[{"index":"1","hadith_id":"nawawi40","text":[{"text":"عَنْ أَمِيرِ الْمُؤْمِنِينَ أَبِي حَفْصٍ عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللهُ عَنْهُ قَالَ: سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ: \" إنَّمَا الْأَعْمَالُ بِالنِّيَّاتِ، وَإِنَّمَا لِكُلِّ امْرِئٍ مَا نَوَى، فَمَنْ كَانَتْ هِجْرَتُهُ إلَى اللَّهِ وَرَسُولِهِ فَهِجْرَتُهُ إلَى اللَّهِ وَرَسُولِهِ، وَمَنْ كَانَتْ هِجْرَتُهُ لِدُنْيَا يُصِيبُهَا أَوْ امْرَأَةٍ يَنْكِحُهَا فَهِجْرَتُهُ إلَى مَا هَاجَرَ إلَيْهِ\". رَوَاهُ إِمَامَا الْمُحَدِّثِينَ أَبُو عَبْدِ اللهِ مُحَمَّدُ بنُ إِسْمَاعِيل بن إِبْرَاهِيم بن الْمُغِيرَة بن بَرْدِزبَه الْبُخَارِيُّ الْجُعْفِيُّ [رقم:1]، وَأَبُو الْحُسَيْنِ مُسْلِمٌ بنُ الْحَجَّاج بن مُسْلِم الْقُشَيْرِيُّ النَّيْسَابُورِيُّ [رقم:1907] رَضِيَ اللهُ عَنْهُمَا فِي \"صَحِيحَيْهِمَا\" اللذَينِ هُمَا أَصَحُّ الْكُتُبِ الْمُصَنَّفَةِ.","language":"arabic"},{"text":"I heard the Messenger of Allah (ﷺ) say: \"Actions are (judged) by motives (niyyah), so each man will have what he intended. Thus, he whose migration (hijrah) was to Allah and His Messenger, his migration is to Allah and His Messenger; but he whose migration was for some worldly thing he might gain, or for a wife he might marry, his migration is to that for which he migrated.\" [Bukhari \u0026 Muslim]","language":"english"},{"text":"Aku mendengar Rasulullah (ﷺ) bersabda: \"Perbuatan (dinilai) berdasarkan motif (niyyah), maka setiap orang akan mendapatkan apa yang dia niatkan. Maka barang siapa hijrahnya (hijrah) kepada Allah dan Rasul-Nya, maka hijrahnya adalah kepada Allah dan Rasul-Nya, tetapi barang siapa hijrahnya karena suatu tujuan duniawi yang mungkin diperolehnya, atau untuk seorang istri yang hendak dinikahinya, maka hijrahnya adalah kepada apa yang ia Hijrah itu.” [ Bukhari \u0026 Muslim ]","language":"bahasa"}],"narrated":[{"text":"It is narrated on the authority of Amirul Mu\u0027minin, Abu Hafs \u0027Umar bin al-Khattab (ra) who said:","language":"english"},{"text":"Diriwayatkan atas otoritas Amirul Mu\u0027minin, Abu Hafs \u0027Umar bin al-Khattab (ra) yang berkata:","language":"bahasa"}]},{"index":"2","hadith_id":"nawawi40","text":[{"text":"عَنْ عُمَرَ رَضِيَ اللهُ عَنْهُ أَيْضًا قَالَ: \" بَيْنَمَا نَحْنُ جُلُوسٌ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه و سلم ذَاتَ يَوْمٍ، إذْ طَلَعَ عَلَيْنَا رَجُلٌ شَدِيدُ بَيَاضِ الثِّيَابِ، شَدِيدُ سَوَادِ الشَّعْرِ، لَا يُرَى عَلَيْهِ أَثَرُ السَّفَرِ، وَلَا يَعْرِفُهُ مِنَّا أَحَدٌ. حَتَّى جَلَسَ إلَى النَّبِيِّ صلى الله عليه و سلم . فَأَسْنَدَ رُكْبَتَيْهِ إلَى رُكْبَتَيْهِ، وَوَضَعَ كَفَّيْهِ عَلَى فَخِذَيْهِ، وَقَالَ: يَا مُحَمَّدُ أَخْبِرْنِي عَنْ الْإِسْلَامِ. فَقَالَ رَسُولُ اللَّهِ صلى الله عليه و سلم الْإِسْلَامُ أَنْ تَشْهَدَ أَنْ لَا إلَهَ إلَّا اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ، وَتُقِيمَ الصَّلَاةَ، وَتُؤْتِيَ الزَّكَاةَ، وَتَصُومَ رَمَضَانَ، وَتَحُجَّ الْبَيْتَ إنْ اسْتَطَعْت إلَيْهِ سَبِيلًا. قَالَ: صَدَقْت . فَعَجِبْنَا لَهُ يَسْأَلُهُ وَيُصَدِّقُهُ! قَالَ: فَأَخْبِرْنِي عَنْ الْإِيمَانِ. قَالَ: أَنْ تُؤْمِنَ بِاَللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ وَالْيَوْمِ الْآخِرِ، وَتُؤْمِنَ بِالْقَدَرِ خَيْرِهِ وَشَرِّهِ. قَالَ: صَدَقْت. قَالَ: فَأَخْبِرْنِي عَنْ الْإِحْسَانِ. قَالَ: أَنْ تَعْبُدَ اللَّهَ كَأَنَّك تَرَاهُ، فَإِنْ لَمْ تَكُنْ تَرَاهُ فَإِنَّهُ يَرَاك. قَالَ: فَأَخْبِرْنِي عَنْ السَّاعَةِ. قَالَ: مَا الْمَسْئُولُ عَنْهَا بِأَعْلَمَ مِنْ السَّائِلِ. قَالَ: فَأَخْبِرْنِي عَنْ أَمَارَاتِهَا؟ قَالَ: أَنْ تَلِدَ الْأَمَةُ رَبَّتَهَا، وَأَنْ تَرَى الْحُفَاةَ الْعُرَاةَ الْعَالَةَ رِعَاءَ الشَّاءِ يَتَطَاوَلُونَ فِي الْبُنْيَانِ. ثُمَّ انْطَلَقَ، فَلَبِثْتُ مَلِيًّا، ثُمَّ قَالَ: يَا عُمَرُ أَتَدْرِي مَنْ السَّائِلُ؟. ‫‬قُلْتُ: اللَّهُ وَرَسُولُهُ أَعْلَمُ. قَالَ: فَإِنَّهُ جِبْرِيلُ أَتَاكُمْ يُعَلِّمُكُمْ دِينَكُمْ \". [رَوَاهُ مُسْلِمٌ] .","language":"arabic"},{"text":"While we were one day sitting with the Messenger of Allah (ﷺ) there appeared before us a man dressed in extremely white clothes and with very black hair. No traces of journeying were visible on him, and none of us knew him. He sat down close by the Prophet (ﷺ) rested his knees against the knees of the Prophet (ﷺ) and placed his palms over his thighs, and said: \"O Muhammad! Inform me about Islam.\" The Messenger of Allah (ﷺ) replied: \"Islam is that you should testify that there is no deity worthy of worship except Allah and that Muhammad is His Messenger (ﷺ), that you should perform salah (ritual prayer), pay the zakah, fast during Ramadan, and perform Hajj (pilgrimage) to the House (the Ka`bah at Makkah), if you can find a way to it (or find the means for making the journey to it).\" He said: \"You have spoken the truth.\" We were astonished at his thus questioning him (ﷺ) and then telling him that he was right, but he went on to say, \"Inform me about Iman (faith).\" He (the Prophet) answered, \"It is that you believe in Allah and His angels and His Books and His Messengers and in the Last Day, and in fate (qadar), both in its good and in its evil aspects.\" He said, \"You have spoken the truth.\" Then he (the man) said, \"Inform me about Ihsan.\" He (the Prophet) answered, \"It is that you should serve Allah as though you could see Him, for though you cannot see Him yet He sees you.\" He said, \"Inform me about the Hour.\" He (the Prophet) said, \"About that the one questioned knows no more than the questioner.\" So he said, \"Well, inform me about its signs.\" He said, \"They are that the slave-girl will give birth to her mistress and that you will see the barefooted ones, the naked, the destitute, the herdsmen of the sheep (competing with each other) in raising lofty buildings.\" Thereupon the man went off. I waited a while, and then he (the Prophet) said, \"O `Umar, do you know who that questioner was?\" I replied, \"Allah and His Messenger know better.\" He said, \"That was Jibril. He came to teach you your religion.\" [Muslim]","language":"english"},{"text":"Ketika suatu hari kami sedang duduk bersama Rasulullah (ﷺ) muncullah di hadapan kami seorang laki-laki berpakaian sangat putih dan berambut sangat hitam. Tidak ada jejak perjalanan yang terlihat pada dirinya, dan tidak satupun dari kami yang mengenalnya. Dia duduk di dekat Nabi (ﷺ) meletakkan lututnya di lutut Nabi (ﷺ) dan meletakkan telapak tangannya di atas pahanya, dan berkata: \"O Muhammad! Beritahu aku tentang Islam.\" Rasulullah (ﷺ) menjawab: \"Islam adalah bahwa kamu harus bersaksi bahwa tidak ada Tuhan yang berhak disembah selain Allah dan bahwa Muhammad adalah utusan-Nya (), bahwa kamu harus melakukan salat, membayar zakat, berpuasa selama Ramadhan, dan melakukan haji (ziarah) ke Rumah (Ka`bah di Mekah), jika Anda dapat menemukan jalan ke sana (atau menemukan sarana untuk melakukan perjalanan ke sana).\" Dia berkata: \" \"Mereka adalah bahwa budak perempuan akan melahirkan majikannya dan bahwa Anda akan melihat yang bertelanjang kaki, telanjang, miskin, penggembala domba (bersaing satu sama lain) dalam membangun gedung-gedung tinggi.\" Setelah itu pria itu pergi. Saya menunggu beberapa saat, dan kemudian dia (Nabi) berkata, \"O `Umar, tahukah Anda siapa penanya itu?\" Aku menjawab, \"Allah dan Rasul-Nya lebih tahu.\" Dia berkata, \"Itu Jibril. Dia datang untuk mengajarimu agamamu.\" [ Tahukah kamu siapa penanya itu?\" Saya menjawab, \"Allah dan Rasul-Nya lebih tahu.\" Dia berkata, \"Itu Jibril. Dia datang untuk mengajarimu agamamu.\" [ Tahukah kamu siapa penanya itu?\" Saya menjawab, \"Allah dan Rasul-Nya lebih tahu.\" Dia berkata, \"Itu Jibril. Dia datang untuk mengajarimu agamamu.\" [ Muslim ]","language":"bahasa"}],"narrated":[{"text":"Also on the authority of `Umar (ra) who said:","language":"english"},{"text":"Juga atas otoritas `Umar (ra) yang mengatakan:","language":"bahasa"}]},{"index":"3","hadith_id":"nawawi40","text":[{"text":"عَنْ أَبِي عَبْدِ الرَّحْمَنِ عَبْدِ اللَّهِ بْنِ عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: سَمِعْت رَسُولَ اللَّهِ صلى الله عليه و سلم يَقُولُ: \" بُنِيَ الْإِسْلَامُ عَلَى خَمْسٍ: شَهَادَةِ أَنْ لَا إلَهَ إلَّا اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ، وَإِقَامِ الصَّلَاةِ، وَإِيتَاءِ الزَّكَاةِ، وَحَجِّ الْبَيْتِ، وَصَوْمِ رَمَضَانَ\". [رَوَاهُ الْبُخَارِيُّ] ، [وَمُسْلِمٌ].","language":"arabic"},{"text":"I heard the Messenger of Allah (ﷺ) say, \"Islam has been built on five [pillars]: testifying that there is no deity worthy of worship except Allah and that Muhammad is the Messenger of Allah, establishing the salah (prayer), paying the zakat (obligatory charity), making the hajj (pilgrimage) to the House, and fasting in Ramadhan.\" [Bukhari \u0026 Muslim]","language":"english"},{"text":"Saya mendengar Rasulullah (ﷺ) berkata, “Islam dibangun di atas lima [pilar]: bersaksi bahwa tidak ada Tuhan yang berhak disembah selain Allah dan bahwa Muhammad adalah utusan Allah, mendirikan salat, membayar zakat, haji ke Baitullah, dan puasa Ramadhan.” [ Bukhari \u0026 Muslim ]","language":"bahasa"}],"narrated":[{"text":"On the authority of Abdullah, the son of Umar ibn al-Khattab (ra), who said:","language":"english"},{"text":"Atas otoritas Abdullah, putra Umar bin al-Khattab (ra), yang mengatakan:","language":"bahasa"}]},{"index":"4","hadith_id":"nawawi40","text":[{"text":"عَنْ أَبِي عَبْدِ الرَّحْمَنِ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ رَضِيَ اللهُ عَنْهُ قَالَ: حَدَّثَنَا رَسُولُ اللَّهِ صلى الله عليه و سلم -وَهُوَ الصَّادِقُ الْمَصْدُوقُ-: \"إنَّ أَحَدَكُمْ يُجْمَعُ خَلْقُهُ فِي بَطْنِ أُمِّهِ أَرْبَعِينَ يَوْمًا نُطْفَةً، ثُمَّ يَكُونُ عَلَقَةً مِثْلَ ذَلِكَ، ثُمَّ يَكُونُ مُضْغَةً مِثْلَ ذَلِكَ، ثُمَّ يُرْسَلُ إلَيْهِ الْمَلَكُ فَيَنْفُخُ فِيهِ الرُّوحَ، وَيُؤْمَرُ بِأَرْبَعِ كَلِمَاتٍ: بِكَتْبِ رِزْقِهِ، وَأَجَلِهِ، وَعَمَلِهِ، وَشَقِيٍّ أَمْ سَعِيدٍ؛ فَوَاَللَّهِ الَّذِي لَا إلَهَ غَيْرُهُ إنَّ أَحَدَكُمْ لَيَعْمَلُ بِعَمَلِ أَهْلِ الْجَنَّةِ حَتَّى مَا يَكُونُ بَيْنَهُ وَبَيْنَهَا إلَّا ذِرَاعٌ فَيَسْبِقُ عَلَيْهِ الْكِتَابُ فَيَعْمَلُ بِعَمَلِ أَهْلِ النَّارِ فَيَدْخُلُهَا. وَإِنَّ أَحَدَكُمْ لَيَعْمَلُ بِعَمَلِ أَهْلِ النَّارِ حَتَّى مَا يَكُونُ بَيْنَهُ وَبَيْنَهَا إلَّا ذِرَاعٌ فَيَسْبِقُ عَلَيْهِ الْكِتَابُ فَيَعْمَلُ بِعَمَلِ أَهْلِ الْجَنَّةِ فَيَدْخُلُهَا\". [رَوَاهُ الْبُخَارِيُّ] ، [وَمُسْلِمٌ] .","language":"arabic"},{"text":"The Messenger of Allah (ﷺ), and he is the truthful, the believed, narrated to us, “Verily the creation of each one of you is brought together in his mother’s womb for forty days in the form of a nutfah (a drop), then he becomes an alaqah (clot of blood) for a like period, then a mudghah (morsel of flesh) for a like period, then there is sent to him the angel who blows his soul into him and who is commanded with four matters: to write down his rizq (sustenance), his life span, his actions, and whether he will be happy or unhappy (i.e., whether or not he will enter Paradise). By the One, other than Whom there is no deity, verily one of you performs the actions of the people of Paradise until there is but an arms length between him and it, and that which has been written overtakes him, and so he acts with the actions of the people of the Hellfire and thus enters it; and verily one of you performs the actions of the people of the Hellfire, until there is but an arms length between him and it, and that which has been written overtakes him and so he acts with the actions of the people of Paradise and thus he enters it.” [Bukhari \u0026 Muslim]","language":"english"},{"text":"Rasulullah (ﷺ), dan dia adalah orang-orang yang benar, orang-orang yang beriman, meriwayatkan kepada kami, “Sesungguhnya penciptaan masing-masing dari kamu dibawa bersama-sama dalam rahim ibunya selama empat puluh hari dalam bentuk nutfah (setetes) , kemudian dia menjadi alaqah (segumpal darah) untuk periode yang sama, kemudian mudghah (sepotong daging) untuk periode yang sama, kemudian diutus kepadanya malaikat yang meniupkan jiwanya ke dalam dirinya dan yang diperintahkan dengan empat hal. : untuk menuliskan rizkinya (rezeki), umurnya, amalannya, dan apakah dia akan bahagia atau tidak bahagia (yaitu, apakah dia akan masuk surga atau tidak). Demi Dzat yang tidak ada Tuhan selain Dia, sesungguhnya salah seorang di antara kalian mengerjakan amalan penghuni surga sampai hanya sebatas lengan antara dia dan surga, dan apa yang telah ditulis menyusulnya, dan dia bertindak dengan tindakan orang-orang dari neraka dan dengan demikian memasukinya; Dan sesungguhnya salah seorang di antara kalian mengerjakan amalan-amalan penghuni Neraka, sampai jarak antara dia dengannya hanya sebatas lengan, dan apa yang telah ditulis melampaui dia, maka dia bertindak dengan amalan-amalan penghuni surga, dan demikianlah dia. memasukinya.” [ Bukhari \u0026 Muslim ]","language":"bahasa"}],"narrated":[{"text":"On the authority of Abdullah ibn Masood (ra), who said:","language":"english"},{"text":"Atas otoritas Abdullah bin Masood (ra), yang berkata:","language":"bahasa"}]},{"index":"5","hadith_id":"nawawi40","text":[{"text":"عَنْ أُمِّ الْمُؤْمِنِينَ أُمِّ عَبْدِ اللَّهِ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا، قَالَتْ: قَالَ: رَسُولُ اللَّهِ صلى الله عليه و سلم \"مَنْ أَحْدَثَ فِي أَمْرِنَا هَذَا مَا لَيْسَ مِنْهُ فَهُوَ رَدٌّ [رَوَاهُ الْبُخَارِيُّ] ،[وَمُسْلِمٌ] وَفِي رِوَايَةٍ لِمُسْلِمٍ: مَنْ عَمِلَ عَمَلًا لَيْسَ عَلَيْهِ أَمْرُنَا فَهُوَ رَدٌّ\".","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, “He who innovates something in this matter of ours (i.e., Islam) that is not of it will have it rejected (by Allah).” [Bukhari \u0026 Muslim] In another version in Muslim it reads: “He who does an act which we have not commanded, will have it rejected (by Allah).”","language":"english"},{"text":"Rasulullah (ﷺ) berkata, “Barang siapa yang membuat sesuatu yang baru dalam urusan kita ini (yaitu, Islam) yang bukan darinya, ia akan ditolak (oleh Allah).” [ Bukhari \u0026 Muslim ] Dalam versi lain dalam Muslim tertulis: “Barang siapa mengerjakan suatu perbuatan yang tidak kami perintahkan, maka tertolak (oleh Allah).”","language":"bahasa"}],"narrated":[{"text":"On the authority of the mother of the faithful, Aisha (ra), who said:","language":"english"},{"text":"Atas otoritas ibu orang beriman, Aisha (ra), yang mengatakan:","language":"bahasa"}]},{"index":"6","hadith_id":"nawawi40","text":[{"text":"عَنْ أَبِي عَبْدِ اللَّهِ النُّعْمَانِ بْنِ بَشِيرٍ رَضِيَ اللَّهُ عَنْهُمَا، قَالَ: سَمِعْت رَسُولَ اللَّهِ صلى الله عليه و سلم يَقُولُ: \"إنَّ الْحَلَالَ بَيِّنٌ، وَإِنَّ الْحَرَامَ بَيِّنٌ، وَبَيْنَهُمَا أُمُورٌ مُشْتَبِهَاتٌ لَا يَعْلَمُهُنَّ كَثِيرٌ مِنْ النَّاسِ، فَمَنْ اتَّقَى الشُّبُهَاتِ فَقْد اسْتَبْرَأَ لِدِينِهِ وَعِرْضِهِ، وَمَنْ وَقَعَ فِي الشُّبُهَاتِ وَقَعَ فِي الْحَرَامِ، كَالرَّاعِي يَرْعَى حَوْلَ الْحِمَى يُوشِكُ أَنْ يَرْتَعَ فِيهِ، أَلَا وَإِنَّ لِكُلِّ مَلِكٍ حِمًى، أَلَا وَإِنَّ حِمَى اللَّهِ مَحَارِمُهُ، أَلَا وَإِنَّ فِي الْجَسَدِ مُضْغَةً إذَا صَلَحَتْ صَلَحَ الْجَسَدُ كُلُّهُ، وَإذَا فَسَدَتْ فَسَدَ الْجَسَدُ كُلُّهُ، أَلَا وَهِيَ الْقَلْبُ\". [رَوَاهُ الْبُخَارِيُّ]، [وَمُسْلِمٌ] .","language":"arabic"},{"text":"I heard the Messenger of Allah (ﷺ) say, “That which is lawful is clear and that which is unlawful is clear, and between the two of them are doubtful matters about which many people do not know. Thus he who avoids doubtful matters clears himself in regard to his religion and his honor, but he who falls into doubtful matters [eventually] falls into that which is unlawful, like the shepherd who pastures around a sanctuary, all but grazing therein. Truly every king has a sanctuary, and truly Allah’s sanctuary is His prohibitions. Truly in the body there is a morsel of flesh, which, if it be whole, all the body is whole, and which, if it is diseased, all of [the body] is diseased. Truly, it is the heart.” [Bukhari \u0026 Muslim]","language":"english"},{"text":"Saya mendengar Rasulullah () bersabda, “Yang halal itu jelas dan yang haram itu jelas, dan di antara keduanya ada hal-hal yang syubhat yang banyak orang tidak mengetahuinya. Demikianlah barang siapa yang menjauhi hal-hal yang syubhat maka menjernihkan diri dalam hal agama dan kehormatannya, tetapi barang siapa yang terjerumus ke dalam hal-hal yang syubhat [akhirnya] jatuh ke dalam yang haram, seperti penggembala yang menggembalakan di sekitar tempat suci, kecuali merumput di dalamnya. Sesungguhnya setiap raja memiliki tempat suci, dan sesungguhnya tempat suci Allah adalah larangan-Nya. Sesungguhnya di dalam tubuh itu ada segumpal daging, yang jika utuh, seluruh tubuh itu utuh, dan yang jika sakit maka semua [tubuh] itu berpenyakit. Sungguh, itu adalah hati.” [ Bukhari \u0026 Muslim ]","language":"bahasa"}],"narrated":[{"text":"On the authority of an-Nu’man ibn Basheer (ra), who said:","language":"english"},{"text":"Atas otoritas an-Nu\u0027man bin Basyir (ra), yang mengatakan:","language":"bahasa"}]},{"index":"7","hadith_id":"nawawi40","text":[{"text":"عَنْ أَبِي رُقَيَّةَ تَمِيمِ بْنِ أَوْسٍ الدَّارِيِّ رَضِيَ اللهُ عَنْهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ: \"الدِّينُ النَّصِيحَةُ.\" قُلْنَا: لِمَنْ؟ قَالَ: \"لِلَّهِ، وَلِكِتَابِهِ، وَلِرَسُولِهِ، وَلِأَئِمَّةِ الْمُسْلِمِينَ وَعَامَّتِهِمْ.\" [رَوَاهُ مُسْلِمٌ]","language":"arabic"},{"text":"The Prophet (ﷺ) said, “The deen (religion) is naseehah (advice, sincerity).” We said, “To whom?” He (ﷺ) said, “To Allah, His Book, His Messenger, and to the leaders of the Muslims and their common folk.” [Muslim]","language":"english"},{"text":"Nabi (ﷺ) berkata, “Dien (agama) adalah naseehah (nasihat, ketulusan).” Kami berkata, “Kepada siapa?” Dia (ﷺ) berkata, \"Untuk Allah, Kitab-Nya, Rasul-Nya, dan untuk para pemimpin kaum Muslimin dan rakyat jelata.\" [ Muslim ]","language":"bahasa"}],"narrated":[{"text":"On the authority of Tameem ibn Aus ad-Daree (ra):","language":"english"},{"text":"Atas otoritas Tameem ibn Aus ad-Daree (ra):","language":"bahasa"}]},{"index":"8","hadith_id":"nawawi40","text":[{"text":"عَنْ ابْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا، أَنَّ رَسُولَ اللَّهِ صلى الله عليه و سلم قَالَ: \"أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَشْهَدُوا أَنْ لَا إلَهَ إلَّا اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ، وَيُقِيمُوا الصَّلَاةَ، وَيُؤْتُوا الزَّكَاةَ؛ فَإِذَا فَعَلُوا ذَلِكَ عَصَمُوا مِنِّي دِمَاءَهُمْ وَأَمْوَالَهُمْ إلَّا بِحَقِّ الْإِسْلَامِ، وَحِسَابُهُمْ عَلَى اللَّهِ تَعَالَى\" . [رَوَاهُ الْبُخَارِيُّ] ،[وَمُسْلِمٌ]","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"I have been ordered to fight against the people until they testify that there is none worthy of worship except Allah and that Muhammad is the Messenger of Allah, and until they establish the salah and pay the zakat. And if they do that then they will have gained protection from me for their lives and property, unless [they commit acts that are punishable] in Islam, and their reckoning will be with Allah.\" [Bukhari \u0026 Muslim]","language":"english"},{"text":"Rasulullah SAW bersabda, “Aku telah diperintahkan untuk memerangi manusia sampai mereka bersaksi bahwa tidak ada yang berhak disembah selain Allah dan bahwa Muhammad adalah utusan Allah, dan sampai mereka mendirikan shalat dan menunaikan zakat. Dan jika mereka melakukan itu maka mereka akan mendapatkan perlindungan dari saya untuk kehidupan dan harta benda mereka, kecuali [mereka melakukan tindakan yang dapat dihukum] dalam Islam, dan perhitungan mereka di sisi Allah. [ Bukhari \u0026 Muslim ]","language":"bahasa"}],"narrated":[{"text":"On the authority of Abdullah ibn Umar (ra):","language":"english"},{"text":"Atas otoritas Abdullah bin Umar (ra):","language":"bahasa"}]},{"index":"9","hadith_id":"nawawi40","text":[{"text":"عَنْ أَبِي هُرَيْرَةَ عَبْدِ الرَّحْمَنِ بْنِ صَخْرٍ رَضِيَ اللهُ عَنْهُ قَالَ: سَمِعْت رَسُولَ اللَّهِ صلى الله عليه و سلم يَقُولُ: \"مَا نَهَيْتُكُمْ عَنْهُ فَاجْتَنِبُوهُ، وَمَا أَمَرْتُكُمْ بِهِ فَأْتُوا مِنْهُ مَا اسْتَطَعْتُمْ، فَإِنَّمَا أَهْلَكَ الَّذِينَ مِنْ قَبْلِكُمْ كَثْرَةُ مَسَائِلِهِمْ وَاخْتِلَافُهُمْ عَلَى أَنْبِيَائِهِمْ \". [رَوَاهُ الْبُخَارِيُّ] ،[وَمُسْلِمٌ]","language":"arabic"},{"text":"I heard the Messenger of Allah (ﷺ) say, “What I have forbidden for you, avoid. What I have ordered you [to do], do as much of it as you can. For verily, it was only the excessive questioning and their disagreeing with their Prophets that destroyed [the nations] who were before you.” [Bukhari \u0026 Muslim]","language":"english"},{"text":"Saya mendengar Rasulullah (ﷺ) berkata, “Apa yang saya larang bagi Anda, hindari. Apa yang saya perintahkan kepada Anda [untuk dilakukan], lakukan sebanyak yang Anda bisa. Karena sesungguhnya, hanya pertanyaan yang berlebihan dan ketidaksetujuan mereka dengan para nabi mereka yang menghancurkan [bangsa-bangsa] sebelum kamu.” [ Bukhari \u0026 Muslim ]","language":"bahasa"}],"narrated":[{"text":"On the authority of Abu Hurayrah (ra):","language":"english"},{"text":"Atas otoritas Abu Hurairah (ra):","language":"bahasa"}]},{"index":"10","hadith_id":"nawawi40","text":[{"text":"عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه و سلم \"إنَّ اللَّهَ طَيِّبٌ لَا يَقْبَلُ إلَّا طَيِّبًا، وَإِنَّ اللَّهَ أَمَرَ الْمُؤْمِنِينَ بِمَا أَمَرَ بِهِ الْمُرْسَلِينَ فَقَالَ تَعَالَى: \"يَا أَيُّهَا الرُّسُلُ كُلُوا مِنْ الطَّيِّبَاتِ وَاعْمَلُوا صَالِحًا\"، وَقَالَ تَعَالَى: \"يَا أَيُّهَا الَّذِينَ آمَنُوا كُلُوا مِنْ طَيِّبَاتِ مَا رَزَقْنَاكُمْ\" ثُمَّ ذَكَرَ الرَّجُلَ يُطِيلُ السَّفَرَ أَشْعَثَ أَغْبَرَ يَمُدُّ يَدَيْهِ إلَى السَّمَاءِ: يَا رَبِّ! يَا رَبِّ! وَمَطْعَمُهُ حَرَامٌ، وَمَشْرَبُهُ حَرَامٌ، وَمَلْبَسُهُ حَرَامٌ، وَغُذِّيَ بِالْحَرَامِ، فَأَنَّى يُسْتَجَابُ لَهُ؟\". [رَوَاهُ مُسْلِمٌ]","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, “Allah the Almighty is Good and accepts only that which is good. And verily Allah has commanded the believers to do that which He has commanded the Messengers. So the Almighty has said: “O (you) Messengers! Eat of the tayyibat [all kinds of halal (legal) foods], and perform righteous deeds.” [23:51] and the Almighty has said: “O you who believe! Eat of the lawful things that We have provided you.” [2:172]” Then he (ﷺ) mentioned [the case] of a man who, having journeyed far, is disheveled and dusty, and who spreads out his hands to the sky saying “O Lord! O Lord!,” while his food is haram (unlawful), his drink is haram, his clothing is haram, and he has been nourished with haram, so how can [his supplication] be answered? [Muslim]","language":"english"},{"text":"Rasulullah SAW bersabda, “Allah SWT itu baik dan hanya menerima apa yang baik. Dan sesungguhnya Allah telah memerintahkan orang-orang yang beriman untuk mengerjakan apa yang telah diperintahkan-Nya kepada para Rasul. Maka Yang Mahakuasa telah berfirman: “Hai (kamu) para Rasul! Makanlah tayyibat [segala jenis makanan halal], dan lakukan amal saleh.” [23:51] dan Yang Mahakuasa telah berfirman: “Hai orang-orang yang beriman! Makanlah dari makanan yang halal yang Kami berikan kepadamu.” [2:172]” Kemudian dia (ﷺ) menyebutkan [kasus] seorang pria yang, setelah melakukan perjalanan jauh, kusut dan berdebu, dan yang merentangkan tangannya ke langit sambil berkata, “Ya Tuhan! Ya Tuhan!,” sedangkan makanannya haram, minumannya haram, pakaiannya haram, dan dia diberi makan dengan yang haram, lalu bagaimana doanya dikabulkan? [ Muslim ]","language":"bahasa"}],"narrated":[{"text":"On the authority of Abu Hurayrah (ra):","language":"english"},{"text":"Atas otoritas Abu Hurairah (ra):","language":"bahasa"}]},{"index":"11","hadith_id":"nawawi40","text":[{"text":"عَنْ أَبِي مُحَمَّدٍ الْحَسَنِ بْنِ عَلِيِّ بْنِ أَبِي طَالِبٍ سِبْطِ رَسُولِ اللَّهِ صلى الله عليه و سلم وَرَيْحَانَتِهِ رَضِيَ اللَّهُ عَنْهُمَا، قَالَ: حَفِظْت مِنْ رَسُولِ اللَّهِ صلى الله عليه و سلم \"دَعْ مَا يُرِيبُك إلَى مَا لَا يُرِيبُك\". رَوَاهُ التِّرْمِذِيُّ [رقم:2520]، [وَالنَّسَائِيّ] وَقَالَ التِّرْمِذِيُّ: حَدِيثٌ حَسَنٌ صَحِيحٌ.","language":"arabic"},{"text":"I memorised from the Messenger of Allah (peace and blessings of Allah be upon him): “Leave that which makes you doubt for that which does not make you doubt.” [At-Tirmidhi] [An-Nasai] At-Tirmidhi said that it was a good and sound (hasan saheeh) hadeeth.","language":"english"},{"text":"Saya hafal dari Rasulullah (damai dan berkah Allah besertanya): \"Tinggalkan apa yang membuat Anda ragu untuk apa yang tidak membuat Anda ragu.\" [At-Tirmidzi] [An-Nasai]At-Tirmidzi mengatakan bahwa itu adalah hadits yang baik dan benar (hasan shahih).","language":"bahasa"}],"narrated":[{"text":"On the authority of Abu Muhammad al-Hasan ibn Ali ibn Abee Talib (may Allah be pleased with him), the grandson of the Messenger of Allah (peace and blessings of Allah be upon him), and the one much loved by him, who said:","language":"english"},{"text":"Atas otoritas Abu Muhammad al-Hasan bin Ali bin Abi Thalib ra, cucu Rasulullah (damai dan berkah Allah besertanya), dan orang yang sangat dicintainya, yang dikatakan:","language":"bahasa"}]},{"index":"12","hadith_id":"nawawi40","text":[{"text":"عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه و سلم \"مِنْ حُسْنِ إسْلَامِ الْمَرْءِ تَرْكُهُ مَا لَا يَعْنِيهِ\". حَدِيثٌ حَسَنٌ، رَوَاهُ التِّرْمِذِيُّ [رقم: 2318] ، ابن ماجه [رقم:3976].","language":"arabic"},{"text":"The Messenger of Allah (peace and blessings of Allah be upon him) said, “Part of the perfection of one’s Islam is his leaving that which does not concern him.” A hasan (good) hadeeth which was related by at-Tirmidhi and others in this fashion.","language":"english"},{"text":"Rasulullah shallallahu \u0027alaihi wa sallam bersabda, \"Sebagian dari kesempurnaan keislaman seseorang adalah meninggalkan apa yang tidak menjadi urusannya.\" Sebuah hadits hasan (baik) yang diriwayatkan oleh at-Tirmidzi dan lainnya dengan cara ini.","language":"bahasa"}],"narrated":[{"text":"On the authority of Abu Hurayrah (may Allah be pleased with him) who said:","language":"english"},{"text":"Atas otoritas Abu Hurairah (ra dengan dia) yang mengatakan:","language":"bahasa"}]},{"index":"13","hadith_id":"nawawi40","text":[{"text":"عَنْ أَبِي حَمْزَةَ أَنَسِ بْنِ مَالِكٍ رَضِيَ اللهُ عَنْهُ خَادِمِ رَسُولِ اللَّهِ صلى الله عليه و سلم عَنْ النَّبِيِّ صلى الله عليه و سلم قَالَ: \"لَا يُؤْمِنُ أَحَدُكُمْ حَتَّى يُحِبَّ لِأَخِيهِ مَا يُحِبُّ لِنَفْسِهِ\". رَوَاهُ الْبُخَارِيُّ [رقم:13]، وَمُسْلِمٌ [رقم:45]. [رَوَاهُ الْبُخَارِيُّ] ، [وَمُسْلِمٌ]","language":"arabic"},{"text":"None of you [truly] believes until he loves for his brother that which he loves for himself. [Al-Bukhari] [Muslim]","language":"english"},{"text":"Tidak beriman salah seorang di antara kamu hingga dia mencintai untuk saudaranya apa yang dia cintai untuk dirinya sendiri. [Al-Bukhari] [Muslim]","language":"bahasa"}],"narrated":[{"text":"On the authority of Abu Hamzah Anas bin Malik (may Allah be pleased with him) — the servant of the Messenger of Allah (peace and blessings of Allah be upon him) — that the Prophet (peace and blessings of Allah be upon him) said:","language":"english"},{"text":"Atas otoritas Abu Hamzah Anas bin Malik (ra dengan dia) - hamba Rasulullah (damai dan berkah Allah besertanya) - bahwa Nabi (damai dan berkah Allah besertanya) mengatakan :","language":"bahasa"}]},{"index":"14","hadith_id":"nawawi40","text":[{"text":"عَنْ ابْنِ مَسْعُودٍ رَضِيَ اللهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه و سلم \"لَا يَحِلُّ دَمُ امْرِئٍ مُسْلِمٍ [ يشهد أن لا إله إلا الله، وأني رسول الله] إلَّا بِإِحْدَى ثَلَاثٍ: الثَّيِّبُ الزَّانِي، وَالنَّفْسُ بِالنَّفْسِ، وَالتَّارِكُ لِدِينِهِ الْمُفَارِقُ لِلْجَمَاعَةِ\". [رَوَاهُ الْبُخَارِيُّ] ، [وَمُسْلِمٌ]","language":"arabic"},{"text":"The Messenger of Allah (peace and blessings of Allah be upon him) said, “It is not permissible to spill the blood of a Muslim except in three [instances]: the married person who commits adultery, a life for a life, and the one who forsakes his religion and separates from the community.” [Al-Bukhari] [Muslim]","language":"english"},{"text":"Rasulullah shallallahu \u0027alaihi wa sallam bersabda, “Tidak halal darah seorang muslim tertumpah kecuali dalam tiga hal: orang yang berzina, yang berzina, yang nyawanya diganti, dan yang orang yang meninggalkan agamanya dan memisahkan diri dari masyarakat.” [Al-Bukhari] [Muslim]","language":"bahasa"}],"narrated":[{"text":"On the authority of Ibn Masood (may Allah be pleased with him) who said:","language":"english"},{"text":"Atas otoritas Ibn Masood (ra dengan dia) yang mengatakan:","language":"bahasa"}]},{"index":"15","hadith_id":"nawawi40","text":[{"text":"عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه و سلم قَالَ: \"مَنْ كَانَ يُؤْمِنُ بِاَللَّهِ وَالْيَوْمِ الْآخِرِ فَلْيَقُلْ خَيْرًا أَوْ لِيَصْمُتْ، وَمَنْ كَانَ يُؤْمِنُ بِاَللَّهِ وَالْيَوْمِ الْآخِرِ فَلْيُكْرِمْ جَارَهُ، وَمَنْ كَانَ يُؤْمِنُ بِاَللَّهِ وَالْيَوْمِ الْآخِرِ فَلْيُكْرِمْ ضَيْفَهُ\". [رَوَاهُ الْبُخَارِيُّ] ، [وَمُسْلِمٌ]","language":"arabic"},{"text":"Let him who believes in Allah and the Last Day speak good, or keep silent; and let him who believes in Allah and the Last Day be generous to his neighbour; and let him who believes in Allah and the Last Day be generous to his guest. [Al-Bukhari] [Muslim]","language":"english"},{"text":"Biarlah orang yang beriman kepada Allah dan Hari Akhir berbicara yang baik, atau diam; dan hendaklah orang yang beriman kepada Allah dan Hari Akhir bermurah hati kepada tetangganya; dan hendaklah orang yang beriman kepada Allah dan Hari Akhir bermurah hati kepada tamunya. [Al-Bukhari] [Muslim]","language":"bahasa"}],"narrated":[{"text":"On the authority of Abu Hurayrah (may Allah be pleased with him), that the Messenger of Allah (peace and blessings of Allah be upon him) said:","language":"english"},{"text":"Atas otoritas Abu Hurairah ra bahwa Rasulullah (damai dan berkah Allah besertanya) mengatakan:","language":"bahasa"}]},{"index":"16","hadith_id":"nawawi40","text":[{"text":"عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ أَنَّ رَجُلًا قَالَ لِلنَّبِيِّ صلى الله عليه و سلم أَوْصِنِي. قَالَ: لَا تَغْضَبْ، فَرَدَّدَ مِرَارًا، قَالَ: لَا تَغْضَبْ\" . [رَوَاهُ الْبُخَارِيُّ].","language":"arabic"},{"text":"A man said to the Prophet (peace and blessings of Allah be upon him), “Counsel me,” so he (peace and blessings of Allah be upon him) said, “Do not become angry.” The man repeated [his request for counsel] several times, and [each time] he (peace and blessings of Allah be upon him) said, “Do not become angry.” [Al-Bukhari]","language":"english"},{"text":"Seorang laki-laki berkata kepada Nabi (damai dan berkah Allah besertanya), \"Beri nasihat padaku,\" maka dia (damai dan berkah Allah besertanya) berkata, \"Jangan marah.\" Pria itu mengulangi [permintaannya untuk nasihat] beberapa kali, dan [setiap kali] dia (damai dan berkah Allah besertanya) berkata, “Jangan marah.” [Al-Bukhari]","language":"bahasa"}],"narrated":[{"text":"On the authority of Abu Hurayrah (may Allah be pleased with him):","language":"english"},{"text":"Atas otoritas Abu Hurairah (ra dengan dia):","language":"bahasa"}]},{"index":"17","hadith_id":"nawawi40","text":[{"text":"عَنْ أَبِي يَعْلَى شَدَّادِ بْنِ أَوْسٍ رَضِيَ اللهُ عَنْهُ عَنْ رَسُولِ اللَّهِ صلى الله عليه و سلم قَالَ: \"إنَّ اللَّهَ كَتَبَ الْإِحْسَانَ عَلَى كُلِّ شَيْءٍ، فَإِذَا قَتَلْتُمْ فَأَحْسِنُوا الْقِتْلَةَ، وَإِذَا ذَبَحْتُمْ فَأَحْسِنُوا الذِّبْحَةَ، وَلْيُحِدَّ أَحَدُكُمْ شَفْرَتَهُ، وَلْيُرِحْ ذَبِيحَتَهُ\". [رَوَاهُ مُسْلِمٌ].","language":"arabic"},{"text":"Verily Allah has prescribed ihsan (proficiency, perfection) in all things. So if you kill then kill well; and if you slaughter, then slaughter well. Let each one of you sharpen his blade and let him spare suffering to the animal he slaughters.” [Muslim]","language":"english"},{"text":"Sesungguhnya Allah telah menetapkan ihsan (kemahiran, kesempurnaan) dalam segala hal. Jadi jika Anda membunuh maka bunuhlah dengan baik; dan jika kamu menyembelih, maka sembelihlah dengan baik. Biarlah masing-masing dari kalian mengasah pedangnya dan biarkan dia melepaskan penderitaan dari hewan yang dia sembelih.” [Muslim]","language":"bahasa"}],"narrated":[{"text":"On the authority of Abu Ya’la Shaddad bin Aws (may Allah be pleased with him), that the Messenger of Allah (peace and blessings of Allah be upon him) said:","language":"english"},{"text":"Atas otoritas Abu Ya\u0027la Shaddad bin Aws ra bahwa Rasulullah (damai dan berkah Allah besertanya) mengatakan:","language":"bahasa"}]},{"index":"18","hadith_id":"nawawi40","text":[{"text":"عَنْ أَبِي ذَرٍّ جُنْدَبِ بْنِ جُنَادَةَ، وَأَبِي عَبْدِ الرَّحْمَنِ مُعَاذِ بْنِ جَبَلٍ رَضِيَ اللَّهُ عَنْهُمَا، عَنْ رَسُولِ اللَّهِ صلى الله عليه و سلم قَالَ: \"اتَّقِ اللَّهَ حَيْثُمَا كُنْت، وَأَتْبِعْ السَّيِّئَةَ الْحَسَنَةَ تَمْحُهَا، وَخَالِقْ النَّاسَ بِخُلُقٍ حَسَنٍ\" . رَوَاهُ التِّرْمِذِيُّ [رقم:1987] وَقَالَ: حَدِيثٌ حَسَنٌ، وَفِي بَعْضِ النُّسَخِ: حَسَنٌ صَحِيحٌ.","language":"arabic"},{"text":"Have taqwa (fear) of Allah wherever you may be, and follow up a bad deed with a good deed which will wipe it out, and behave well towards the people. It was related by at-Tirmidhi, who said it was a hasan (good) hadeeth, and in some copies it is stated to be a hasan saheeh hadeeth.","language":"english"},{"text":"Milikilah taqwa (takwa) kepada Allah di mana pun Anda berada, dan tindak lanjuti perbuatan buruk dengan perbuatan baik yang akan menghapusnya, dan berperilaku baik terhadap orang-orang. Diriwayatkan oleh at-Tirmidzi, yang mengatakan itu adalah hadits hasan (baik), dan dalam beberapa salinan dinyatakan sebagai hadits hasan shahih.","language":"bahasa"}],"narrated":[{"text":"On the authority of Abu Dharr Jundub ibn Junadah, and Abu Abdur-Rahman Muadh bin Jabal (may Allah be pleased with him), that the Messenger of Allah (peace and blessings of Allah be upon him) said:","language":"english"},{"text":"Atas wewenang Abu Dzar Jundub bin Junadah, dan Abu Abdur-Rahman Muadz bin Jabal ra bahwa Rasulullah (damai dan berkah Allah besertanya) mengatakan:","language":"bahasa"}]},{"index":"19","hadith_id":"nawawi40","text":[{"text":"عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: \"كُنْت خَلْفَ رَسُولِ اللَّهِ صلى الله عليه و سلم يَوْمًا، فَقَالَ: يَا غُلَامِ! إنِّي أُعَلِّمُك كَلِمَاتٍ: احْفَظْ اللَّهَ يَحْفَظْك، احْفَظْ اللَّهَ تَجِدْهُ تُجَاهَك، إذَا سَأَلْت فَاسْأَلْ اللَّهَ، وَإِذَا اسْتَعَنْت فَاسْتَعِنْ بِاَللَّهِ، وَاعْلَمْ أَنَّ الْأُمَّةَ لَوْ اجْتَمَعَتْ عَلَى أَنْ يَنْفَعُوك بِشَيْءٍ لَمْ يَنْفَعُوك إلَّا بِشَيْءٍ قَدْ كَتَبَهُ اللَّهُ لَك، وَإِنْ اجْتَمَعُوا عَلَى أَنْ يَضُرُّوك بِشَيْءٍ لَمْ يَضُرُّوك إلَّا بِشَيْءٍ قَدْ كَتَبَهُ اللَّهُ عَلَيْك؛ رُفِعَتْ الْأَقْلَامُ، وَجَفَّتْ الصُّحُفُ\" . رَوَاهُ التِّرْمِذِيُّ [رقم:2516] وَقَالَ: حَدِيثٌ حَسَنٌ صَحِيحٌ. وَفِي رِوَايَةِ غَيْرِ التِّرْمِذِيِّ: \"احْفَظْ اللَّهَ تَجِدْهُ أمامك، تَعَرَّفْ إلَى اللَّهِ فِي الرَّخَاءِ يَعْرِفُك فِي الشِّدَّةِ، وَاعْلَمْ أَنَّ مَا أَخْطَأَك لَمْ يَكُنْ لِيُصِيبَك، وَمَا أَصَابَك لَمْ يَكُنْ لِيُخْطِئَك، وَاعْلَمْ أَنَّ النَّصْرَ مَعَ الصَّبْرِ، وَأَنْ الْفَرَجَ مَعَ الْكَرْبِ، وَأَنَّ مَعَ الْعُسْرِ يُسْرًا\".","language":"arabic"},{"text":"One day I was behind the Prophet (peace and blessings of Allah be upon him) [riding on the same mount] and he said, “O young man, I shall teach you some words [of advice]: Be mindful of Allah and Allah will protect you. Be mindful of Allah and you will find Him in front of you. If you ask, then ask Allah [alone]; and if you seek help, then seek help from Allah [alone]. And know that if the nation were to gather together to benefit you with anything, they would not benefit you except with what Allah had already prescribed for you. And if they were to gather together to harm you with anything, they would not harm you except with what Allah had already prescribed against you. The pens have been lifted and the pages have dried.” It was related by at-Tirmidhi, who said it was a good and sound hadeeth. Another narration, other than that of Tirmidhi, reads: Be mindful of Allah, and you will find Him in front of you. Recognize and acknowledge Allah in times of ease and prosperity, and He will remember you in times of adversity. And know that what has passed you by [and you have failed to attain] was not going to befall you, and what has befallen you was not going to pass you by. And know that victory comes with patience, relief with affliction, and hardship with ease.","language":"english"},{"text":"Suatu hari saya berada di belakang Nabi (damai dan berkah Allah besertanya) [mengendarai gunung yang sama] dan dia berkata, “Wahai anak muda, aku akan mengajarimu beberapa kata [nasihat]: Ingatlah Allah dan Allah akan melindungimu. Ingatlah Allah dan Anda akan menemukan Dia di depan Anda. Jika kamu meminta, maka mintalah kepada Allah [saja]; dan jika kamu mencari pertolongan, maka mintalah pertolongan kepada Allah [saja]. Dan ketahuilah, seandainya umat itu berkumpul untuk memberi manfaat kepadamu dengan sesuatu, mereka tidak akan memberi manfaat kepadamu kecuali dengan apa yang telah ditetapkan Allah untukmu. Dan jika mereka berkumpul untuk mencelakaimu dengan sesuatu, mereka tidak akan mencelakakanmu kecuali dengan apa yang telah ditetapkan Allah terhadapmu. Pena telah diangkat dan halaman-halamannya telah kering.” Diriwayatkan oleh at-Tirmidzi, yang mengatakan bahwa itu adalah hadits yang baik dan benar. Narasi lain, selain Tirmidzi, berbunyi: Bertakwalah kepada Allah, dan Anda akan menemukan-Nya di depan Anda. Kenali dan akui Allah di saat kemudahan dan kemakmuran, dan Dia akan mengingat Anda di saat kesulitan. Dan ketahuilah bahwa apa yang telah melewati Anda [dan Anda gagal mencapainya] tidak akan menimpa Anda, dan apa yang telah menimpa Anda tidak akan melewati Anda. Dan ketahuilah, bahwa kemenangan ada bersama kesabaran, kemudahan bersama kesusahan, dan kesulitan bersama kemudahan.","language":"bahasa"}],"narrated":[{"text":"On the authority of Abu Abbas Abdullah bin Abbas (may Allah be pleased with him) who said:","language":"english"},{"text":"Atas otoritas Abu Abbas Abdullah bin Abbas (ra dengan dia) yang mengatakan:","language":"bahasa"}]},{"index":"20","hadith_id":"nawawi40","text":[{"text":"عَنْ أَبِي مَسْعُودٍ عُقْبَةَ بْنِ عَمْرٍو الْأَنْصَارِيِّ الْبَدْرِيِّ رَضِيَ اللهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه و سلم \"إنَّ مِمَّا أَدْرَكَ النَّاسُ مِنْ كَلَامِ النُّبُوَّةِ الْأُولَى: إذَا لَمْ تَسْتَحِ فَاصْنَعْ مَا شِئْت\" . [رَوَاهُ الْبُخَارِيُّ].","language":"arabic"},{"text":"The Messenger of Allah (peace and blessings of Allah be upon him) said, “Verily, from what was learnt by the people from the speech of the earliest prophecy is: If you feel no shame, then do as you wish.” [Al-Bukhari]","language":"english"},{"text":"Rasulullah (damai dan berkah Allah besertanya) berkata, “Sesungguhnya, dari apa yang dipelajari oleh orang-orang dari pidato nubuat awal adalah: Jika Anda tidak merasa malu, maka lakukan apa yang Anda inginkan.” [Al-Bukhari]","language":"bahasa"}],"narrated":[{"text":"On the authority of Abu Masood Uqbah bin ’Amr al-Ansaree al-Badree (may Allah be pleased with him) who said:","language":"english"},{"text":"Atas otoritas Abu Masood Uqbah bin \u0027Amr al-Ansari al-Badri (ra dengan dia) yang mengatakan:","language":"bahasa"}]},{"index":"21","hadith_id":"nawawi40","text":[{"text":"عَنْ أَبِي عَمْرٍو وَقِيلَ: أَبِي عَمْرَةَ سُفْيَانَ بْنِ عَبْدِ اللَّهِ رَضِيَ اللهُ عَنْهُ قَالَ: \"قُلْت: يَا رَسُولَ اللَّهِ! قُلْ لِي فِي الْإِسْلَامِ قَوْلًا لَا أَسْأَلُ عَنْهُ أَحَدًا غَيْرَك؛ قَالَ: قُلْ: آمَنْت بِاَللَّهِ ثُمَّ اسْتَقِمْ\" . [رَوَاهُ مُسْلِمٌ].","language":"arabic"},{"text":"I said, \"O Messenger of Allah, tell me something about al-Islam which I can ask of no one but you.\" He (peace and blessings of Allah be upon him) said, \"Say I believe in Allah — and then be steadfast.\" [Muslim]","language":"english"},{"text":"Aku berkata, \"Ya Rasulullah, ceritakan padaku sesuatu tentang Islam yang tidak bisa aku tanyakan kepada siapa pun kecuali Engkau.\" Dia (damai dan berkah Allah besertanya) berkata, \"Katakanlah aku beriman kepada Allah - dan kemudian tabah.\" [Muslim]","language":"bahasa"}],"narrated":[{"text":"On the authority of Abu `Amr — and he is also called Abu `Amrah — Sufyan bin Abdullah ath- Thaqafee (may Allah be pleased with him) who said:","language":"english"},{"text":"Atas otoritas Abu `Amr — dan dia juga disebut Abu `Amrah — Sufyan bin Abdullah ath-Tsaqafii (ra dengan dia) yang mengatakan:","language":"bahasa"}]},{"index":"22","hadith_id":"nawawi40","text":[{"text":"عَنْ أَبِي عَبْدِ اللَّهِ جَابِرِ بْنِ عَبْدِ اللَّهِ الْأَنْصَارِيِّ رَضِيَ اللَّهُ عَنْهُمَا: \"أَنَّ رَجُلًا سَأَلَ رَسُولَ اللَّهِ صلى الله عليه و سلم فَقَالَ: أَرَأَيْت إذَا صَلَّيْت الْمَكْتُوبَاتِ، وَصُمْت رَمَضَانَ، وَأَحْلَلْت الْحَلَالَ، وَحَرَّمْت الْحَرَامَ، وَلَمْ أَزِدْ عَلَى ذَلِكَ شَيْئًا؛ أَأَدْخُلُ الْجَنَّةَ؟ قَالَ: نَعَمْ\". [رَوَاهُ مُسْلِمٌ].","language":"arabic"},{"text":"A man questioned the Messenger of Allah (peace and blessings of Allah be upon him) and said, “Do you think that if I perform the obligatory prayers, fast in Ramadhan, treat as lawful that which is halal, and treat as forbidden that which is haram, and do not increase upon that [in voluntary good deeds], then I shall enter Paradise?” He (peace and blessings of Allah be upon him) replied, “Yes.” [Muslim]","language":"english"},{"text":"Seorang laki-laki bertanya kepada Rasulullah (damai dan berkah Allah besertanya) dan berkata, “Apakah Anda berpikir bahwa jika saya menunaikan shalat wajib, berpuasa di bulan Ramadhan, menghalalkan yang halal, dan mengharamkan apa yang halal? haram, dan janganlah ditambah dengan itu, maka aku akan masuk surga?” Dia (damai dan berkah Allah besertanya) menjawab, \"Ya.\" [Muslim]","language":"bahasa"}],"narrated":[{"text":"On the authority of Abu Abdullah Jabir bin Abdullah al-Ansaree (may Allah be pleased with him) that:","language":"english"},{"text":"Atas otoritas Abu Abdullah Jabir bin Abdullah al-Ansari (ra dengan dia) bahwa:","language":"bahasa"}]},{"index":"23","hadith_id":"nawawi40","text":[{"text":"عَنْ أَبِي مَالِكٍ الْحَارِثِ بْنِ عَاصِمٍ الْأَشْعَرِيِّ رَضِيَ اللهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه و سلم \"الطَّهُورُ شَطْرُ الْإِيمَانِ، وَالْحَمْدُ لِلَّهِ تَمْلَأُ الْمِيزَانَ، وَسُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ تَمْلَآنِ -أَوْ: تَمْلَأُ- مَا بَيْنَ السَّمَاءِ وَالْأَرْضِ، وَالصَّلَاةُ نُورٌ، وَالصَّدَقَةُ بُرْهَانٌ، وَالصَّبْرُ ضِيَاءٌ، وَالْقُرْآنُ حُجَّةٌ لَك أَوْ عَلَيْك، كُلُّ النَّاسِ يَغْدُو، فَبَائِعٌ نَفْسَهُ فَمُعْتِقُهَا أَوْ مُوبِقُهَا\". [رَوَاهُ مُسْلِمٌ].","language":"arabic"},{"text":"The Messenger of Allah (peace and blessings of Allah be upon him) said, “Purity is half of iman (faith). ‘Al-hamdu lillah (praise be to Allah)’ fills the scales, and ‘subhan-Allah (how far is Allah from every imperfection) and ‘Al-hamdulillah (praise be to Allah)’ fill that which is between heaven and earth. And the salah (prayer) is a light, and charity is a proof, and patience is illumination, and the Qur’an is a proof either for you or against you. Every person starts his day as a vendor of his soul, either freeing it or causing its ruin.” [Muslim]","language":"english"},{"text":"Rasulullah (damai dan berkah Allah besertanya) mengatakan, “Kesucian adalah setengah dari iman (iman). \u0027Al-hamdu lillah (segala puji bagi Allah)\u0027 mengisi timbangan, dan \u0027subhan-Allah (seberapa jauh Allah dari segala ketidaksempurnaan) dan \u0027Al-hamdulillah (segala puji bagi Allah)\u0027 mengisi apa yang ada di antara langit dan bumi . Dan shalat adalah cahaya, dan sedekah adalah buktinya, dan kesabaran adalah penerangan, dan Al-Qur\u0027an adalah bukti bagimu atau terhadapmu. Setiap orang memulai harinya sebagai penjaja jiwanya, entah membebaskannya atau menyebabkan kehancurannya.” [Muslim]","language":"bahasa"}],"narrated":[{"text":"On the authority of Abu Malik al-Harith bin Asim al-Asharee (may Allah be pleased with him) who said:","language":"english"},{"text":"Atas otoritas Abu Malik al-Harits bin Asim al-Asharee (ra dengan dia) yang mengatakan:","language":"bahasa"}]},{"index":"24","hadith_id":"nawawi40","text":[{"text":"عَنْ أَبِي ذَرٍّ الْغِفَارِيِّ رَضِيَ اللهُ عَنْهُ عَنْ النَّبِيِّ صلى الله عليه و سلم فِيمَا يَرْوِيهِ عَنْ رَبِّهِ تَبَارَكَ وَتَعَالَى، أَنَّهُ قَالَ: \"يَا عِبَادِي: إنِّي حَرَّمْت الظُّلْمَ عَلَى نَفْسِي، وَجَعَلْته بَيْنَكُمْ مُحَرَّمًا؛ فَلَا تَظَالَمُوا. يَا عِبَادِي! كُلُّكُمْ ضَالٌّ إلَّا مَنْ هَدَيْته، فَاسْتَهْدُونِي أَهْدِكُمْ. يَا عِبَادِي! كُلُّكُمْ جَائِعٌ إلَّا مَنْ أَطْعَمْته، فَاسْتَطْعِمُونِي أُطْعِمْكُمْ. يَا عِبَادِي! كُلُّكُمْ عَارٍ إلَّا مَنْ كَسَوْته، فَاسْتَكْسُونِي أَكْسُكُمْ. يَا عِبَادِي! إنَّكُمْ تُخْطِئُونَ بِاللَّيْلِ وَالنَّهَارِ، وَأَنَا أَغْفِرُ الذُّنُوبَ جَمِيعًا؛ فَاسْتَغْفِرُونِي أَغْفِرْ لَكُمْ. يَا عِبَادِي! إنَّكُمْ لَنْ تَبْلُغُوا ضُرِّي فَتَضُرُّونِي، وَلَنْ تَبْلُغُوا نَفْعِي فَتَنْفَعُونِي. يَا عِبَادِي! لَوْ أَنَّ أَوَّلَكُمْ وَآخِرَكُمْ وَإِنْسَكُمْ وَجِنَّكُمْ كَانُوا عَلَى أَتْقَى قَلْبِ رَجُلٍ وَاحِدٍ مِنْكُمْ، مَا زَادَ ذَلِكَ فِي مُلْكِي شَيْئًا. يَا عِبَادِي! لَوْ أَنَّ أَوَّلَكُمْ وَآخِرَكُمْ وَإِنْسَكُمْ وَجِنَّكُمْ كَانُوا عَلَى أَفْجَرِ قَلْبِ رَجُلٍ وَاحِدٍ مِنْكُمْ، مَا نَقَصَ ذَلِكَ مِنْ مُلْكِي شَيْئًا. يَا عِبَادِي! لَوْ أَنَّ أَوَّلَكُمْ وَآخِرَكُمْ وَإِنْسَكُمْ وَجِنَّكُمْ قَامُوا فِي صَعِيدٍ وَاحِدٍ، فَسَأَلُونِي، فَأَعْطَيْت كُلَّ وَاحِدٍ مَسْأَلَته، مَا نَقَصَ ذَلِكَ مِمَّا عِنْدِي إلَّا كَمَا يَنْقُصُ الْمِخْيَطُ إذَا أُدْخِلَ الْبَحْرَ. يَا عِبَادِي! إنَّمَا هِيَ أَعْمَالُكُمْ أُحْصِيهَا لَكُمْ، ثُمَّ أُوَفِّيكُمْ إيَّاهَا؛ فَمَنْ وَجَدَ خَيْرًا فَلْيَحْمَدْ اللَّهَ، وَمَنْ وَجَدَ غَيْرَ ذَلِكَ فَلَا يَلُومَن إلَّا نَفْسَهُ\". [رَوَاهُ مُسْلِمٌ].","language":"arabic"},{"text":"O My servants! I have forbidden dhulm (oppression) for Myself, and I have made it forbidden amongst you, so do not oppress one another. O My servants, all of you are astray except those whom I have guided, so seek guidance from Me and I shall guide you. O My servants, all of you are hungry except those whom I have fed, so seek food from Me and I shall feed you. O My servants, all of you are naked except those whom I have clothed, so seek clothing from Me and I shall clothe you. O My servants, you commit sins by day and by night, and I forgive all sins, so seek forgiveness from Me and I shall forgive you. O My servants, you will not attain harming Me so as to harm Me, and you will not attain benefiting Me so as to benefit Me. O My servants, if the first of you and the last of you, and the humans of you and the jinn of you, were all as pious as the most pious heart of any individual amongst you, then this would not increase My Kingdom an iota. O My servants, if the first of you and the last of you, and the humans of you and the jinn of you, were all as wicked as the most wicked heart of any individual amongst you, then this would not decrease My Kingdom an iota. O My servants, if the first of you and the last of you, and the humans of you and the jinn of you, were all to stand together in one place and ask of Me, and I were to give everyone what he requested, then that would not decrease what I Possess, except what is decreased of the ocean when a needle is dipped into it. O My servants, it is but your deeds that I account for you, and then recompense you for. So he who finds good, let him praise Allah, and he who finds other than that, let him blame no one but himself. [Muslim]","language":"english"},{"text":"Wahai hamba-Ku! Aku telah mengharamkan dzulmum (penindasan) bagi diri-Ku, dan Aku telah mengharamkannya di antara kamu, maka janganlah kamu menindas satu sama lain. Wahai hamba-Ku, kamu semua tersesat kecuali orang-orang yang telah Aku beri petunjuk, maka mintalah petunjuk kepada-Ku, niscaya Aku akan memberi petunjuk kepadamu. Wahai hamba-Ku, kalian semua lapar kecuali yang telah Aku beri makan, maka carilah makanan dari-Ku maka Aku akan memberimu makan. Wahai hamba-Ku, kamu semua telanjang kecuali orang-orang yang Aku beri pakaian, maka carilah pakaian dari-Ku, maka Aku akan memberimu pakaian. Wahai hamba-Ku, kamu berbuat dosa di siang dan malam hari, dan Aku mengampuni segala dosa, maka mintalah ampun kepada-Ku maka Aku akan mengampuni kamu. Wahai hamba-Ku, kamu tidak akan memperoleh manfaat dari-Ku sehingga merugikan-Ku, dan kamu tidak akan memperoleh manfaat dari-Ku untuk memberi manfaat kepada-Ku. Wahai hamba-Ku, jika yang pertama dari kalian dan yang terakhir dari kalian, dan manusia di antara kalian dan jin di antara kalian, semuanya sama salehnya dengan hati yang paling saleh dari setiap individu di antara kalian, maka ini tidak akan meningkatkan Kerajaan-Ku sedikit pun. Wahai hamba-Ku, jika yang pertama dari kalian dan yang terakhir dari kalian, dan manusia dari kalian dan jin kalian, semuanya sama jahatnya dengan hati yang paling jahat dari setiap individu di antara kalian, maka ini tidak akan mengurangi Kerajaan-Ku sedikit pun. . Wahai hamba-Ku, jika yang pertama dari kamu dan yang terakhir dari kamu, dan manusia di antara kamu dan jin kamu, semuanya berdiri di satu tempat dan meminta kepada-Ku, dan Aku akan memberikan setiap orang apa yang dia minta, maka itu tidak akan mengurangi apa yang Aku Miliki, kecuali apa yang berkurang dari lautan ketika sebuah jarum dicelupkan ke dalamnya. Wahai hamba-Ku, hanyalah amalan-amalanmu yang Aku pertanggung jawabkan kepadamu, kemudian Aku memberi balasan kepadamu. Maka barang siapa mendapat kebaikan, hendaklah dia memuji Allah, dan barang siapa menemukan selain itu, [Muslim]","language":"bahasa"}],"narrated":[{"text":"On the authority of Abu Dharr al-Ghifaree (may Allah be pleased with him) from the Prophet (peace and blessings of Allah be upon him) from his Lord, that He said:","language":"english"},{"text":"Atas otoritas Abu Dzar al-Ghifari (ra dengan dia) dari Nabi (damai dan berkah Allah besertanya) dari Tuhannya, bahwa Dia berkata:","language":"bahasa"}]},{"index":"25","hadith_id":"nawawi40","text":[{"text":"عَنْ أَبِي ذَرٍّ رَضِيَ اللهُ عَنْهُ أَيْضًا، \"أَنَّ نَاسًا مِنْ أَصْحَابِ رَسُولِ اللَّهِ صلى الله عليه و سلم قَالُوا لِلنَّبِيِّ صلى الله عليه و سلم يَا رَسُولَ اللَّهِ ذَهَبَ أَهْلُ الدُّثُورِ بِالْأُجُورِ؛ يُصَلُّونَ كَمَا نُصَلِّي، وَيَصُومُونَ كَمَا نَصُومُ، وَيَتَصَدَّقُونَ بِفُضُولِ أَمْوَالِهِمْ. قَالَ: أَوَلَيْسَ قَدْ جَعَلَ اللَّهُ لَكُمْ مَا تَصَّدَّقُونَ؟ إنَّ بِكُلِّ تَسْبِيحَةٍ صَدَقَةً، وَكُلِّ تَكْبِيرَةٍ صَدَقَةً، وَكُلِّ تَحْمِيدَةٍ صَدَقَةً، وَكُلِّ تَهْلِيلَةٍ صَدَقَةً، وَأَمْرٌ بِمَعْرُوفٍ صَدَقَةٌ، وَنَهْيٌ عَنْ مُنْكَرٍ صَدَقَةٌ، وَفِي بُضْعِ أَحَدِكُمْ صَدَقَةٌ. قَالُوا: يَا رَسُولَ اللَّهِ أَيَأْتِي أَحَدُنَا شَهْوَتَهُ وَيَكُونُ لَهُ فِيهَا أَجْرٌ؟ قَالَ: أَرَأَيْتُمْ لَوْ وَضَعَهَا فِي حَرَامٍ أَكَانَ عَلَيْهِ وِزْرٌ؟ فَكَذَلِكَ إذَا وَضَعَهَا فِي الْحَلَالِ، كَانَ لَهُ أَجْرٌ\". [رَوَاهُ مُسْلِمٌ].","language":"arabic"},{"text":"Some people from amongst the Companions of the Messenger of Allah (peace and blessings of Allah be upon him) said to the Prophet (peace and blessings of Allah be upon him), \"O Messenger of Allah, the affluent have made off with the rewards; they pray as we pray, they fast as we fast, and they give [much] in charity by virtue of their wealth.\" He (peace and blessings of Allah be upon him) said, \"Has not Allah made things for you to give in charity? Truly every tasbeehah [saying: \u0027subhan-Allah\u0027] is a charity, and every takbeerah [saying: \u0027Allahu akbar\u0027] is a charity, and every tahmeedah [saying: \u0027al-hamdu lillah\u0027] is a charity, and every tahleelah [saying: \u0027laa ilaha illAllah\u0027] is a charity. And commanding the good is a charity, and forbidding an evil is a charity, and in the bud`i [sexual act] of each one of you there is a charity.\" They said, \"O Messenger of Allah, when one of us fulfils his carnal desire will he have some reward for that?\" He (peace and blessings of Allah be upon him) said, \"Do you not see that if he were to act upon it [his desire] in an unlawful manner then he would be deserving of punishment? Likewise, if he were to act upon it in a lawful manner then he will be deserving of a reward.\" [Muslim]","language":"english"},{"text":"Beberapa orang di antara para sahabat Rasulullah (damai dan berkah Allah besertanya) berkata kepada Nabi (damai dan berkah Allah besertanya), \"Ya Rasulullah, orang kaya telah mengambil keuntungan dari pahala. ; mereka shalat sebagaimana kami shalat, mereka berpuasa sebagaimana kami berpuasa, dan mereka bersedekah karena hartanya.” Dia (damai dan berkah Allah besertanya) berkata, \"Bukankah Allah telah membuat sesuatu untuk Anda bersedekah? Sesungguhnya setiap tasbih [mengucapkan: \u0027subhan-Allah\u0027] adalah sedekah, dan setiap takbir [mengucapkan: \u0027Allahu\u0027] akbar\u0027] adalah sedekah, dan setiap tahmid (mengucapkan: \u0027al-hamdu lillah\u0027] adalah sedekah, dan setiap tahlilah [mengucapkan: \u0027laa ilaha illAllah\u0027] adalah sedekah. kejahatan adalah sedekah, dan dalam bud`i [perbuatan seksual] masing-masing dari kamu ada sedekah.\" Mereka berkata, \"Ya Rasulullah, ketika salah satu dari kami memenuhi keinginan duniawinya, apakah dia akan mendapat pahala untuk itu?\" Dia (damai). dan berkat Allah besertanya) berkata, \"Tidakkah kamu melihat bahwa jika dia melakukannya [keinginannya] dengan cara yang melanggar hukum, maka dia layak mendapat hukuman? Demikian juga, jika dia mengamalkannya dengan cara yang halal maka dia akan mendapat pahala.” [Muslim]","language":"bahasa"}],"narrated":[{"text":"Also on the authority of Abu Dharr (may Allah be pleased with him):","language":"english"},{"text":"Juga atas otoritas Abu Dzar (ra dengan dia):","language":"bahasa"}]},{"index":"26","hadith_id":"nawawi40","text":[{"text":"عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه و سلم \"كُلُّ سُلَامَى مِنْ النَّاسِ عَلَيْهِ صَدَقَةٌ، كُلَّ يَوْمٍ تَطْلُعُ فِيهِ الشَّمْسُ تَعْدِلُ بَيْنَ اثْنَيْنِ صَدَقَةٌ، وَتُعِينُ الرَّجُلَ فِي دَابَّتِهِ فَتَحْمِلُهُ عَلَيْهَا أَوْ تَرْفَعُ لَهُ عَلَيْهَا مَتَاعَهُ صَدَقَةٌ، وَالْكَلِمَةُ الطَّيِّبَةُ صَدَقَةٌ، وَبِكُلِّ خُطْوَةٍ تَمْشِيهَا إلَى الصَّلَاةِ صَدَقَةٌ، وَتُمِيطُ الْأَذَى عَنْ الطَّرِيقِ صَدَقَةٌ\". [رَوَاهُ الْبُخَارِيُّ] ، [وَمُسْلِمٌ].","language":"arabic"},{"text":"The Messenger of Allah (peace and blessings of Allah be upon him) said, “Every joint of a person must perform a charity each day that the sun rises: to judge justly between two people is a charity. To help a man with his mount, lifting him onto it or hoisting up his belongings onto it, is a charity. And the good word is a charity. And every step that you take towards the prayer is a charity, and removing a harmful object from the road is a charity.” [Al-Bukhari] [Muslim]","language":"english"},{"text":"Rasulullah (damai dan berkah Allah besertanya) berkata, “Setiap sendi seseorang harus melakukan sedekah setiap hari ketika matahari terbit: untuk memutuskan secara adil antara dua orang adalah sedekah. Membantu seseorang dengan tunggangannya, mengangkatnya atau mengangkat barang-barangnya ke atasnya, adalah sedekah. Dan perkataan yang baik adalah sedekah. Dan setiap langkah yang Anda ambil menuju shalat adalah sedekah, dan mengeluarkan benda berbahaya dari jalan adalah sedekah.” [Al-Bukhari] [Muslim]","language":"bahasa"}],"narrated":[{"text":"On the authority of Abu Hurayrah (may Allah be pleased with him) who said:","language":"english"},{"text":"Atas otoritas Abu Hurairah (ra dengan dia) yang mengatakan:","language":"bahasa"}]},{"index":"27","hadith_id":"nawawi40","text":[{"text":"عَنْ النَّوَّاسِ بْنِ سَمْعَانَ رَضِيَ اللهُ عَنْهُ عَنْ النَّبِيِّ صلى الله عليه و سلم قَالَ: \"الْبِرُّ حُسْنُ الْخُلُقِ، وَالْإِثْمُ مَا حَاكَ فِي صَدْرِك، وَكَرِهْت أَنْ يَطَّلِعَ عَلَيْهِ النَّاسُ\" رَوَاهُ مُسْلِمٌ [رَوَاهُ مُسْلِمٌ]. وَعَنْ وَابِصَةَ بْنِ مَعْبَدٍ رَضِيَ اللهُ عَنْهُ قَالَ: أَتَيْت رَسُولَ اللَّهِ صلى الله عليه و سلم فَقَالَ: \"جِئْتَ تَسْأَلُ عَنْ الْبِرِّ؟ قُلْت: نَعَمْ. فقَالَ: استفت قلبك، الْبِرُّ مَا اطْمَأَنَّتْ إلَيْهِ النَّفْسُ، وَاطْمَأَنَّ إلَيْهِ الْقَلْبُ، وَالْإِثْمُ مَا حَاكَ فِي النَّفْسِ وَتَرَدَّدَ فِي الصَّدْرِ، وَإِنْ أَفْتَاك النَّاسُ وَأَفْتَوْك\" . حَدِيثٌ حَسَنٌ، رَوَيْنَاهُ في مُسْنَدَي الْإِمَامَيْنِ أَحْمَدَ بْنِ حَنْبَلٍ [رقم:4/227]، وَالدَّارِمِيّ [2/246] بِإِسْنَادٍ حَسَنٍ.","language":"arabic"},{"text":"Righteousness is in good character, and wrongdoing is that which wavers in your soul, and which you dislike people finding out about. [Muslim] And on the authority of Wabisah bin Ma’bad (may Allah be pleased with him) who said: I came to the Messenger of Allah (peace and blessings of Allah be upon him) and he (peace and blessings of Allah be upon him) said, “You have come to ask about righteousness.” I said, “Yes.” He (peace and blessings of Allah be upon him) said, “Consult your heart. Righteousness is that about which the soul feels at ease and the heart feels tranquil. And wrongdoing is that which wavers in the soul and causes uneasiness in the breast, even though people have repeatedly given their legal opinion [in its favour].” A good hadeeth transmitted from the musnads of the two imams, Ahmed bin Hambal and Al- Darimi, with a good chain of authorities.","language":"english"},{"text":"Kebajikan itu ada pada akhlak yang baik, dan kemaksiatan adalah kegoyahan dalam jiwamu, dan kamu tidak suka orang mengetahuinya. [Muslim] Dan atas otoritas Wabisah bin Ma\u0027bad (ra dengan dia) yang berkata: Saya datang kepada Rasulullah (damai dan berkah Allah besertanya) dan dia (damai dan berkah Allah besertanya) berkata, “Kamu datang untuk bertanya tentang kebenaran.” Saya bilang iya.\" Dia (damai dan berkah Allah besertanya) berkata, “Berkonsultasilah dengan hatimu. Kebajikan adalah hal yang membuat jiwa merasa tenang dan hati merasa tenang. Dan kezaliman adalah kegoyahan jiwa dan keresahan di dada, padahal manusia berulang-ulang mengeluarkan pendapat hukumnya.” Sebuah hadits yang baik disampaikan dari musnad dua imam, Ahmed bin Hambal dan Al-Darimi, dengan rantai otoritas yang baik.","language":"bahasa"}],"narrated":[{"text":"On the authority of an-Nawas bin Sam’an (may Allah be pleased with him), that the Prophet (peace and blessings of Allah be upon him) said:","language":"english"},{"text":"Atas otoritas an-Nawas bin Sam\u0027an ra bahwa Nabi (damai dan berkah Allah besertanya) mengatakan:","language":"bahasa"}]},{"index":"28","hadith_id":"nawawi40","text":[{"text":"عَنْ أَبِي نَجِيحٍ الْعِرْبَاضِ بْنِ سَارِيَةَ رَضِيَ اللهُ عَنْهُ قَالَ: \"وَعَظَنَا رَسُولُ اللَّهِ صلى الله عليه و سلم مَوْعِظَةً وَجِلَتْ مِنْهَا الْقُلُوبُ، وَذَرَفَتْ مِنْهَا الْعُيُونُ، فَقُلْنَا: يَا رَسُولَ اللَّهِ! كَأَنَّهَا مَوْعِظَةُ مُوَدِّعٍ فَأَوْصِنَا، قَالَ: أُوصِيكُمْ بِتَقْوَى اللَّهِ، وَالسَّمْعِ وَالطَّاعَةِ وَإِنْ تَأَمَّرَ عَلَيْكُمْ عَبْدٌ، فَإِنَّهُ مَنْ يَعِشْ مِنْكُمْ فَسَيَرَى اخْتِلَافًا كَثِيرًا، فَعَلَيْكُمْ بِسُنَّتِي وَسُنَّةِ الْخُلَفَاءِ الرَّاشِدِينَ الْمَهْدِيينَ، عَضُّوا عَلَيْهَا بِالنَّوَاجِذِ، وَإِيَّاكُمْ وَمُحْدَثَاتِ الْأُمُورِ؛ فَإِنَّ كُلَّ بِدْعَةٍ ضَلَالَةٌ\". [رَوَاهُ أَبُو دَاوُدَ]، وَاَلتِّرْمِذِيُّ [رقم:266] وَقَالَ: حَدِيثٌ حَسَنٌ صَحِيحٌ.","language":"arabic"},{"text":"The Messenger of Allah (peace and blessings of Allah be upon him) gave us a sermon by which our hearts were filled with fear and tears came to our eyes. So we said, “O Messenger of Allah! It is as though this is a farewell sermon, so counsel us.” He (peace and blessings of Allah be upon him) said, “I counsel you to have taqwa (fear) of Allah, and to listen and obey [your leader], even if a slave were to become your ameer. Verily he among you who lives long will see great controversy, so you must keep to my Sunnah and to the Sunnah of the Khulafa ar-Rashideen (the rightly guided caliphs), those who guide to the right way. Cling to it stubbornly [literally: with your molar teeth]. Beware of newly invented matters [in the religion], for verily every bidah (innovation) is misguidance.” [Abu Dawud] It was related by at-Tirmidhi, who said that it was a good and sound hadeeth.","language":"english"},{"text":"Rasulullah (damai dan berkah Allah besertanya) memberi kami khotbah yang membuat hati kami dipenuhi ketakutan dan air mata mengalir. Maka kami berkata, “Ya Rasulullah! Seolah-olah ini adalah khotbah perpisahan, jadi nasihati kami.” Dia (damai dan berkah Allah besertanya) berkata, “Saya menasihati Anda untuk memiliki taqwa (takut) kepada Allah, dan untuk mendengarkan dan menaati [pemimpin Anda], bahkan jika seorang budak menjadi amir Anda. Sesungguhnya dia di antara kamu yang berumur panjang akan melihat perselisihan besar, jadi kamu harus berpegang pada Sunnahku dan Sunnah Khulafa ar-Rasyidin (para khalifah yang mendapat petunjuk), mereka yang memberi petunjuk ke jalan yang benar. Pegang erat-erat [harfiah: dengan gigi geraham Anda]. Waspadalah terhadap hal-hal baru [dalam agama], karena sesungguhnya setiap bidah adalah kesesatan.” [Abu Daud] Diriwayatkan oleh at-Tirmidzi, yang mengatakan bahwa itu adalah hadits yang baik dan benar.","language":"bahasa"}],"narrated":[{"text":"On the authority of Abu Najeeh al-’Irbaad ibn Saariyah (may Allah be pleased with him) who said:","language":"english"},{"text":"Atas otoritas Abu Najeeh al-\u0027Irbaad ibn Saariyah (ra dengan dia) yang mengatakan:","language":"bahasa"}]},{"index":"29","hadith_id":"nawawi40","text":[{"text":"عَنْ مُعَاذِ بْنِ جَبَلٍ رَضِيَ اللهُ عَنْهُ قَالَ: قُلْت يَا رَسُولَ اللَّهِ! أَخْبِرْنِي بِعَمَلٍ يُدْخِلُنِي الْجَنَّةَ وَيُبَاعِدْنِي مِنْ النَّارِ، قَالَ: \"لَقَدْ سَأَلْت عَنْ عَظِيمٍ، وَإِنَّهُ لَيَسِيرٌ عَلَى مَنْ يَسَّرَهُ اللَّهُ عَلَيْهِ: تَعْبُدُ اللَّهَ لَا تُشْرِكْ بِهِ شَيْئًا، وَتُقِيمُ الصَّلَاةَ، وَتُؤْتِي الزَّكَاةَ، وَتَصُومُ رَمَضَانَ، وَتَحُجُّ الْبَيْتَ، ثُمَّ قَالَ: أَلَا أَدُلُّك عَلَى أَبْوَابِ الْخَيْرِ؟ الصَّوْمُ جُنَّةٌ، وَالصَّدَقَةُ تُطْفِئُ الْخَطِيئَةَ كَمَا يُطْفِئُ الْمَاءُ النَّارَ، وَصَلَاةُ الرَّجُلِ فِي جَوْفِ اللَّيْلِ، ثُمَّ تَلَا: \" تَتَجَافَى جُنُوبُهُمْ عَنِ الْمَضَاجِعِ \" حَتَّى بَلَغَ \"يَعْمَلُونَ\"،[ 32 سورة السجدة / الأيتان : 16 و 17 ] ثُمَّ قَالَ: أَلَا أُخْبِرُك بِرَأْسِ الْأَمْرِ وَعَمُودِهِ وَذُرْوَةِ سَنَامِهِ؟ قُلْت: بَلَى يَا رَسُولَ اللَّهِ. قَالَ: رَأْسُ الْأَمْرِ الْإِسْلَامُ، وَعَمُودُهُ الصَّلَاةُ، وَذُرْوَةُ سَنَامِهِ الْجِهَادُ، ثُمَّ قَالَ: أَلَا أُخْبِرُك بِمَلَاكِ ذَلِكَ كُلِّهِ؟ فقُلْت: بَلَى يَا رَسُولَ اللَّهِ ! فَأَخَذَ بِلِسَانِهِ وَقَالَ: كُفَّ عَلَيْك هَذَا. قُلْت: يَا نَبِيَّ اللَّهِ وَإِنَّا لَمُؤَاخَذُونَ بِمَا نَتَكَلَّمُ بِهِ؟ فَقَالَ: ثَكِلَتْك أُمُّك وَهَلْ يَكُبُّ النَّاسَ عَلَى وُجُوهِهِمْ -أَوْ قَالَ عَلَى مَنَاخِرِهِمْ- إلَّا حَصَائِدُ أَلْسِنَتِهِمْ؟!\" . رَوَاهُ التِّرْمِذِيُّ [رقم:2616] وَقَالَ: حَدِيثٌ حَسَنٌ صَحِيحٌ.","language":"arabic"},{"text":"I said, “O Messenger of Allah, tell me of an act which will take me into Paradise and will keep me away from the Hellfire.” He (peace and blessings of Allah be upon him) said, “You have asked me about a great matter, yet it is easy for him for whom Allah makes it easy: worship Allah, without associating any partners with Him; establish the prayer; pay the zakat; fast in Ramadhan; and make the pilgrimage to the House.” Then he (peace and blessings of Allah be upon him) said, “Shall I not guide you towards the means of goodness? Fasting is a shield; charity wipes away sin as water extinguishes fire; and the praying of a man in the depths of the night.” Then he (peace and blessings of Allah be upon him) recited: “[Those] who forsake their beds, to invoke their Lord in fear and hope, and they spend (charity in Allah’s cause) out of what We have bestowed on them. No person knows what is kept hidden for them of joy as a reward for what they used to do.” [as-Sajdah, 16-17] Then he (peace and blessings of Allah be upon him) said, “Shall I not inform you of the head of the matter, its pillar and its peak?” I said, “Yes, O Messenger of Allah.” He (peace and blessings of Allah be upon him) said, “The head of the matter is Islam, its pillar is the prayer and its peak is jihad.” Then he (peace and blessings of Allah be upon him) said, “Shall I not tell you of the foundation of all of that?” I said, “Yes, O Messenger of Allah.” So he took hold of his tongue and said, “Restrain this.” I said, “O Prophet of Allah, will we be taken to account for what we say with it?” He (peace and blessings of Allah be upon him) said, “May your mother be bereaved of you, O Muadh! Is there anything that throws people into the Hellfire upon their faces — or: on their noses — except the harvests of their tongues?” It was related by at-Tirmidhi, who said it was a good and sound hadeeth.","language":"english"},{"text":"Aku berkata, “Ya Rasulullah, beri tahu aku tentang suatu perbuatan yang akan membawaku ke surga dan menjauhkanku dari api neraka.” Dia (damai dan berkah Allah besertanya) berkata, “Anda telah bertanya kepada saya tentang masalah besar, namun mudah baginya untuk siapa Allah memudahkan: menyembah Allah, tanpa menyekutukan-Nya; mendirikan shalat; membayar zakat; puasa di bulan Ramadhan; dan berhaji ke Baitullah.” Kemudian dia (damai dan berkah Allah besertanya) berkata, “Maukah aku membimbingmu menuju jalan kebaikan? Puasa adalah perisai; sedekah menghapus dosa seperti air memadamkan api; dan shalat seorang laki-laki di kedalaman malam.” Kemudian dia (damai dan berkah Allah besertanya) membaca: “[Orang-orang] yang meninggalkan tempat tidur mereka, untuk berdoa kepada Tuhan mereka dengan takut dan berharap, dan mereka menafkahkan (sedekah di jalan Allah) dari sebagian yang Kami anugerahkan kepada mereka. Tidak ada seorang pun yang mengetahui apa yang disembunyikan bagi mereka dari kebahagiaan sebagai balasan atas apa yang telah mereka lakukan.” [as-Sajdah, 16-17] Kemudian dia (damai dan berkah Allah besertanya) berkata, \"Maukah aku memberitahumu tentang inti masalah, tiangnya dan puncaknya?\" Aku berkata, “Ya, wahai Rasulullah.” Rasulullah SAW bersabda, “Utamanya adalah Islam, tiangnya adalah shalat, dan puncaknya adalah jihad.” Kemudian dia (damai dan berkah Allah besertanya) berkata, \"Maukah aku memberitahumu tentang dasar dari semua itu?\" Aku berkata, “Ya, wahai Rasulullah.” Jadi dia menahan lidahnya dan berkata, “Tahan ini.” Aku berkata, \"Ya Nabi Allah, apakah kami akan diperhitungkan dengan apa yang kami ucapkan?\" Dia (damai dan berkah Allah besertanya) berkata, “Semoga ibumu kehilanganmu, wahai Muadh! Apakah ada sesuatu yang melemparkan manusia ke dalam api Neraka di atas wajah mereka — atau: di hidung mereka — kecuali panen lidah mereka?” Diriwayatkan oleh at-Tirmidzi, yang mengatakan bahwa itu adalah hadits yang baik dan benar.","language":"bahasa"}],"narrated":[{"text":"On the authority of Muadh bin Jabal (may Allah be pleased with him) who said:","language":"english"},{"text":"Atas otoritas Muadz bin Jabal (ra dengan dia) yang mengatakan:","language":"bahasa"}]},{"index":"30","hadith_id":"nawawi40","text":[{"text":"عَنْ أَبِي ثَعْلَبَةَ الْخُشَنِيِّ جُرْثُومِ بن نَاشِر رَضِيَ اللهُ عَنْهُ عَنْ رَسُولِ اللَّهِ صلى الله عليه و سلم قَال: \"إنَّ اللَّهَ تَعَالَى فَرَضَ فَرَائِضَ فَلَا تُضَيِّعُوهَا، وَحَدَّ حُدُودًا فَلَا تَعْتَدُوهَا، وَحَرَّمَ أَشْيَاءَ فَلَا تَنْتَهِكُوهَا، وَسَكَتَ عَنْ أَشْيَاءَ رَحْمَةً لَكُمْ غَيْرَ نِسْيَانٍ فَلَا تَبْحَثُوا عَنْهَا\". حَدِيثٌ حَسَنٌ، رَوَاهُ الدَّارَقُطْنِيّ ْ\"في سننه\" [4/184]، وَغَيْرُهُ.","language":"arabic"},{"text":"Verily Allah ta’ala has laid down religious obligations (fara’id), so do not neglect them; and He has set limits, so do not overstep them; and He has forbidden some things, so do not violate them; and He has remained silent about some things, out of compassion for you, not forgetfulness — so do not seek after them. A hasan hadeeth narrated by ad-Daraqutnee and others.","language":"english"},{"text":"Sesungguhnya Allah ta\u0027ala telah menetapkan kewajiban agama (fara\u0027id), maka janganlah kamu mengabaikannya; dan Dia telah menetapkan batasan, maka janganlah kamu melampauinya; dan Dia telah mengharamkan beberapa hal, maka janganlah kamu melanggarnya; dan Dia tetap diam tentang beberapa hal, karena belas kasihan kepada Anda, bukan karena lupa - jadi jangan mencarinya. Sebuah hadits hasan diriwayatkan oleh ad-Daraqutnee dan lain-lain.","language":"bahasa"}],"narrated":[{"text":"On the authority of Abu Tha’labah al-Kushanee — Jurthoom bin Nashir (may Allah be pleased with him) — that the Messenger of Allah (peace and blessings of Allah be upon him) said:","language":"english"},{"text":"Atas otoritas Abu Tha\u0027labah al-Kushanee - Jurthoom bin Nashir (ra dengan dia) - bahwa Rasulullah (damai dan berkah Allah besertanya) mengatakan:","language":"bahasa"}]},{"index":"31","hadith_id":"nawawi40","text":[{"text":"عَنْ أَبِي الْعَبَّاسِ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيّ رَضِيَ اللهُ عَنْهُ قَالَ: جَاءَ رَجُلٌ إلَى النَّبِيِّ صلى الله عليه و سلم فَقَالَ: يَا رَسُولَ اللهِ! دُلَّنِي عَلَى عَمَلٍ إذَا عَمِلْتُهُ أَحَبَّنِي اللهُ وَأَحَبَّنِي النَّاسُ؛ فَقَالَ: \"ازْهَدْ فِي الدُّنْيَا يُحِبَّك اللهُ، وَازْهَدْ فِيمَا عِنْدَ النَّاسِ يُحِبَّك النَّاسُ\" . حديث حسن، رَوَاهُ ابْنُ مَاجَهْ [رقم:4102]، وَغَيْرُهُ بِأَسَانِيدَ حَسَنَةٍ.","language":"arabic"},{"text":"A man came to the Prophet (peace and blessings of Allah be upon him) and said, “O Messenger of Allah, direct me to an act which, if I do it, [will cause] Allah to love me and the people to love me.” So he (peace and blessings of Allah be upon him) said, “Renounce the world and Allah will love you, and renounce what the people possess and the people will love you.” A hasan hadeeth related by Ibn Majah and others with good chains of authorities.","language":"english"},{"text":"Seorang laki-laki datang kepada Nabi (damai dan berkah Allah besertanya) dan berkata, “Ya Rasulullah, arahkan saya ke suatu tindakan yang, jika saya melakukannya, [akan menyebabkan] Allah mencintai saya dan orang-orang mencintai saya. Aku.\" Maka dia (damai dan berkah Allah besertanya) berkata, “Tinggalkan dunia dan Allah akan mencintaimu, dan tinggalkan apa yang dimiliki manusia dan manusia akan mencintaimu.” Sebuah hadits hasan yang diriwayatkan oleh Ibn Majah dan lainnya dengan rantai otoritas yang baik.","language":"bahasa"}],"narrated":[{"text":"On the authority of Abu al-’Abbas Sahl bin Sa’ad as-Sa’idee (may Allah be pleased with him) who said:","language":"english"},{"text":"Atas otoritas Abu al-\u0027Abbas Sahl bin Sa\u0027ad as-Sa\u0027idee (ra dengan dia) yang mengatakan:","language":"bahasa"}]},{"index":"32","hadith_id":"nawawi40","text":[{"text":"عَنْ أَبِي سَعِيدٍ سَعْدِ بْنِ مَالِكِ بْنِ سِنَانٍ الْخُدْرِيّ رَضِيَ اللهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه و سلم قَالَ: \" لَا ضَرَرَ وَلَا ضِرَارَ\" . حَدِيثٌ حَسَنٌ، رَوَاهُ ابْنُ مَاجَهْ [راجع رقم:2341]، وَالدَّارَقُطْنِيّ [رقم:4/228]، وَغَيْرُهُمَا مُسْنَدًا. وَرَوَاهُ مَالِكٌ [2/746] فِي \"الْمُوَطَّإِ\" عَنْ عَمْرِو بْنِ يَحْيَى عَنْ أَبِيهِ عَنْ النَّبِيِّ صلى الله عليه و سلم مُرْسَلًا، فَأَسْقَطَ أَبَا سَعِيدٍ، وَلَهُ طُرُقٌ يُقَوِّي بَعْضُهَا بَعْضًا.","language":"arabic"},{"text":"There should be neither harming (darar) nor reciprocating harm (dirar). A hasan hadeeth related by Ibn Majah, ad-Daraqutnee and others as a musnad hadeeth. It was also related by Malik in al-Muwatta in mursal form from Amr bin Yahya, from his father from the Prophet (peace and blessings of Allah be upon him), but leaving Abu Sa’eed from the chain. And it has other chains of narrations that strengthen one another.","language":"english"},{"text":"Tidak boleh ada yang merugikan (darar) dan tidak pula merugikan (dirar). Sebuah hadits hasan yang diriwayatkan oleh Ibn Majah, ad-Daraqutnee dan lainnya sebagai hadits musnad. Hal ini juga diriwayatkan oleh Malik dalam al-Muwatta dalam bentuk mursal dari Amr bin Yahya, dari ayahnya dari Nabi (damai dan berkah Allah besertanya), tetapi meninggalkan Abu Sa\u0027eed dari rantai. Dan ia memiliki rantai riwayat lain yang memperkuat satu sama lain.","language":"bahasa"}],"narrated":[{"text":"On the authority of Abu Sa’eed al-Khudree (may Allah be pleased with him), that the Messenger of Allah (peace and blessings of Allah be upon him) said:","language":"english"},{"text":"Atas otoritas Abu Sa\u0027eed al-Khudree (ra dengan dia), bahwa Rasulullah (damai dan berkah Allah besertanya) mengatakan:","language":"bahasa"}]},{"index":"33","hadith_id":"nawawi40","text":[{"text":"عَنْ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا أَنَّ رَسُولَ اللَّهِ صلى الله عليه و سلم قَالَ: \"لَوْ يُعْطَى النَّاسُ بِدَعْوَاهُمْ لَادَّعَى رِجَالٌ أَمْوَالَ قَوْمٍ وَدِمَاءَهُمْ، لَكِنَّ الْبَيِّنَةَ عَلَى الْمُدَّعِي، وَالْيَمِينَ عَلَى مَنْ أَنْكَرَ\" . حَدِيثٌ حَسَنٌ، رَوَاهُ الْبَيْهَقِيّ [في\"السنن\" 10/252]، وَغَيْرُهُ هَكَذَا، وَبَعْضُهُ فِي \"الصَّحِيحَيْنِ\".","language":"arabic"},{"text":"Were people to be given everything that they claimed, men would [unjustly] claim the wealth and lives of [other] people. But, the onus of proof is upon the claimant, and the taking of an oath is upon him who denies. A hasan hadeeth narrated by al-Baihaqee and others in this form, and part of it is in the two Saheehs.","language":"english"},{"text":"Jika orang diberi segala sesuatu yang mereka klaim, manusia akan [tidak adil] mengklaim kekayaan dan kehidupan orang [lainnya]. Tetapi, tanggung jawab pembuktian ada pada penggugat, dan pengambilan sumpah adalah pada dia yang mengingkari. Sebuah hadits hasan diriwayatkan oleh al-Baihaqee dan yang lainnya dalam bentuk ini, dan sebagian darinya ada dalam dua Shahih.","language":"bahasa"}],"narrated":[{"text":"On the authority of Ibn Abbas (may Allah be pleased with him), that the Messenger of Allah (peace and blessings of Allah be upon him) said:","language":"english"},{"text":"Dari Ibnu Abbas radhiyallahu \u0027anhu bahwa Rasulullah SAW bersabda:","language":"bahasa"}]},{"index":"34","hadith_id":"nawawi40","text":[{"text":"عَنْ أَبِي سَعِيدٍ الْخُدْرِيّ رَضِيَ اللهُ عَنْهُ قَالَ سَمِعْت رَسُولَ اللَّهِ صلى الله عليه و سلم يَقُولُ: \"مَنْ رَأَى مِنْكُمْ مُنْكَرًا فَلْيُغَيِّرْهُ بِيَدِهِ، فَإِنْ لَمْ يَسْتَطِعْ فَبِلِسَانِهِ، فَإِنْ لَمْ يَسْتَطِعْ فَبِقَلْبِهِ، وَذَلِكَ أَضْعَفُ الْإِيمَانِ\" . [رَوَاهُ مُسْلِمٌ].","language":"arabic"},{"text":"I heard the Messenger of Allah (ﷺ) say, “Whosoever of you sees an evil, let him change it with his hand; and if he is not able to do so, then [let him change it] with his tongue; and if he is not able to do so, then with his heart — and that is the weakest of faith.” [Muslim]","language":"english"},{"text":"Saya mendengar Rasulullah (ﷺ) berkata, “Barang siapa di antara kamu melihat kemungkaran, hendaklah dia mengubahnya dengan tangannya; dan jika dia tidak mampu, maka [biarkan dia mengubahnya] dengan lidahnya; dan jika dia tidak mampu, maka dengan hatinya — dan itu adalah selemah-lemahnya iman.” [Muslim]","language":"bahasa"}],"narrated":[{"text":"On the authority of Abu Sa`eed al-Khudree (may Allah be pleased with him) who said:","language":"english"},{"text":"Atas otoritas Abu Sa`eed al-Khudree (ra dengan dia) yang mengatakan:","language":"bahasa"}]},{"index":"35","hadith_id":"nawawi40","text":[{"text":"عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه و سلم \" لَا تَحَاسَدُوا، وَلَا تَنَاجَشُوا، وَلَا تَبَاغَضُوا، وَلَا تَدَابَرُوا، وَلَا يَبِعْ بَعْضُكُمْ عَلَى بَيْعِ بَعْضٍ، وَكُونُوا عِبَادَ اللَّهِ إخْوَانًا، الْمُسْلِمُ أَخُو الْمُسْلِمِ، لَا يَظْلِمُهُ، وَلَا يَخْذُلُهُ، وَلَا يَكْذِبُهُ، وَلَا يَحْقِرُهُ، التَّقْوَى هَاهُنَا، وَيُشِيرُ إلَى صَدْرِهِ ثَلَاثَ مَرَّاتٍ، بِحَسْبِ امْرِئٍ مِنْ الشَّرِّ أَنْ يَحْقِرَ أَخَاهُ الْمُسْلِمَ، كُلُّ الْمُسْلِمِ عَلَى الْمُسْلِمِ حَرَامٌ: دَمُهُ وَمَالُهُ وَعِرْضُهُ\" . [رَوَاهُ مُسْلِمٌ].","language":"arabic"},{"text":"The Messenger of Allah (peace and blessings of Allah be upon him) said, “Do not envy one another, and do not inflate prices for one another, and do not hate one another, and do not turn away from one another, and do not undercut one another in trade, but [rather] be slaves of Allah and brothers [amongst yourselves]. A Muslim is the brother of a Muslim: he does not oppress him, nor does he fail him, nor does he lie to him, nor does he hold him in contempt. Taqwa (piety) is right here [and he pointed to his chest three times]. It is evil enough for a man to hold his brother Muslim in contempt. The whole of a Muslim is inviolable for another Muslim: his blood, his property, and his honour.” [Muslim]","language":"english"},{"text":"Rasulullah shallallahu \u0027alaihi wa sallam bersabda, “Janganlah kamu saling iri, jangan saling menaikkan harga, dan jangan saling membenci, dan jangan saling berpaling, dan tidak saling melemahkan dalam perdagangan, tetapi [lebih] menjadi hamba Allah dan saudara [di antara kamu sendiri]. Seorang Muslim adalah saudara dari seorang Muslim: dia tidak menindasnya, tidak pula mengecewakannya, tidak membohonginya, dan tidak menghinanya. Taqwa (takwa) ada di sini [dan dia menunjuk dadanya tiga kali]. Sudah cukup jahat bagi seorang pria untuk menghina saudaranya Muslim. Seluruh seorang Muslim tidak dapat diganggu gugat bagi Muslim lainnya: darahnya, hartanya, dan kehormatannya.” [Muslim]","language":"bahasa"}],"narrated":[{"text":"On the authority of Abu Hurayrah (may Allah be pleased with him) who said:","language":"english"},{"text":"Atas otoritas Abu Hurairah (ra dengan dia) yang mengatakan:","language":"bahasa"}]},{"index":"36","hadith_id":"nawawi40","text":[{"text":"عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ عَنْ النَّبِيِّ صلى الله عليه و سلم قَالَ: \"مَنْ نَفَّسَ عَنْ مُؤْمِنٍ كُرْبَةً مِنْ كُرَبِ الدُّنْيَا نَفَّسَ اللَّهُ عَنْهُ كُرْبَةً مِنْ كُرَبِ يَوْمِ الْقِيَامَةِ، وَمَنْ يَسَّرَ عَلَى مُعْسِرٍ، يَسَّرَ اللَّهُ عَلَيْهِ فِي الدُّنْيَا وَالْآخِرَةِ، وَمَنْ سَتَرَ مُسْلِما سَتَرَهُ اللهُ فِي الدُّنْيَا وَالْآخِرَةِ ، وَاَللَّهُ فِي عَوْنِ الْعَبْدِ مَا كَانَ الْعَبْدُ فِي عَوْنِ أَخِيهِ، وَمَنْ سَلَكَ طَرِيقًا يَلْتَمِسُ فِيهِ عِلْمًا سَهَّلَ اللَّهُ لَهُ بِهِ طَرِيقًا إلَى الْجَنَّةِ، وَمَا اجْتَمَعَ قَوْمٌ فِي بَيْتٍ مِنْ بُيُوتِ اللَّهِ يَتْلُونَ كِتَابَ اللَّهِ، وَيَتَدَارَسُونَهُ فِيمَا بَيْنَهُمْ؛ إلَّا نَزَلَتْ عَلَيْهِمْ السَّكِينَةُ، وَغَشِيَتْهُمْ الرَّحْمَةُ، وَ حَفَّتهُمُ المَلاَئِكَة، وَذَكَرَهُمْ اللَّهُ فِيمَنْ عِنْدَهُ، وَمَنْ أَبَطْأَ بِهِ عَمَلُهُ لَمْ يُسْرِعْ بِهِ نَسَبُهُ\". [رَوَاهُ مُسْلِمٌ] بهذا اللفظ.","language":"arabic"},{"text":"Whoever removes a worldly grief from a believer, Allah will remove from him one of the griefs of the Day of Resurrection. And whoever alleviates the need of a needy person, Allah will alleviate his needs in this world and the Hereafter. Whoever shields [or hides the misdeeds of] a Muslim, Allah will shield him in this world and the Hereafter. And Allah will aid His slave so long as he aids his brother. And whoever follows a path to seek knowledge therein, Allah will make easy for him a path to Paradise. No people gather together in one of the Houses of Allah, reciting the Book of Allah and studying it among themselves, except that sakeenah (tranquility) descends upon them, and mercy envelops them, and the angels surround them, and Allah mentions them amongst those who are with Him. And whoever is slowed down by his actions, will not be hastened forward by his lineage. Related by [Muslim] in these words.","language":"english"},{"text":"Barang siapa yang menghilangkan salah satu kesedihan duniawi dari seorang mukmin, maka Allah akan menghilangkan darinya salah satu kesedihan di hari kiamat. Dan barang siapa yang meringankan kebutuhan orang yang membutuhkan, maka Allah akan meringankan kebutuhannya di dunia dan di akhirat. Siapa yang melindungi [atau menyembunyikan kesalahan] seorang Muslim, Allah akan melindunginya di dunia dan di akhirat. Dan Allah akan membantu hamba-Nya selama ia membantu saudaranya. Dan barang siapa menempuh suatu jalan untuk menuntut ilmu di dalamnya, maka Allah akan memudahkan baginya jalan menuju surga. Tidaklah suatu kaum berkumpul di salah satu Rumah Allah, membaca Kitab Allah dan mempelajarinya di antara mereka sendiri, kecuali turun atas mereka sakinah (ketenangan), dan rahmat menyelimuti mereka, dan para malaikat mengelilingi mereka, dan Allah menyebut mereka di antara orang-orang itu. yang bersama-Nya. Dan barang siapa yang diperlambat oleh perbuatannya, tidak akan dipercepat oleh garis keturunannya. Terkait oleh [Muslim] dalam kata-kata ini.","language":"bahasa"}],"narrated":[{"text":"On the authority of Abu Hurayrah (may Allah be pleased with him), that the Prophet (peace and blessings of Allah be upon him) said:","language":"english"},{"text":"Atas otoritas Abu Hurairah (ra dengan dia), bahwa Nabi (damai dan berkah Allah besertanya) mengatakan:","language":"bahasa"}]},{"index":"37","hadith_id":"nawawi40","text":[{"text":"عَنْ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا عَنْ رَسُولِ اللَّهِ صلى الله عليه و سلم فِيمَا يَرْوِيهِ عَنْ رَبِّهِ تَبَارَكَ وَتَعَالَى، قَالَ: \"إنَّ اللَّهَ كَتَبَ الْحَسَنَاتِ وَالسَّيِّئَاتِ، ثُمَّ بَيَّنَ ذَلِكَ، فَمَنْ هَمَّ بِحَسَنَةٍ فَلَمْ يَعْمَلْهَا كَتَبَهَا اللَّهُ عِنْدَهُ حَسَنَةً كَامِلَةً، وَإِنْ هَمَّ بِهَا فَعَمِلَهَا كَتَبَهَا اللَّهُ عِنْدَهُ عَشْرَ حَسَنَاتٍ إلَى سَبْعِمِائَةِ ضِعْفٍ إلَى أَضْعَافٍ كَثِيرَةٍ، وَإِنْ هَمَّ بِسَيِّئَةٍ فَلَمْ يَعْمَلْهَا كَتَبَهَا اللَّهُ عِنْدَهُ حَسَنَةً كَامِلَةً، وَإِنْ هَمَّ بِهَا فَعَمِلَهَا كَتَبَهَا اللَّهُ سَيِّئَةً وَاحِدَةً\". [رَوَاهُ الْبُخَارِيُّ] ، [وَمُسْلِمٌ]، في \"صحيحيهما\" بهذه الحروف.","language":"arabic"},{"text":"Verily Allah ta’ala has written down the good deeds and the evil deeds, and then explained it [by saying]: “Whosoever intended to perform a good deed, but did not do it, then Allah writes it down with Himself as a complete good deed. And if he intended to perform it and then did perform it, then Allah writes it down with Himself as from ten good deeds up to seven hundred times, up to many times multiplied. And if he intended to perform an evil deed, but did not do it, then Allah writes it down with Himself as a complete good deed. And if he intended it [i.e., the evil deed] and then performed it, then Allah writes it down as one evil deed.” [Al-Bukhari] [Muslim].","language":"english"},{"text":"Sesungguhnya Allah ta\u0027ala telah menuliskan perbuatan baik dan perbuatan jahat, kemudian menjelaskannya [dengan mengatakan]: “Barang siapa berniat untuk melakukan suatu kebaikan, tetapi tidak melakukannya, maka Allah menuliskannya di sisi-Nya sebagai lengkap tindakan yang baik. Dan jika dia berniat untuk melakukannya kemudian melakukannya, maka Allah menuliskannya di sisi-Nya dari sepuluh kebaikan hingga tujuh ratus kali lipat hingga berlipat ganda. Dan jika dia berniat untuk melakukan suatu perbuatan jahat, tetapi tidak melakukannya, maka Allah menuliskannya di sisi-Nya sebagai perbuatan baik yang sempurna. Dan jika dia berniat [yaitu, perbuatan jahat] dan kemudian melakukannya, maka Allah menuliskannya sebagai satu perbuatan jahat.” [Al-Bukhari] [Muslim] .","language":"bahasa"}],"narrated":[{"text":"On the authority of Ibn Abbas (may Allah be pleased with him), from the Messenger of Allah (peace and blessings of Allah be upon him), from what he has related from his Lord:","language":"english"},{"text":"Atas otoritas Ibn Abbas (ra dengan dia), dari Rasulullah (damai dan berkah Allah besertanya), dari apa yang dia meriwayatkan dari Tuhannya:","language":"bahasa"}]},{"index":"38","hadith_id":"nawawi40","text":[{"text":"عَنْ أَبِي هُرَيْرَة رَضِيَ اللهُ عَنْهُ قَالَ: قَالَ رَسُول اللَّهِ صلى الله عليه و سلم إنَّ اللَّهَ تَعَالَى قَالَ: \"مَنْ عَادَى لِي وَلِيًّا فَقْد آذَنْتهُ بِالْحَرْبِ، وَمَا تَقَرَّبَ إلَيَّ عَبْدِي بِشَيْءٍ أَحَبَّ إلَيَّ مِمَّا افْتَرَضْتُهُ عَلَيْهِ، وَلَا يَزَالُ عَبْدِي يَتَقَرَّبُ إلَيَّ بِالنَّوَافِلِ حَتَّى أُحِبَّهُ، فَإِذَا أَحْبَبْتُهُ كُنْت سَمْعَهُ الَّذِي يَسْمَعُ بِهِ، وَبَصَرَهُ الَّذِي يُبْصِرُ بِهِ، وَيَدَهُ الَّتِي يَبْطِشُ بِهَا، وَرِجْلَهُ الَّتِي يَمْشِي بِهَا، وَلَئِنْ سَأَلَنِي لَأُعْطِيَنَّهُ، وَلَئِنْ اسْتَعَاذَنِي لَأُعِيذَنَّهُ\". [رَوَاهُ الْبُخَارِيُّ].","language":"arabic"},{"text":"The Messenger of Allah (peace and blessings of Allah be upon him) said, “Verily Allah ta’ala has said: ‘Whosoever shows enmity to a wali (friend) of Mine, then I have declared war against him. And My servant does not draw near to Me with anything more loved to Me than the religious duties I have obligated upon him. And My servant continues to draw near to me with nafil (supererogatory) deeds until I Love him. When I Love him, I am his hearing with which he hears, and his sight with which he sees, and his hand with which he strikes, and his foot with which he walks. Were he to ask [something] of Me, I would surely give it to him; and were he to seek refuge with Me, I would surely grant him refuge.’ ” [Al-Bukhari]","language":"english"},{"text":"Rasulullah (damai dan berkah Allah besertanya) berkata, “Sesungguhnya Allah ta\u0027ala berfirman: \u0027Barang siapa yang memusuhi seorang wali (sahabat)-Ku, maka Aku telah menyatakan perang terhadapnya. Dan tidak ada hamba-Ku yang mendekat kepada-Ku dengan sesuatu yang lebih dicintai-Ku selain kewajiban-kewajiban agama yang Aku wajibkan kepadanya. Dan hamba-Ku terus mendekatkan diri kepada-Ku dengan amal nafil hingga Aku Mencintainya. Jika Aku Mencintainya, Aku adalah pendengarannya yang ia gunakan untuk mendengar, penglihatannya yang ia gunakan untuk melihat, tangannya yang ia gunakan untuk memukul, dan kakinya yang ia gunakan untuk berjalan. Jika dia meminta [sesuatu] dari-Ku, Aku pasti akan memberikannya; dan seandainya dia berlindung kepada-Ku, pasti Aku akan memberinya perlindungan.\u0027 ” [Al-Bukhari]","language":"bahasa"}],"narrated":[{"text":"On the authority of Abu Hurayrah (may Allah be pleased with him) who said:","language":"english"},{"text":"Atas otoritas Abu Hurairah (ra dengan dia) yang mengatakan:","language":"bahasa"}]},{"index":"39","hadith_id":"nawawi40","text":[{"text":"عَنْ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا أَنَّ رَسُولَ اللَّهِ صلى الله عليه و سلم قَالَ: \"إنَّ اللَّهَ تَجَاوَزَ لِي عَنْ أُمَّتِي الْخَطَأَ وَالنِّسْيَانَ وَمَا اسْتُكْرِهُوا عَلَيْهِ\" . حَدِيثٌ حَسَنٌ، رَوَاهُ ابْنُ مَاجَهْ [رقم:2045]، وَالْبَيْهَقِيّ [\"السنن\" 7 ].","language":"arabic"},{"text":"Verily Allah has pardoned [or been lenient with] for me my ummah: their mistakes, their forgetfulness, and that which they have been forced to do under duress. A hasan hadeeth related by Ibn Majah, and al-Bayhaqee and others.","language":"english"},{"text":"Sesungguhnya Allah telah mengampuni (atau melunakkan) umatku: kesalahan mereka, kelupaan mereka, dan apa yang mereka terpaksa melakukannya di bawah tekanan. Sebuah hadits hasan yang diriwayatkan oleh Ibn Majah, dan al-Bayhaqi dan lainnya.","language":"bahasa"}],"narrated":[{"text":"On the authority of Ibn Abbas (may Allah be pleased with him), that the Messenger of Allah (peace and blessings of Allah be upon him) said:","language":"english"},{"text":"Dari Ibnu Abbas radhiyallahu \u0027anhu bahwa Rasulullah SAW bersabda:","language":"bahasa"}]},{"index":"40","hadith_id":"nawawi40","text":[{"text":"عَنْ ابْن عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: أَخَذَ رَسُولُ اللَّهِ صلى الله عليه و سلم بِمَنْكِبِي، وَقَالَ: \"كُنْ فِي الدُّنْيَا كَأَنَّك غَرِيبٌ أَوْ عَابِرُ سَبِيلٍ\". وَكَانَ ابْنُ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا يَقُولُ: إذَا أَمْسَيْتَ فَلَا تَنْتَظِرْ الصَّبَاحَ، وَإِذَا أَصْبَحْتَ فَلَا تَنْتَظِرْ الْمَسَاءَ، وَخُذْ مِنْ صِحَّتِك لِمَرَضِك، وَمِنْ حَيَاتِك لِمَوْتِك. [رَوَاهُ الْبُخَارِيُّ].","language":"arabic"},{"text":"The Messenger of Allah (peace and blessings of Allah be upon him) took me by the shoulder and said, “Be in this world as though you were a stranger or a wayfarer.” And Ibn Umar (may Allah be pleased with him) used to say, “In the evening do not expect [to live until] the morning, and in the morning do not expect [to live until] the evening. Take [advantage of] your health before times of sickness, and [take advantage of] your life before your death.” [Al-Bukhari]","language":"english"},{"text":"Rasulullah (damai dan berkah Allah besertanya) memegang pundakku dan berkata, “Jadilah di dunia ini seolah-olah kamu adalah orang asing atau musafir.” Dan Ibnu Umar radhiyallahu ‘anhu pernah berkata, “Pada waktu petang jangan berharap [hidup sampai] pagi hari, dan di pagi hari jangan berharap [hidup sampai] sore hari. Manfaatkan [manfaatkan] kesehatan Anda sebelum masa sakit, dan [manfaatkan] hidup Anda sebelum kematian Anda.” [Al-Bukhari]","language":"bahasa"}],"narrated":[{"text":"On the authority of Abdullah ibn Umar (may Allah be pleased with him), who said:","language":"english"},{"text":"Atas otoritas Abdullah bin Umar (ra dengan dia), yang mengatakan:","language":"bahasa"}]},{"index":"41","hadith_id":"nawawi40","text":[{"text":"عَنْ أَبِي مُحَمَّدٍ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ رَضِيَ اللَّهُ عَنْهُمَا، قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه و سلم \"لَا يُؤْمِنُ أَحَدُكُمْ حَتَّى يَكُونَ هَوَاهُ تَبَعًا لِمَا جِئْتُ بِهِ\". حَدِيثٌ حَسَنٌ صَحِيحٌ، رَوَيْنَاهُ فِي كِتَابِ \"الْحُجَّةِ\" بِإِسْنَادٍ صَحِيحٍ.","language":"arabic"},{"text":"The Messenger of Allah (peace and blessings of Allah be upon him) said, “None of you [truly] believes until his desires are subservient to that which I have brought.” [Imam an-Nawawi says:] We have related it in Kitab al-Hujjah with a saheeh chain of narrators.","language":"english"},{"text":"Rasulullah shallallahu \u0027alaihi wa sallam bersabda, \"Tidak beriman salah seorang di antara kamu sampai keinginannya tunduk kepada apa yang telah Aku bawa.\" [Imam an-Nawawi mengatakan:] Kami telah menghubungkannya dalam Kitab al-Hujjah dengan rantai perawi yang shahih.","language":"bahasa"}],"narrated":[{"text":"On the authority of Abu Muhammad Abdullah bin ’Amr bin al-’Aas (may Allah be pleased with him) who said:","language":"english"},{"text":"Atas otoritas Abu Muhammad Abdullah bin \u0027Amr bin al-\u0027Aas (ra dengan dia) yang mengatakan:","language":"bahasa"}]},{"index":"42","hadith_id":"nawawi40","text":[{"text":"عَنْ أَنَسِ بْنِ مَالِكٍ رَضِيَ اللهُ عَنْهُ قَالَ: سَمِعْت رَسُولَ اللَّهِ صلى الله عليه و سلم يَقُولُ: قَالَ اللَّهُ تَعَالَى: \"يَا ابْنَ آدَمَ! إِنَّكَ مَا دَعَوْتنِي وَرَجَوْتنِي غَفَرْتُ لَك عَلَى مَا كَانَ مِنْك وَلَا أُبَالِي، يَا ابْنَ آدَمَ! لَوْ بَلَغَتْ ذُنُوبُك عَنَانَ السَّمَاءِ ثُمَّ اسْتَغْفَرْتنِي غَفَرْتُ لَك، يَا ابْنَ آدَمَ! إنَّك لَوْ أتَيْتنِي بِقُرَابِ الْأَرْضِ خَطَايَا ثُمَّ لَقِيتنِي لَا تُشْرِكُ بِي شَيْئًا لَأَتَيْتُك بِقُرَابِهَا مَغْفِرَةً\" . رَوَاهُ التِّرْمِذِيُّ [رقم:3540]، وَقَالَ: حَدِيثٌ حَسَنٌ صَحِيحٌ.","language":"arabic"},{"text":"I heard the Messenger of Allah (peace and blessings of Allah be upon him) say, “Allah the Almighty has said: ‘O Son of Adam, as long as you invoke Me and ask of Me, I shall forgive you for what you have done, and I shall not mind. O Son of Adam, were your sins to reach the clouds of the sky and you then asked forgiveness from Me, I would forgive you. O Son of Adam, were you to come to Me with sins nearly as great as the Earth, and were you then to face Me, ascribing no partner to Me, I would bring you forgiveness nearly as great as it [too].’ ” It was related by at-Tirmidhi, who said that it was a hasan hadeeth.","language":"english"},{"text":"Saya mendengar Rasulullah (damai dan berkah Allah besertanya) berkata, “Allah SWT telah berfirman: \u0027Hai anak Adam, selama Anda memohon kepada-Ku dan meminta kepada-Ku, saya akan mengampuni Anda untuk apa yang Anda miliki. selesai, dan saya tidak akan keberatan. Wahai Anak Adam, sekiranya dosamu mencapai awan di langit, lalu kamu memohon ampun kepada-Ku, niscaya Aku ampuni. Wahai Anak Adam, jika kamu datang kepada-Ku dengan dosa yang hampir sebesar bumi, dan jika kamu kemudian menghadap-Ku, tidak menyekutukan-Ku, Aku akan memberimu pengampunan yang hampir sebesar [juga].\u0027 ” Diriwayatkan oleh at-Tirmidzi, yang mengatakan bahwa itu adalah hadits hasan.","language":"bahasa"}],"narrated":[{"text":"On the authority of Anas (may Allah be pleased with him) who said:","language":"english"},{"text":"Atas otoritas Anas (ra dengan dia) yang mengatakan:","language":"bahasa"}]}]