[{"index":"1271","hadith_id":"riyadussalihin","text":[{"text":"وعن ابن عمر رضي الله عنهما أن رسول الله صلى الله عليه وسلم قال‏:‏ بني الإسلام على خمس‏:‏ شهادة أن لا إله إلى الله وأن محمدًا رسول الله، وإقام الصلاة، وإيتاء الزكاة، وحج البيت، وصوم رمضان‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"(The superstructure of) Islam is based on five (pillars), testifying the fact that La ilaha illallah wa anna Muhammad-ar-Rasul-ullah [there is no true god except Allah, and Muhammad ((ﷺ)) is the Messenger of Allah], establishing As- Salat (the prayers), paying Zakat (poor due), the pilgrimage to the House [of Allah (Ka\u0027bah)], and the Saum (fasting) during the month of Ramadan.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"(Suprastruktur) Islam didasarkan pada lima (pilar), bersaksi tentang fakta bahwa La ilaha illallah wa anna Muhammad-ar-Rasul-ullah [tidak ada Tuhan yang benar selain Allah, dan Muhammad ((ﷺ)) adalah Utusan Allah] , mendirikan As-Salat (shalat), membayar Zakat (jatuh tempo), haji ke Rumah [Allah (Ka\u0027bah)] , dan Saum (puasa) selama bulan Ramadhan.” [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Ibn \u0027Umar (May Allah be pleased with them) reported:","language":"english"},{"text":"Ibnu \u0027Umar radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"1272","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي هريرة رضي الله عنه قال‏:‏ خطبنا رسول الله صلى الله عليه وسلم فقال‏:‏ ‏\"‏يا أيها الناس إن الله قد فرض عليكم الحج فحجوا‏\"‏ فقال رجل‏:‏ أكل عام يا رسول الله‏؟‏ فسكت، حتى قالها ثلاثًا فقال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏لو قلت نعم لوجبت، ولما استطعتم‏\"‏ ثم قال‏:‏ ‏\"‏ذروني ما تركتكم، فإنما هلك من كان قبلكم بكثرة سؤالهم، واختلافهم على أنبيائهم، فإذا أمرتكم بشيء فأتوا منه ما استطعتم، وإذا نهيتكم عن شيء فدعوه‏\"‏‏.‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) delivered a Khutbah and said, \"O people! Hajj (pilgrimage to the House of Allah) has been made incumbent upon you, so perform Hajj.\" A man inquired: \"O Messenger of Allah, is it prescribed every year?\" He (ﷺ) remained silent till the man repeated it thrice. Then he (ﷺ) said, \"Had I replied in the affirmative, it would have surely become obligatory, and you would not have been able to fulfill it.\" Afterwards he said, \"Do not ask me so long as I do not impose anything upon you, because those who were before you were destroyed on account of their frequent questioning and their disagreement with their Prophets. So when I order you to do something, do it as far as you can; and when I forbid you from doing anything, eschew it.\" [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) menyampaikan Khutbah dan berkata, \"Hai manusia! Haji (ziarah ke Rumah Allah) telah diwajibkan atasmu, maka lakukanlah haji.\" Seorang laki-laki bertanya: \"Ya Rasulullah, apakah itu disyariatkan setiap tahun?\" Dia (ﷺ) tetap diam sampai pria itu mengulanginya tiga kali. Kemudian beliau (ﷺ) berkata, “Seandainya aku mengiyakan, pastilah itu menjadi wajib, dan kamu tidak akan mampu memenuhinya.” Kemudian beliau bersabda, “Jangan bertanya kepadaku selama aku tidak memaksakan sesuatu kepadamu, karena orang-orang sebelum kamu binasa karena seringnya mereka bertanya dan berselisih dengan para nabi mereka. Maka ketika aku memerintahkan kamu untuk melakukan sesuatu, lakukan sejauh yang Anda bisa; dan ketika saya melarang Anda melakukan apa pun, hindarilah.\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"1273","hadith_id":"riyadussalihin","text":[{"text":"وعنه قال‏:‏ سئل النبي صلى الله عليه وسلم أي العمل أفضل‏؟‏ قال‏:‏ ‏\"‏إيمان بالله ورسوله‏\"‏ قيل‏:‏ ثم ماذا‏؟‏ قال‏:‏ ‏\"‏الجهاد في سبيل الله‏\"‏ قيل ثم ماذا‏؟‏ قال‏:‏ ‏\"‏حج مبرور‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏\"‏المبرور‏\"‏ هو الذي لا يرتكب صاحبه فيه معصية‏.‏","language":"arabic"},{"text":"The Prophet (ﷺ) was asked: \"Which deed is the best?\" He (ﷺ) replied, \"Faith in Allah and His Messenger.\" Then he was asked: \"What is next?\" He replied, \"Jihad (holy fighting) in the Cause of Allah.\" Then he was asked, \"What is after that?\" He (ﷺ) replied, \"Hajj Mabrur (an accepted pilgrimage).\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Nabi (ﷺ) ditanya: \"Perbuatan apa yang paling baik?\" Dia (ﷺ) menjawab, \"Iman kepada Allah dan Rasul-Nya.\" Kemudian dia ditanya: \"Apa selanjutnya?\" Dia menjawab, \"Jihad (perang suci) di jalan Allah.\" Kemudian dia ditanya, \"Apa yang terjadi setelah itu?\" Dia (ﷺ) menjawab, \"Haji Mabrur (ziarah yang diterima).\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"1274","hadith_id":"riyadussalihin","text":[{"text":"وعنه قال سمعت رسول الله صلى الله عليه وسلم يقول‏:‏ ‏ \"‏من حج، فلم يرفث ولم يفسق، رجع كيوم ولدته أمه‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"Whoever performs Hajj (pilgrimage) and does not have sexual relations (with his wife), nor commits sin, nor disputes unjustly (during Hajj), then he returns from Hajj as pure and free from sins as on the day on which his mother gave birth to him.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, “Barang siapa yang menunaikan haji, tidak bersetubuh (dengan istrinya), tidak berbuat dosa, dan tidak berselisih (saat haji), maka ia kembali dari haji dalam keadaan suci dan bebas dari dosa. dosa seperti pada hari ibunya melahirkan dia.” [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"1275","hadith_id":"riyadussalihin","text":[{"text":"وعنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏ \"‏العمرة إلى العمرة كفارة لما بينهما، والحج المبرور ليس له جزاء إلا الجنة‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"(The performance of) \u0027Umrah is an expiation for the sins committed between it and the previous \u0027Umrah; and the reward of Hajj Mabrur (i.e., one accepted) is nothing but Jannah.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"(Melaksanakan) \u0027Umrah adalah penghapus dosa yang dilakukan antara itu dan \u0027umrah sebelumnya; dan pahala haji Mabrur (yaitu, satu diterima) tidak lain adalah Jannah.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"1276","hadith_id":"riyadussalihin","text":[{"text":"وعن عائشة رضي الله عنها قالت‏:‏ قلت يا رسول الله نرى الجهاد أفضل العمل، أفلا نجاهد‏؟‏ فقال‏:‏ ‏:‏ ‏ \"‏لَكُنّ أفضل الجهاد حج مبرور‏\"‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","language":"arabic"},{"text":"I said: \"O Messenger of Allah! We consider Jihad as the best deed, should we not then go for Jihad?\" The Messenger of Allah (ﷺ) said, \"The best Jihad for you women is Hajj Mabrur (i.e., one accepted by Allah).\" [Al-Bukhari].","language":"english"},{"text":"Aku berkata: \"Ya Rasulullah! Kami menganggap Jihad sebagai perbuatan terbaik, tidakkah kami kemudian pergi untuk Jihad?\" Rasulullah (ﷺ) berkata, \"Jihad terbaik bagi kalian para wanita adalah haji mabrur (yaitu, yang diterima oleh Allah).\" [Al-Bukhari] .","language":"bahasa"}],"narrated":[{"text":"\u0027Aishah (May Allah be pleased with her) reported:","language":"english"},{"text":"\u0027Aisyah r.a. melaporkan:","language":"bahasa"}]},{"index":"1277","hadith_id":"riyadussalihin","text":[{"text":"وعنها أن رسول الله صلى الله عليه وسلم، قال‏:‏ ‏ \"‏ما من يوم أكثر من أن يعتق الله فيه عبدًا من النار من يوم عرفة‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"There is no day on which Allah sets free more slaves from Hell than He does on the Day of \u0027Arafah.\" [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Tidak ada hari di mana Allah membebaskan lebih banyak budak dari Neraka daripada yang Dia lakukan pada hari Arafah.\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"\u0027Aishah (May Allah be pleased with her) reported:","language":"english"},{"text":"\u0027Aisyah r.a. melaporkan:","language":"bahasa"}]},{"index":"1278","hadith_id":"riyadussalihin","text":[{"text":"وعن ابن عباس رضي الله عنهما، أن النبي صلى الله عليه وسلم قال‏:‏ ‏ \"‏عمرة في رمضان تعدل عمرة أو حجة معي‏\"‏‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","language":"arabic"},{"text":"The Prophet (ﷺ) said, \"(The performance of) \u0027Umrah during Ramadan is equal to Hajj (pilgrimage).\" Or said, \"Equal to the performance of Hajj with me.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Nabi (ﷺ) berkata, \"(Melakukan) \u0027Umrah selama Ramadhan adalah sama dengan haji (ziarah).\" Atau berkata, \"Setara dengan kinerja haji dengan saya.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Ibn \u0027Abbas (May Allah be pleased with them) reported:","language":"english"},{"text":"Ibn \u0027Abbas (semoga Allah meridhoi mereka) melaporkan:","language":"bahasa"}]},{"index":"1279","hadith_id":"riyadussalihin","text":[{"text":"وعنه أن امرأة قالت‏:‏ يا رسول الله إن فريضة الله على عباده في الحج، أدركت أبي شيخًا كبيرًا، لا يثبت على الراحلة، أفأحج عنه‏؟‏ قال‏:‏ ‏ \"‏نعم‏\"‏‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","language":"arabic"},{"text":"A woman came to the Messenger of Allah (ﷺ) and said, \"Allah\u0027s obligation upon His slaves has become obligatory on my father in his old age. My father is very old and incapable of riding. May I perform Hajj on his behalf?\" He (ﷺ) said, \"Yes.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Seorang wanita datang kepada Rasulullah (ﷺ) dan berkata, \"Kewajiban Allah atas hamba-hamba-Nya telah menjadi kewajiban ayahku di hari tuanya. Ayahku sudah sangat tua dan tidak mampu menunggang kuda. Bolehkah aku menunaikan haji atas namanya?\" Dia (ﷺ) berkata, \"Ya.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Ibn \u0027Abbas (May Allah be pleased with them) reported:","language":"english"},{"text":"Ibn \u0027Abbas (semoga Allah meridhoi mereka) melaporkan:","language":"bahasa"}]},{"index":"1280","hadith_id":"riyadussalihin","text":[{"text":"وعن لقيط بن عامر رضي الله عنه أنه أتى النبي صلى الله عليه وسلم فقال‏:‏ إن أبي شيخ كبير لا يستطيع الحج ولا العمرة، ولا الظعن قال‏:‏ ‏ \"‏حج عن أبيك واعتمر‏\"‏ ‏(‏‏(‏رواه أبو داود والترمذي وقال‏:‏ حديث حسن صحيح‏.‏ ‏)‏‏)‏‏.‏","language":"arabic"},{"text":"I came to the Prophet (ﷺ) and said: \"My father is a very old man and does not have strength to perform Hajj (pilgrimage) or \u0027Umrah or to undertake the journey.\" The Prophet (ﷺ) said, \"Perform Hajj and \u0027Umrah on behalf of your father.\" [Abu Dawud and At- Tirmidhi].","language":"english"},{"text":"Saya datang kepada Nabi (ﷺ) dan berkata: \"Ayah saya adalah orang yang sangat tua dan tidak memiliki kekuatan untuk melakukan haji (ziarah) atau \u0027Umrah atau melakukan perjalanan.\" Nabi (ﷺ) berkata, \"Lakukan haji dan \u0027umrah atas nama ayahmu.\" [Abu Dawud dan At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Laqit bin \u0027Amir (May Allah be pleased with him) reported:","language":"english"},{"text":"Laqit bin \u0027Amir (ra dengan dia) melaporkan:","language":"bahasa"}]},{"index":"1281","hadith_id":"riyadussalihin","text":[{"text":"وعن السائب بن يزيد رضي الله عنه، قال‏:‏ حج بي مع رسول الله صلى الله عليه وسلم في حجة الوداع وأنا ابن سبع سنين‏.‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","language":"arabic"},{"text":"I was seven years old when I was taken to perform Hajj (pilgrimage). This was during the time the Messenger of Allah (ﷺ) performed the Hajjat-ul-Wada\u0027 (Farewell Pilgrimage). [Al- Bukhari].","language":"english"},{"text":"Saya berumur tujuh tahun ketika saya dibawa untuk melakukan haji (haji). Ini terjadi pada saat Rasulullah (ﷺ) melakukan Hajjat-ul-Wada\u0027 (Ziarah Perpisahan). [Al-Bukhari] .","language":"bahasa"}],"narrated":[{"text":"As-Sai\u0027b bin Yazid (May Allah be pleased with him) reported:","language":"english"},{"text":"As-Sai\u0027b bin Yazid radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"1282","hadith_id":"riyadussalihin","text":[{"text":"وعن ابن عباس رضي الله عنهما أن النبي صلى الله عليه وسلم لقي ركبا بالروحاء فقال‏:‏ ‏\"‏من القوم‏؟‏‏\"‏ قالوا‏:‏ المسلمون‏.‏ قالوا من أنت‏؟‏ قال‏:‏ ‏\"‏رسول الله‏\"‏ فرفعت امرأة صبيًا فقالت‏:‏ ألهذا حج‏؟‏ قال ‏\"‏نعم ولك أجر‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Prophet (ﷺ) came across a caravan at Ar-Rauha\u0027 and asked who the people in the caravan were. They replied that they were Muslims. They asked: \"Who are you?\" He (ﷺ) said, \"I am the Messenger of Allah.\" Then a woman lifted up a boy to him and asked: \"Would this child be credited with having performed the Hajj (pilgrimage)?\" Whereupon he (ﷺ) said, \"Yes, and you will have a reward.\" [Muslim].","language":"english"},{"text":"Nabi (ﷺ) menemukan kafilah di Ar-Rauha\u0027 dan bertanya siapa orang-orang di kafilah itu. Mereka menjawab bahwa mereka adalah Muslim. Mereka bertanya: \"Siapa kamu?\" Dia (ﷺ) berkata, \"Aku adalah utusan Allah.\" Kemudian seorang wanita mengangkat seorang anak laki-laki kepadanya dan bertanya: \"Apakah anak ini akan dikreditkan dengan melakukan haji (ziarah)?\" Kemudian dia (ﷺ) berkata, \"Ya, dan kamu akan mendapat pahala.\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Ibn \u0027Abbas (May Allah be pleased with them) reported:","language":"english"},{"text":"Ibn \u0027Abbas (semoga Allah meridhoi mereka) melaporkan:","language":"bahasa"}]},{"index":"1283","hadith_id":"riyadussalihin","text":[{"text":"وعن أنس رضي الله عنه، أن رسول الله صلى الله عليه وسلم حج على رحل وكانت زاملته‏.‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) performed the pilgrimage on an unsaddled camel which also carried his provisions (i.e., his Zamilah). [Al- Bukhari].","language":"english"},{"text":"Rasulullah (ﷺ) menunaikan umroh dengan unta tanpa sadel yang juga membawa perbekalannya (yakni Zamilahnya). [Al-Bukhari] .","language":"bahasa"}],"narrated":[{"text":"Anas (May Allah be pleased with him) reported:","language":"english"},{"text":"Anas (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"1284","hadith_id":"riyadussalihin","text":[{"text":"وعن ابن عباس رضي الله عنهما قال‏:‏ كانت عكاظ ومجنة، وذو المجاز أسواقًا في الجاهلية، فتأثموا أن يتجروا في المواسم، فنزلت‏:‏ ‏{‏ليس عليكم جناح أن تبتغوا فضلا من ربكم‏}‏ ‏(‏‏(‏البقرة‏:‏ 198‏)‏‏)‏ في مواسم الحج‏.‏‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","language":"arabic"},{"text":"Ukaz, Mijannah and Dhul-Majaz were markets during the pre-Islamic period. The Companions disliked trading there till the following Ayat of the Noble Qur\u0027an were revealed: \"There is no sin on you if you seek the Bounty of your Rubb (during pilgrimage by trading)...\" (2:198) [Al- Bukhari].","language":"english"},{"text":"Ukaz, Mijannah dan Dzul-Majaz adalah pasar selama periode pra-Islam. Para sahabat tidak suka berdagang di sana sampai ayat Al-Qur\u0027an berikut diturunkan: \"Tidak ada dosa bagimu jika kamu mencari karunia dari hartamu (selama haji dengan berdagang)...\" (2:198) [Al -Bukhori] .","language":"bahasa"}],"narrated":[{"text":"Ibn \u0027Abbas (May Allah be pleased with them) reported:","language":"english"},{"text":"Ibn \u0027Abbas (semoga Allah meridhoi mereka) melaporkan:","language":"bahasa"}]}]