[{"index":"1808","hadith_id":"riyadussalihin","text":[{"text":"عن النواس بن سمعان رضي الله عنه قال‏:‏ ذكر رسول الله صلى الله عليه وسلم الدجال ذات غداة، فخفض فيه، ورفع حتى ظنناه في طائفة النخل‏.‏ فلما رحنا إليه، عرف ذلك فينا، فقال‏:‏ ‏\"‏ما شأنكم‏؟‏” قلنا‏:‏ يا رسول الله ذكرت الدجال الغداة، فخفضت فيه حتى ظنناه في طائفة النخل فقال‏:‏ ‏\"‏غير الدجال أخوفنى عليكم؛ إن يخرج وأنا فيكم، فأنا حجيجه دونكم؛ وإن يخرج ولست فيكم، فامرؤ حجيج نفسه، والله خليفتي على كل مسلم، إنه شاب قطط، عينه طافية، كأني أشبهه بعبد العزى بن قطن، فمن أدركه منكم فليقرأ عليه فواتح سورة الكهف، إنه خارج خلة بين الشام والعراق، فعاث يمينا وعاث شمالاً، يا عباد الله فاثبتوا” قلنا‏:‏ يا رسول الله وما لبثه في الأرض‏؟‏ قال‏:‏ ‏\"‏أربعون يوماً‏:‏ يوم كسنة، ويوم كشهر، ويوم كجمعة، وسائر أيامه كأيامكم‏\"‏ قلنا ‏:‏ يا رسول الله ، فذلك اليوم الذي كسنة أتكفينا فيه صلاة يوم‏؟‏ قال‏:‏ لا، اقدروا له قدره” فقلنا‏:‏ يا رسول الله وما إسراعه في الأرض‏؟‏ قال‏:‏ ‏\"‏كالغيث استدبرته الريح، فيأتي على القوم، فيدعوهم، فيؤمنون به، ويستجيبون له فيأمر السماء فتمطر، والأرض فتنبت، فتروح عليهم سارحتهم، أطول ما كانت ذرى، وأسبغه ضروعاً، وأمده خواصر، ثم يأتي القوم فيدعوهم، فيردون عليه قوله، فيصرف عنهم، فيصبحون ممحلين ليس بأيديهم شيء من أموالهم، ويمر بالخربة فيقول لها‏:‏ أخرجي كنوزك، فتتبعه كنوزها كيعاسيب النحل، ثم يدعو رجلاً ممتلئاً شبابا فيضربه بالسيف، فيقطعه جزلتين رمية الغرض، ثم يدعوه، فيقبل، ويتهلل وجهه يضحك، فبينما هو كذلك إذ بعث الله تعالى المسيح ابن مريم،صلى الله عليه وسلم ، فينزل عند المنارة البيضاء شرقي دمشق بين مهرودتين، واضعاً كفيه على أجنحة ملكين، إذا طأطأ رأسه، قطر، وإذا رفعه تحدر منه جمان كاللؤلؤ، فلا يحل لكافر يجد نفسه إلا مات، ونفسه ينتهي إلى حيث ينتهي طرفه، فيطلبه حتى يدركه بباب لد فيقتله، ثم يأتي عيسى ، صلى الله عليه وسلم ، قوم قد عصمهم الله منه، فيمسح عن وجوههم، ويحدثهم بدرجاتهم في الجنة، فبينما هو كذلك إذ أوحى الله تعالى إلى عيسى صلى الله عليه وسلم إني قد أخرجت عباداً لي لا يدان لأحد بقتالهم، فحرز عبادي إلى الطور، ويبعث الله يأجوج ومأجوج وهم من كل حدب ينسلون، فيمر أوائلهم على بحيرة طبرية فيشربون ما فيها، ويمر آخرهم فيقول‏:‏ لقد كان بهذه مرة ماء، ويحصر نبي الله عيسى، صلى الله عليه وسلم ، وأصحابه حتى يكون رأس الثور لأحدهم خيراً من مائة دينار لأحدكم اليوم، فيرغب نبي الله عيسى، صلى الله عليه وسلم وأصحابه، رضي الله عنهم، إلى الله تعالى، فيرسل الله تعالى عليهم النغف في رقابهم، فيصبحون فرسى كموت نفس واحدة ثم يهبط نبي الله عيسى، صلى الله عليه وسلم ، وأصحابه رضي الله عنهم، إلى الله تعالى، فيرسل الله تعالى عليهم النغف في رقابهم فيصبحون فرسى كموت نفس واحدة ثم يهبط نبي الله عيسى، صلى الله عليه وسلم ، وأصحابه رضي الله عنهم، إلى الأرض، فلا يجدون في الأرض موضع شبر إلا ملأه زهمهم ونتنهم، فيرغب، نبي الله عيسىصلى الله عليه وسلم ، وأصحابه رضي الله عنهم إلى الله تعالى، فيرسل الله تعالى طيراً كأعناق البخت، فتحملهم، فتطرحهم حيث شاء الله، ثم يرسل الله عز وجل مطراً لا يكن منه بيت مدر ولا وبر، فيغسل الأرض حتى يتركها كالزلقة، ثم يقال للأرض‏:‏ أنبتي ثمرتك، وردي بركتك، فيومئذ تأكل العصابة من الرمانة، ويستظلون بقحفها، ويبارك في الرسل حتى إن اللقحة من الإبل لتكفي الفئام من الناس، واللقحة من البقر لتكفي القبيلة من الناس، واللقحة من الغنم لتكفي الفخذ من الناس، فبينما هم كذلك إذ بعث الله تعالى ريحاً طيبة، فتأخذهم تحت آباطهم، فتقبض روح كل مؤمن وكل مسلم؛ ويبقى شرار الناس يتهارجون فيها تهارج الحمر فعليهم تقوم الساعة‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏ قوله: «خلة بين الشام والعراق» : أي طريقا بينهما. وقوله: «عاث» بالعين المهملة والثاء المثلثة، والعيث: أشد الفساد. «والذرى» : بضم الذال المعجمة وهو أعالي الأسنمة وهو جمع ذروة بضم الذال وكسرها « واليعاسيب» : ذكور النحل. «وجزلتين» : أي قطعتين، «والغرض» : الهدف الذي يرمى إليه بالنشاب، أي: يرميه رمية كرمية النشاب إلى الهدف. «والمهرودة» بالدال المهملة والمعجمة، وهي: الثوب المصبوغ. قوله: «لا يدان» : أي لا طاقة. «والنغف» : دود. «وفرسى» : جمع فريس، وهو القتيل. و «الزلقة» : بفتح الزاي واللام وبالقاف، ... وروي: الزلفة بضم الزاي وإسكان اللام وبالفاء وهي المرآة. ... «والعصابة» : الجماعة. «والرسل» بكسر الراء: اللبن. «واللقحة» : اللبون. «والفئام» بكسر الفاء وبعدها همزة ممدودة: الجماعة. ... «والفخذ» من الناس: دون القبيلة.","language":"arabic"},{"text":"One morning the Messenger of Allah (ﷺ) made a mention of Dajjal, and he described him to be insignificant and at the same time described him so significant that we thought he was on the date-palm trees (i.e., nearby). When we went to him (the Prophet (ﷺ)) in the evening, he perceived the sign of fear on our faces. He said, \"What is the matter with you?\u0027\u0027 We said: \"O Messenger of Allah, you talked about Dajjal this morning raising your voice and lowering it until we thought he was hiding in the palm-trees grove: He said: \"Something other than Dajjal make worry about you. If he appears while I am with you, I will defend you against him. But if he appears after I die, then everyone of you is his own defender. Allah is the One Who remains after me to guide every Muslim. Dajjal will be a young man with very curly hair with one eye protruding (with which he cannot see). I compare (his appearance) to that of Al-`Uzza bin Qatan. He who amongst you survives to see him, should recite over him the opening Ayat of Surat Al-Kahf (i.e., Surat 18: Verses 1-8). He will appear on the way between Syria and Iraq and will spread mischief right and left. O slaves of Allah! Remain adhered to the truth.\u0027\u0027 We asked: \"O Messenger of Allah! How long will he stay on the earth?\u0027\u0027 He said, \"For forty days. One day will be like a year, one day like a month, one day like a week and the rest of the days will be like your days.\u0027\u0027 We said: \"O Messenger of Allah! Will one day\u0027s Salat (prayer) suffice for the Salat of that day which will be equal to one year?\u0027\u0027 Thereupon he said, \"No, but you must make an estimate of time and then offer Salat.\u0027\u0027 We said: \"O Messenger of Allah! How quickly will he walk upon the earth?\u0027\u0027 Thereupon he said, \"Like cloud driven by the wind (i.e., very quickly). He will come to the people and call them to his obedience and they will affirm their faith in him and respond to him. He will then give command to the sky and it will send its rain upon the earth and he will then send his command to the earth and it will grow vegetation. Then in the evening their pasturing animals will come to them with their humps very high and their udders full of milk and their flanks stretched. He will then come to another people and invite them, but they will reject him and he will leave them, in barren lands and without any goods and chattels! He would then walk through the waste land and say to it: `Bring forth your treasures\u0027, and the treasures will come out and follow him like swarms of bees. He will then call a person brimming with youth and strike him with the sword and cut him into two pieces and make these pieces lie at a distance, which is generally between the archer and his target. He will then call that young man and he will come forward, laughing, with his face gleaming out of joy; and it will be at this very time that Allah will send `Isa (Jesus), son of Maryam (Mary) who will descend at the white minaret in the eastern side of Damascus, wearing two garments lightly dyed and placing his hands on the wings of two angels. When he will lower his head, there would fall drops of water from his head, and when he will raise it up, drops like pearls would scatter from it. Every disbeliever who will find his (i.e., `Isa\u0027s) smell will die and his smell will reach as far as he will be able to see. He will then search for Dajjal until he will catch hold of him at the gate of Ludd (village near Jerusalem), and will kill him. Then the people, whom Allah will have protected, will come to `Isa son of Maryam, and he will wipe their faces and will inform them of their ranks in Jannah, and it will be under such conditions that Allah will reveal to `Isa these words: `I have brought forth from amongst my slaves such people against whom none will be able to fight, so take these people safely to the mountain.\u0027 And then Allah will send Ya\u0027juj and Ma\u0027juj (Gog and Magog people) and they will sworn down from every slope. The first of them will pass the Lake Tabariyah (near the Dead Sea in Palestine) and drink all its water. And when the last of them will pass, he will say: `There was once water there.\u0027 Prophet `Isa (ﷺ) and his companions will then be so much hard-pressed that the head of an ox will be dearer to them than one hundred dinar, and `Isa along with his companions, will make supplication to Allah, Who will send insects which will attack their (Ya\u0027juj and Ma\u0027juj people) neck until they all will perish like a single person. Prophet, `¦sa and his companions will then come down and they will not find in the earth as much space as a single span which would not be filled with their corpses and their stench. Prophet `Isa and his companions will then again beseech Allah, Who will send birds whose necks will be like those of Bactrian camels, and they will carry them and throw them where Allah will desire. Then Allah will send down rain which will spare no house in the city or in the countryside. It would wash away the earth until it appears like a mirror. Then the earth will be told to bring forth its fruit and restore its blessings; and as a result of this, there will grow such a big pomegranate that a group of people will eat from it and seek shelter under its skin. Milk will be so blessed that the milk of one she-camel will suffice for a large company and the cow will give so much milk, that it will suffice for a whole tribe. The sheep will give so much milk that the whole family will be able to drink out of that, and at that time Allah will send a pleasant wind which will soothe people even under their armpits, and will take the life of every Muslim and true believer, and only the wicked will survive. They will commit adultery in public like asses and the Resurrection Day will be held.\u0027\u0027 [Muslim].","language":"english"},{"text":"Suatu pagi Rasulullah (ﷺ) menyebutkan Dajjal, dan dia menggambarkan dia tidak penting dan pada saat yang sama menggambarkan dia begitu penting sehingga kami pikir dia berada di pohon kurma (yaitu, di dekatnya). Ketika kami mengunjunginya (Nabi (ﷺ)) di malam hari, dia melihat tanda ketakutan di wajah kami. Dia berkata, \"Ada apa denganmu?\" Kami berkata: \"Ya Rasulullah, pagi ini kamu berbicara tentang Dajjal dengan meninggikan suaramu dan mengecilkannya sampai kami mengira dia bersembunyi di rumpun pohon palem: Dia berkata: “Sesuatu selain Dajjal membuatmu khawatir. Jika dia muncul saat aku bersamamu, aku akan membelamu melawannya. Tapi jika dia muncul setelah aku mati, maka setiap orang di antara kamu adalah pembelanya sendiri. saya untuk membimbing setiap Muslim. Dajjal akan menjadi seorang pemuda dengan rambut sangat keriting dengan satu mata menonjol (yang tidak bisa dilihatnya). Saya membandingkan (penampilannya) dengan Al-`Uzza bin Qatan. Dia yang di antara kamu bertahan untuk melihatnya, harus membacakan kepadanya ayat pembukaan Surat Al-Kahfi (yaitu, Surat 18: Ayat 1-8). Dia akan muncul di jalan antara Suriah dan Irak dan akan menyebarkan kerusakan kanan dan kiri. Wahai hamba Allah! Tetap berpegang pada kebenaran.\u0027\u0027 Kami bertanya: \"Ya Rasulullah! Berapa lama dia akan tinggal di bumi?\" Dia berkata, \"Selama empat puluh hari. Suatu hari akan seperti setahun, satu hari seperti sebulan, satu hari seperti seminggu dan sisa hari-hari akan seperti hari-harimu.\u0027\u0027 Kami berkata: \"Ya Rasulullah! untuk shalat hari itu yang sama dengan satu tahun?\u0027\u0027 Kemudian dia berkata, \"Tidak, tetapi Anda harus membuat perkiraan waktu dan kemudian menawarkan Salat.\u0027\u0027 Kami berkata: \"Ya Rasulullah! Seberapa cepat dia akan berjalan di bumi?\u0027\u0027 Kemudian dia berkata, \"Seperti awan yang didorong oleh angin (yaitu, sangat dengan cepat). Dia akan datang kepada orang-orang dan memanggil mereka untuk ketaatannya dan mereka akan menegaskan iman mereka kepadanya dan menanggapinya. Dia kemudian akan memberi perintah ke langit dan itu akan menurunkan hujannya ke bumi dan dia kemudian akan mengirimkan perintahnya ke bumi dan itu akan menumbuhkan tumbuh-tumbuhan. Kemudian di malam hari hewan penggembalaan mereka akan datang kepada mereka dengan punuk yang sangat tinggi dan ambing mereka penuh dengan susu dan panggul mereka meregang. Dia kemudian akan datang kepada orang lain dan mengundang mereka, tetapi mereka akan menolaknya dan dia akan meninggalkan mereka, di tanah tandus dan tanpa barang dan harta benda! Dia kemudian akan berjalan melalui tanah kosong dan berkata kepadanya: \u0027Keluarkan hartamu\u0027, dan harta itu akan keluar dan mengikutinya seperti kawanan lebah. Dia kemudian akan memanggil seseorang yang penuh dengan pemuda dan menyerangnya dengan pedang dan memotongnya menjadi dua bagian dan membuat potongan-potongan ini terletak pada jarak, yang umumnya antara pemanah dan targetnya. Dia kemudian akan memanggil pemuda itu dan dia akan maju ke depan, tertawa, dengan wajahnya bersinar karena kegembiraan; dan pada saat inilah Allah akan mengutus `Isa (Yesus), putra Maryam (Maryam) yang akan turun di menara putih di sisi timur Damaskus, mengenakan dua pakaian yang diwarnai sedikit dan meletakkan tangannya di atas sayap. dari dua malaikat. Ketika dia menundukkan kepalanya, akan ada tetesan air dari kepalanya, dan ketika dia mengangkatnya, tetesan seperti mutiara akan berhamburan darinya. Setiap orang kafir yang akan menemukan baunya (yaitu, `Isa) akan mati dan baunya akan mencapai sejauh yang ia bisa lihat. Dia kemudian akan mencari Dajjal sampai dia menangkapnya di gerbang Ludd (desa dekat Yerusalem), dan akan membunuhnya. Kemudian orang-orang yang Allah lindungi, akan datang kepada Isa putra Maryam, dan dia akan mengusap wajah mereka dan memberitahu mereka tentang barisan mereka di Jannah, dan dalam kondisi seperti itulah Allah akan menurunkan kepada Isa hal-hal ini. kata-kata: \u0027Aku telah melahirkan dari antara budak-budakku orang-orang seperti itu yang tidak dapat dilawan oleh siapa pun, jadi bawalah orang-orang ini dengan selamat ke gunung.\u0027 Dan kemudian Allah akan mengirim Ya\u0027juj dan Ma\u0027juj (orang Ya\u0027juj dan Ma\u0027juj) dan mereka akan bersumpah dari setiap lereng. Yang pertama akan melewati Danau Tabariyah (dekat Laut Mati di Palestina) dan meminum semua airnya. Dan ketika yang terakhir dari mereka akan lewat, dia akan berkata: \u0027Dulu ada air di sana.\u0027 Nabi `Isa (ﷺ) dan para sahabatnya kemudian akan sangat tertekan sehingga kepala seekor lembu lebih mereka cintai daripada seratus dinar, dan `Isa bersama para sahabatnya, akan berdoa kepada Allah, Yang akan mengutus serangga yang akan menyerang leher mereka (orang Ya\u0027juj dan Ma\u0027juj) sampai mereka semua binasa seperti satu orang. Nabi, `¦sa dan para sahabatnya kemudian akan turun dan mereka tidak akan menemukan di bumi sebanyak ruang yang tidak akan diisi dengan mayat dan bau busuk mereka. Nabi `Isa dan para sahabatnya akan kembali memohon kepada Allah, Yang akan mengirimkan burung-burung yang lehernya seperti leher unta Baktria, dan mereka akan membawanya dan membuangnya ke tempat yang dikehendaki Allah. Kemudian Allah akan menurunkan hujan yang tidak akan menyayangkan rumah di kota atau di pedesaan. Itu akan menyapu bumi sampai tampak seperti cermin. Kemudian bumi akan diperintahkan untuk menghasilkan buahnya dan memulihkan berkat-berkatnya; dan akibatnya akan tumbuh buah delima yang begitu besar sehingga sekelompok orang akan memakannya dan mencari perlindungan di bawah kulitnya. Susu akan sangat diberkati sehingga susu seekor unta betina akan cukup untuk satu rombongan besar dan sapi akan memberikan begitu banyak susu, sehingga cukup untuk seluruh suku. Domba-domba itu akan memberikan susu yang begitu banyak sehingga seluruh keluarga dapat meminumnya, dan pada saat itu Allah akan mengirimkan angin yang menyenangkan yang akan menenangkan orang-orang bahkan di bawah ketiak mereka, dan akan mencabut nyawa setiap Muslim dan mukmin sejati. , dan hanya orang jahat yang akan bertahan. Mereka akan berzina di depan umum seperti keledai dan hari kiamat akan diadakan.\u0027\u0027 [Muslim].","language":"bahasa"}],"narrated":[{"text":"An-Nawwas bin Sam`an (May Allah be pleased with him) reported:","language":"english"},{"text":"An-Nawwas bin Sam`an radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"1809","hadith_id":"riyadussalihin","text":[{"text":"وعن ربعي بن حراش قال‏:‏ انطلقت مع أبي مسعود الأنصاري إلى حذيفة بن اليمان رضي الله عنهم فقال له أبو مسعود، حدثني ما سمعت من رسول الله صلى الله عليه وسلم ، في الدجال قال‏:‏ ‏ \"‏إن الدجال يخرج ، وإن معه ماء وناراً ، فأما الذي يراه الناس ماء فنار تحرق، وأما الذي يراه الناس نارأً، فماء بارد عذب، فمن أدركه منكم، فليقع في الذي يراه ناراً، فإنه ماء عذب طيب‏\"‏ فقال أبو مسعود‏:‏ وأنا قد سمعته‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"I accompanied Abu Mas\u0027ud Al-Ansari to Hudaifah bin Al-Yaman (May Allah be pleased with them). Abu Mas\u0027ud said to him: \"Tell us what you heard from the Messenger of Allah (ﷺ) about Dajjal (the Antichrist).\" Hudaifah said: He (ﷺ) said, \"Dajjal will appear, and with him will be water and fire. That which people consider to be water will in fact be a burning fire, and that which people will consider to be fire will in fact be cool and sweet water. He who from amongst you happens to face him, should jump into that which he sees as fire for that will be nice and sweet water.\" Abu Mas\u0027ud said: \"I have also heard this from the Messenger of Allah (ﷺ).\" [Al-Bukhari and Muslim]","language":"english"},{"text":"Saya menemani Abu Mas\u0027ud Al-Ansari ke Hudaifah bin Al-Yaman (Semoga Allah meridhoi mereka). Abu Mas\u0027ud berkata kepadanya: \"Beri tahu kami apa yang kamu dengar dari Rasulullah (ﷺ) tentang Dajjal (Dajjal).\" Hudaifah berkata: Dia (ﷺ) berkata, \"Dajjal akan muncul, dan bersamanya akan ada air dan api. Apa yang manusia anggap air sebenarnya adalah api yang menyala, dan apa yang orang anggap api sebenarnya jadilah air yang sejuk dan manis. Barangsiapa di antara kalian yang kebetulan berhadapan dengannya, hendaklah melompat ke dalam apa yang dilihatnya sebagai api, karena itu akan menjadi air yang baik dan manis.” Abu Mas\u0027ud berkata: \"Saya juga mendengar ini dari Rasulullah (ﷺ).\" [Al-Bukhari dan Muslim]","language":"bahasa"}],"narrated":[{"text":"Rib\u0027i bin Hirash (May Allah be pleased with him) said:","language":"english"},{"text":"Rib\u0027i bin Hirash (semoga Allah meridhoinya) berkata:","language":"bahasa"}]},{"index":"1810","hadith_id":"riyadussalihin","text":[{"text":"وعن عبد الله بن عمرو بن العاص رضي الله عنهما قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏ \"‏يخرج الدجال في أمتى فيمكث أربعين لا أدري يوماً أو أربعين شهراً، أو أربعين عاماً، فيبعث الله تعالى عيسى بن مريم‏.‏ صلى الله عليه وسلم ، فيطلبه فيهلكه، ثم يمكث الناس سبع سنين ليس بين اثنين عداوة، ثم يرسل الله عز وجل،ريحاً باردة من قبل الشام، فلا يبقى على وجه الأرض أحد في قلبه مثقال ذرة من خير أو إيمان إلا قبضته، حتى لو أن أحدكم دخل في كبد جبل، لدخلته عليه حتى تقبضه، فيبقى شرار الناس في خفة الطير، وأحلام السباع لا يعرفون معروفاً ، ولا ينكرون منكراً، فيتمثل لهم الشيطان، فيقول‏:‏ ألا تستجيبون‏؟‏ فيقولون ‏:‏ فما تأمرنا‏؟‏ فيأمرهم بعبادة الأوثان، وهم في ذلك دار رزقهم، حسن عيشهم ، ثم ينفخ في الصور، فلا يسمعه أحد إلا أصغى ليتا ورفع ليتا، وأول من يسمعه رجل يلوط حوض إبله فيصعق ويصعق الناس، ثم يرسل الله -أو قال‏:‏ ينزل الله - مطرا كأنه الطل أو الظل، فتنبت منه أجساد الناس، ثم ينفخ فيه أخرى فإذا هم قيام ينظرون ، ثم يقال‏:‏ يا أيها الناس هلم إلى ربكم ، وقفوهم إنهم مسؤولون ‎، ثم يقال‏:‏ أخرجوا بعث النار فيقال‏:‏ من كم‏؟‏ فيقال‏:‏ من كل ألف تسعمائة وتسعة وتسعين، فذلك يوم يجعل الولدان شيباً، وذلك يوم يكشف عن ساق‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏ «الليت» : صفحة العنق. ومعناه يضع صفحة عنقه ويرفع صفحته الأخرى.","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"Dajjal (the Antichrist) will appear in my Ummah and he will stay in the world for forty. I do not know whether this will be forty days or forty months or forty years. Allah will then send (Prophet) \u0027Isa (Jesus), son of Maryam (Mary). \u0027Isa will pursue him and slaughter him. Then people will survive for seven years (i.e., after the demise of \u0027Isa) in the state that there will be no rancour between two persons. Then Allah will send a cool breeze from the side of Ash-Sham. None will remain upon the face of the earth having the smallest particle of good or Faith in him but he will die, so much so that even if someone amongst you will enter the innermost part of a mountain, this breeze will reach that place also and will cause him to die. Only the wicked people will survive and they will be as fast as birds (i.e., to commit evil) and as ferocious towards one another as wild beasts. They will never appreciate the good, nor condemn evil. Then Shaitan (Satan) will come to them in the garb of a man and will say: \u0027Will you not obey me?\u0027 They will say: \u0027What do you order us to do?\u0027 He will command them to worship idols. They will have abundance of sustenance and will lead comfortable lives. Then the Trumpet will be blown. Every one hearing it, will turn his neck towards it and will raise it. The first one to hear that Trumpet will be a man who will be busy repairing the basin for his camels. He will become unconscious. Allah will send, or will cause to send, rain which will be like dew and there will grow out of it (like wild growth) the bodies of the people. Then the second Trumpet will be blown and they will stand up and begin to look around. Then it will be said: \u0027O people! Go to your Rubb.\u0027 Then there will be a command: \u0027Make them stand there.\u0027 After it they will be called to account. Then it will be said: \u0027Separate from them the share of the Fire.\u0027 It will be asked: \u0027How much?\u0027 It will be said: \u0027Nine hundred and ninety-nine out of every thousand.\u0027 That will be the Day which will make children hoary-headed men because of its terror and that will be the Day when the Shin will be uncovered.\" [Muslim].","language":"english"},{"text":"Hanya orang-orang jahat yang akan bertahan dan mereka akan secepat burung (yaitu, melakukan kejahatan) dan sama ganasnya terhadap satu sama lain seperti binatang buas. Mereka tidak akan pernah menghargai kebaikan, atau mengutuk kejahatan. Kemudian Setan (Setan) akan datang kepada mereka dalam pakaian seorang pria dan akan berkata: \u0027Apakah kamu tidak menaati saya?\u0027 Mereka akan berkata: \u0027Apa yang Anda perintahkan untuk kami lakukan?\u0027 Dia akan memerintahkan mereka untuk menyembah berhala. Mereka akan memiliki rezeki yang berlimpah dan akan menjalani kehidupan yang nyaman. Kemudian Terompet akan ditiup. Setiap orang yang mendengarnya, akan mengarahkan lehernya ke arahnya dan akan mengangkatnya. Yang pertama mendengar bahwa Terompet adalah orang yang akan sibuk memperbaiki baskom unta-untanya. Dia akan menjadi tidak sadar. Allah akan mengirimkan, atau akan mengirimkan, hujan yang seperti embun dan darinya akan tumbuh (seperti tumbuh-tumbuhan liar) tubuh-tubuh manusia. Kemudian terompet kedua akan ditiup dan mereka akan berdiri dan mulai melihat-lihat. Kemudian dikatakan: \u0027Hai manusia! Pergi ke Rubb Anda.\u0027 Kemudian akan ada perintah: \u0027Suruh mereka berdiri di sana.\u0027 Setelah itu mereka akan dipanggil ke rekening. Kemudian dikatakan: \u0027Pisahkan dari mereka bagian Neraka.\u0027 Akan ditanyakan: \u0027Berapa?\u0027 Akan dikatakan: \u0027Sembilan ratus sembilan puluh sembilan dari setiap seribu.\u0027 Itu akan menjadi Hari yang membuat anak-anak menjadi laki-laki bebal karena terornya dan itu akan menjadi Hari dimana Shin akan terungkap.\" Kemudian dikatakan: \u0027Pisahkan dari mereka bagian Neraka.\u0027 Akan ditanyakan: \u0027Berapa?\u0027 Akan dikatakan: \u0027Sembilan ratus sembilan puluh sembilan dari setiap seribu.\u0027 Itu akan menjadi Hari yang membuat anak-anak menjadi laki-laki bebal karena terornya dan itu akan menjadi Hari dimana Shin akan terungkap.\" Kemudian dikatakan: \u0027Pisahkan dari mereka bagian Neraka.\u0027 Akan ditanyakan: \u0027Berapa?\u0027 Akan dikatakan: \u0027Sembilan ratus sembilan puluh sembilan dari setiap seribu.\u0027 Itu akan menjadi Hari yang membuat anak-anak menjadi laki-laki bebal karena terornya dan itu akan menjadi Hari dimana Shin akan terungkap.\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"\u0027Abdullah bin \u0027Amr bin Al-\u0027As (May Allah be pleased with them) said:","language":"english"},{"text":"\u0027Abdullah bin \u0027Amr bin Al-\u0027As (semoga Allah meridhoi mereka) berkata:","language":"bahasa"}]},{"index":"1811","hadith_id":"riyadussalihin","text":[{"text":"-وعن أنس رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏ \"‏ليس من بلد إلى سيطؤه الدجال، إلا مكة والمدينة، وليس نقب من أنقابها إلا عليه الملائكة صافين تحرسهما، فينزل بالسبخة، فترجف المدينة ثلاث رجفات، يخرج الله منها كل كافر ومنافق‏\"‏‏.‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"There will be no land which will not be trampled by Dajjal (the Antichrist) but Makkah and Al-Madinah; and there will be no passage leading to them which will not be guarded by the angels, arranged in rows. Dajjal will appear in a barren place adjacent to Al- Madinah and the city will be shaken three times. Allah will expel from it every disbeliever and hypocrite.\" [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, “Tidak akan ada negeri yang tidak akan diinjak-injak oleh Dajjal (Dajjal) selain Makkah dan Madinah; dan tidak akan ada jalan menuju mereka yang tidak dijaga oleh para malaikat. , disusun berjajar. Dajjal akan muncul di tempat tandus yang berdekatan dengan Madinah dan kota itu akan diguncang tiga kali. Allah akan mengusir darinya setiap orang yang kafir dan munafik.\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Anas bin Malik (May Allah be pleased with him) said:","language":"english"},{"text":"Anas bin Malik r.a. berkata:","language":"bahasa"}]},{"index":"1812","hadith_id":"riyadussalihin","text":[{"text":"وعنه رضي الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏ \"‏يتبع الدجال من يهود أصبهان سبعون ألفا عليهم الطيالسة‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"Dajjal (the Antichrist) will be followed by seventy thousand Jews of Isfahan and will be dressed in robes of green coloured satin.\" [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Dajjal (Dajjal) akan diikuti oleh tujuh puluh ribu orang Yahudi Isfahan dan akan mengenakan jubah satin berwarna hijau.\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Anas (May Allah be pleased with him) said:","language":"english"},{"text":"Anas (semoga Allah meridhoinya) berkata:","language":"bahasa"}]},{"index":"1813","hadith_id":"riyadussalihin","text":[{"text":"وعن أم شريك رضي الله عنها أنها سمعت النبي صلى الله عليه وسلم يقول‏:‏ لينفرن الناس من الدجال في الجبال‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"I heard the Prophet (ﷺ) saying, \"People will run away from Dajjal (the Antichrist) seeking shelter in the mountains.\" [Muslim].","language":"english"},{"text":"Saya mendengar Nabi (ﷺ) berkata, \"Orang-orang akan lari dari Dajjal (Dajjal) mencari perlindungan di pegunungan.\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Umm Sharik (May Allah be pleased with her) reported:","language":"english"},{"text":"Ummu Syarik (Semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"1814","hadith_id":"riyadussalihin","text":[{"text":"وعن عمران بن حصين رضي الله عنهما قال‏:‏ سمعت رسول الله صلى الله عليه وسلم يقول‏:‏ ‏ \"‏ما بين خلق آدم إلى قيام الساعة أمر أكبر من الدجال‏\"‏‏.‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"I heard the Messenger of Allah (ﷺ) saying, \"Between time of the creation of Adam and the Resurrection Day, there is nothing greater than the mischief of Dajjal (the Antichrist).\" [Muslim].","language":"english"},{"text":"Saya mendengar Rasulullah (ﷺ) berkata, \"Antara waktu penciptaan Adam dan Hari Kebangkitan, tidak ada yang lebih besar dari kerusakan Dajjal (Dajjal).\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"\u0027Imran bin Hussain (May Allah be pleased with them) reported:","language":"english"},{"text":"\u0027Imran bin Hussain (semoga Allah meridhoi mereka) melaporkan:","language":"bahasa"}]},{"index":"1815","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي سعيد الخدري رضي الله عنه عن النبي صلى الله عليه وسلم قال‏:‏ “يخرج الدجال فيتوجه قبله رجل من المؤمنين فيتلقاه المسالح‏:‏ مسالح الدجال، فيقولون له‏:‏ إلى أين تعمد‏؟‏ فيقول‏:‏ أعمد إلى هذا الذي خرج فيقولون له أوَ ما تؤمن بربنا‏؟‏ فيقول‏:‏ ما بربنا خفاء‏!‏ فيقولون‏:‏ اقتلوه، فيقول بعضهم لبعض‏:‏ أليس قد نهاكم ربكم أن تقتلوا أحداً دونه، فينطلقون به إلى الدجال، فإذا رآه المؤمن قال‏:‏ يا أيها الناس إن هذا الدجال الذي ذكر رسول الله صلى الله عليه وسلم ؛ فيأمر الدجال به فيشبّح؛ فيقول‏:‏ خذوه وشجوه، فيوسع ظهره وبطنه ضرباً، فيقول‏:‏ أوَ ما تؤمن بي‏؟‏ فيقول‏:‏ أنت المسيح الكذاب‏!‏ فيؤمر به ، فيؤشر بالمنشار من مفرقه حتى يفرق بين رجليه، ثم يمشي الدجال بين القطعتين ، ثم يقول له‏:‏ قم ، فيستوي قائماً، ثم يقول له‏:‏ أتؤمن بي‏؟‏ فيقول‏:‏ ما ازددت فيك إلا بصيرة، ثم يقول‏:‏ يا أيها الناس إنه لا يفعل بعدي بأحد من الناس، فيأخذه الدجال ليذبحه، فيجعل الله ما بين رقبته إلى ترقوته نحاساً، فلا يستطيع إليه سبيلا، فيأخذ بيديه ورجليه فيقذف به، فيحسب الناس أنما قذفه إلى النار، وإنما ألقي في الجنة‏\"‏ فقال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏هذا أعظم الناس شهادة عند رب العالمين‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏ وروى البخاري بعضه بمعناه “المسالح” ‏:‏هم الخفراء والطلائع‏.‏","language":"arabic"},{"text":"I heard the Prophet (ﷺ) saying, \"Dajjal (the Antichrist) will come forth and a person from amongst the believers will go towards him and the armed watchmen of Dajjal will meet him and they will say to him: \u0027Where do you intend to go?\u0027 He will say: \u0027I intend to go to this one who has appeared.\u0027 They will say to him: \u0027Don\u0027t you believe in our lord (meaning Dajjal)?\u0027 He will say: \u0027There (i.e., we know Him to be Allah, Alone, without any partners) is nothing hidden about our Rubb.\u0027 Some of them will say: \u0027Let us kill him\u0027, but some others will say: \u0027Has your lord (Dajjal) not forbidden you to kill anyone without his consent?\u0027 So they will take him to Dajjal. When the believer will see him, he will say: \u0027O people! This is Dajjal about whom the Messenger of Allah (ﷺ) has informed us.\u0027 Dajjal will have him laid on his stomach and have his head. He will be struck on his back and on his stomach. Dajjal will ask him: \u0027Don\u0027t you believe in me?\u0027 He will say: \u0027You are the false Messiah.\u0027 He will then give his order to have him sawn with a saw into two from the parting of his hair up to his legs. After that Dajjal will walk between the two halves and will say to him: \u0027Stand up\u0027, and he will stand on his feet. He will then say to him: \u0027Don\u0027t you believe in me?\u0027 The person will say: \u0027It has added to my insight that you are Dajjal\u0027. He will add: \u0027O people! He will not be able to behave with anyone amongst people in such a manner after me.\u0027 Dajjal will try to kill him. The space between his neck and collarbone will turn into copper and he will find no way to kill him. So he will catch hold of him by his hand and feet and throw him into (what appears to be the fire). The people will think that he has been thrown into the fire whereas he will be thrown into Jannah.\" The Messenger of Allah (ﷺ) added, \"He will be the most eminent amongst the people with regard to martyrdom near the Rubb of the worlds.\" [Muslim]","language":"english"},{"text":"Saya mendengar Nabi (ﷺ) berkata, \"Dajjal (Dajjal) akan muncul dan seseorang dari antara orang-orang beriman akan pergi ke arahnya dan penjaga bersenjata Dajjal akan menemuinya dan mereka akan berkata kepadanya: \u0027Di mana Anda berniat? untuk pergi?\u0027 Dia akan berkata: \u0027Saya berniat untuk pergi ke orang yang telah muncul ini.\u0027 Mereka akan berkata kepadanya: \u0027Apakah kamu tidak percaya pada Tuhan kami (artinya Dajjal)?\u0027 Dia akan berkata: \u0027Di sana (yaitu, kita tahu Dia adalah Allah, Sendiri, tanpa sekutu) tidak ada yang tersembunyi tentang Rubb kita.\u0027 Beberapa dari mereka akan berkata: \u0027Mari kita bunuh dia\u0027, tetapi beberapa yang lain akan berkata: \u0027Apakah Tuhanmu (Dajjal) tidak melarangmu untuk membunuh siapa pun tanpa persetujuannya?\u0027 Maka mereka akan membawanya ke Dajjal. Ketika seorang mukmin melihatnya, dia akan berkata: \u0027Wahai manusia! Ini adalah Dajjal yang telah diberitahukan oleh Rasulullah (ﷺ) kepada kita.\u0027 Dajjal akan meletakkannya tengkurap dan kepalanya. Dia akan dipukul di punggung dan perutnya. Dajjal akan bertanya kepadanya: \u0027Apakah kamu tidak percaya padaku?\u0027 Dia akan berkata: \u0027Engkau adalah Mesias palsu.\u0027 Dia kemudian akan memberi perintah agar dia digergaji dengan gergaji menjadi dua dari belahan rambutnya sampai ke kakinya. Setelah itu Dajjal akan berjalan di antara dua bagian dan akan berkata kepadanya: \u0027Berdiri\u0027, dan dia akan berdiri di atas kakinya. Dia kemudian akan berkata kepadanya: \u0027Apakah kamu tidak percaya padaku?\u0027 Orang itu akan berkata: \u0027Ini telah menambah wawasan saya bahwa Anda adalah Dajjal\u0027. Dia akan menambahkan: \u0027Wahai manusia! Dia tidak akan bisa berperilaku dengan siapa pun di antara orang-orang dengan cara seperti itu setelah saya.\u0027 Dajjal akan mencoba membunuhnya. Ruang antara leher dan tulang selangkanya akan berubah menjadi tembaga dan dia tidak akan menemukan cara untuk membunuhnya. Jadi dia akan menangkapnya dengan tangan dan kakinya dan melemparkannya ke dalam (apa yang tampak seperti api). Orang-orang akan mengira bahwa dia telah dilemparkan ke dalam api sedangkan dia akan dilemparkan ke dalam Jannah.\" Rasulullah (ﷺ) menambahkan, \"Dia akan menjadi yang paling utama di antara orang-orang dalam hal kesyahidan di dekat Sampah dunia. .\" [Muslim]","language":"bahasa"}],"narrated":[{"text":"Abu Sa\u0027id Al-Khudri (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Sa\u0027id Al-Khudri r.a. melaporkan:","language":"bahasa"}]},{"index":"1816","hadith_id":"riyadussalihin","text":[{"text":"وعن المغيرة بن شعبة رضي الله عنه قال‏:‏ ما سأل أحد رسول الله صلى الله عليه وسلم عن الدجال أكثر مما سألته؛ وإنه قال لي‏:‏ ‏\"‏مايضرك‏؟‏ ‏\"‏قلت‏:‏ إنهم يقولون‏:‏ إن معه جبل خبز ونهر ماء‏!‏ قال‏:‏ ‏\"‏هو أهون على الله من ذلك‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"No one asked the Messenger of Allah (ﷺ) more about Dajjal than I asked him. He said to me, \"He will not harm you.\" I said: \"O Messenger of Allah, it is reported that he will have with him a mountain of bread and a river full of water.\" Thereupon he said, \"He (Dajjal) is far too worthless and insignificant near Allah (to let him deceive the believers).\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Tidak ada yang bertanya kepada Rasulullah (ﷺ) lebih banyak tentang Dajjal daripada yang saya tanyakan kepadanya. Dia berkata kepadaku, \"Dia tidak akan menyakitimu.\" Aku berkata: \"Ya Rasulullah, dilaporkan bahwa dia akan memiliki segunung roti dan sungai yang penuh dengan air.\" Kemudian dia berkata, \"Dia (Dajjal) terlalu tidak berharga dan tidak berarti di dekat Allah (untuk membiarkan dia menipu orang-orang beriman).\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Al-Mughirah bin Shu\u0027bah (May Allah be pleased with him) said:","language":"english"},{"text":"Al-Mughirah bin Shu\u0027bah r.a. berkata:","language":"bahasa"}]},{"index":"1817","hadith_id":"riyadussalihin","text":[{"text":"وعن أنس رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏ \"‏ما من نبي إلا وقد أنذر أمته الأعور الكذاب، ألا إنه أعور، وإن ربكم عز وجل ليس بأعور، مكتوب بين عينيه ك ف ر‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"There has not been a Prophet who has not warned his Ummah of that one-eyed liar (Dajjal). Behold, he is blind in one eye and your Rubb (Allah) is not blind. On his forehead are the letters: (K.F.R.) (meaning Kafir- disbeliever).\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, “Tidak ada seorang Nabi yang tidak memperingatkan umatnya tentang pembohong bermata satu itu (Dajjal). Lihatlah, dia buta satu matanya dan Rubb-mu (Allah) tidak buta. Di dahinya ada huruf: (KFR) (artinya Kafir- kafir).\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Anas (May Allah be pleased with him) said:","language":"english"},{"text":"Anas (semoga Allah meridhoinya) berkata:","language":"bahasa"}]},{"index":"1818","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي هريرة رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏ \"‏ألا أحدثكم حديثاً عن الدجال ما حدث به نبي قومه‏!‏ إنه أعور، وإنه يجيء معه بمثال الجنة والنار، فالتي يقول إنها الجنة هي النار‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"Let me tell you something about Dajjal (the Antichrist) which no Prophet had told his people. He is blind (in one eye) and will bring with him something like Jannah and Hell; but what he calls Jannah will be in fact Hell.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Biarkan aku memberitahumu sesuatu tentang Dajjal (Dajjal) yang tidak pernah diceritakan oleh Nabi kepada kaumnya. Dia buta (satu matanya) dan akan membawa sesuatu seperti Jannah dan Neraka; tapi apa dia menyebut Jannah sebenarnya adalah Neraka.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) said:","language":"english"},{"text":"Abu Hurairah r.a. berkata:","language":"bahasa"}]},{"index":"1819","hadith_id":"riyadussalihin","text":[{"text":"وعن ابن عمر رضي الله عنهما أن رسول الله صلى الله عليه وسلم ذكر الدجال بين ظهراني الناس فقال‏:‏ ‏ \"‏ إن الله ليس بأعور، ألا إن المسيح الدجال أعور العين اليمنى، كأن عينه عنبة طافية‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"One day the Messenger of Allah (ﷺ) mentioned Al-Masih Dajjal (the Antichrist) in the presence of the people and said, \"Verily, Allah is not one-eyed but Al-Masih Ad-Dajjal is blind in the right eye which looks like a swollen grape.\" [Al-Bukhari and Muslim]","language":"english"},{"text":"Suatu hari Rasulullah (ﷺ) menyebut Al-Masih Dajjal (Dajjal) di hadapan orang-orang dan berkata, “Sesungguhnya, Allah tidak bermata satu tetapi Al-Masih Ad-Dajjal buta di mata kanannya. terlihat seperti anggur yang bengkak.\" [Al-Bukhari dan Muslim]","language":"bahasa"}],"narrated":[{"text":"\u0027Abdullah bin \u0027Umar (May Allah be pleased with them) said:","language":"english"},{"text":"\u0027Abdullah bin \u0027Umar (semoga Allah meridhoi mereka) berkata:","language":"bahasa"}]},{"index":"1820","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏ \"‏ لا تقوم الساعة حتى يقاتل المسلمون اليهود، حتى يختبيء اليهودي من وراء الحجر والشجر، فيقول الحجر والشجر‏:‏ يا مسلم هذا يهودي خلفى تعالى فاقتله، إلا الغرقد فإنه من شجر اليهود‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah(ﷺ) said, \"The Last Hour will not come until the Muslims fight against the Jews, until a Jew will hide himself behind a stone or a tree, and the stone or the tree will say: \u0027O Muslim, there is a Jew behind me. Come and kill him,\u0027 but Al-Gharqad tree will not say so, for it is the tree of the Jews.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, “Tidak akan datang Hari Kiamat hingga kaum Muslimin memerangi kaum Yahudi, hingga seorang Yahudi bersembunyi di balik batu atau pohon, dan batu atau pohon itu akan berkata: \u0027Wahai Muslim, ada seorang Yahudi di belakangku. Datang dan bunuh dia,\u0027 tetapi pohon Al-Gharqad tidak akan mengatakan demikian, karena itu adalah pohon Yahudi.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) said:","language":"english"},{"text":"Abu Hurairah r.a. berkata:","language":"bahasa"}]},{"index":"1821","hadith_id":"riyadussalihin","text":[{"text":"وعنه رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏ \"‏ والذي نفسي بيده لا تذهب الدنيا حتى يمر الرجل بالقبر، فيتمرغ عليه، ويقول‏:‏ ياليتني مكان صاحب هذا القبر، وليس به الدين، ما به إلا البلاء‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"By Him in Whose Hand my soul is, the world will not come to an end until a man passes by a grave and will lie over it saying, \u0027Would that I were in this grave (i.e., dead)!\u0027 Not he will say so because of religious reasons but because of widespread mischief and severe trials of this world.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Demi Dzat yang jiwaku berada di tangan-Nya, dunia tidak akan berakhir sampai seseorang melewati kuburan dan akan berbaring di atasnya sambil berkata, \u0027Seandainya aku ada di kuburan ini ( yaitu, mati)!\u0027 Bukan karena alasan agama, tetapi karena kerusakan yang meluas dan cobaan berat di dunia ini.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"1822","hadith_id":"riyadussalihin","text":[{"text":"وعنه رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏ لا تقوم الساعة حتى يحسر الفرات عن جبل من ذهب يقتتل عليه، فيقتل من كل مائة تسعة وتسعون، فيقول كل رجل منه‏:‏ لعلي أن أكون أنا أنجو‏\"‏‏.‏ وفي رواية‏:‏ ‏\"‏يوشك أن يحسر الفرات عن كنز من ذهب، فمن حضره فلا يأخذ منه شيئاً‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"The Hour will not come to pass before the River Euphrates dries up to unveil the mountain of gold, for which people will fight. Ninety-nine out of one hundred will die (in the fighting) and every man amongst them will say: \u0027Perhaps I may be the only one to remain alive.\"\u0027 Another narration is: \"The time is near when the River Euphrates will dry up to unveil a treasure of gold. Whosoever may be alive at that time, should not take anything of it.\" [Al-Bukhari and Muslim]","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Hari kiamat tidak akan terjadi sebelum Sungai Efrat mengering untuk menyingkap gunung emas, di mana orang akan berperang. Sembilan puluh sembilan dari seratus akan mati (dalam pertempuran) dan setiap orang di antara mereka akan berkata: \u0027Mungkin hanya aku yang masih hidup.\"\u0027 Narasi lain adalah: \"Waktunya sudah dekat ketika Sungai Efrat akan mengering untuk menyingkap harta emas. Siapapun yang hidup di waktu itu, tidak boleh mengambil apa pun.\" [Al-Bukhari dan Muslim]","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) said:","language":"english"},{"text":"Abu Hurairah r.a. berkata:","language":"bahasa"}]},{"index":"1823","hadith_id":"riyadussalihin","text":[{"text":"وعنه قال‏:‏ سمعت رسول الله صلى الله عليه وسلم يقول‏:‏ ‏ \"‏يتركون المدينة على خير ما كانت، لا يغشاها إلا العوافي -يريد‏:‏ عوافي السباع والطير، وآخر من يحشر راعيان من مزينة يريدان المدينة ينعقان بغنمهما فيجدانها وحوشاً، حتى إذا بلغا ثنية الوداع خراً على وجوههما‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"People will desert Al-Madinah in spite of it being in better condition except for wild beasts and birds. The Last Hour will happen upon two shepherds of the tribe of Muzainah. They will enter Al-Madinah driving their sheep but will find it full of wild beasts and would turn away. When they will arrive at the hill named Thaniyyat-ul-Wada\u0027 they will fall on their faces.\" [Al- Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Orang-orang akan meninggalkan Madinah meskipun kondisinya lebih baik kecuali binatang buas dan burung. Hari Kiamat akan terjadi atas dua penggembala dari suku Muzainah. Mereka akan memasuki Al- Madinah menggiring domba-domba mereka tetapi akan menemukannya penuh dengan binatang buas dan akan berpaling. Ketika mereka akan tiba di bukit bernama Thaniyyat-ul-Wada\u0027 mereka akan tersungkur.” [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) said:","language":"english"},{"text":"Abu Hurairah r.a. berkata:","language":"bahasa"}]},{"index":"1824","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي سعيد الخدري رضي الله عنه أن النبي صلى الله عليه وسلم قال‏:‏ ‏ \"‏يكون خليفة ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏ خلفائكم في آخر الزمان يحثو المال ولا يعده‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Prophet (ﷺ) said, \"From your caliphs there will be one in the Last Days who will distribute wealth without counting it.\" [Muslim].","language":"english"},{"text":"Nabi (ﷺ) berkata, \"Dari khalifah Anda akan ada satu di Hari Akhir yang akan mendistribusikan kekayaan tanpa menghitungnya.\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Sa\u0027id Al-Khudri (May Allah be pleased with him) said:","language":"english"},{"text":"Abu Sa\u0027id Al-Khudri r.a. berkata:","language":"bahasa"}]},{"index":"1825","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي موسى الأشعري رضي الله عنه أن النبي صلى الله عليه وسلم قال‏:‏ ‏ \"‏ليأتين على الناس زمان يطوف الرجل فيه بالصدقة من الذهب، فلا يجد أحداً يأخذها منه، ويرى الرجل الواحد يتبعه أربعون امرأة يلذن به من قلة الرجال وكثرة النساء‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Prophet (ﷺ) said, \"A time will come when a man will go about with alms from his gold and will not find anyone to receive it. One man will be seen being followed by forty women dependant upon him on account of the scarcity of men and excess of women.\" [Muslim].","language":"english"},{"text":"Nabi (ﷺ) berkata, \"Akan tiba waktunya seorang pria akan pergi dengan sedekah dari emasnya dan tidak akan menemukan siapa pun untuk menerimanya. Seorang pria akan terlihat diikuti oleh empat puluh wanita yang bergantung padanya karena kelangkaan. laki-laki dan kelebihan perempuan.” [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Musa Al-Ash\u0027ari (May Allah be pleased with him) said:","language":"english"},{"text":"Abu Musa Al-Asy\u0027ari r.a. berkata:","language":"bahasa"}]},{"index":"1826","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي هريرة رضي الله عنه أن النبي صلى الله عليه وسلم قال‏:‏ ‏ \"‏ اشترى رجل من رجل عقاراً، فوجد الذي اشترى العقار في عقاره جرة فيها ذهب، فقال له الذي اشترى العقار خذ ذهبك‏:‏ إنما اشتريت منك الأرض، ولم أشتر الذهب، وقال الذي له الأرض‏:‏ إنما بعتك الأرض وما فيها، فتحاكما إلى رجل، فقال الذي تحاكما إليه‏:‏ ألكما ولد‏؟‏ قال أحدهما ‏:‏ لي غلام، وقال الآخر‏:‏ لي جارية، قال‏:‏ أنكحا الغلام الجارية وأنفقوا على أنفسهما منه وتصدقا‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Prophet (ﷺ) said, \"A man bought a piece of land from another man, and the buyer found a jar filled with gold in the land. The buyer said to the seller: \u0027Take your gold, as I bought only the land from you and not the gold.\u0027 The owner of the land said: \u0027I sold you the land with everything in it.\u0027 So both of them took their case before a third man who asked: \u0027Have you any children?\u0027 One of them said: \u0027I have a boy.\u0027 The other said, \u0027I have a girl.\u0027 The man said: \u0027Marry the girl to the boy and spend the money on them; and whatever remains give it in charity.\"\u0027 [Al-Bukhari and Muslim].","language":"english"},{"text":"Nabi (ﷺ) berkata, \"Seorang pria membeli sebidang tanah dari pria lain, dan pembeli menemukan sebuah kendi berisi emas di tanah itu. Pembeli berkata kepada penjual: \u0027Ambil emasmu, karena saya hanya membeli tanah itu. dari Anda dan bukan emas.\u0027 Pemilik tanah berkata: \u0027Saya menjual tanah dengan segala isinya.\u0027 Jadi keduanya membawa kasus mereka ke hadapan pria ketiga yang bertanya: \u0027Apakah Anda punya anak?\u0027 Salah satu dari mereka berkata: \u0027Saya punya anak laki-laki.\u0027 Yang lain berkata, \u0027Saya punya anak perempuan.\u0027 Laki-laki itu berkata: \u0027Nikahkan gadis itu dengan lelaki itu dan belanjakan uangnya untuk mereka; dan apa pun yang tersisa berikanlah itu sebagai sedekah.\"\u0027 [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"1827","hadith_id":"riyadussalihin","text":[{"text":"وعنه رضي الله عنه أنه سمع رسول الله صلى الله عليه وسلم يقول‏:‏ ‏ \"‏كانت امرأتان معهما ابناهما، جاء الذئب فذهب بابن إحداهما، فقالت لصاحبتها‏:‏ إنما ذهب بابنك، وقالت الأخرى إنما ذهب بابنك فتحاكما إلى داود صلى الله عليه وسلم فقضى به للكبرى، فخرجتا على سليمان بن داود، صلى الله عليه وسلم فأخبرتاه، فقال‏:‏ ائتوني بالسكين أشقه بينهما‏.‏ فقالت الصغرى‏:‏ لا تفعل رحمك الله، هو ابنها، فقضى به للصغرى‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"There were two women, each had her child with her. A wolf came and took away the child of one of them. One woman said to her companion: \u0027The wolf has taken your son.\u0027 The other said: \u0027It has taken your son.\u0027 So both of them took the dispute to Prophet Dawud (David) (ﷺ) who judged that the boy should be given to the older lady. Then they went to Prophet Sulaiman (Solomon) (ﷺ) son of Dawud and put the case before him. Prophet Sulaiman said: \u0027Give me a knife so that I may cut the child into two and give one half to each of you.\u0027 The younger woman said: \u0027Do not do so; may Allah bless you! He is her child.\u0027 On that Prophet Sulaiman decided the case in favour of the younger woman.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Ada dua wanita, masing-masing membawa anaknya. Seekor serigala datang dan mengambil anak salah satu dari mereka. Seorang wanita berkata kepada temannya: \u0027Serigala telah mengambil anakmu. \u0027 Yang lain berkata: \u0027Dia telah mengambil anakmu.\u0027 Maka keduanya membawa perselisihan tersebut kepada Nabi Dawud (David) (ﷺ) yang memutuskan bahwa anak laki-laki itu harus diberikan kepada wanita yang lebih tua.Kemudian mereka pergi ke Nabi Sulaiman (Solomon) (ﷺ) putra Dawud dan meletakkan kasus itu di hadapannya. . Nabi Sulaiman berkata: \u0027Berikan aku pisau agar aku dapat memotong anak itu menjadi dua dan memberikan satu setengah untuk kalian masing-masing.\u0027 Wanita yang lebih muda berkata: \"Jangan lakukan itu; semoga Allah memberkatimu! Dia adalah anaknya.\" Pada saat itu Nabi Sulaiman memutuskan kasus ini untuk wanita yang lebih muda.” [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) said:","language":"english"},{"text":"Abu Hurairah r.a. berkata:","language":"bahasa"}]},{"index":"1828","hadith_id":"riyadussalihin","text":[{"text":"وعن مرادس الأسلمي رضي الله عنه قال‏:‏ قال للنبي صلى الله عليه وسلم ‏:‏ ‏ \"‏يذهب الصالحون الأول فالأول، وتبقى حثالة كحثالة الشعير أو التمر، لا يباليهم الله باله‏\"‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Prophet (ﷺ) said, \"The pious men will depart one after another, the dregs of people, like the sediment of barley or dates will remain; Allah will not raise them in value and esteem.\" [Al- Bukhari].","language":"english"},{"text":"Nabi (ﷺ) berkata, \"Orang-orang saleh akan pergi satu demi satu, ampas manusia, seperti endapan jelai atau kurma akan tetap ada; Allah tidak akan meninggikan nilai dan kehormatan mereka.\" [Al-Bukhari] .","language":"bahasa"}],"narrated":[{"text":"Mirdas Al-Aslami (May Allah be pleased with him) said:","language":"english"},{"text":"Mirdas Al-Aslami (semoga Allah meridhoinya) berkata:","language":"bahasa"}]},{"index":"1829","hadith_id":"riyadussalihin","text":[{"text":"وعن رفاعة بن رافع الزرقي رضي الله عنه قال‏:‏ جاء جبريل إلى النبي صلى الله عليه وسلم ‏:‏ ‏\"‏إذا أنزل الله تعالى بقوم عذاباً‏‏.‏ وعن رفاعة بن رافع الزُّرَقِيِّ - رضي الله عنه - قال: جاء جبريل إلى النبيّ - صلى الله عليه وسلم - قال: مَا تَعُدُّونَ أهْلَ بَدْرٍ فِيكُمْ؟ قال: «مِنْ أفْضَلِ المُسْلِمِينَ» أوْ كَلِمَةً نَحْوَهَا. قال: وَكَذلِكَ مَنْ شَهِدَ بَدْرًا مِنَ المَلائِكَةِ. (‏رواه البخاري)","language":"arabic"},{"text":"Jibril (Gabriel) came to the Prophet (ﷺ) and asked him: \"How do you estimate among you those who participated in the battle of Badr?\" He replied, \"They were the best of Muslims\" (or he may have said something similar to that). Jibril said: \"The same is the case with the angels who were at Badr.\" [Al- Bukhari].","language":"english"},{"text":"Jibril (Jibril) datang kepada Nabi (ﷺ) dan bertanya kepadanya: \"Bagaimana Anda memperkirakan di antara Anda orang-orang yang berpartisipasi dalam perang Badar?\" Dia menjawab, \"Mereka adalah Muslim terbaik\" (atau dia mungkin mengatakan sesuatu yang mirip dengan itu). Jibril berkata: \"Sama halnya dengan para malaikat yang berada di Badar.\" [Al-Bukhari] .","language":"bahasa"}],"narrated":[{"text":"Rifa\u0027ah bin Rafi\u0027 Az-Zuraqi (May Allah be pleased with him) said:","language":"english"},{"text":"Rifa\u0027ah bin Rafi\u0027 Az-Zuraqi r.a. berkata:","language":"bahasa"}]},{"index":"1830","hadith_id":"riyadussalihin","text":[{"text":"وعن ابن عمر رضي الله عنهما قال : قال رسولُ اللهِ : « إذَا أنْزَلَ اللهُ تَعَالَى بِقَومٍ عَذَاباً ، أصَابَ العَذَابُ مَنْ كَانَ فِيهِمْ ، ثُمَّ بُعِثُوا عَلَى أَعْمَالِهِمْ » . متفق عليه .","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"If Allah afflicts punishment upon a nation, it befalls the whole population indiscriminately and then they will be resurrected and judged according to their deeds.\" [Al- Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Jika Allah menimpakan hukuman atas suatu bangsa, itu menimpa seluruh penduduk tanpa pandang bulu dan kemudian mereka akan dibangkitkan dan dihakimi sesuai dengan perbuatan mereka.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Ibn \u0027Umar (May Allah be pleased with them) said:","language":"english"},{"text":"Ibn \u0027Umar (semoga Allah meridhoi mereka) berkata:","language":"bahasa"}]},{"index":"1831","hadith_id":"riyadussalihin","text":[{"text":"وعن جابر رضي الله عنه قال‏:‏ كان جذع يقوم إليه النبي صلى الله عليه وسلم ، يعني في الخطبة‏.‏ فلما وضع المنبر، سمعنا للجذع مثل صوت العشار حتى نزل النبي، صلى الله عليه وسلم ، فوضع يده عليه فسكن‏\"‏‏.‏ وفي رواية‏:‏ فلما كان يوم الجمعة قعد النبي، صلى الله عليه وسلم على المنبر، فصاحت النخلة التى كان يخطب عندها حتى كادت أن تنشق‏.‏ وفي رواية ‏:‏ فصاحت صياح الصبي، فنزل النبي صلى الله عليه وسلم ، حتى أخذها فضمها إليه، فجعلت تئن أنين الصبي الذي يسكت حتى استقرت ، قال‏:‏ ‏\"‏بكت على ما كانت تسمع من الذكر‏\"‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","language":"arabic"},{"text":"There was a trunk of a date-palm tree upon which the Prophet (ﷺ) used to recline while delivering Khutbah (sermon). When a pulpit was placed in the mosque, we heard the trunk crying out like a pregnant she-camel. the Prophet (ﷺ) came down from the pulpit and put his hand on the trunk and it became quiet. Another narration is: The Prophet (ﷺ) used to stand by a tree or a date-palm on Friday (to give the Khutbah). Then an Ansari woman or man said, \"O Messenger of Allah! Shall we make a pulpit for you?\" He replied, \"If you wish.\" So they made a pulpit for him and when it was Friday, the Prophet (ﷺ) sat on the pulpit [to deliver the Khutbah (sermon)] and the trunk of the date- palm on which he used to recline cried out as if it would split asunder. Another narration is: It cried like a child and the Prophet (ﷺ) descended (from the pulpit) and embraced it while it continued moaning like a child being quietened. The Prophet (ﷺ) said, \"It was crying for (missing) what it used to hear of Dhikr near it.\" [Al-Bukhari].","language":"english"},{"text":"Ada sebatang pohon kurma tempat Nabi (ﷺ) biasa berbaring saat menyampaikan Khutbah (khotbah). Ketika mimbar ditempatkan di masjid, kami mendengar belalai berteriak seperti unta betina hamil. Nabi (ﷺ) turun dari mimbar dan meletakkan tangannya di atas bagasi dan itu menjadi sunyi. Riwayat lainnya adalah: Nabi (ﷺ) biasa berdiri di dekat pohon atau pohon kurma pada hari Jumat (untuk memberikan Khutbah). Kemudian seorang wanita atau pria Ansari berkata, \"Ya Rasulullah! Maukah kami membuatkan mimbar untukmu?\" Dia menjawab, \"Jika Anda mau.\" Maka mereka membuat mimbar untuknya dan ketika hari Jumat, Nabi (ﷺ) duduk di mimbar [untuk menyampaikan Khutbah] dan batang pohon kurma yang biasa ia sandarkan berseru seolah-olah itu akan terbelah. Riwayat lainnya adalah: Ia menangis seperti anak kecil dan Nabi (ﷺ) turun (dari mimbar) dan memeluknya sambil terus merintih seperti anak kecil yang ditenangkan. Nabi (ﷺ) berkata, \"Ia menangis karena (kehilangan) apa yang biasa ia dengar tentang Dzikir di dekatnya.\" [Al-Bukhari] .","language":"bahasa"}],"narrated":[{"text":"Jabir (May Allah be pleased with him) said:","language":"english"},{"text":"Jabir radhiyallahu \u0027anhu berkata:","language":"bahasa"}]},{"index":"1832","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي ثعلبة الخشني جرثوم بن ناشر رضي الله عنه عن رسول الله صلى الله عليه وسلم قال‏:‏ ‏ \"‏إن الله تعالى فرض فرائض فلا تضيعوها، وحد حدوداً فلا تعتدوها، وحرم أشياء فلا تنتهكوها، وسكت عن أشياء رحمة لكم غير نسيان فلا تبحثوا عنها‏\"‏‏.‏ حديث حسن. رواه الدارقطني وغيره.","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"Allah, the Exalted, has laid down certain duties which you should not neglect, and has put certain limits which you should not transgress, and has kept silent about other matters out of mercy for you and not out of forgetfulness, so do not seek to investigate them.\" [Ad-Daraqutni and others]","language":"english"},{"text":"Rasulullah SAW bersabda, “Allah Ta\u0027ala telah menetapkan kewajiban-kewajiban tertentu yang tidak boleh kamu abaikan, dan telah menetapkan batas-batas tertentu yang tidak boleh kamu langgar, dan telah diam tentang hal-hal lain karena rahmat bagimu dan bukan karena lupa, jadi jangan berusaha menyelidikinya.\" [Ad-Daraqutni dan lainnya]","language":"bahasa"}],"narrated":[{"text":"Abu Tha\u0027labah Al-Khushani (May Allah be pleased with him) said:","language":"english"},{"text":"Abu Tha\u0027labah Al-Khushani r.a. berkata:","language":"bahasa"}]},{"index":"1833","hadith_id":"riyadussalihin","text":[{"text":"وعن عبد الله بن أبي أوفى رضي الله عنهما قال‏:‏ غزونا مع رسول الله صلى الله عليه وسلم سبع غزوات نأكل الجراد، وفي رواية‏:‏ نأكل معه الجراد‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"We accompanied the Messenger of Allah (ﷺ) in seven expeditions, and we ate locusts. [Al-Bukhari and Muslim].","language":"english"},{"text":"Kami menemani Rasulullah (ﷺ) dalam tujuh ekspedisi, dan kami makan belalang. [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"\u0027Abdullah bin Abu \u0027Aufa (May Allah be pleased with them) said:","language":"english"},{"text":"\u0027Abdullah bin Abu \u0027Aufa (semoga Allah meridhoi mereka) berkata:","language":"bahasa"}]},{"index":"1834","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي هريرة رضي الله عنه أن النبي صلى الله عليه وسلم قال‏:‏ ‏ \"‏لا يلدغ المؤمن من جحر مرتين‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Prophet (ﷺ) said, \"A believer should not be stung twice from the same hole.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Nabi (ﷺ) berkata, \"Seorang mukmin tidak boleh disengat dua kali dari lubang yang sama.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) said:","language":"english"},{"text":"Abu Hurairah r.a. berkata:","language":"bahasa"}]},{"index":"1835","hadith_id":"riyadussalihin","text":[{"text":"وعنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ، ‏:‏ ‏ \"‏ثلاثة لا يكلمهم الله يوم القيامة ولا ينظر إليهم ولا يزكيهم ولهم عذاب أليم‏:‏ رجل على فضل ماء بالفلاة يمنعه من ابن السبيل، ورجل بايع رجلاً، سلعة، بعد العصر، فحلف بالله لأخذها بكذا وكذا، فصدقه وهو على غير ذلك، ورجل بايع إماماً لا يبايعه إلا لدنيا، فإن أعطاه منها وفى ، وإن لم يعطه منها لم يف‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"There are three (types of) people with whom Allah will neither speak on the Day of Resurrection nor purify them (from sins) and there will be a painful chastisement for them: A person who has spare water in a desert and he refuses to give it to the traveller; a person who sells a commodity to another person after the afternoon prayer and swears by Allah that he has bought it at such and such price, and the buyer pays him accordingly though in reality it was not true; and a person who pledges allegiance to an Imam (leader) just for some worldly benefit, and then if the Imam bestows on him (something out of that) he fulfills his allegiance, and if does not give him, he does not fulfill it.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, “Ada tiga (jenis) orang yang tidak diajak bicara oleh Allah pada hari kiamat dan tidak mensucikan mereka (dari dosa) dan bagi mereka azab yang pedih: menyimpan air di gurun dan dia menolak memberikannya kepada musafir; orang yang menjual barang dagangan kepada orang lain setelah salat Ashar dan bersumpah demi Allah bahwa dia telah membelinya dengan harga ini dan itu, dan pembeli membayarnya sesuai dengan itu. pada kenyataannya itu tidak benar; dan seseorang yang berjanji setia kepada seorang Imam (pemimpin) hanya untuk beberapa keuntungan duniawi, dan kemudian jika Imam memberinya (sesuatu dari itu) dia memenuhi kesetiaannya, dan jika tidak memberinya , dia tidak memenuhinya.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) said:","language":"english"},{"text":"Abu Hurairah r.a. berkata:","language":"bahasa"}]},{"index":"1836","hadith_id":"riyadussalihin","text":[{"text":"وعنه عن النبي صلى الله عليه وسلم قال‏:‏ ‏\"‏ بين النفختين أربعون‏\"‏ قالوا‏:‏ يا أبا هريرة أربعون يوماً‏؟‏ قال‏:‏ أبيت، قالوا‏:‏ أربعون سنة‏؟‏ قال‏:‏ أبيت، قالوا‏:‏ أربعون شهراً‏؟‏ قال‏:‏ أبيت‏\"‏ ويبلى كل شئ من الإنسان إلا عجب ذنبه، فيه يركب الخلق، ثم ينزل الله من السماء ماء، فينبتون كما ينبت البقل‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Prophet (ﷺ) said, \"Between the two Blowing of the Trumpet there will be an interval of forty.\" The people said, \"O Abu Hurairah! Do you mean forty days?\" He said, \"I cannot say anything.\" They said, \"Do you mean forty years?\" He said, \"I cannot say anything.\" They said, \"Do you mean forty months?\" He said, \"I cannot say anything. The Prophet added: \u0027Everything of the human body will perish except the last coccyx bone (end part of the spinal cord), and from that bone Allah will reconstruct the whole body. Then Allah will send down water from the sky and people will grow like green vegetables\u0027.\" [Al- Bukhari and Muslim].","language":"english"},{"text":"Nabi (ﷺ) berkata, \"Di antara dua Peniupan Terompet akan ada interval empat puluh.\" Orang-orang berkata, \"Wahai Abu Hurairah! Apakah maksudmu empat puluh hari?\" Dia berkata, \"Saya tidak bisa mengatakan apa-apa.\" Mereka berkata, \"Apakah maksud Anda empat puluh tahun?\" Dia berkata, \"Saya tidak bisa mengatakan apa-apa.\" Mereka berkata, \"Apakah maksud Anda empat puluh bulan?\" Dia berkata, \"Saya tidak bisa berkata apa-apa. Nabi menambahkan: \u0027Segala sesuatu dari tubuh manusia akan binasa kecuali tulang ekor terakhir (bagian ujung dari sumsum tulang belakang), dan dari tulang itu Allah akan membangun kembali seluruh tubuh. Kemudian Allah akan mengirimkan turunkan air dari langit dan orang-orang akan tumbuh seperti sayuran hijau\u0027.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) said:","language":"english"},{"text":"Abu Hurairah r.a. berkata:","language":"bahasa"}]},{"index":"1837","hadith_id":"riyadussalihin","text":[{"text":"وعنه قال‏:‏ بينما النبي صلى الله عليه وسلم في مجلس يحدث القوم، جاءه أعرابي فقال‏:‏ متى الساعة‏؟‏ فمضى رسول الله صلى الله عليه وسلم ، يحدث، فقال بعض القوم‏:‏ سمع ما قال‏:‏ فكره ما قال، وقال بعضهم‏:‏ بل لم يسمع، حتى إذا قضى حديثه قال‏:‏ ‏\"‏أين السائل عن الساعة‏؟‏ ‏\"‏قال‏:‏ ها أنا يا رسول الله ‏.‏ قال‏:‏ ‏\"‏إذا ضيعت الأمانة ، فانتظر الساعة‏\"‏ قال‏:‏ كيف إضاعتها‏؟‏ قالك ‏\"‏إذا وسد الأمر إلى غير أهله فانتظر الساعة‏\"‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","language":"arabic"},{"text":"Once the Prophet (ﷺ) was speaking to us when, a bedouin came and asked him: \"When will the Last Day be?\" The Messenger of Allah (ﷺ) continued his talk. Some of those present thought that he had heard him but disliked the interruption and the other said that he had not hear him. When the Messenger of Allah (ﷺ) concluded his speech he asked, \"Where is the one who inquired about the Last Day?\" The man replied: \"Here I am.\" The Messenger of Allah (ﷺ) replied, \"When the practice of honouring a trust is lost, expect the Last Day.\" He asked: \"How could it be lost?\" He replied, \"When the government is entrusted to the undeserving people, then wait for the Last Day.\" [Al- Bukhari].","language":"english"},{"text":"Suatu ketika Nabi (ﷺ) berbicara kepada kita ketika, seorang Badui datang dan bertanya kepadanya: \"Kapan Hari Akhir?\" Rasulullah SAW melanjutkan ceramahnya. Beberapa dari mereka yang hadir berpikir bahwa dia telah mendengarnya tetapi tidak menyukai interupsi dan yang lain mengatakan bahwa dia tidak mendengarnya. Ketika Rasulullah (ﷺ) mengakhiri pidatonya, dia bertanya, \"Di mana orang yang bertanya tentang Hari Akhir?\" Pria itu menjawab: \"Ini aku.\" Rasulullah (ﷺ) menjawab, “Jika amalan menghormati amanah hilang, tunggulah Hari Akhir.” Dia bertanya: \"Bagaimana itu bisa hilang?\" Beliau menjawab, “Bila pemerintah dipercayakan kepada orang-orang yang tidak berhak, maka tunggulah Hari Kiamat.” [Al-Bukhari] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"1838","hadith_id":"riyadussalihin","text":[{"text":"وعنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏ \"‏يصلون لكم، فإن أصابوا فلكم، وإن أخطؤوا فلكم وعليهم‏\"‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"Your leaders will lead you in Salat (prayer). If they conduct it properly, you and they will be rewarded; but if they make mistakes you will earn the reward and they will be held responsible (for the mistakes).\" [Al- Bukhari].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Pemimpinmu akan memimpinmu dalam shalat. Jika mereka melakukannya dengan benar, kamu dan mereka akan diberi pahala; tetapi jika mereka melakukan kesalahan, kamu akan mendapatkan pahala dan mereka akan dimintai pertanggungjawaban. (untuk kesalahan).\" [Al-Bukhari] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"1839","hadith_id":"riyadussalihin","text":[{"text":"وعنه رضي الله عنه ‏:‏ ‏{‏كنتم خير أمة أخرجت للناس‏}‏ قال‏:‏ خير الناس للناس يأتون بهم في السلاسل في أعناقهم حتى يدخلوا في الإسلام‏.‏ أخرجه: البخاري.","language":"arabic"},{"text":"\"You are the best of peoples ever raised up for (the benefit of) mankind...\" (3:110): The best for mankind are those who bring them with chains round their necks till they embrace Islam (and thereby save them from the eternal punishment in the Hell-fire, and make them enter Jannah in the Hereafter).\" [Al-Bukhari].","language":"english"},{"text":"\"Kamu adalah umat terbaik yang pernah dibangkitkan untuk (kepentingan) umat manusia ...\" (3:110): Sebaik-baik manusia adalah mereka yang membawa mereka dengan rantai di leher mereka sampai mereka memeluk Islam (dan dengan demikian menyelamatkan mereka). dari siksaan kekal di neraka, dan masukkan mereka ke dalam Jannah di akhirat).” [Al-Bukhari] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) said in the interpretation of the Ayah reported:","language":"english"},{"text":"Abu Hurairah (semoga Allah meridhoinya) mengatakan dalam interpretasi dari Ayah yang dilaporkan:","language":"bahasa"}]},{"index":"1840","hadith_id":"riyadussalihin","text":[{"text":"وعنه عن النبي صلى الله عليه وسلم قال‏:‏ ‏ \"‏عجب الله عز وجل من قوم يدخلون الجنة في السلاسل‏\"‏ ‏(‏‏(‏رواهما البخاري‏)‏‏)‏‏.‏ معناه: يؤسرون ويقيدون ثم يسلمون فيدخلون الجنة.","language":"arabic"},{"text":"the Prophet (ﷺ) said, \"Allah marvels at those people who enter Jannah in chains.\" [Al-Bukhari].","language":"english"},{"text":"Nabi (ﷺ) berkata, \"Allah kagum pada orang-orang yang masuk Jannah dengan rantai.\" [Al-Bukhari] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) said:","language":"english"},{"text":"Abu Hurairah r.a. berkata:","language":"bahasa"}]},{"index":"1841","hadith_id":"riyadussalihin","text":[{"text":"وعنه عن النبي صلى الله عليه وسلم قال‏:‏ ‏ \"‏أحب البلاد إلى الله مساجدها ، وأبغض البلاد إلى الله أسواقها‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"the Prophet (ﷺ) said, \"The dearest parts on the face of the earth near Allah are its mosques, and the most hated parts near Allah are its markets.\" [Muslim].","language":"english"},{"text":"Nabi (ﷺ) bersabda, \"Bagian yang paling dicintai di muka bumi di dekat Allah adalah masjidnya, dan bagian yang paling dibenci di dekat Allah adalah pasarnya.\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) said:","language":"english"},{"text":"Abu Hurairah r.a. berkata:","language":"bahasa"}]},{"index":"1842","hadith_id":"riyadussalihin","text":[{"text":"وعن سلمان الفارسي رضي الله عنه من قوله قال‏:‏ لا تكونن إن استطعت أول من يدخل السوق، ولا آخر من يخرج منها، فإنها معركة الشيطان، وبها ينصب رايته‏.‏ ‏(‏‏(‏رواه مسلم هكذا‏)‏‏)‏‏.‏ ورواه البرقاني في صحيحه عن سلمان قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏ \"‏لا تكن أول من يدخل السوق، ولا آخر من يخرج منها، فيها باض الشيطان وفرخ‏\"‏‏.‏","language":"arabic"},{"text":"The Prophet (ﷺ) said, \"Do not, if you can help, be the first to enter the market and the last to leave it because it is an arena of Satan and the standard of Satan is set there.\" [Muslim]. There are other narrations with some variation in the wordings.","language":"english"},{"text":"Nabi (ﷺ) berkata, \"Jangan, jika Anda dapat membantu, menjadi yang pertama memasuki pasar dan yang terakhir meninggalkannya karena itu adalah arena setan dan standar setan ditetapkan di sana.\" [Muslim] . Ada riwayat lain dengan beberapa variasi dalam susunan kata.","language":"bahasa"}],"narrated":[{"text":"Salman Al-Farisi (May Allah be pleased with him) said:","language":"english"},{"text":"Salman Al-Farisi r.a. berkata:","language":"bahasa"}]},{"index":"1843","hadith_id":"riyadussalihin","text":[{"text":"وعن عاصم الأحول عن عبد الله بن سرجس رضي الله عنه قال‏:‏ قلت لرسول الله صلى الله عليه وسلم ‏:‏ يا رسول الله غفر الله لك، قال‏:‏ ‏ \"‏ولك‏\"‏ قال عاصم‏:‏ فقلت له‏:‏ استغفر لك رضي الله عنه صلى الله عليه وسلم ‏؟‏ قال‏:‏ نعم ولك، ثم تلا هذه الآية‏:‏ ‏{‏واستغفر لذنبك، وللمؤمنين والمؤمنات‏}‏ ‏(‏‏(‏محمد‏:‏19‏)‏‏)‏‏.‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"\u0027Abdullah bin Sarjis (May Allah be pleased with him) said to the Messenger of Allah (ﷺ): \"O Messenger of Allah! May Allah forgive all your sins!\" The Messenger of Allah (ﷺ) said, \"And yours also.\" \u0027Asim reported: I asked \u0027Abdullah: \"Did the Messenger of Allah (ﷺ) seek forgiveness for you?\" He replied: \"Yes, and for you also.\" Then he recited the Verse: \"Seek forgiveness for your sins and for the believing men and the believing women.\" (47:19) [Muslim].","language":"english"},{"text":"\u0027Abdullah bin Sarjis (Semoga Allah senang dengan dia) berkata kepada Rasulullah (ﷺ): \"Ya Rasulullah! Semoga Allah mengampuni semua dosamu!\" Rasulullah (ﷺ) berkata, \"Dan milikmu juga.\" \u0027Asim melaporkan: Saya bertanya kepada \u0027Abdullah: \"Apakah Rasulullah (ﷺ) meminta pengampunan untuk Anda?\" Dia menjawab: \"Ya, dan untukmu juga.\" Kemudian dia membacakan Ayat: \"Mintalah ampunan atas dosa-dosamu dan bagi orang-orang yang beriman laki-laki dan perempuan yang beriman.\" (47:19) [Muslim] .","language":"bahasa"}],"narrated":[{"text":"\u0027Asim Al-Ahwal said:","language":"english"},{"text":"\u0027Asim Al Ahwal berkata:","language":"bahasa"}]},{"index":"1844","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي مسعود الأنصاري رضي الله عنه قال‏:‏ قال النبي صلى الله عليه وسلم ‏:‏ ‏ \"‏إن مما أدرك الناس من كلام النبوة الأولى‏:‏ إذا لم تستحي فاصنع ما شئت‏\"‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Prophet (ﷺ) said, \"One of the admonitions of the previous Prophets which has been conveyed to people is that if you have no modesty, you can do whatever you like.\" [Al- Bukhari].","language":"english"},{"text":"Nabi (ﷺ) berkata, \"Salah satu nasihat dari para Nabi sebelumnya yang telah disampaikan kepada manusia adalah bahwa jika Anda tidak memiliki kerendahan hati, Anda dapat melakukan apa pun yang Anda suka.\" [Al-Bukhari] .","language":"bahasa"}],"narrated":[{"text":"Abu Mas\u0027ud Al-Ansari (May Allah be pleased with him) said:","language":"english"},{"text":"Abu Mas\u0027ud Al-Ansari r.a. berkata:","language":"bahasa"}]},{"index":"1845","hadith_id":"riyadussalihin","text":[{"text":"وعن ابن مسعود رضي الله عنه قال‏:‏ قال النبي صلى الله عليه وسلم ‏:‏ ‏ \"‏أول ما يقضى بين الناس يوم القيامة في الدماء‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Prophet (ﷺ) said, \"The first matter concerning which people will be judged on the Day of Resurrection will be the matter of blood.\" [Al-Bukhari and Muslim]","language":"english"},{"text":"Nabi (ﷺ) berkata, \"Hal pertama yang akan diadili pada hari kiamat adalah masalah darah.\" [Al-Bukhari dan Muslim]","language":"bahasa"}],"narrated":[{"text":"Ibn Mas\u0027ud (May Allah be pleased with him) reported:","language":"english"},{"text":"Ibnu Mas\u0027ud radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"1846","hadith_id":"riyadussalihin","text":[{"text":"وعن عائشة رضي الله عنها قالت‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏ \"‏خلقت الملائكة من نور، وخلق الجان من مارج من نار، وخلق آدم مما وصف لكم‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"Angels were created from light, jinns were created from a smokeless flame of fire, and \u0027Adam was created from that which you have been told (i.e., sounding clay like the clay of pottery).\" [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Malaikat diciptakan dari cahaya, jin diciptakan dari nyala api yang tidak berasap, dan \u0027Adam diciptakan dari apa yang telah diberitahukan kepadamu (yaitu, tanah liat yang terdengar seperti tanah liat tembikar). \" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"\u0027Aishah (May Allah be pleased with her) reported:","language":"english"},{"text":"\u0027Aisyah r.a. melaporkan:","language":"bahasa"}]},{"index":"1847","hadith_id":"riyadussalihin","text":[{"text":"وعنها رضي الله عنها قالت‏:‏ ‏ \"‏كان خلق نبي الله صلى الله عليه وسلم القرآن‏\"‏ ‏(‏‏(‏رواه مسلم في جملة حديث طويل‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The conduct of the Prophet (ﷺ) was entirely according to the Qur\u0027an. [Muslim in a long Hadith].","language":"english"},{"text":"Perilaku Nabi (ﷺ) sepenuhnya sesuai dengan Al-Qur\u0027an. [Muslim dalam hadits panjang] .","language":"bahasa"}],"narrated":[{"text":"\u0027Aishah (May Allah be pleased with her) said:","language":"english"},{"text":"\u0027Aisyah r.a. berkata:","language":"bahasa"}]},{"index":"1848","hadith_id":"riyadussalihin","text":[{"text":"وعنها قالت ‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏من أحب لقاء الله أحب الله لقاءه، ومن كره لقاء الله كره الله لقاءه‏\"‏ فقلت‏:‏ يا رسول الله ، أكراهية الموت‏؟‏ فكلنا نكره الموت‏!‏ قال‏:‏‏\"‏ليس كذلك، ولكن المؤمن إذا بشر برحمة الله ورضوانه وجنته أحب لقاء الله ، فأحب الله لقاءه، وإن الكافر إذا بشر بعذاب الله وسخطه، كره لقاء الله وكره الله لقاءه‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"He who loves to meet Allah, Allah loves to meet him; and he who dislikes to meet Allah, Allah abhors to meet him.\" I (\u0027Aishah) said: \"O Messenger of Allah! So far as the feelings of aversion against death is concerned, we all have this feeling.\" Thereupon he said, \"I do not mean that. What I meant is that when a (true) believer is given the glad tidings of the Mercy of Allah, His Pleasures and His Jannah (at the time of death), he loves to meet Allah, and Allah also loves to meet him. When a disbeliever is given the news of the Torment of Allah and His Wrath (at the time of death), he dislikes to meet Allah and Allah also abhors to meet him.\" [Muslim].","language":"english"},{"text":"Rasulullah SAW bersabda, “Barang siapa yang senang bertemu dengan Allah, maka Allah juga senang bertemu dengannya, dan barang siapa yang tidak senang bertemu dengan Allah, maka Allah benci untuk bertemu dengannya.” Saya (\u0027Aisyah) berkata: \"Ya Rasulullah! Sejauh perasaan penolakan terhadap kematian yang bersangkutan, kita semua memiliki perasaan ini.\" Kemudian dia berkata, “Saya tidak bermaksud demikian. Yang saya maksudkan adalah bahwa ketika seorang mukmin (sejati) diberi kabar gembira tentang rahmat Allah, keridhaan-Nya dan Jannah-Nya (pada saat kematian), dia senang bertemu Allah, dan Allah juga senang bertemu dengannya. Ketika seorang kafir diberi kabar tentang siksaan Allah dan murka-Nya (pada saat kematian), dia tidak suka bertemu Allah dan Allah juga benci bertemu dengannya.” [Muslim] .","language":"bahasa"}],"narrated":[{"text":"\u0027Aishah (May Allah be pleased with her) reported:","language":"english"},{"text":"\u0027Aisyah r.a. melaporkan:","language":"bahasa"}]},{"index":"1849","hadith_id":"riyadussalihin","text":[{"text":"وعن أم المؤمنين صفية بن حيي رضي الله عنها قالت‏:‏ كان النبي صلى الله عليه وسلم معتكفاً، فأتيته أزوره ليلاً، فحدثته ثم قمت لأنقلب، فقام معي ليقلبني، فمر رجلان من الأنصار رضي الله عنهما ، فلما رأيا النبي صلى الله عليه وسلم أسرعا، فقال صلى الله عليه وسلم ‏:‏ على رسلكما إنها صفية بنت حيي فقالا‏:‏ سبحان الله يا رسول الله‏!‏ ‏:‏‏\"‏إن الشيطان يجري من ابن آدم مجرى الدم، وإني خشيت أن يقذف في قلوبكما شراً أو قال‏:‏ شيئاً” ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"I came to visit the Prophet (ﷺ) while he was in the state of I\u0027tikaf [(seclusion) in the mosque during the last ten days of Ramadan]. After having talked to him, I got up to return. The Prophet (ﷺ) also got up with me and accompanied me a part of the way. At that moment two Ansari man passed by. When they saw him they quickened their pace. The Prophet (ﷺ) said to them, \"Do not hurry. She is Safiyyah, daughter of Huyai, my wife.\" They said: \"Subhan Allah (Allah is free from imperfection)! O Messenger of Allah! (You are far away from any suspicion).\" The Messenger of Allah (ﷺ) said, \"Satan circulates in a person like blood (in the blood streams). I apprehended lest Satan should drop some evil thoughts in your minds.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Saya datang untuk mengunjungi Nabi (ﷺ) ketika dia dalam keadaan I\u0027tikaf [(khalwat) di masjid selama sepuluh hari terakhir Ramadhan]. Setelah berbicara dengannya, saya bangkit untuk kembali. Nabi (ﷺ) juga bangun dengan saya dan menemani saya di sebagian jalan. Saat itu dua orang Ansari lewat. Ketika mereka melihatnya, mereka mempercepat langkah mereka. Nabi (ﷺ) berkata kepada mereka, \"Jangan terburu-buru. Dia adalah Safiyyah, putri Huyai, istriku.\" Mereka berkata: \"Subhanallah (Allah bebas dari ketidaksempurnaan)! Ya Rasulullah! (Engkau jauh dari kecurigaan).\" Rasulullah (ﷺ) berkata, \"Setan beredar dalam diri seseorang seperti darah (dalam aliran darah). Saya menangkap agar Setan tidak menjatuhkan beberapa pikiran jahat ke dalam pikiran Anda.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Safiyyah bint Huyai (May Allah be pleased with her), the Mother of the Believers, said:","language":"english"},{"text":"Safiyyah binti Huyai (semoga Allah meridhoinya), ibu orang-orang beriman, berkata:","language":"bahasa"}]},{"index":"1850","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي الفضل العباس بن عبد المطلب رضي الله عنه قال‏:‏ شهدت مع رسول الله صلى الله عليه وسلم يوم حنين فلزمت أنا وأبو سفيان بن الحارث بن عبد المطلب رسول الله صلى الله عليه وسلم فلم نفارقه ورسول الله صلى الله عليه وسلم على بغلة له بيضاء، فلما التقى المسلمون والمشركون ولى المسلمون مدبرين ، فطفق رسول الله صلى الله عليه وسلم ، يركض بغلته قبل الكفار، وأنا آخذ بلجام بغلة رسول الله صلى الله عليه وسلم ،أكفها إرادة أن لا تسرع وأبو سفيان آخذ بركاب رسول الله صلى الله عليه وسلم فقال‏:‏ رسول الله صلى الله عليه وسلم ‏\"‏أي عباس ناد أصحاب السمرة” قال العباس، وكان رجلاً صيتا فقلت بأعلى صوتي‏:‏ أين أصحاب السمرة، فوالله لكأن عطفتهم حين سمعوا صوتى عطفة البقر على أولادها، فقالوا‏:‏ يا لبيك يا لبيك، فاقتتلوا هم والكفار، والدعوة في الأنصار يقولون‏:‏ يا معشر الأنصار، يا معشر الأنصار، ثم قصرت الدعوة على بني الحارث بن الخزرج، فنظر رسول الله صلى الله عليه وسلم وهو على بغلته كالمتطاول عليها إلى قتالهم فقال‏:‏ ‏\"‏هذا حين حمي الوطيس‏\"‏ ثم أخذ رسول الله صلى الله عليه وسلم حصيات، فرمى بهن وجوه الكفار، ثم قال‏:‏ ‏\"‏انهزموا ورب محمد‏\"‏، فذهبت أنظر فإذا القتال على هيئته فيما أرى، فوالله ما هو إلا أن رماهم بحصياته، فما زلت أرى حدهم كيلاً، وأمرهم مدبراً، ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏«الوطيس» التنور، ومعناه: اشتدت الحرب. وقوله: «حدهم» هو بالحاء المهملة: أي بأسهم.","language":"arabic"},{"text":"I was in the company of the Messenger of Allah (ﷺ) on the day of (the battle of) Hunain. Abu Sufyan bin Al-Harith and I did not leave the Messenger of Allah (ﷺ) throughout the battle. The Messenger of Allah (ﷺ) was riding on his white mule. When the Muslims had an encounter with the pagans, Muslims took to their heels. The Messenger of Allah (ﷺ) began to urge his mule towards the disbelievers, holding the bridle of his mule. I was trying to restrain it from going very fast, and Abu Sufyan was holding the stirrup of the mule of the Messenger of Allah (ﷺ). The Messenger of Allah (ﷺ) said, \"O Abbas! Call out the People of As-Samurah [i.e., those people who had made the covenant under the tree (i.e., Bai\u0027ah Ridwan)].\" \u0027Abbas called out at the top of his voice: \"Where are the People of As-Samurah.\" \u0027Abbas said: As soon as they heard my voice, they rushed towards the Prophet (ﷺ) like a cow turning towards her calf. They were shouting: \"Here we are.\" Soon they began to fight the infidels. Then there was a call for Ansar. Those who called out to them shouted: \"O you the people of Ansar! O you the people of Ansar!\" They ended their call at Banu Al-Harith bin Al-Khazraj. The Messenger of Allah (ﷺ) who was riding on his mule looked at their fight with his neck stretched forward and he said, \"This is the time when the fight is raging hot.\" Then the Messenger of Allah (ﷺ) took pebbles and threw them in the face of the disbelievers. He said, \"By the Rubb of Muhammad, the disbelievers will be defeated.\" I continued to watch until I found that their force was subdued and they began to retreat. [Muslim].","language":"english"},{"text":"Saya berada di perusahaan Rasulullah (ﷺ) pada hari (perang) Hunain. Abu Sufyan bin Al-Harits dan aku tidak meninggalkan Rasulullah (ﷺ) selama pertempuran. Rasulullah (ﷺ) sedang mengendarai keledai putihnya. Ketika kaum muslimin bertemu dengan kaum pagan, kaum muslimin mengambil langkah mereka. Rasulullah (ﷺ) mulai mendorong bagalnya ke arah orang-orang kafir, memegang kekang bagalnya. Saya mencoba menahannya agar tidak terlalu cepat, dan Abu Sufyan sedang memegang behel keledai Rasulullah (ﷺ). Rasulullah (ﷺ) berkata, \"Hai Abbas! Panggil orang-orang As-Samurah [yaitu, orang-orang yang telah membuat perjanjian di bawah pohon (yaitu, Bai\u0027ah Ridwan)].\" \u0027Abbas berseru dengan suara kerasnya: \"Di mana orang-orang As-Samurah.\" \u0027 Abbas berkata: Begitu mereka mendengar suaraku, mereka bergegas menuju Nabi (ﷺ) seperti seekor sapi yang berbalik ke arah anaknya. Mereka berteriak: \"Ini dia.\" Segera mereka mulai memerangi orang-orang kafir. Kemudian ada panggilan untuk Ansar. Orang-orang yang memanggil mereka berteriak: \"Hai orang-orang Ansar! Wahai orang-orang Ansar!\" Mereka mengakhiri panggilan mereka di Banu Al-Harits bin Al-Khazraj. Rasulullah (ﷺ) yang menunggangi bagalnya melihat pertarungan mereka dengan leher terjulur ke depan dan dia berkata, \"Ini adalah waktu ketika pertarungan berlangsung sengit.\" Kemudian Rasulullah () mengambil kerikil dan melemparkannya ke wajah orang-orang kafir. Dia berkata, \"Dengan Rubb Muhammad, orang-orang kafir akan dikalahkan.\" Saya terus menonton sampai saya menemukan bahwa kekuatan mereka ditundukkan dan mereka mulai mundur. Begitu mereka mendengar suaraku, mereka bergegas menuju Nabi (ﷺ) seperti seekor sapi yang berbalik ke arah anaknya. Mereka berteriak: \"Ini dia.\" Segera mereka mulai memerangi orang-orang kafir. Kemudian ada panggilan untuk Ansar. Orang-orang yang memanggil mereka berteriak: \"Hai orang-orang Ansar! Wahai orang-orang Ansar!\" Mereka mengakhiri panggilan mereka di Banu Al-Harits bin Al-Khazraj. Rasulullah (ﷺ) yang menunggangi bagalnya melihat pertarungan mereka dengan leher terjulur ke depan dan dia berkata, \"Ini adalah waktu ketika pertarungan berlangsung sengit.\" Kemudian Rasulullah () mengambil kerikil dan melemparkannya ke wajah orang-orang kafir. Dia berkata, \"Dengan Rubb Muhammad, orang-orang kafir akan dikalahkan.\" Saya terus menonton sampai saya menemukan bahwa kekuatan mereka ditundukkan dan mereka mulai mundur. Begitu mereka mendengar suaraku, mereka bergegas menuju Nabi (ﷺ) seperti seekor sapi yang berbalik ke arah anaknya. Mereka berteriak: \"Ini dia.\" Segera mereka mulai memerangi orang-orang kafir. Kemudian ada panggilan untuk Ansar. Orang-orang yang memanggil mereka berteriak: \"Hai orang-orang Ansar! Wahai orang-orang Ansar!\" Mereka mengakhiri panggilan mereka di Banu Al-Harits bin Al-Khazraj. Rasulullah (ﷺ) yang menunggangi bagalnya melihat pertarungan mereka dengan leher terjulur ke depan dan dia berkata, \"Ini adalah waktu ketika pertarungan berlangsung sengit.\" Kemudian Rasulullah () mengambil kerikil dan melemparkannya ke wajah orang-orang kafir. Dia berkata, \"Dengan Rubb Muhammad, orang-orang kafir akan dikalahkan.\" Saya terus menonton sampai saya menemukan bahwa kekuatan mereka ditundukkan dan mereka mulai mundur. mereka bergegas menuju Nabi (ﷺ) seperti seekor sapi yang berbalik ke arah betisnya. Mereka berteriak: \"Ini dia.\" Segera mereka mulai memerangi orang-orang kafir. Kemudian ada panggilan untuk Ansar. Orang-orang yang memanggil mereka berteriak: \"Hai orang-orang Ansar! Wahai orang-orang Ansar!\" Mereka mengakhiri panggilan mereka di Banu Al-Harits bin Al-Khazraj. Rasulullah (ﷺ) yang menunggangi bagalnya melihat pertarungan mereka dengan leher terjulur ke depan dan dia berkata, \"Ini adalah waktu ketika pertarungan berlangsung sengit.\" Kemudian Rasulullah () mengambil kerikil dan melemparkannya ke wajah orang-orang kafir. Dia berkata, \"Dengan Rubb Muhammad, orang-orang kafir akan dikalahkan.\" Saya terus menonton sampai saya menemukan bahwa kekuatan mereka ditundukkan dan mereka mulai mundur. mereka bergegas menuju Nabi (ﷺ) seperti seekor sapi yang berbalik ke arah betisnya. Mereka berteriak: \"Ini dia.\" Segera mereka mulai memerangi orang-orang kafir. Kemudian ada panggilan untuk Ansar. Orang-orang yang memanggil mereka berteriak: \"Hai orang-orang Ansar! Wahai orang-orang Ansar!\" Mereka mengakhiri panggilan mereka di Banu Al-Harits bin Al-Khazraj. Rasulullah (ﷺ) yang menunggangi bagalnya melihat pertarungan mereka dengan leher terjulur ke depan dan dia berkata, \"Ini adalah waktu ketika pertarungan berlangsung sengit.\" Kemudian Rasulullah () mengambil kerikil dan melemparkannya ke wajah orang-orang kafir. Dia berkata, \"Dengan Rubb Muhammad, orang-orang kafir akan dikalahkan.\" Saya terus menonton sampai saya menemukan bahwa kekuatan mereka ditundukkan dan mereka mulai mundur. Segera mereka mulai memerangi orang-orang kafir. Kemudian ada panggilan untuk Ansar. Orang-orang yang memanggil mereka berteriak: \"Hai orang-orang Ansar! Wahai orang-orang Ansar!\" Mereka mengakhiri panggilan mereka di Banu Al-Harits bin Al-Khazraj. Rasulullah (ﷺ) yang menunggangi bagalnya melihat pertarungan mereka dengan leher terjulur ke depan dan dia berkata, \"Ini adalah waktu ketika pertarungan berlangsung sengit.\" Kemudian Rasulullah () mengambil kerikil dan melemparkannya ke wajah orang-orang kafir. Dia berkata, \"Dengan Rubb Muhammad, orang-orang kafir akan dikalahkan.\" Saya terus menonton sampai saya menemukan bahwa kekuatan mereka ditundukkan dan mereka mulai mundur. Segera mereka mulai memerangi orang-orang kafir. Kemudian ada panggilan untuk Ansar. Orang-orang yang memanggil mereka berteriak: \"Hai orang-orang Ansar! Wahai orang-orang Ansar!\" Mereka mengakhiri panggilan mereka di Banu Al-Harits bin Al-Khazraj. Rasulullah (ﷺ) yang menunggangi bagalnya melihat pertarungan mereka dengan leher terjulur ke depan dan dia berkata, \"Ini adalah waktu ketika pertarungan berlangsung sengit.\" Kemudian Rasulullah () mengambil kerikil dan melemparkannya ke wajah orang-orang kafir. Dia berkata, \"Dengan Rubb Muhammad, orang-orang kafir akan dikalahkan.\" Saya terus menonton sampai saya menemukan bahwa kekuatan mereka ditundukkan dan mereka mulai mundur. Mereka mengakhiri panggilan mereka di Banu Al-Harits bin Al-Khazraj. Rasulullah (ﷺ) yang menunggangi bagalnya melihat pertarungan mereka dengan leher terjulur ke depan dan dia berkata, \"Ini adalah waktu ketika pertarungan berlangsung sengit.\" Kemudian Rasulullah () mengambil kerikil dan melemparkannya ke wajah orang-orang kafir. Dia berkata, \"Dengan Rubb Muhammad, orang-orang kafir akan dikalahkan.\" Saya terus menonton sampai saya menemukan bahwa kekuatan mereka ditundukkan dan mereka mulai mundur. Mereka mengakhiri panggilan mereka di Banu Al-Harits bin Al-Khazraj. Rasulullah (ﷺ) yang menunggangi bagalnya melihat pertarungan mereka dengan leher terjulur ke depan dan dia berkata, \"Ini adalah waktu ketika pertarungan berlangsung sengit.\" Kemudian Rasulullah () mengambil kerikil dan melemparkannya ke wajah orang-orang kafir. Dia berkata, \"Dengan Rubb Muhammad, orang-orang kafir akan dikalahkan.\" Saya terus menonton sampai saya menemukan bahwa kekuatan mereka ditundukkan dan mereka mulai mundur. [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Al-\u0027Abbas bin \u0027Abdul-Muttalib (May Allah be pleased with him) said:","language":"english"},{"text":"Al-\u0027Abbas bin \u0027Abdul-Muttalib r.a. berkata:","language":"bahasa"}]},{"index":"1851","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي هريرة رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏ \"‏يا أيها الناس إن الله طيب لا يقبل إلا طيباً، وإن الله أمر المؤمنين بما أمر به المرسلين، فقال تعالى‏:‏ ‏{‏يا أيها الرسل كلوا من الطيباب واعلموا صالحاً‏}‏، وقال تعالى‏:‏ ‏{‏يا أيها الذين آمنوا كلوا من طيبات ما رزقناكم‏}‏ ثم ذكر الرجل يطيل السفر أشعث أغبر يمد يديه إلى السماء ‏:‏ يا رب يارب، ومطعمه حرام، ومشربه حرام، وملبسه حرام، وغذي بالحرام فأنى يستجاب لذلك‏!‏‏؟‏‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"O people! Allah is Pure and, therefore, accepts only that which is pure. Allah has commanded the believers as He has commanded His Messengers by saying: \u0027O Messengers! Eat of the good things, and do good deeds.\u0027 (23:51) And He said: \u0027O you who believe (in the Oneness of Allah - Islamic Monotheism)! Eat of the lawful things that We have provided you...\"\u0027 (2:172). Then he (ﷺ) made a mention of the person who travels for a long period of time, his hair are dishevelled and covered with dust. He lifts his hand towards the sky and thus makes the supplication: \u0027My Rubb! My Rubb!\u0027 But his food is unlawful, his drink is unlawful, his clothes are unlawful and his nourishment is unlawful, how can, then his supplication be accepted?\" [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Hai manusia! Allah itu suci dan karena itu, hanya menerima apa yang suci. Allah telah memerintahkan orang-orang beriman sebagaimana Dia telah memerintahkan para rasul-Nya dengan mengatakan: \u0027Wahai para rasul! Makanlah yang baik-baik. , dan melakukan perbuatan baik.\u0027 (23:51) Dan Dia berfirman: \u0027Hai orang-orang yang beriman (kepada Keesaan Allah - Tauhid Islam)! Makanlah dari apa yang Kami berikan kepadamu yang halal ...\"\u0027 (2:172). Kemudian beliau (ﷺ) menyebutkan tentang orang yang bepergian untuk waktu yang lama, rambutnya acak-acakan dan tertutup debu. Dia mengangkat tangannya ke langit dan dengan demikian membuat permohonan: \u0027Rubb saya! Karet saya!\u0027 Tetapi makanannya haram, minumannya haram, pakaiannya haram, dan makanannya haram, bagaimana mungkin doanya dikabulkan?”","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) said:","language":"english"},{"text":"Abu Hurairah r.a. berkata:","language":"bahasa"}]},{"index":"1852","hadith_id":"riyadussalihin","text":[{"text":"وعنه رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏ثلاثة لا يكلمهم الله يوم القيامة، ولا يزكيهم، ولا ينظر إليهم ، ولهم عذاب أليم‏:‏ شيخ زان، وملك كذاب، وعائل مستكبر‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏ (4)","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"There are three (types of) people whom Allah will neither speak to on the Day of Resurrection nor will He purify them (i.e., from their sins), nor will look upon them; and they will have a painful chastisement. These are: An old man who commits fornication; a king who is a great liar and a poor man who is proud.\" [Muslim]","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Ada tiga (jenis) orang yang tidak akan diajak bicara oleh Allah pada hari kiamat dan tidak akan mensucikan mereka (yaitu, dari dosa-dosa mereka), dan tidak akan memandang mereka; dan mereka akan mendapat azab yang pedih, yaitu: Orang tua pezina, raja pembohong besar, dan orang miskin sombong. [Muslim]","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) said:","language":"english"},{"text":"Abu Hurairah r.a. berkata:","language":"bahasa"}]},{"index":"1853","hadith_id":"riyadussalihin","text":[{"text":"وعنه رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏ \"‏سيحان وجيحان والفرات والنيل كل من أنهار الجنة‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"Saihan (Oxus), Jaihan (Jaxartes), Al-Furat (Euphrates) and An-Nil (Nile) are all from the rivers of Jannah.\" [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Saihan (Oxus), Jaihan (Jaxartes), Al-Furat (Efrat) dan An-Nil (Nil) semuanya dari sungai Jannah.\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) said:","language":"english"},{"text":"Abu Hurairah r.a. berkata:","language":"bahasa"}]},{"index":"1854","hadith_id":"riyadussalihin","text":[{"text":"وعنه قال‏:‏ أخذ رسول الله صلى الله عليه وسلم بيدي فقال‏:‏ ‏ \"‏خلق الله التربة يوم السبت، وخلق فيها الجبال يوم الأحد، وخلق الشجر يوم الأثنين وخلق المكروه يوم الثلاثاء، وخلق النور يوم الأربعاء، وبث فيها الدواب يوم الخميس، وخلق آدم صلى الله عليه وسلم بعد العصر من يوم الجمعة في آخر الخلق في آخر ساعة من النهار فيما بين العصر إلى الليل‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) took hold of my hand and said, \"Allah, the Exalted and Glorious, created the earth on Saturday, the mountains on Sunday, the trees on Monday, the things entailing labour on Tuesday, light on Wednesday, He spread out animals of all kinds on Thursday, and created Adam in the afternoon on Friday, and it was the last hour of Friday between the afternoon and the night.\" [Muslim].","language":"english"},{"text":"Rasulullah () memegang tanganku dan berkata, \"Allah Yang Maha Agung dan Maha Agung menciptakan bumi pada hari Sabtu, gunung-gunung pada hari Minggu, pepohonan pada hari Senin, hal-hal yang memerlukan kerja pada hari Selasa, cahaya pada hari Rabu, Dia menyebarkan hewan dari segala jenis pada hari Kamis, dan menciptakan Adam di sore hari pada hari Jumat, dan itu adalah jam terakhir hari Jumat antara sore dan malam.” [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) said:","language":"english"},{"text":"Abu Hurairah r.a. berkata:","language":"bahasa"}]},{"index":"1855","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي سليمان خالد بن الوليد رضي الله عنه قال‏:‏ “لقد انقطعت في يدي يوم مؤته تسعة أسياف، فما بقي في يدي إلا صفيحة يمانية‏\"‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","language":"arabic"},{"text":"In the battle of Mu\u0027tah, seven swords were broken in my hand, and all that remained with me was a Yemeni sword. [Al- Bukhari].","language":"english"},{"text":"Dalam perang Mu\u0027tah, tujuh pedang patah di tanganku, dan yang tersisa di tanganku hanyalah pedang Yaman. [Al-Bukhari] .","language":"bahasa"}],"narrated":[{"text":"Abu Sulaiman Khalid bin Al-Walid (May Allah be pleased with him) said:","language":"english"},{"text":"Abu Sulaiman Khalid bin Al-Walid r.a. berkata:","language":"bahasa"}]},{"index":"1856","hadith_id":"riyadussalihin","text":[{"text":"وعن عمرو بن العاص رضي الله عنه سمع رسول الله صلى الله عليه وسلم يقول‏:‏ ‏ \"‏إذا حكم الحاكم، فاجتهد، ثم أصاب، فله أجران، وإن حكم واجتهد، فأخطأ، فله أجر‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"I heard the Messenger of Allah (ﷺ) saying, \"When a judge utilizes his skill of judgement and comes to a right decision, he will have a double reward, but when he uses his judgement and commits a mistake, he will have a single reward.\" [Al-Bukhari and Muslim]","language":"english"},{"text":"Saya mendengar Rasulullah (ﷺ) bersabda, “Jika seorang hakim menggunakan keahliannya dalam mengambil keputusan dan mengambil keputusan yang benar, dia akan mendapat dua pahala, tetapi ketika dia menggunakan penilaiannya dan melakukan kesalahan, dia akan mendapat satu pahala. hadiah.\" [Al-Bukhari dan Muslim]","language":"bahasa"}],"narrated":[{"text":"\u0027Amr bin \u0027Al-\u0027As (May Allah be pleased with him) said:","language":"english"},{"text":"\u0027Amr bin \u0027Al-\u0027As (semoga Allah meridhoinya) berkata:","language":"bahasa"}]},{"index":"1857","hadith_id":"riyadussalihin","text":[{"text":"وعن عائشة رضي الله عنها أن النبي صلى الله عليه وسلم قال‏:‏ ‏ \"‏الحمى فيح جهنم فأبردوها بالماء‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Prophet (ﷺ) said, \"Fever comes from the vehement raging of Hell, so cool it with water.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Nabi (ﷺ) berkata, \"Demam berasal dari amukan neraka yang hebat, jadi dinginkan dengan air.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"\u0027Aishah (May Allah be pleased with her) said:","language":"english"},{"text":"\u0027Aisyah r.a. berkata:","language":"bahasa"}]},{"index":"1858","hadith_id":"riyadussalihin","text":[{"text":"وعنها رضي الله عنها عن النبي صلى الله عليه وسلم قال‏:‏ ‏ \"‏من مات وعليه صوم، صام عنه وليه‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Prophet (ﷺ) said, \"If a person dies without observing Saum (fasts), his Wali should make it up on his behalf.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Nabi (ﷺ) berkata, \"Jika seseorang meninggal tanpa menjalankan Saum (puasa), Walinya harus menggantinya atas namanya.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"\u0027Aishah (May Allah be pleased with her) said:","language":"english"},{"text":"\u0027Aisyah r.a. berkata:","language":"bahasa"}]},{"index":"1859","hadith_id":"riyadussalihin","text":[{"text":"وعن عوف بن مالك بن الطفيل أن عائشة رضي الله عنها حدثت أن عبد الله بن الزبير رضي الله عنهما قال في بيع أو عطاء أعطته عائشة رضي الله عنها‏:‏ والله لتنتهين عائشة، أو لأحجرن عليها، قالت أهو قال هذا ‏؟‏ قالو‏:‏ نعم، قالت‏:‏ هو لله علي نذر أن لا أكلم ابن الزبير أبدا، فاستشفع بن الزبير إليها حين طالت الهجرة، فقالت‏:‏ لا والله لا أشفع فيه أبداً، ولا أتحنث إلى نذري فلما طال ذلك على ابن الزبير كلم المسور ابن مخرمة، وعبد الرحمن بن الأسود بن عبد يغوث وقال لهما‏:‏ أنشدكما الله لما أدخلتماني على عائشة رضي الله عنها، فإنها لا يحل لها أن تنذر قطيعتى، فأقبل به المسور، وعبد الرحمن حتى استأذنا على عائشة، فقالا‏:‏ السلام عليك ورحمة الله وبركاته، أندخل‏؟‏ قالت عائشة‏:‏ ادخلوا، قالوا‏:‏ كلنا‏؟‏ قالت‏:‏ نعم ادخلوا كلكم، ولا تعلم أن معهما ابن الزبير، فلما دخلوا ، دخل ابن الزبير الحجاب، فاعتنق عائشة رضي الله عنها، وطفق يناشدها ويبكي، وطفق المسور، وعبد الرحمن يناشدانها إلا كلمته وقبلت منه، ويقولان ‏:‏ إن النبي صلى الله عليه وسلم نها عما قد علمت من الهجرة، ولا يحل لمسلم أن يهجر أخاه فوق ثلاث ليال، فلما أكثروا على عائشة من التذكرة والتحريج، طفقت تذكرهما وتبكي ، وتقول‏:‏ إني نذرت والنذر شديد ، فلم يزالا بها حتى كلمت ابن الزبير، وأعتقت في نذرها ذلك أربعين رقبة، وكانت تذكر نذرها بعد ذلك فتبكي حتى تبل دموعها خمارها‏.‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","language":"arabic"},{"text":"\u0027Aishah (May Allah be pleased with her) as told that \u0027Abdullah bin Az-Zubair (May Allah be pleased with them) had said in respect of selling of a gift which was presented to her: \"By Allah! If \u0027Aishah does not stop this kind of thing, I will declare her incompetent to administer her property.\" \u0027Aishah (May Allah be pleased with her) asked: \"Did He (\u0027Abdullah bin Az-Zubair) say so?\" The people said: \"Yes.\" \u0027Aishah (May Allah be pleased with her) said: \"I vow it before Allah that I will never speak to Ibn Az-Zubair.\" When this desertion lasted long, \u0027Abdullah bin Az-Zubair sought intercession with her, but she said: \"By Allah I will not accept the intercession of anyone for him, and I will not commit a sin of breaking my vow.\" When this state of affairs was prolonged, Ibn Az-Zubair felt it hard on him. He said to Al-Miswar bin Makhramah and \u0027Abdur-Rahman bin Al-Aswad bin Yaghut: \"I beseech you in the Name of Allah that you should take me to \u0027Aishah because it is unlawful for her to vow to sever relations with me.\" So Al-Miswar and \u0027Abdur-Rahman took him with them. They sought her permission, saying: \"As-salamu \u0027alaika wa rahmatullahi wa barakatuhu! Shall we come in?\" \u0027Aishah (May Allah be pleased with her) said: \"Come in,\" They asked: \"All of us?\" She said: \"All of you,\" not knowing that Ibn Az-Zubair was also with them. So, when they entered, Ibn Az-Zubair entered the screened place and got hold of \u0027Aishah (May Allah be pleased with her), his aunt. He was requesting her to forgive him and wept. Al-Miswar and \u0027Abdur-Rahman also pleaded on his behalf and requested her to speak to him and to accept his repentance. They said to her: \"The Prophet (ﷺ) forbade to cut off relationship because it is unlawful for any Muslim not to talk to his (Muslim) brother (or sister, for that matter) for more than three (days).\" So when they persisted in urging and reminding her of the superiority of having good relation with kith and kin, she began to weep, saying: \"I have made a vow which is a matter of very serious nature.\" They persisted in their appeal till she spoke with \u0027Abdullah bin Az-Zubair, and she freed forty slaves as an expiation for breaking her vow. Later on, whenever she remembered her vow, she would weep so much that her veil would become wet with tears. [Al- Bukhari].","language":"english"},{"text":"\u0027Aisyah radhiyallahu \u0027anhu meriwayatkan bahwa \u0027Abdullah bin Az-Zubair r.a. berkata tentang penjualan hadiah yang diberikan kepadanya: \"Demi Allah! Jika \u0027Aisyah tidak tidak menghentikan hal semacam ini, saya akan menyatakan dia tidak kompeten untuk mengelola propertinya.\" \u0027Aisyah (ra dengan dia) bertanya: \"Apakah Dia (\u0027Abdullah bin Az-Zubair) mengatakan demikian?\" Orang-orang berkata: \"Ya.\" \u0027Aisyah r.a. berkata: \"Saya bersumpah di hadapan Allah bahwa saya tidak akan pernah berbicara dengan Ibn Az-Zubair.\" Ketika desersi ini berlangsung lama, \u0027Abdullah bin Az-Zubair meminta syafaat dengannya, tetapi dia berkata: \"Demi Allah, saya tidak akan menerima syafaat siapa pun untuknya, dan saya tidak akan melakukan dosa melanggar sumpah saya.\" Ketika keadaan ini berkepanjangan, Ibnu Az-Zubair merasa sulit baginya. Dia berkata kepada Al-Miswar bin Makhramah dan \u0027Abdur-Rahman bin Al-Aswad bin Yaghut: \"Saya mohon dengan nama Allah bahwa Anda harus membawa saya ke \u0027Aisyah karena haram baginya untuk bersumpah untuk memutuskan hubungan dengan saya. .\" Jadi Al-Miswar dan \u0027Abdur-Rahman membawanya bersama mereka. Mereka meminta izinnya, dengan mengatakan: \"As-salamu \u0027alaika wa rahmatullahi wa barakatuhu! Haruskah kita masuk?\" \u0027Aisyah (semoga Allah meridhoinya) berkata: \"Masuklah,\" Mereka bertanya: \"Kita semua?\" Dia berkata: \"Kalian semua,\" tidak mengetahui bahwa Ibn Az-Zubair juga bersama mereka. Jadi, ketika mereka masuk, Ibn Az-Zubair memasuki tempat yang disaring dan menangkap \u0027Aishah (ra dengan dia), bibinya. Dia memintanya untuk memaafkannya dan menangis. Al-Miswar dan \u0027Abdur-Rahman juga memohon atas namanya dan memintanya untuk berbicara dengannya dan menerima pertobatannya. Mereka berkata kepadanya: \"Nabi (ﷺ) melarang untuk memutuskan hubungan karena haram bagi setiap Muslim untuk tidak berbicara dengan saudara (atau saudara perempuannya) (dalam hal ini) lebih dari tiga (hari).\" Jadi ketika mereka terus mendesak dan mengingatkannya tentang keunggulan memiliki hubungan baik dengan sanak saudara, dia mulai menangis, mengatakan: \"Saya telah membuat sumpah yang merupakan masalah yang sangat serius.\" Mereka bertahan dalam permohonan mereka sampai dia berbicara dengan \u0027Abdullah bin Az-Zubair, dan dia membebaskan empat puluh budak sebagai penebusan karena melanggar sumpahnya. Kemudian, setiap kali dia mengingat sumpahnya, dia akan menangis begitu banyak hingga kerudungnya basah oleh air mata. Abdur-Rahman juga memohon atas namanya dan memintanya untuk berbicara dengannya dan menerima pertobatannya. Mereka berkata kepadanya: \"Nabi (ﷺ) melarang untuk memutuskan hubungan karena haram bagi setiap Muslim untuk tidak berbicara dengan saudara (atau saudara perempuannya) (dalam hal ini) lebih dari tiga (hari).\" Jadi ketika mereka terus mendesak dan mengingatkannya tentang keunggulan memiliki hubungan baik dengan sanak saudara, dia mulai menangis, mengatakan: \"Saya telah membuat sumpah yang merupakan masalah yang sangat serius.\" Mereka bertahan dalam permohonan mereka sampai dia berbicara dengan \u0027Abdullah bin Az-Zubair, dan dia membebaskan empat puluh budak sebagai penebusan karena melanggar sumpahnya. Kemudian, setiap kali dia mengingat sumpahnya, dia akan menangis begitu banyak hingga kerudungnya basah oleh air mata. Abdur-Rahman juga memohon atas namanya dan memintanya untuk berbicara dengannya dan menerima pertobatannya. Mereka berkata kepadanya: \"Nabi (ﷺ) melarang untuk memutuskan hubungan karena haram bagi setiap Muslim untuk tidak berbicara dengan saudara (atau saudara perempuannya) (dalam hal ini) lebih dari tiga (hari).\" Jadi ketika mereka terus mendesak dan mengingatkannya tentang keunggulan memiliki hubungan baik dengan sanak saudara, dia mulai menangis, mengatakan: \"Saya telah membuat sumpah yang merupakan masalah yang sangat serius.\" Mereka bertahan dalam permohonan mereka sampai dia berbicara dengan \u0027Abdullah bin Az-Zubair, dan dia membebaskan empat puluh budak sebagai penebusan karena melanggar sumpahnya. Kemudian, setiap kali dia mengingat sumpahnya, dia akan menangis begitu banyak hingga kerudungnya basah oleh air mata. Jadi ketika mereka terus mendesak dan mengingatkannya tentang keunggulan memiliki hubungan baik dengan sanak saudara, dia mulai menangis, mengatakan: \"Saya telah membuat sumpah yang merupakan masalah yang sangat serius.\" Mereka bertahan dalam permohonan mereka sampai dia berbicara dengan \u0027Abdullah bin Az-Zubair, dan dia membebaskan empat puluh budak sebagai penebusan karena melanggar sumpahnya. Kemudian, setiap kali dia mengingat sumpahnya, dia akan menangis begitu banyak hingga kerudungnya basah oleh air mata. Jadi ketika mereka terus mendesak dan mengingatkannya tentang keunggulan memiliki hubungan baik dengan sanak saudara, dia mulai menangis, mengatakan: \"Saya telah membuat sumpah yang merupakan masalah yang sangat serius.\" Mereka bertahan dalam permohonan mereka sampai dia berbicara dengan \u0027Abdullah bin Az-Zubair, dan dia membebaskan empat puluh budak sebagai penebusan karena melanggar sumpahnya. Kemudian, setiap kali dia mengingat sumpahnya, dia akan menangis begitu banyak hingga kerudungnya basah oleh air mata. [Al-Bukhari] .","language":"bahasa"}],"narrated":[{"text":"\u0027Auf bin Malik (May Allah be pleased with him) said:","language":"english"},{"text":"Auf bin Malik r.a. berkata:","language":"bahasa"}]},{"index":"1860","hadith_id":"riyadussalihin","text":[{"text":"وعن عقبة بن عامر رضي الله عنه أن رسول الله صلى الله عليه وسلم خرج إلى قتلى أحد، فصلى عليهم بعد ثمان سنين كالمودع للأحياء والأموات، ثم طلع إلى المنبر ، فقال‏:‏ إني بين أيديكم فرط وأنا شهيد عليكم، وإن موعدكم الحوض ، وإني لأنظر إليه من مقامي هذا، وإني لست أخشى عليكم أن تشركوا، ولكن أخشى عليكم الدنيا أن تنافسوها‏\"‏ قال‏:‏ فكانت آخر نظرة نظرتها إلى رسول الله صلى الله عليه وسلم ‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏ وفي رواية ‏:‏ ‏\"‏ولكني أخشى عليكم الدنيا أن تنافسوا فيها ، وتقتتلوا فتهلكوا كملا هلك من كان قبلكم‏\"‏ قال عقبة‏:‏ فكان آخر ما رأيت رسول الله صلى الله عليه وسلم على المنبر‏. وفي رواية قال: «إني فرط لكم وأنا شهيد عليكم وإني والله لأنظر إلى حوضي الآن، وإني أعطيت مفاتيح خزائن الأرض، أو مفاتيح الأرض، وإني والله ما أخاف عليكم أن تشركوا بعدي، ولكن أخاف عليكم أن تنافسوا فيها» . والمراد بالصلاة على قتلى أحد: الدعاء لهم، لا الصلاة المعروفة.‏","language":"arabic"},{"text":"One day the Messenger of Allah (ﷺ) went out and asked Allah\u0027s forgiveness for the martyrs of the battle of Uhud after eight years. It seemed that by so doing, he bid farewell to the living and the dead. He then came back, rose to the pulpit and said, \"I shall be your precursor; I am a witness for you (before Allah), and I will be present before you at the River (Haud Al-Kauthar). By Allah I can see with my own eyes the Haud from this place. I am not afraid that you will associate anything with Allah in worship after (my demise), but I apprehend that you will vie with one another for the life of the world.\" The narrator said: It was the last time that I saw the Messenger of Allah (ﷺ). [Al-Bukhari and Muslim]. There are some more narrations with very minor changes in its wording.","language":"english"},{"text":"Suatu hari Rasulullah (ﷺ) pergi keluar dan meminta pengampunan Allah untuk para syuhada perang Uhud setelah delapan tahun. Tampaknya dengan melakukan itu, dia mengucapkan selamat tinggal kepada yang hidup dan yang mati. Dia kemudian kembali, naik ke mimbar dan berkata, \"Aku akan menjadi pendahulumu; aku menjadi saksi untukmu (di hadapan Allah), dan aku akan hadir di hadapanmu di sungai (Haud Al-Kautsar). Demi Allah aku dapat melihat dengan mata kepala sendiri Haud dari tempat ini. Saya tidak takut bahwa Anda akan mempersekutukan apapun dengan Allah dalam ibadah setelah (kematian saya), tetapi saya tahu bahwa Anda akan bersaing satu sama lain untuk kehidupan dunia. Narator berkata: Itu adalah terakhir kalinya aku melihat Rasulullah (ﷺ). [Al-Bukhari dan Muslim] . Ada beberapa riwayat lagi dengan perubahan yang sangat kecil dalam kata-katanya.","language":"bahasa"}],"narrated":[{"text":"\u0027Uqbah bin \u0027Amir (May Allah be pleased with him) said:","language":"english"},{"text":"\u0027Uqbah bin \u0027Amir (semoga Allah meridhoinya) berkata:","language":"bahasa"}]},{"index":"1861","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي زيد عمرو بن أخطب الأنصاري رضي الله عنه قال‏:‏ صلى بنا رسول الله صلى الله عليه وسلم الفجر، وصعد المنبر، فخطبنا حتى حضرت الظهر، فنزل فصلى، ثم صعد المنبر حتى حضرت العصر، ثم نزل فصلى، ثم صعد المنبر حتى غربت الشمس، فأخبرنا ما كان هو كائن، فأعلمنا أحفظنا‏.‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) led us in the morning (Fajr) prayer and he ascended the pulpit and addressed us until it was the time for the Zuhr prayer. He then came down the pulpit and led us in Salat (prayer). Again he ascended the pulpit and addressed until it was the time for the \u0027Asr prayer. He then again came down, led us in Salat and again ascended the pulpit and addressed us until sunset. He informed us of everything that lay hidden in the past and what will happen in the future; and the most learned amongst us is the one who has preserved it in his memory. [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) memimpin kami dalam shalat subuh (Fajr) dan dia naik ke mimbar dan berbicara kepada kami sampai tiba waktu shalat Zuhur. Dia kemudian turun dari mimbar dan memimpin kami dalam shalat. Sekali lagi dia naik ke mimbar dan berpidato sampai tiba waktu salat Ashar. Dia kemudian turun lagi, memimpin kami dalam shalat dan kembali naik mimbar dan berbicara kepada kami sampai matahari terbenam. Dia memberi tahu kami tentang segala sesuatu yang tersembunyi di masa lalu dan apa yang akan terjadi di masa depan; dan yang paling terpelajar di antara kita adalah orang yang menyimpannya dalam ingatannya. [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Zaid \u0027Amr bin Akhtab Al-Ansari (May Allah be pleased with him) said:","language":"english"},{"text":"Abu Zaid \u0027Amr bin Akhtab Al-Ansari r.a. berkata:","language":"bahasa"}]},{"index":"1862","hadith_id":"riyadussalihin","text":[{"text":"وعن عائشة رضي الله عنها قالت‏:‏ قال النبي صلى الله عليه وسلم ‏:‏ من نذر أن يطيع الله فليطعه ومن نذر أن يعصي الله فلا يعصه‏\"‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Prophet (ﷺ) said, \"He who vows to obey Allah, should obey Him. But he who vows to disobey Allah, should not disobey Him.\" [Al- Bukhari].","language":"english"},{"text":"Nabi (ﷺ) berkata, \"Barangsiapa yang bersumpah untuk menaati Allah, harus menaati-Nya. Tetapi siapa yang bersumpah untuk tidak menaati Allah, tidak boleh melanggar-Nya.\" [Al-Bukhari] .","language":"bahasa"}],"narrated":[{"text":"\u0027Aishah (May Allah be pleased with her) said:","language":"english"},{"text":"\u0027Aisyah r.a. berkata:","language":"bahasa"}]},{"index":"1863","hadith_id":"riyadussalihin","text":[{"text":"-وعن أم شريك رضي الله عنها أن رسول الله صلى الله عليه وسلم أمرها بقتل الأوزاغ وقال‏:‏ “كان ينفخ على إبراهيم‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) ordered me to kill chameleon. He also said, \"It blew (fire) on Prophet Ibrahim. [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) memerintahkan saya untuk membunuh bunglon. Dia juga berkata, “Itu meniup (api) pada Nabi Ibrahim [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Umm Sharik (May Allah be pleased with her) said:","language":"english"},{"text":"Ummu Syarik (Semoga Allah meridhoinya) berkata:","language":"bahasa"}]},{"index":"1864","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي هريرة رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ “من قتل وزغة في أول ضربة فله كذا وكذا حسنة،ومن قتلها في الضربة الثانية، فله كذا وكذا حسنة، ودون الأول وإن قتلها في الضربة الثالثة، فله كذا وكذا حسنة” ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏ وفي رواية‏:‏ ‏ \"‏من قتل وزغاً في أول ضربة، كتب له مائة حسنة، وفى الثانية دون ذلك، وفى الثالثة دون ذلك‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏ قال أهل اللغة: «الوزغ» العظام من سام أبرص.","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"He who kills a chameleon at the first blow, such and such number of good deeds will be awarded to him; whoever kills it at the second blow, such and such number of merits will be recorded for him. And if he kills it at the third blow, he will get such and such merits.\" Another narration is: The Messenger of Allah (ﷺ) said, \"If anyone kills a chameleon with the first blow, a hundred good deeds will be recorded for him; less than that will be recorded for him if he kills it at the second blow, and still less rewards will be recorded for him if he kills it at the third blow.\" [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, “Barang siapa yang membunuh bunglon pada pukulan pertama, akan diberikan kebaikan sebanyak ini dan itu; siapa pun yang membunuhnya pada pukulan kedua, akan dicatat pahalanya sekian dan sekian. untuknya. Dan jika dia membunuhnya pada pukulan ketiga, dia akan mendapatkan pahala ini dan itu.\" Riwayat lain adalah: Rasulullah (ﷺ) berkata, \"Barang siapa membunuh seekor bunglon dengan pukulan pertama, seratus kebaikan akan dicatat baginya; kurang dari itu akan dicatat baginya jika dia membunuhnya pada pukulan kedua. , dan masih lebih sedikit hadiah yang akan dicatat untuknya jika dia membunuhnya pada pukulan ketiga.\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) said:","language":"english"},{"text":"Abu Hurairah r.a. berkata:","language":"bahasa"}]},{"index":"1865","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏ \"‏ قال رجل لأتصدقن بصدقة، فخرج بصدقته، فوضعها في يد سارق، فأصبحوا يتحدثون‏:‏ تصدق على سارق‏!‏ فقال‏:‏ اللهم لك الحمد لأتصدقن بصدقة، فخرج بصدقته، فوضعها في يد زانية‏؟‏‏!‏ فأصبحوا يتحدثون‏:‏ تصدق على زانية فقال‏:‏ اللهم لك الحمد على زانية، لأتصدقن بصدقة، فخرج بصدقته، فوضعها في يد غني‏‏ فأصبحوا يتحدثون‏!‏ تصدق الليلة على غني‏‏ فقال‏:‏ اللهم لك الحمد على سارق ، وعلى زانية، وعلى غني‏!‏ فأتى فقيل له‏:‏ أما صدقتك على سارق، فلعله أن يستعف عن سرقته، وأما الزانية فلعلها تستعف عن زناها، وأما الغني فلعله أن يعتبر، فينفق مما آتاه الله‏\"‏ ‏(‏‏(‏رواه البخاري بلفظه، ومسلم بمعناه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said: \"A man (from amongst the people before you) said: \u0027Indeed! I will give in charity.\u0027 So he took his Sadaqah out and placed it in a thief\u0027s hand. In the morning the people were talking (about this incident) and saying: \u0027Sadaqah was given to a thief last night.\u0027 The man said: \u0027O Allah! Praise be to You. I have given Sadaqah to a thief. Indeed, I will give in charity!\u0027 So he took his Sadaqah out and he placed it in a prostitute\u0027s hand. In the morning the people were talking (about this incident) and saying: \u0027Sadaqah was given to a prostitute last night.\u0027 On hearing this, the man said: \u0027Praise be to You, O Allah! I gave Sadaqah to a prostitute. Indeed, I will give in charity!\u0027 So he took his Sadaqah out and placed it in a rich man\u0027s hand. In the morning the people were talking (about this incident) and saying: \u0027Sadaqah was given to a rich man last night.\u0027 The man said: \u0027O Allah! Praise be to You (for helping me) give charity to a thief, a prostitute and a rich man.\u0027 Then he had a dream in which he was told that his Sadaqah to the thief might result in his refraining from his theft, his Sadaqah to the prostitute might help her abstain from her immorality, and his Sadaqah to the rich man might help him pay heed and spend from what Allah had bestowed upon him.\" [Al- Bukhari].","language":"english"},{"text":"Rasulullah (ﷺ) berkata: \"Seorang pria (dari antara orang-orang sebelum kamu) berkata: \u0027Sungguh! Aku akan bersedekah.\u0027 Jadi dia mengeluarkan shadaqahnya dan meletakkannya di tangan pencuri. Di pagi hari orang-orang membicarakan (tentang kejadian ini) dan berkata: \u0027Sedekah diberikan kepada seorang pencuri tadi malam.\u0027 Laki-laki itu berkata: \"Ya Allah! Segala puji bagi-Mu. Aku telah memberikan sedekah kepada seorang pencuri. Sungguh, aku akan bersedekah!\" Jadi dia mengeluarkan shadaqahnya dan meletakkannya di tangan seorang pelacur. Di pagi hari orang-orang membicarakan (tentang kejadian ini) dan berkata: \u0027Sedekah diberikan kepada seorang pelacur tadi malam.\u0027 Mendengar ini, pria itu berkata: \"Segala puji bagi-Mu, ya Allah! Aku telah memberikan sedekah kepada seorang pelacur. Sungguh, aku akan bersedekah!\" Maka dia mengeluarkan shadaqahnya dan meletakkannya di tangan orang kaya. Di pagi hari orang-orang membicarakan (tentang kejadian ini) dan berkata: \u0027Sedekah diberikan kepada orang kaya tadi malam.\u0027 Orang itu berkata: \u0027Ya Allah! Segala puji bagi-Mu (karena membantuku) bersedekah kepada pencuri, pelacur, dan orang kaya.\u0027 Kemudian dia bermimpi di mana dia diberitahu bahwa sedekahnya kepada pencuri mungkin membuatnya menahan diri dari pencuriannya, sedekahnya kepada pelacur mungkin membantunya menjauhkan diri dari kemaksiatannya, dan sedekahnya kepada orang kaya mungkin membantunya memperhatikan. dan menafkahkan dari apa yang telah dikaruniakan Allah kepadanya.” [Al-Bukhari] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) said:","language":"english"},{"text":"Abu Hurairah r.a. berkata:","language":"bahasa"}]},{"index":"1866","hadith_id":"riyadussalihin","text":[{"text":"وعنه قال‏:‏ كنا مع رسول الله صلى الله عليه وسلم في دعوة، فرفع إليه الذراع، وكانت تعجبه، فنهس منها نهسة وقال‏:‏ أنا سيد الناس يوم القيامة، هل تدرون مم ذاك‏؟‏ يجمع الله الأولين والآخرين في صعيد واحد، فيبصرهم الناظر، ويسمعهم الداعي، وتدنوا منهم الشمس، فيبلغ الناس من الغم والكرب ما لا يطيقون ولا يحتملون ، فيقول الناس‏:‏ ألا ترون إلى ما أنتم فيه إلى ما بلغكم، ألا تنظرون من يشفع لكم إلى ربكم‏؟‏ فيقول بعض الناس لبعض‏:‏ أبوكم آدم، ويأتونه فيقولون‏:‏ يا آدم أنت أبو البشر، خلقك الله بيده، ونفخ فيك من روحه، وأمر الملائكة، فسجدوا لك وأسكنك الجنة، ألا تشفع لنا إلى ربك‏؟‏ ألا ترى ما نحن فيه، وما بلغنا‏؟‏ فقال‏:‏ إن ربي غضب غضباً لم يغضب قبله مثله، ولا يغضب بعده مثله، وإنه نهاني عن الشجرة، فعصيت، نفسي نفسي نفسي، اذهبوا إلى غيري، إذهبوا إلى نوح، فيأتون نوحا فيقولون‏:‏ يا نوح ، أنت أول الرسل إلى أهل الأرض، وقد سماك الله عبداً شكوراً، ألا ترى ما نحن فيه، ألا ترى ما بلغنا ألا تشفع لنا إلى ربك‏؟‏ فيقول‏:‏ إن ربي غضب اليوم غضباً لم يغضب قبله مثله، ولن يغضب بعده مثله، وإنه قد كانت لي دعوة دعوت بها على قومي، نفسي نفسي نفسي، اذهبوا إلى غيري، اذهبوا إلى إبراهيم فيأتون إبراهيم فيقولون‏:‏ يا إبراهيم أنت نبي الله وخليله من أهل الأرض اشفع لنا إلى ربك، ألا ترى ما نحن فيه‏؟‏ فيقول لهم‏:‏ إن ربي غضب اليوم غضباً لم يغضب قبله مثله، ولن يغضب بعده مثله، وإني كنت كذبت ثلاث كذبات، نفسي نفسي نفسي، اذهبوا إلى غيري، اذهبوا إلى موسى، فيأتون موسى، فيقولون‏:‏ يا موسى أنت رسول الله فضلك الله برسالاته وبكلامه على الناس، اشفع لنا إلى ربك ألا ترى ما نحن فيه‏؟‏ فيقول‏:‏ إن ربي قد غضب اليوم غضباً لم يغضب قبله مثله، ولن يغضب بعده مثله، وإني قد قتلت نفساً لم أومر بقتلها، نفسي نفسي نفسي، اذهبوا إلى غيري، اذهبوا إلى عيسى، فيأتون عيسى، فيقولون‏:‏ يا عيسى أنت رسول الله وكلمته ألقاها إلى مريم وروح منه ، وكلمت الناس في المهد ‎، اشفع لنا إلى ربك، ألا ترى ما نحن فيه‏؟‏ فيقول عيسى‏:‏ إن ربي غضب اليوم غضباً لم يغضب قبله مثله، ولن يغضب بعده مثله ولم يذكر ذنباً، نفسي نفسي نفسي، اذهبوا إلى غيري، اذهبوا إلى محمد صلى الله عليه وسلم ‏\"‏‏.‏ وفي رواية‏:‏ ‏\"‏فيأتوني فيقولون‏:‏ يا محمد أنت رسول الله وخاتم الأنبياء، وقد غفر لك ما تقدم من ذنبك وما تأخر، اشفع لنا إلى ربك، ألا ترى ما نحن فيه‏؟‏ فأنطلق، فأتي تحت العرش، فأقع ساجداً لربي، ثم يفتح الله علي من محامده، وحسن الثناء عليه شيئاً لم يفتح على أحد قبلي ثم يقال‏:‏ يا محمد ارفع رأسك، سل تعطه، واشفع تشفع، فأرفع رأسي، فأقول أمتي يارب، أمتي يا رب، فيقال‏:‏ يا محمد أدخل من أمتك من لا حساب عليهم من الباب الأيمن من أبواب الجنة وهم شركاء الناس فيما سوى ذلك من الأبواب‏\"‏ ثم قال‏:‏‏\"‏ والذي نفسي بيده إن ما بين المصراعين من مصاريع الجنة كما بين مكة وهجر، أو كما بين مكة وبصرى‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"Meat was one day brought to the Messenger of Allah (ﷺ) and a foreleg was offered to him, a part which he liked. He sliced with his teeth a piece out of it and said: I shall be the leader of mankind on the Day of Resurrection. Do you know why? Allah would gather in one plain the earlier and the later (of the human race) on the Day of Resurrection. Then the voice of the proclaimer would be heard by all of them and the eyesight would penetrate through all of them and the sun would come near. People would then experience a degree of anguish, anxiety and agony which they shall not be able to bear and they shall not be able to stand. Some people would say to the others: Don you see in which trouble you are? Don\u0027t you see what (misfortune) has overtaken you? Why don\u0027t you find one who should intercede for you with your Lord? Some would say to the others: Go to Adam. And they would go to Adam and say: O Adam, thou art the father of mankind. Allah created thee by His own Hand and breathed in thee of His spirit and ordered the angels to prostrate before thee. Intercede for us with thy Lord Don\u0027t you see in what (trouble) we are? Don\u0027t you see what (misfortune) has overtaken us? Adam would say: Verily, my Lord is angry, to an extent to which He had never been angry before nor would He be angry afterward. Verily, He forbade me (to go near) that tree and I disobeyed Him. I am concerned with my own self. Go to someone else; go to Noah. They would come to Noah and would say: O Noah, thou art the first of the Messengers (sent) on the earth (after Adam), and Allah named thee as a\" Grateful Servant,\" intercede for us with thy Lord. Don\u0027t you see in what (trouble) we are? Don\u0027t you see what (misfortune) has overtaken us? He would say: Verily, my Lord is angry today as He had never been angry before, and would never be angry afterwards. There had emanated a curse from me with which I cursed my people. I am concerned with only myself, I am concerned only with myself; you better go to Ibrahim (peace be upon him). They would go to Ibrahim and say: Thou art the apostle of Allah and His Friend amongst the inhabitants of the earth; intercede for us with thy Lord. Don\u0027t you see in which (trouble) we are? Don\u0027t you see what (misfortune) has overtaken us? Ibrahim would say to them: Verily, my Lord is today angry as He had never been angry before and would never be angry afterwards. and (Ibrahim) would mention his lies (and then say): I am concerned only with myself, I am concerned only with myself. You better go to someone else: go to Moses. They would come to Moses (peace be upon him) and say: O Moses, thou art Allah\u0027s messenger, Allah blessed thee with His messengership and His conversation amongst people. Intercede for us with thy Lord. Don\u0027t you see in what (trouble) we are? Don\u0027t you see what (misfortune) has overtaken us? Moses (peace be upon him) would say to them: Verily. my Lord is angry as He had never been angry before and would never be angry afterwards. I, in fact, killed a person whom I had not been ordered to kill. I am concerned with myself, I am concerned with myself. You better go to Jesus (peace be upon him). They would come to Jesus and would say: O Jesus, thou art the messenger of Allah and thou conversed with people in the cradle, (thou art) His Word which I-Ie sent down upon Mary. and (thou art) the Spirit from Him; so intercede for us with thy Lord. Don\u0027t you see (the trouble) in which we are? Don\u0027t you see (the misfortune) that has overtaken us? Jesus (peace be upon him) would say: Verily, my Lord is angry today as He had never been angry before or would ever be angry afterwards. He mentioned no sin of his. (He simply said: ) I am concerned with myself, I am concerned with myself; you go to someone else: better go to Muhammad (ﷺ). They would come to me and say: O Mahammad, thou art the messenger of Allah and the last of the apostles. Allah has pardoned thee all thy previous and later sins. Intercede for us with thy Lord; don\u0027t you see in which (trouble) we are? Don\u0027t you see what (misfortune) has overtaken us? I shall then set off and come below the Throne and fall down prostrate before my Lord; then Allah would reveal to me and inspire me with some of His Praises and Glorifications which He had not revealed to anyone before me. He would then say: Muhammad, raise thy head; ask and it would be granted; intercede and intercession would be accepted I would then raise my head and say: O my Lord, my people, my people. It would be said: O Muhammad, bring in by the right gate of Paradise those of your people who would have no account to render. They would share with the people some other door besides this door. The Prophet then said: By Him in Whose Hand is the life of Muhammad, verify the distance between two door leaves of the Paradise is as great as between Mecca and Hajar, or as between Mecca and Busra. [Al-Bukhari and Muslim]","language":"english"},{"text":"Daging suatu hari dibawa ke Rasulullah (ﷺ) dan kaki depan dipersembahkan kepadanya, bagian yang dia sukai. Dia mengiris dengan giginya sepotong dari itu dan berkata: Saya akan menjadi pemimpin umat manusia pada Hari Kebangkitan. Apa kamu tahu kenapa? Allah akan berkumpul di satu dataran awal dan akhir (umat manusia) pada Hari Kebangkitan. Kemudian suara proklamator akan terdengar oleh mereka semua dan penglihatan akan menembus mereka semua dan matahari akan mendekat. Orang-orang kemudian akan mengalami tingkat penderitaan, kecemasan, dan penderitaan yang tidak akan mampu mereka tanggung dan mereka tidak akan mampu bertahan. Beberapa orang akan berkata kepada yang lain: Apakah Anda melihat di mana masalah Anda? Tidakkah kamu melihat apa (kemalangan) telah menyusulmu? kenapa tidak Apakah kamu menemukan orang yang memberi syafaat bagimu di sisi Tuhanmu? Beberapa akan berkata kepada yang lain: Pergilah ke Adam. Dan mereka akan pergi kepada Adam dan berkata: Wahai Adam, engkau adalah bapak manusia. Allah menciptakan engkau dengan Tangan-Nya sendiri dan meniupkan ruh-Nya kepadamu dan memerintahkan para malaikat untuk bersujud di hadapanmu. Berilah kami syafaat di sisi Tuhanmu Tidakkah kamu melihat (kesulitan) kami ini apa? Tidakkah kamu lihat apa (kemalangan) yang telah menimpa kita? Adam akan berkata: Sesungguhnya, Tuhanku marah, sejauh mana Dia tidak pernah marah sebelumnya dan tidak akan marah sesudahnya. Sesungguhnya Dia melarangku (mendekati) pohon itu dan aku mendurhakai-Nya. Saya prihatin dengan diri saya sendiri. Pergi ke orang lain; pergi ke Nuh. Mereka akan datang kepada Nuh dan akan berkata: Wahai Nuh, engkau adalah utusan pertama (diutus) di bumi (setelah Adam), dan Allah menamaimu sebagai \"Hamba yang Bersyukur,\" berilah syafaat bagi kami di sisi Tuhanmu. Tidakkah kamu melihat dalam (masalah) apa kita ini? Tidakkah kamu lihat apa (kemalangan) yang telah menimpa kita? Dia akan berkata: Sesungguhnya, Tuhanku marah hari ini karena Dia tidak pernah marah sebelumnya, dan tidak akan pernah marah sesudahnya. Telah terpancar kutukan dariku yang dengannya aku mengutuk umatku. Saya hanya peduli dengan diri saya sendiri, saya hanya peduli dengan diri saya sendiri; Anda lebih baik pergi ke Ibrahim (saw). Mereka akan pergi ke Ibrahim dan berkata: Engkau adalah rasul Allah dan Sahabat-Nya di antara penduduk bumi; berilah syafaat bagi kami di sisi Tuhanmu. Tidakkah kamu melihat (masalah) kita yang mana? Tidakkah kamu lihat apa (kemalangan) yang telah menimpa kita? Ibrahim akan berkata kepada mereka: Sesungguhnya Tuhanku hari ini marah karena Dia tidak pernah marah sebelumnya dan tidak akan pernah marah setelahnya. dan (Ibrahim) akan menyebutkan kebohongannya (dan kemudian berkata): Saya hanya peduli dengan diri saya sendiri, saya hanya peduli dengan diri saya sendiri. Anda sebaiknya pergi ke orang lain: pergi ke Musa. Mereka akan datang kepada Musa (saw) dan berkata: Wahai Musa, engkau adalah utusan Allah, Allah memberkatimu dengan utusan-Nya dan percakapan-Nya di antara manusia. Beri syafaat bagi kami di sisi Tuhanmu. Tidakkah kamu melihat dalam (masalah) apa kita ini? Tidakkah kamu lihat apa (kemalangan) yang telah menimpa kita? Musa (saw) akan berkata kepada mereka: Sesungguhnya. Tuhanku marah karena Dia tidak pernah marah sebelumnya dan tidak akan pernah marah setelahnya. Saya, pada kenyataannya, membunuh seseorang yang saya tidak diperintahkan untuk membunuh. Saya prihatin dengan diri saya sendiri, saya prihatin dengan diri saya sendiri. Anda lebih baik pergi ke Yesus (saw). Mereka akan datang kepada Yesus dan akan berkata: Ya Yesus, engkau adalah utusan Allah dan engkau berbicara dengan orang-orang dalam buaian, (engkau adalah) Firman-Nya yang Aku-Ie turunkan kepada Maria. dan (engkau adalah) Roh dari Dia; maka berilah syafaat bagi kami di sisi Tuhanmu. Tidakkah kamu melihat (masalah) di mana kita berada? Tidakkah kamu melihat (kemalangan) yang telah menimpa kita? Yesus (saw) akan berkata: Sesungguhnya, Tuhanku marah hari ini karena Dia tidak pernah marah sebelumnya atau akan pernah marah sesudahnya. Dia tidak menyebutkan dosanya. (Dia hanya berkata: ) Saya prihatin dengan diri saya sendiri, saya prihatin dengan diri saya sendiri; Anda pergi ke orang lain: lebih baik pergi ke Muhammad (ﷺ). Mereka akan datang kepadaku dan berkata: Wahai Mahammad, engkau adalah utusan Allah dan rasul terakhir. Allah telah mengampuni dosa-dosamu yang telah lalu dan yang akan datang. Beri syafaat bagi kami dengan Tuhanmu; tidakkah kamu melihat (masalah) kita yang mana? Mengenakan\u0027 t Anda lihat apa (kemalangan) telah menyusul kami? Saya kemudian akan berangkat dan datang di bawah Arsy dan sujud di hadapan Tuhanku; kemudian Allah akan mengungkapkan kepadaku dan mengilhamiku dengan beberapa Pujian dan Kemuliaan-Nya yang tidak Dia turunkan kepada siapa pun sebelum aku. Dia kemudian akan berkata: Muhammad, angkat kepalamu; meminta dan itu akan diberikan; syafaat dan syafaat akan diterima Saya kemudian akan mengangkat kepala saya dan berkata: Ya Tuhanku, umatku, umatku. Dikatakan: Wahai Muhammad, bawalah melalui pintu surga yang benar orang-orang dari kaummu yang tidak memiliki pertanggungjawaban. Mereka akan berbagi dengan orang-orang beberapa pintu lain selain pintu ini. Nabi kemudian berkata: Demi Dzat yang nyawa Muhammad berada di tangan-Nya, pastikan jarak antara dua daun pintu surga sama besarnya dengan antara Mekah dan Hajar, atau antara Mekah dan Busra. [Al-Bukhari and Muslim]","language":"bahasa"}],"narrated":[{"text":"Abu Huraira reported:","language":"english"},{"text":"Abu Hurairah melaporkan:","language":"bahasa"}]},{"index":"1867","hadith_id":"riyadussalihin","text":[{"text":"وعن بن عباس رضي الله عنهما قال‏:‏ جاء إبراهيم صلى الله عليه وسلم بأم إسماعيل وبابنها إسماعيل وهي ترضعه حتى وضعها عند البيت عند دوحة فوق زمزم في أعلى المسجد وليس بمكة يومئذ أحد وليس بها ماء، فوضعهما هناك، ووضع عندهما جراباً فيه تمر، وسقاء فيه ماء، ثم قفى إبراهيم منطلقاً، فتبعته أم إسماعيل فقالت‏:‏ يا إبراهيم أين تذهب وتتركنا بهذا الوادي الذي ليس فيه أنيس ولا شيء‏؟‏ فقالت له ذلك مراراً، وجعل لا يلتفت إليها، قالت له‏:‏ آلله أمرك بهذا‏؟‏ قال‏:‏ نعم ، قالت‏:‏ إذا لا يضيعنا، ثم رجعت، فانطلق إبراهيم صلى الله عليه وسلم ، حتى إذا كان عند الثنية حيث يرونه استقبل بوجهه البيت ، ثم دعا بهؤلاء الدعوات ، فرفع يديه فقال‏:‏ ‏{‏ربنا إني أسكنت من ذريتي بواد غير ذي زرع‏}‏ حتى بلغ ‏{‏يشكرون‏}‏ وجعلت أم إسماعيل ترضع إسماعيل، وتشرب من ذلك الماء، حتى إذا نفد ما في السقاء عطشت، وعطش ابنها، وجعلت تنظر إليه يتلوى -أوقال‏:‏ يتلبط- فانطلقت كراهية أن تنظر إليه ، فوجدت الصفا أقرب جبل في الأرض يليها، فقامت عليه، ثم استقبلت الوادي تنظر هل ترى أحداً‏؟‏ فلم تر أحداً، فهبطت من الصفا حتى إذا بلغت الوادي، رفعت طرف درعها، ثم سعت سعي الإنسان المجهود حتى جاوزت الوادي، ثم أتت المروة، فقامت عليها، فنظرت هل ترى أحداً‏؟‏ فلم تر أحداً، ففعلت ذلك سبع مرات، قال ابن عباس رضي الله عنهما‏:‏ قال النبي صلى الله عليه وسلم ‏\"‏فذلك سعي الناس بينها‏\"‏ فلما أشرفت على المروة سمعت صوتاً، فقالت‏:‏ صه-تريد نفسها- ثم تسمّعت ، فسمعت أيضاً فقالت‏:‏ قد أسمعت إن كان عندك غواث فأغث، فإذا هى بالملك عند موضع زمزم، فبحث بعقبه -أو قال بجناحه- حتى ظهر الماء، فجعلت تحوضه وتقول بيدها هكذا، وجعلت تغرف الماء في سقائها وهو يفور بعدما تغرف، وفي رواية ‏:‏ بقدر ما تغرف، قال ابن عباس رضي الله عنهما ‏:‏ قال النبي صلى الله عليه وسلم ‏:‏ ‏\"‏رحم الله أم إسماعيل لو تركت زمزم -أو قال‏:‏ لو لم تغرف من الماء، لكان زمزم عينا معينا” قال‏:‏ فشربت ، وأرضعت ولدها، فقال لها الملك‏:‏ لا تخافوا الضيعة فإن ههنا بيتا لله يبنيه هذا الغلام وأبوه، وإن الله لا يضيع أهله، وكان البيت مرتفعاً من الأرض كالرابية تأتيه السيول، فتأخذ عن يمينه وعن شماله، فكانت كذلك حتى مرت بهم رفقة من جرهم، أو أهل بيت من جرهم مقبلين من طريق كداء، فنزلوا في أسفل مكة، فرأوا طائراً عائفاً فقالوا‏:‏ إن هذا الطائر ليدور على ماء لعهدنا بهذا الوادي وما فيه ماء، فأرسلوا جرياً أو جريين، فإذا هم بالماء، فرجعوا، فأخبروهم، فأقبلوا وأم إسماعيل عند الماء، فقالوا‏:‏ أتأذنين لنا أن ننزل عندك‏؟‏ قالت‏:‏ نعم، ولكن لا حق لكم في الماء، قالوا‏:‏ نعم، قال ابن عباس‏:‏ قال النبي صلى الله عليه وسلم ‏:‏ ‏\"‏فألفى ذلك أم إسماعيل، وهي تحب الأنس، فنزلوا، فأرسلوا إلى أهليهم فنزلوا معهم، حتى إذا كانوا بها أهل أبيات، وشب الغلام وتعلم العربيه منهم وأنفسهم وأعجبهم حين شب ، فلما أدرك، زوجوه امرأة منهم، وماتت أم إسماعيل، فجاء إبراهيم بعد ما تزوج إسماعيل يطالع تركته فلم يجد إسماعيل، فسأل امرأته عنه فقالت‏:‏ خرج يبتغي لنا- وفي رواية‏:‏ يصيد لنا - ثم سألها عن عيشهم وهيئتهم فقالت‏:‏ نحن بشر ، نحن في ضيق وشدة، وشكت إليه ، قال‏:‏ فإذا جاء زوجك، أقرئي عليه السلام وقولي‏:‏ غير عتبة بابك، قال‏:‏ ذاك أبي وقد أمرني أن أفارقك، الحقي بأهلك‏.‏ فطلقها ، وتزوج منهم أخرى، فلبث عنهم إبراهيم ما شاء الله ثم أتاهم بعد، فلم يجده ، فدخل على امرأته، فسأله عنه، قالت‏:‏ خرج يبتغي لنا، قال‏:‏ كيف أنتم‏؟‏ وسألها عن عيشهم وهيئتهم، فقالت‏:‏ نحن بخير وسعة وأثنت على الله تعالى، فقال‏:‏ ما طعامكم‏؟‏ قالت‏:‏ اللحم قال‏:‏ فما شرابكم‏؟‏ قالت الماء‏.‏ قال‏:‏ اللهم بارك لهم في اللحم والماء، قال النبي صلى الله عليه وسلم ‏:‏ ‏\"‏ولم يكن لهم يؤمئذ حب ولو كان لهم دعا لهم فيه” قال‏:‏ فهما لا يخلو عليهما أحد بغير مكة إلا لم يوافقاه‏.‏ وفي رواية فجاء فقال‏:‏ أين إسماعيل‏؟‏ فقالت امرأته‏:‏ ذهب يصيد، فقالت امرأته‏:‏ ألا تنزل، فتطعم وتشرب‏؟‏ قال‏:‏ وما طعامكم وما شرابكم‏؟‏ قالت‏:‏ طعامنا اللحم، وشرابنا الماء، قال‏:‏ اللهم بارك لهم في طعامهم وشرابهم- قال، فقال أبوالقاسم صلى الله عليه وسلم ‏:‏ “بركة دعوة إبراهيم صلى الله عليه وسلم ‏\"‏ قال‏:‏ فإذا جاء زوجك ، فاقرئي عليه السلام ومريه يثبت عتبة بابه، فلما جاء إسماعيل، قال‏:‏ هل أتاكم من أحد‏؟‏ قالت‏:‏ نعم، أتانا شيخ حسن الهيئة، وأثنت عليه فسألني عنك، فأخبرته ،فسألني كيف عيشنا، فأخبرته، أنّا بخير، قال‏:‏ فأوصاك بشيء‏؟‏ قالت‏:‏ نعم، يقرأ عليك السلام، ويأمرك أن تثبت عبتة بابك، قال‏:‏ ذاك أبي وأنت العتبة أمرني أن أمسكك، ثم لبث عنهم ما شاء الله، ثم جاء بعد ذلك وإسماعيل يبري نبلاً له تحت دوحة قريباً من زمزم، فلما رآه، قام إليه ، فصنع كما يصنع الوالد بالولد، والولد بالوالد قال يا إسماعيل إن الله أمرني بأمر ، قال‏:‏ فاصنع ما أراك ربك‏؟‏ قال‏:‏ وتعينني، قال‏:‏ وأعينك، قال‏:‏ فإن الله أمرني أن أبني بيتا ههنا، وأشار إلى أكمة مرتفعة على ما حولها، فعند ذلك رفع القواعد من البيت، فجعل إسماعيل يأتي بالحجارة وإبراهيم يبني حتى إذا ارتفع البناء، جاء بهذا الحجر فوضعه له فقام عليه، وهو يبني وإسماعيل يناوله الحجارة وهما يقولان ‏:‏ ربنا تقبل منا إنك أنت السميع العليم‏.‏ وفي رواية‏:‏ إن إبراهيم خرج بإسماعيل وأم إسماعيل، معهم شنة فيها ماء، فجعلت أم إسماعيل تشرب من الشنة، فيدر لبنها على صبيها حتى قدم مكة، فوضعها تحت دوحة، ثم رجع إبراهيم إلى أهله، فاتبعته أم إسماعيل حتى لما بلغوا كداء، نادته من ورائه‏:‏ يا إبراهيم إلى من تتركنا‏؟‏ قال‏:‏ إلى الله ، قالت‏:‏ رضيت بالله، فرجعت، وجعلت تشرب من الشنة، ويدر لبنها على صبيها حتى لما فني الماء قالت‏:‏ لو ذهبت ، فنظرت لعلي أحس أحداً، قال‏:‏ فذهبت فصعدت الصفا، فنظرت ونظرت هل تحس أحداً، فلما بلغت الوادي، سمعت، وأتت المروة، وفعلت ذلك أشواطا، ثم قالت‏:‏ لو ذهبت فنظرت ما فعل الصبي، فذهبت ونظرت، فإذا هو على حاله كأنه ينشغ للموت، فلم تقرها نفسها ، فقالت‏:‏ لو ذهبت ، فنظرت لعلي أحس أحداً، فذهبت فصعدت الصفا، فنظرت ونظرت، فلم تحس أحداً حتى أتمت سبعاً، ثم قالت‏:‏ لو ذهبت ، فنظرت ما فعل، فإذا هي بصوت فقال‏:‏ أغث إن كان عندك خير، فإذا جبريل صلى الله عليه وسلم فقال بعقبه هكذا، وغمز بعقبه على الأرض فانبثق الماء فدهشت أم إسماعيل، فجعلت تحفن، وذكر الحديث بطوله‏.‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏ بهذه الروايات كلها‏.‏ «الدوحة» الشجرة الكبيرة. قوله: «قفى» : أي: ولى. ... «والجري» : الرسول. «وألفى» : معناه وجد. قوله: «ينشغ» : أي: يشهق.","language":"arabic"},{"text":"Ibrahim (ﷺ) brought his wife and her son Isma\u0027il (ﷺ), while she was suckling him, to a place near the Ka\u0027bah under a tree on the spot of Zamzam, at the highest place in the mosque. In those days, there was no human being in Makkah, nor was there any water. So he made them sit over there and placed near them a leather bag containing some dates, and a small water-skin containing some water, and set out homeward. Isma\u0027il\u0027s mother followed him saying: \"O Ibrahim! Where are you going, leaving us in this valley where there is no person whose company we may enjoy, nor is there anything (to enjoy)?\" She repeated that to him many times, but he did not look back at her. Then she asked him: \"Has Allah commanded you to do so?\" He said: \"Yes.\" She said: \"Then He will not neglect us.\" She returned while Ibrahim proceeded onwards. Having reached the Thaniya, where they could not see him, he faced Ka\u0027bah, raised his both hands and supplicated: \"O our Rubb! I have made some of my offspring to dwell in an uncultivable valley by Your Sacred House (the Ka\u0027bah at Makkah) in order, O our Rubb, that they may perform As-Salat (Iqamat-as-Salat). So fill some hearts among men with love towards them, and (O Allah) provide them with fruits so that they may give thanks.\" (14:37). Isma\u0027il\u0027s mother went on suckling Isma\u0027il and drinking from the water which she had. When the water in the water-skin had all been used up, she became thirsty and her child also became thirsty. She started looking at Isma\u0027il, tossing in agony. She left him, for she could not endure looking at him, and found that the mountain of As-Safa was the nearest mountain to her on that land. She stood on it and started looking at the valley keenly so that she might see somebody, but she could not see anybody. Then she descended from As-Safa, and when she reached the valley, she tucked up her robe and ran in the valley like a person in distress and trouble till she crossed the valley and reached Al-Marwah mountain where she stood and started looking, expecting to see somebody, but she could not see anybody. She repeated that (running between As-Safa and Al-Marwah) seven times.\" Ibn \u0027Abbas further related: The Prophet (ﷺ) said, \"This is the source of the tradition of the Sa\u0027y - i.e., the going of people between the two mountains. When she reached Al-Marwah (for the last time), she heard a voice and she exclaimed: \u0027Shshs!\u0027 (Silencing herself) and listened attentively. She heard the voice again and said: \u0027O (whoever you may be) You have made me hear your voice; have you any succour for me?\u0027 And behold! She saw an angel at the place of Zamzam, digging the earth with his heel (or with his wing), till water flowed out from that place. She started to make something like of a basin around it, using her hands in this way and began to fill her water- skin with water with her hands, and the water was flowing out until she had scooped some of it.\" The Prophet (ﷺ) further said, \"May Allah bestow mercy on Isma\u0027il\u0027s mother! Had she let the Zamzam flow without trying to control it (or had she not scooped in that water) while filling her water-skin, Zamzam would have been a stream flowing on the surface of the earth.\" The Prophet (ﷺ) further added, \"Then she drank (water) and suckled her child. The angel said to her: \u0027Do not be afraid of being neglected, for this is the site on which the House of Allah will be built by this boy and his father, and Allah will never let neglected His people.\u0027 The House of Allah (the Ka\u0027bah) at that time was on a high place resembling a hillock, and when torrents came, they flowed to its right and left. She continued living in that way till some people from the tribe of Jurhum passed by her and her child. As they were coming from through the way of Kada\u0027, in the lower part of Makkah where they saw a bird that had a habit of flying around water and not leaving it. They said: \u0027This bird must be flying over water, though we know that there is no water in this valley.\u0027 They sent one or two messengers who discovered the source of water, and returned to inform them of the water. So, they all came towards the water.\" The Prophet (ﷺ) added, \"Isma\u0027il\u0027s mother was sitting near the water. They asked her: \u0027Do you allow us to stay with you?\u0027 She replied: \u0027Yes, but you will have no right to possess the water.\u0027 They agreed to that.\" The Prophet (ﷺ) further said, \"Isma\u0027il\u0027s mother was pleased with the whole situation as she used to love the company of the people. So, they settled there, and later on they sent for their families who came and settled with them. The child (i.e., Isma\u0027il) grew up and learnt Arabic from them (his virtues) caused them to love and admire him as he grew up, and when he reached the age of puberty, they gave him one of their daughters in marriage. After Isma\u0027il\u0027s mother had died, Ibrahim came after Isma\u0027il\u0027s marriage in order to see his family that he had left before, but he did not find Isma\u0027il there. When he asked Isma\u0027il\u0027s wife about him, she replied: \u0027He has gone in search of our livelihood.\u0027 Then he asked her about their way of living and their condition, and she replied complaining to him: \u0027We are living in hardship, misery and destitution.\u0027 He said: \u0027When your husband returns, convey my salutations to him and tell him to change the threshold of the door of his house.\u0027 When Isma\u0027il came, he seemed to have perceived something unusual. He asked his wife: \u0027Did anyone visit you?\u0027 She replied: \u0027Yes, an old man of such and such description came and asked me about you and I informed him, and he asked about our state of living, and, I told him that we were living in hardship and poverty.\u0027 Thereupon Isma\u0027il said: \u0027Did he advise you anything?\u0027 She replied: \u0027Yes, he told me to convey his salutations to you and to change the threshold of your door.\u0027 Isma\u0027il said: \u0027That was my father, and he has ordered me to divorce you. Go back to your family.\u0027 So Isma\u0027il divorced her and married another woman from amongst them (Jurhum). Then Ibrahim stayed away from them for a period as long as Allah wished, and called on them again but did not find Isma\u0027il. So he came to Isma\u0027il\u0027s wife and asked her about him. She said: \u0027He has gone in search of our livelihood.\u0027 Ibrahim asked her about their sustenance and living: \u0027How are you getting on?\u0027 She replied: \u0027We are prosperous and well off.\u0027 Then she praised Allah, the Exalted. Ibrahim asked: \u0027What kind of food do you eat?\u0027 She said: \u0027Meat.\u0027 He said: \u0027What do you drink?\u0027 She said: \u0027Water.\u0027 He said, \u0027O Allah! Bless their meat and water!\"\u0027 The Prophet (ﷺ) added, \"At that time they did not have grain, and if they had grain, he would have also invoked Allah to bless it.\" The Prophet (ﷺ) further said, \"If somebody has only these two things as his sustenance, his health and disposition will be badly affected because these things do not suit him unless he lives in Makkah.\" The Prophet (ﷺ) added, \"Then Ibrahim said to Isma\u0027il\u0027s wife, \u0027When your husband comes, give my regards to him and tell him that he should keep firm the threshold of his door.\u0027 When Isma\u0027il came back, he asked his wife: \u0027Did anyone call on you?\u0027 She replied: \u0027Yes, a good looking old man came to me.\u0027 She praised him and added: \u0027He asked about you, and I informed him, and he asked about our livelihood and I told him that we were in good condition.\u0027 Isma\u0027il asked her: \u0027Did he give you a piece of advice?\u0027 She said: \u0027Yes, he told me to convey his regards to you and ordered that you should keep firm the threshold of your door.\u0027 On that Isma\u0027il said: \u0027He was my father and you are the threshold of the door. He has ordered me to keep you with me.\u0027 Then Ibrahim stayed away from them for a period as long as Allah wished and called on them afterwards. He saw Isma\u0027il under a tree near Zamzam, sharpening his arrows. When he saw Ibrahim, he rose up to welcome him, and they greeted each other as a father does with his son or a son does with his father. Ibrahim said: \u0027O Isma\u0027il! Allah has given me an order.\u0027 Isma\u0027il said: \u0027Do what your Rubb has commanded you to do.\u0027 Ibrahim asked: \u0027Will you help me?\u0027 Isma\u0027il said: \u0027I will help you.\u0027 Ibrahim said: \u0027Allah has ordered me to build a house here, pointing to a hillock higher than the land surrounding it.\"\u0027 The Messenger of Allah (ﷺ) added, \"Then they raised the foundations of the House (i.e., Ka\u0027bah). Isma\u0027il brought the stones and Ibrahim was building (the house). When the walls became high, Isma\u0027il brought stone and placed it for Ibrahim who stood over it and carried on building the House, while Isma\u0027il was handing over the stones to him, both of them prayed: \u0027O our Rubb! Accept this service from us! Verily, You are the All- Hearer and the All-Knower.\"\u0027 [Al-Bukhari]. There are some more narrations about this incident, some adding details and some with minor variations in the wordings.","language":"english"},{"text":"Ibrahim (ﷺ) membawa istri dan putranya Ismail (ﷺ), ketika dia sedang menyusui, ke suatu tempat dekat Ka\u0027bah di bawah pohon di tempat Zamzam, di tempat tertinggi di masjid. Pada masa itu, tidak ada manusia di Mekah, juga tidak ada air. Jadi dia menyuruh mereka duduk di sana dan meletakkan di dekat mereka sebuah tas kulit berisi beberapa kurma, dan kantong kecil berisi air, dan berangkat pulang. Ibu Isma\u0027il mengikutinya sambil berkata: \"Wahai Ibrahim! Kemana kamu akan pergi, meninggalkan kami di lembah ini di mana tidak ada orang yang dapat kami nikmati bersamanya, juga tidak ada sesuatu (untuk dinikmati)?\" Dia mengulangi itu padanya berkali-kali, tetapi dia tidak melihat ke arahnya. Kemudian dia bertanya kepadanya: \"Apakah Allah memerintahkan Anda untuk melakukannya?\" Dia berkata: \"Ya.\" Dia berkata: \"Maka Dia tidak akan mengabaikan kita.\" Dia kembali sementara Ibrahim melanjutkan. Setelah sampai di Thaniya, di mana mereka tidak dapat melihatnya, dia menghadap Ka\u0027bah, mengangkat kedua tangannya dan berdoa: \"O Karet kami! \u0027bah di Mekah) agar, hai Rubb kami, agar mereka dapat melakukan As-Salat (Iqamat-as-Salat), Maka penuhi beberapa hati di antara manusia dengan cinta terhadap mereka, dan (Ya Allah) beri mereka buah-buahan agar mereka boleh berterima kasih.\" (14:37). agar mereka dapat melakukan As-Salat (Iqamat-as-Salat). Maka isilah sebagian hati manusia dengan rasa cinta terhadap mereka, dan (Ya Allah) berilah mereka buah-buahan agar mereka bersyukur.” (14:37). agar mereka dapat melakukan As-Salat (Iqamat-as-Salat). Maka isilah sebagian hati manusia dengan rasa cinta terhadap mereka, dan (Ya Allah) berilah mereka buah-buahan agar mereka bersyukur.” (14:37). Ibu Ismail terus menyusu Ismail dan minum dari air yang dimilikinya. Ketika air di kantong air telah habis, dia menjadi haus dan anaknya juga menjadi haus. Dia mulai melihat Ismail, melemparkan penderitaan. Dia meninggalkannya, karena dia tidak tahan melihatnya, dan menemukan bahwa gunung As-Safa adalah gunung terdekat dengannya di tanah itu. Dia berdiri di atasnya dan mulai melihat ke lembah dengan tajam sehingga dia bisa melihat seseorang, tetapi dia tidak bisa melihat siapa pun. Kemudian dia turun dari As-Safa, dan ketika dia mencapai lembah, dia menyelipkan jubahnya dan berlari di lembah seperti orang dalam kesusahan dan kesulitan sampai dia menyeberangi lembah dan mencapai gunung Al-Marwah di mana dia berdiri dan mulai melihat, berharap untuk melihat seseorang, tapi dia tidak bisa melihat siapa pun. Dia mengulangi itu (berlari antara As-Safa dan Al-Marwah) tujuh kali.\" Ibn \u0027Abbas lebih lanjut menceritakan: Nabi (ﷺ) berkata, \"Ini adalah sumber tradisi Sa\u0027y - yaitu, perginya orang di antara dua gunung. Ketika dia mencapai Al-Marwah (untuk terakhir kalinya), dia mendengar sebuah suara dan dia berseru: \u0027Sst!\u0027 (Membungkam dirinya sendiri) dan mendengarkan dengan penuh perhatian. Dia mendengar suara itu lagi dan berkata: \u0027O (siapapun Anda) Anda telah membuat saya mendengar suara Anda; apakah Anda punya bantuan untuk saya?\u0027 Dan lihatlah! Dia melihat malaikat di tempat Zamzam, menggali bumi dengan tumitnya (atau dengan sayapnya), sampai air mengalir keluar dari tempat itu. Dia mulai membuat sesuatu seperti baskom di sekelilingnya, menggunakan tangannya dengan cara ini dan mulai mengisi kantong airnya dengan air dengan tangannya, dan air mengalir keluar sampai dia menyendok sebagian.” Nabi (ﷺ) selanjutnya berkata, “Semoga Allah melimpahkan rahmat kepada ibu Ismail! Seandainya dia membiarkan zamzam mengalir tanpa berusaha mengendalikannya (atau seandainya dia tidak menyendoki air itu) sambil mengisi kantong airnya, zamzam akan menjadi aliran yang mengalir di permukaan bumi.” Nabi (ﷺ) lebih lanjut menambahkan , \"Kemudian dia minum (air) dan menyusui anaknya. Malaikat berkata kepadanya: \u0027Jangan takut diabaikan, karena ini adalah situs di mana Rumah Allah akan dibangun oleh anak ini dan ayahnya, dan Allah tidak akan pernah membiarkan umat-Nya diabaikan.\u0027 Rumah Allah (Ka\u0027bah) pada waktu itu berada di tempat yang tinggi menyerupai bukit kecil, dan ketika datang aliran deras, mereka mengalir ke kanan dan ke kiri. Dia terus hidup seperti itu sampai beberapa orang dari suku Jurhum melewati dia dan anaknya. Ketika mereka datang dari jalan Kada\u0027, di bagian bawah Mekah di mana mereka melihat seekor burung yang memiliki kebiasaan terbang di sekitar air dan tidak meninggalkannya. Mereka berkata: \u0027Burung ini pasti terbang di atas air, meskipun kita tahu bahwa tidak ada air di lembah ini.\u0027 Mereka mengirim satu atau dua utusan yang menemukan sumber air, dan kembali untuk memberi tahu mereka tentang air itu. Jadi, mereka semua datang ke arah air.” Nabi (ﷺ) menambahkan, “Ibu Ismail sedang duduk di dekat air. Mereka bertanya kepadanya: \u0027Apakah Anda mengizinkan kami untuk tinggal bersama Anda?\u0027 Dia menjawab: \u0027Ya, tetapi Anda tidak berhak memiliki air.\u0027 Mereka setuju untuk itu.\" Nabi (ﷺ) selanjutnya berkata, \"Isma\u0027il\u0027 Ibunya senang dengan seluruh situasi karena dia dulu suka bergaul dengan orang-orang. Jadi, mereka menetap di sana, dan kemudian mereka mengirim keluarga mereka yang datang dan menetap bersama mereka. Anak (yaitu, Ismail) tumbuh dan belajar bahasa Arab dari mereka (keutamaannya) menyebabkan mereka mencintai dan mengaguminya saat dia tumbuh dewasa, dan ketika dia mencapai usia pubertas, mereka memberinya salah satu putri mereka untuk dinikahkan. . Setelah ibu Ismail meninggal, Ibrahim datang setelah pernikahan Isma\u0027il untuk melihat keluarganya yang telah ia tinggalkan sebelumnya, tetapi ia tidak menemukan Ismail di sana. Ketika dia bertanya kepada istri Ismail tentang dia, dia menjawab: \u0027Dia pergi mencari penghidupan kami.\u0027 Kemudian dia bertanya kepadanya tentang cara hidup dan kondisi mereka, dan dia menjawab mengeluh kepadanya: \u0027Kami hidup dalam kesulitan, kesengsaraan, dan kemelaratan. \u0027 Dia berkata: \u0027Ketika suamimu kembali, sampaikan salamku padanya dan katakan padanya untuk mengubah ambang pintu rumahnya.\u0027 Ketika Ismail datang, dia seperti merasakan sesuatu yang tidak biasa. Dia bertanya kepada istrinya: \u0027Apakah ada yang mengunjungi Anda?\u0027 Dia menjawab: \u0027Ya, seorang lelaki tua dengan deskripsi ini dan itu datang dan bertanya kepada saya tentang Anda dan saya memberi tahu dia, dan dia bertanya tentang keadaan hidup kami, dan, saya mengatakan kepadanya bahwa kami hidup dalam kesulitan dan kemiskinan.\u0027 Kemudian Ismail berkata: \u0027Apakah dia menasihatimu sesuatu?\u0027 Dia menjawab: \u0027Ya, dia mengatakan kepada saya untuk menyampaikan salam kepada Anda dan untuk mengubah ambang pintu Anda.\u0027 Ismail berkata: \u0027Itu ayahku, dan dia telah memerintahkanku untuk menceraikanmu. Kembalilah ke keluargamu.\u0027 Maka Ismail menceraikannya dan menikahi wanita lain dari antara mereka (Jurhum). Kemudian Ibrahim menjauh dari mereka selama beberapa waktu selama yang Allah kehendaki, dan memanggil mereka lagi tetapi tidak menemukan Ismail. Jadi dia datang ke istri Ismail dan bertanya tentang dia. Dia berkata: \u0027Dia telah pergi mencari penghidupan kita.\u0027 Ibrahim bertanya padanya tentang rezeki dan kehidupan mereka: \u0027Bagaimana kabarmu?\u0027 Dia menjawab: \u0027Kami makmur dan kaya.\u0027 Kemudian dia memuji Allah Ta\u0027ala. Ibrahim bertanya: \u0027Makanan apa yang kamu makan?\u0027 Dia berkata: \u0027Daging.\u0027 Dia berkata: \u0027Apa yang kamu minum?\u0027 Dia berkata: \u0027Air.\u0027 Dia berkata, \u0027Ya Allah! Berkati daging dan air mereka!\"\u0027 Nabi (ﷺ) menambahkan, \"Saat itu mereka tidak memiliki biji-bijian, dan jika mereka memiliki biji-bijian, dia juga akan memohon kepada Allah untuk memberkatinya.\" Nabi (ﷺ) selanjutnya berkata, \" Jika seseorang hanya memiliki dua hal ini sebagai rezekinya, kesehatan dan wataknya akan sangat terpengaruh karena hal-hal ini tidak cocok untuknya kecuali dia tinggal di Mekah.” Nabi (ﷺ) menambahkan, “Kemudian Ibrahim berkata kepada istri Ismail, \u0027Ketika suamimu datang, sampaikan salamku padanya dan katakan padanya bahwa dia harus menjaga ambang pintunya dengan kokoh.\u0027 Ketika Ismail kembali, dia bertanya kepada istrinya: \u0027Apakah ada yang memanggilmu?\u0027 Dia menjawab: \u0027Ya, seorang lelaki tua yang tampan datang kepada saya.\u0027 Dia memujinya dan menambahkan: \u0027Dia bertanya tentang Anda, dan saya memberi tahu dia, dan dia bertanya tentang mata pencaharian kami dan saya mengatakan kepadanya bahwa kami dalam kondisi baik.\u0027 Ismail bertanya padanya: \u0027Apakah dia memberimu nasihat?\u0027 Dia berkata ya, dia menyuruh saya untuk menyampaikan salamnya kepada Anda dan memerintahkan agar Anda tetap teguh di ambang pintu Anda.\u0027 Pada saat itu Isma\u0027il berkata: \u0027Dia adalah ayahku dan kamu adalah ambang pintu. Dia telah memerintahkan saya untuk membuat Anda tetap bersama saya.\u0027 Kemudian Ibrahim menjauh dari mereka selama beberapa waktu selama yang Allah kehendaki dan memanggil mereka setelah itu. Dia melihat Ismail di bawah pohon dekat Zamzam, sedang mengasah anak panahnya. Ketika dia melihat Ibrahim, dia bangkit untuk menyambutnya, dan mereka saling menyapa seperti seorang ayah dengan putranya atau seorang putra dengan ayahnya. Ibrahim berkata: \u0027Hai Ismail! Allah telah memberi saya perintah.\u0027 Ismail berkata: \u0027Lakukan apa yang diperintahkan Rubb-mu.\u0027 Ibrahim bertanya: \u0027Maukah Anda membantu saya?\u0027 Ismail berkata: \u0027Aku akan membantumu.\u0027 Ibrahim berkata: \u0027Allah telah memerintahkan saya untuk membangun sebuah rumah di sini, menunjuk ke sebuah bukit yang lebih tinggi dari tanah di sekitarnya.\"\u0027 Rasulullah (ﷺ) menambahkan, \"Kemudian mereka mengangkat fondasi Rumah (yaitu, Ka\u0027bah). Ismail membawa batu dan Ibrahim membangun (rumah). Ketika tembok menjadi tinggi, Ismail membawa batu dan meletakkannya untuk Ibrahim yang berdiri di atasnya dan melanjutkan pembangunan Rumah, sementara Ismail menyerahkan batu kepadanya, keduanya berdoa: \u0027Wahai Karet kami! Terima layanan ini dari kami! Sesungguhnya Engkau Maha Mendengar dan Maha Mengetahui.\"\u0027 il membawa batu dan meletakkannya untuk Ibrahim yang berdiri di atasnya dan melanjutkan pembangunan Rumah, sementara Ismail menyerahkan batu kepadanya, keduanya berdoa: \u0027Wahai Karet kami! Terima layanan ini dari kami! Sesungguhnya Engkau Maha Mendengar dan Maha Mengetahui.\"\u0027 il membawa batu dan meletakkannya untuk Ibrahim yang berdiri di atasnya dan melanjutkan pembangunan Rumah, sementara Ismail menyerahkan batu kepadanya, keduanya berdoa: \u0027Wahai Karet kami! Terima layanan ini dari kami! Sesungguhnya Engkau Maha Mendengar dan Maha Mengetahui.\"\u0027 [Al-Bukhari] . Ada beberapa narasi lagi tentang kejadian ini, beberapa menambahkan detail dan beberapa dengan sedikit variasi dalam susunan kata.","language":"bahasa"}],"narrated":[{"text":"Ibn \u0027Abbas (May Allah be pleased with them) reported:","language":"english"},{"text":"Ibn \u0027Abbas (semoga Allah meridhoi mereka) melaporkan:","language":"bahasa"}]},{"index":"1868","hadith_id":"riyadussalihin","text":[{"text":"وعن سعيد بن زيد رضي الله عنه قال‏:‏ سمعت رسول الله صلى الله عليه وسلم يقول‏:‏ ‏ \"‏الكمأة من المن، وماؤها شفاء للعين‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"I heard the Messenger of Allah (ﷺ) saying, \"Truffle (edible fungus) is a species of Al-Manna and their water cures eye diseases.\" [Al-Bukhari and Muslim]","language":"english"},{"text":"Saya mendengar Rasulullah (ﷺ) berkata, \"Truffle (jamur yang dapat dimakan) adalah spesies Al-Manna dan airnya menyembuhkan penyakit mata.\" [Al-Bukhari dan Muslim]","language":"bahasa"}],"narrated":[{"text":"Sa\u0027id bin Zaid (May Allah be pleased with him) reported:","language":"english"},{"text":"Sa\u0027id bin Zaid radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]}]