[{"index":"844","hadith_id":"riyadussalihin","text":[{"text":"وعن عبد الله بن عمرو بن العاص رضي الله عنهما أن رجلا سأل رسول الله صلى الله عليه وسلم‏:‏ أي الإسلام خير‏؟‏ قال‏:‏ ‏ \"‏تطعم الطعام، وتقرأ السلام على من عرفت ومن لم تعرف‏\"‏‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"A man asked the Messenger of Allah (ﷺ): \"Which act in Islam is the best?\" He (ﷺ) replied, \"To give food, and to greet everyone, whether you know or you do not.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Seorang laki-laki bertanya kepada Rasulullah (): \"Amal apa dalam Islam yang paling baik?\" Beliau (ﷺ) menjawab, \"Memberi makan, dan menyapa semua orang, baik yang kamu kenal maupun tidak.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abdullah bin \u0027Amr bin Al-\u0027as (May Allah be pleased with them) reported:","language":"english"},{"text":"Abdullah bin \u0027Amr bin Al-\u0027as (semoga Allah meridhoi mereka) melaporkan:","language":"bahasa"}]},{"index":"845","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم قال‏:‏ لما خلق الله تعالى آدم عليه السلام قال‏:‏ اذهب فسلم على أولئك -نفر من الملائكة جلوس- فاستمع ما يحيونك، فإنه تحيتك وتحية ذريتك‏.‏ فقال‏:‏ السلام عليكم فقالوا‏:‏ السلام عليك ورحمة الله، فزادوه‏:‏ ورحمة الله‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Prophet (ﷺ) said, \"When Allah created Adam (ﷺ), He said to him: \u0027Go and greet that company of angels who are sitting there - and then listen to what they are going to say in reply to your greetings because that will be your greeting and your off-spring\u0027s.\u0027 Adam (ﷺ) said to the angels: \u0027As-Salamu \u0027Alaikum (May peace be upon you).\u0027 They replied: \u0027As-Salamu \u0027Alaikum wa Rahmatullah (May peace be upon you and the Mercy of Allah).\u0027 Thus adding in reply to him: \u0027wa Rahmatullah (and the Mercy of Allah)\u0027 to his greeting.\" [Al- Bukhari and Muslim].","language":"english"},{"text":"Nabi (ﷺ) berkata, \"Ketika Allah menciptakan Adam (ﷺ), Dia berkata kepadanya: \u0027Pergi dan sapalah sekelompok malaikat yang duduk di sana - dan kemudian dengarkan apa yang akan mereka katakan sebagai balasan salam Anda karena itu akan menjadi salam Anda dan keturunan Anda.\u0027 Adam (ﷺ) berkata kepada para malaikat: \u0027As-Salamu \u0027Alaikum (semoga damai menyertaimu).\u0027 Mereka menjawab: \u0027As-Salamu \u0027Alaikum wa Rahmatullah (Semoga damai atasmu dan rahmat Allah).\u0027 Jadi menambahkan sebagai balasan kepadanya: \u0027wa Rahmatullah (dan rahmat Allah)\u0027 untuk salamnya.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"846","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي عمارة البراء بن عازب رضي الله عنهما قال‏:‏ أمرنا رسول الله صلى الله عليه وسلم بسبع‏:‏ بعيادة المريض، واتباع الجنائز، وتشميت العاطس، ونصر الضعيف، وعون المظلوم، وإفشاء السلام وإبرار المقسم‏.‏ ‏(‏‏(‏متفق عليه هذا لفظ إحدى روايات البخاري‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) commanded us to do seven things: to visit the sick, to follow the funeral (of a dead believer), to invoke the Mercy of Allah upon one who sneezes (i.e., by saying to him: Yarhamuk- Allah), to support the weak, to help the oppressed, to promote the greeting of \u0027As-Salamu \u0027Alaikum\u0027, and to help those who swear to do something to keep their oaths. [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) memerintahkan kita untuk melakukan tujuh hal: menjenguk orang sakit, mengikuti pemakaman (orang mukmin yang meninggal), untuk memohon rahmat Allah atas orang yang bersin (yaitu, dengan mengatakan kepadanya: Yarhamuk- Allah), untuk mendukung yang lemah, untuk membantu yang tertindas, untuk mempromosikan salam \u0027As-Salamu \u0027Alaikum\u0027, dan untuk membantu mereka yang bersumpah untuk melakukan sesuatu untuk menjaga sumpah mereka. [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Al-Bara\u0027 bin \u0027Azib (May Allah be pleased with them) reported:","language":"english"},{"text":"Al-Bara\u0027 bin \u0027Azib r.a. melaporkan:","language":"bahasa"}]},{"index":"847","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي هريرة رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏ \"‏لا تدخلوا الجنة حتى تؤمنوا ولا تؤمنوا حتى تحابوا أولا أدلكم على شيء إذا فعلتموه تحاببتم‏؟‏ أفشوا السلام بينكم‏\"‏ ‏(‏‏(‏رواه مسلم ‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"By Him in Whose Hand is my life! You will not enter Jannah until you believe, and you will not believe until you love one another. Shall I inform you of something which, if you do, you will love one another? Promote greetings amongst yourselves.\" [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Demi Dzat yang hidupku ada di tangan-Nya! Kamu tidak akan masuk surga sampai kamu beriman, dan kamu tidak akan beriman sampai kamu saling mencintai. Maukah aku memberitahumu sesuatu yang, jika kamu melakukannya? , kalian akan saling mencintai? Perbanyaklah salam di antara kalian sendiri.\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"848","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي يوسف عبد الله بن سلام رضي الله عنه قال‏:‏ سمعت رسول الله صلى الله عليه وسلم يقول‏:‏ ‏ \"‏يا أيها الناس أفشوا السلام، وأطعموا الطعام، وصلوا الأرحام وصلوا والناس نيام، تدخلوا الجنة بسلام‏\"‏ ‏(‏‏(‏رواه الترمذي وقال حديث حسن صحيح‏)‏‏)‏‏.‏","language":"arabic"},{"text":"I heard the Messenger of Allah (ﷺ) saying, \"O people, exchange greetings of peace (i.e., say: As-Salamu \u0027Alaikum to one another), feed people, strengthen the ties of kinship, and be in prayer when others are asleep, you will enter Jannah in peace.\" [At- Tirmidhi, who classified it as Hasan Sahih].","language":"english"},{"text":"Saya mendengar Rasulullah (ﷺ) berkata, \"Hai manusia, saling bertukar salam (yaitu, mengatakan: As-Salamu \u0027Alaikum satu sama lain), memberi makan orang, memperkuat ikatan kekerabatan, dan berdoa ketika orang lain sedang tertidur, kamu akan memasuki Jannah dengan tenang.\" [At- Tirmidzi, yang mengklasifikasikannya sebagai Hasan Sahih] .","language":"bahasa"}],"narrated":[{"text":"\u0027Abdullah bin Salam (May Allah be pleased with him) reported:","language":"english"},{"text":"\u0027Abdullah bin Salam (ra dengan dia) melaporkan:","language":"bahasa"}]},{"index":"849","hadith_id":"riyadussalihin","text":[{"text":"وعن الطفيل بن أبي بن كعب أنه كان يأتي عبد الله بن عمر، فيغدو معه إلى السوق، قال‏:‏ فإذا غدونا إلى السوق، لم يمر عبد الله على سقاط ولا صاحب بيعة، ولا مسكين، ولا أحد إلا سلم عليه، قال الطفيل، فجئت عبد الله بن عمر يومًا، فاستتبعني إلى السوق فقلت له‏:‏ ما تصنع بالسوق، وأنت لا تقف على البيع ولا تسأل عن السلع، ولا تسوم بها، ولا تجلس في مجالس السوق‏؟‏ وأقول‏:‏ اجلس بنا هاهنا نتحدث، فقال يا أبا بطن- وكان الطفيل ذا بطن- إنما نغدو من أجل السلام فنسلم على من لقيناه‏.‏ ‏(‏‏(‏رواه مالك في الموطأ بإسناد صحيح‏)‏‏)‏‏.‏","language":"arabic"},{"text":"I used to visit \u0027Abdullah bin \u0027Umar (May Allah be pleased with them) in the morning and accompany him to the market. \u0027Abdullah offered greetings of peace to every one he met on the way, be they sellers of petty goods, traders or poor people. One day when I came to him, he asked me to accompany him to the market. I said to him: \"What is the point of your going to the market when you do not sell, nor ask about articles, nor offer a price for them, nor sit down with any company of people. Let us sit down here and talk.\" He replied: \"O Abu Batn (father of a belly) - Tufail had a large belly - we go to the market to greet everyone we meet.\" [Malik, with a sound chain].","language":"english"},{"text":"Saya biasa mengunjungi \u0027Abdullah bin \u0027Umar (ra dengan mereka) di pagi hari dan menemaninya ke pasar. \u0027Abdullah mengucapkan salam damai kepada setiap orang yang ditemuinya di jalan, baik mereka penjual barang-barang kecil, pedagang atau orang miskin. Suatu hari ketika saya datang kepadanya, dia meminta saya untuk menemaninya ke pasar. Saya berkata kepadanya: \"Apa gunanya pergi ke pasar jika Anda tidak menjual, tidak menanyakan barang, tidak menawarkan harga, atau duduk dengan sekelompok orang. Mari kita duduk di sini dan berbicara .\" Dia menjawab: \"Wahai Abu Batn (ayah dari perut) - Tufail memiliki perut yang besar - kami pergi ke pasar untuk menyapa semua orang yang kami temui.\" [Malik, dengan rantai suara] .","language":"bahasa"}],"narrated":[{"text":"At-Tufail bin Ubayy bin Ka\u0027b (May Allah be pleased with him) reported:","language":"english"},{"text":"At-Tufail bin Ubayy bin Ka\u0027b (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"850","hadith_id":"riyadussalihin","text":[{"text":"عن عمران بن الحصين رضي الله عنهما قال‏:‏ جاء رجل إلى النبي صلى الله عليه وسلم فقال‏:‏ السلام عليكم، فرد عليه ثم جلس، فقال النبي صلى الله عليه وسلم‏:‏ “عشر” ثم جاء آخر، فقال‏:‏ السلام عليكم ورحمة الله، فرد عليه فجلس، فقال‏:‏ ‏ \"‏عشرون‏\"‏ ثم جاء آخر، فقال‏:‏ السلام عليكم ورحمة الله وبركاته، فرد عليه فجلس، فقال‏:‏ “ثلاثون” ‏(‏‏(‏رواه أبو داود والترمذي وقال‏:‏ حديث حسن‏)‏‏)‏‏.‏","language":"arabic"},{"text":"A man came to the Prophet (ﷺ) and said: \"As-Salamu \u0027Alaikum (May peace be upon you). The Messenger of Allah (ﷺ) responded to his greeting and the man sat down. The Prophet (ﷺ) said, \"Ten (meaning the man had earned the merit of ten good deeds).\" Another one came and said: \"As-Salamu \u0027Alaikum wa Rahmatullah (May peace be upon you and the Mercy of Allah).\" The Messenger of Allah (ﷺ) responded to his greeting and the man sat down. The Messenger of Allah (ﷺ) said, \"Twenty.\" A third one came and said: \"As-Salamu \u0027Alaikum wa Rahmatullahi wa Barakatuhu (May peace be upon you and the Mercy of Allah and His Blessings).\" The Messenger of Allah (ﷺ) responded to his greeting and the man sat down. The Messenger of Allah (ﷺ) said, \"Thirty.\" [Abu Dawud and At- Tirmidhi, who classified it as Hasan].","language":"english"},{"text":"Seorang pria datang kepada Nabi (ﷺ) dan berkata: \"As-Salamu \u0027Alaikum (semoga damai menyertaimu). Rasulullah (ﷺ) menanggapi salamnya dan pria itu duduk. Nabi (ﷺ) berkata, “Sepuluh (artinya laki-laki itu telah mendapatkan pahala dari sepuluh perbuatan baik).” Yang lain datang dan berkata: “As-Salamu \u0027Alaikum wa Rahmatullah (Semoga kedamaian atasmu dan rahmat Allah).” Rasulullah ( ) menjawab salamnya dan orang itu duduk.Rasulullah (ﷺ) berkata, \"Dua puluh.\" Orang ketiga datang dan berkata: \"As-Salamu \u0027Alaikum wa Rahmatullahi wa Barakatuhu (Semoga kedamaian atasmu dan Rahmat Allah dan Berkah-Nya).” Rasulullah (ﷺ) menjawab salamnya dan pria itu duduk. Rasulullah (ﷺ) berkata, “Tiga puluh.” [Abu Dawud dan At-Tirmidzi, yang mengklasifikasikannya sebagai Hasan].","language":"bahasa"}],"narrated":[{"text":"\u0027Imran bin Husain (May Allah be pleased with them) reported:","language":"english"},{"text":"\u0027Imran bin Husain r.a. melaporkan:","language":"bahasa"}]},{"index":"851","hadith_id":"riyadussalihin","text":[{"text":"وعن عائشة رضي الله عنه قالت‏:‏ قال لي رسول الله صلى الله عليه وسلم‏:‏ “هذا جبريل يقرأ عليك السلام‏\"‏ قالت‏:‏ قلت‏:‏ ‏\"‏وعليه السلام ورحمة الله وبركاته‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ وهكذا وقع في بعض روايات الصحيحين‏:‏ \"وبركاته\" وفي بعضها بحذفها وزيادة الثقة مقبولة","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said to me, \"This is Jibril (Gabriel) who is conveying you greetings of peace.\" I responded: \"Wa \u0027Alaihis-Salamu wa Rahmatullahi wa Barakatuhu (May peace be upon him and the Mercy of Allah and His Blessings).\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata kepadaku, \"Inilah Jibril (Jibril) yang menyampaikan salam damai untukmu.\" Saya menjawab: \"Wa \u0027Alaihis-Salamu wa Rahmatullahi wa Barakatuhu (Semoga damai beserta rahmat Allah dan berkah-Nya).\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"\u0027Aishah (May Allah be pleased with her) reported:","language":"english"},{"text":"\u0027Aisyah r.a. melaporkan:","language":"bahasa"}]},{"index":"852","hadith_id":"riyadussalihin","text":[{"text":"وعن أنس رضي الله عنه أن النبي صلى الله عليه وسلم، كان إذا تكلم بكلمة أعادها ثلاثًا حتى تفهم عنه، وإذا أتى على قوم فسلم عليهم سلم عليهم ثلاثًا‏.‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏ وهذا محمول على ما إذا كان الجمع كثيرًا‏.‏","language":"arabic"},{"text":"Anas (May Allah be pleased with him) reported the Prophet (ﷺ) used to repeat his words thrice so that the meaning thereof would be fully understood, and whenever he came upon a gathering of people, he would greet them. He would repeat Salam thrice. [Al- Bukhari].","language":"english"},{"text":"Anas (semoga Allah meridhoinya) meriwayatkan bahwa Nabi (ﷺ) biasa mengulangi kata-katanya tiga kali sehingga maknanya dapat dipahami sepenuhnya, dan setiap kali dia bertemu dengan sekelompok orang, dia akan menyapa mereka. Dia akan mengulangi Salam tiga kali. [Al-Bukhari] .","language":"bahasa"}],"narrated":[{"language":"english"},{"language":"bahasa"}]},{"index":"853","hadith_id":"riyadussalihin","text":[{"text":"وعن المقداد رضي الله عنه في حديثه الطويل قال‏:‏ كنا نرفع للنبي صلى الله عليه وسلم نصيبه من اللبن، فيجيء من الليل، فيسلم تسليمًا لا يوقظ نائمًا، ويسمع اليقظان، فجاء النبي صلى الله عليه وسلم فسلم كما كان يُسلم‏.‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"We used to reserve for the Prophet (ﷺ) his share of the milk, and he would come at night and offer greetings in such a manner as did not disturb those asleep and was heard only by those who were awake. In fact, the Prophet (ﷺ) came and offered greetings as usual. [Muslim].","language":"english"},{"text":"Kami biasa memesankan untuk Nabi (ﷺ) bagiannya dari susu, dan dia akan datang di malam hari dan memberikan salam sedemikian rupa sehingga tidak mengganggu mereka yang tidur dan hanya didengar oleh mereka yang bangun. Bahkan, Nabi (ﷺ) datang dan memberikan salam seperti biasa. [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Al-Miqdad (May Allah be pleased with him) reported in a long Hadith:","language":"english"},{"text":"Al-Miqdad (semoga Allah meridhoinya) melaporkan dalam sebuah hadits yang panjang:","language":"bahasa"}]},{"index":"854","hadith_id":"riyadussalihin","text":[{"text":"وعن أسماء بنت يزيد رضي الله عنه عنها أن رسول الله صلى الله عليه وسلم، مر في المسجد يومًا، وعصبة من النساء قعود، فألوى بيده بالتسليم‏.‏ ‏(‏‏(‏رواه الترمذي وقال‏:‏ حديث حسن‏)‏‏)‏‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) passed through the mosque one day and there was a group of women (about ten of them) sitting in the mosque. He raised his hand to offer greetings. [At- Tirmidhi, who classified it as Hasan].","language":"english"},{"text":"Rasulullah (ﷺ) melewati masjid suatu hari dan ada sekelompok wanita (sekitar sepuluh dari mereka) duduk di masjid. Dia mengangkat tangannya untuk memberi salam. [At- Tirmidzi, yang mengklasifikasikannya sebagai Hasan] .","language":"bahasa"}],"narrated":[{"text":"Asma\u0027 bint Yazid (May Allah be pleased with her) reported:","language":"english"},{"text":"Asma\u0027 binti Yazid radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"855","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي أمامة رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏ \"‏إن أولى الناس بالله من بدأهم بالسلام‏\"‏ ‏(‏‏(‏رواه أبو داود بإسناد جيد، ورواه الترمذي بنحوه وقال‏:‏ حديث حسن، وقد ذكر بعده‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Prophet (ﷺ) said: Those who are nearest to Allah are they who are first to give a salutation. [Abu Dawud] And At- Tirmidhi narrated its meaning and classified it as Hasan.","language":"english"},{"text":"Nabi (ﷺ) bersabda: Orang yang paling dekat dengan Allah adalah orang yang pertama kali memberi salam. [Abu Dawud] Dan At-Tirmidzi meriwayatkan artinya dan mengklasifikasikannya sebagai Hasan.","language":"bahasa"}],"narrated":[{"text":"Narrated Abu Umamah:","language":"english"},{"text":"Dikisahkan oleh Abu Umamah:","language":"bahasa"}]},{"index":"856","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي جري الهجيمي رضي الله عنه قال‏:‏ أتيت رسول الله صلى الله عليه وسلم فقلت‏:‏ عليك السلام يا رسول الله قال‏:‏ ‏ \"‏لا تقل عليك السلام؛ فإن عليك السلام تحية الموتى‏\"‏‏.‏ ‏(‏‏(‏رواه أبو داود، والترمذي وقال‏:‏ حديث حسن صحيح‏.‏ وقد سبق بطوله‏)‏‏)‏‏.‏","language":"arabic"},{"text":"I saw the Messenger of Allah (ﷺ) and said: \"Alaikas-Salamu ya Rasulallah! (Upon you be peace, O Messenger of Allah)!\" He said, \"Do not say: \u0027Alaikas-Salamu (Upon you be peace).\u0027 This is the Salam to the dead.\" [Abu Dawud and At-Tirmidhi, who classified the hadith as Hasan Sahih].","language":"english"},{"text":"Aku melihat Rasulullah (ﷺ) dan berkata: \"Alaikas-Salamu ya Rasulallah! (Assalamualaikum, ya Rasulullah)!\" Dia berkata, \"Jangan katakan: \u0027Alaikas-Salamu (Semoga damai).\u0027 Ini adalah Salam untuk orang mati.\" [Abu Dawud dan At-Tirmidzi, yang menggolongkan hadits tersebut sebagai Hasan Sahih] .","language":"bahasa"}],"narrated":[{"text":"Abu Juraiy Al-Hujaimi (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Juraiy Al-Hujaimi (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"857","hadith_id":"riyadussalihin","text":[{"text":"عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏\"‏يسلم الراكب على الماشي، والماشي على القاعد، والقليل على الكثير” ‏(‏‏(‏متفق عليه‏)‏‏)‏ وفي رواية للبخاري‏:‏ ‏\"‏والصغير على الكبير‏\"‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \u0027A rider should greet a pedestrian; a pedestrian should greet one who is sitting; and a small group should greet a large group (of people).\u0027\u0027 [Al-Bukhari and Muslim]. The narration in Al-Bukhari adds: The Messenger of Allah (ﷺ) said, \"The young should greet the elderly.\u0027\u0027","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \u0027Seorang pengendara harus menyapa pejalan kaki; pejalan kaki harus menyapa orang yang sedang duduk; dan kelompok kecil harus menyapa kelompok besar (orang).\u0027\u0027 [Al-Bukhari dan Muslim] . Diriwayatkan dalam Al-Bukhari menambahkan: Rasulullah (ﷺ) bersabda, “Yang muda harus menyapa yang tua.\u0027\u0027","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"858","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي أمامة صُدي بن عجلان الباهلي رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ “إن أولى الناس بالله من بدأهم بالسلام‏\"‏ ‏(‏‏(‏رواه أبو داود بإسناد جيد‏)‏‏)‏‏.‏ ورواه الترمذي عن أبي أمامة رضي الله عنه‏:‏ قيل‏:‏ يا رسول الله، الرجلان يلتقيان، أيهما يبدأ بالسلام‏؟‏ قال‏:‏ ‏\"‏أولاهما بالله تعالى‏\"‏ قال الترمذي ‏:‏ حديث حسن‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"The person nearest to Allah is one who is the first to offer greeting.\" [Abu Dawud, with a sound chain]. The narration in At-Tirmidhi is: The Messenger of Allah (ﷺ) was asked: \"O Messenger of Allah! When two persons meet, who should greet the other first?\u0027\u0027 The Messenger of Allah (ﷺ) said, \"The person nearest to Allah (i.e., one who is more obedient and therefore closer to Allah will say: As-Salam first).\"","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, \"Orang yang paling dekat dengan Allah adalah orang yang pertama kali memberi salam.\" [Abu Dawud, dengan rantai suara] . Diriwayatkan dalam At-Tirmidzi adalah: Rasulullah (ﷺ) ditanya: \"Ya Rasulullah! Ketika dua orang bertemu, siapa yang harus menyapa yang lain terlebih dahulu?\u0027\u0027 Rasulullah (ﷺ) berkata, \"Orang itu terdekat dengan Allah (yaitu, orang yang lebih taat dan karena itu lebih dekat kepada Allah akan mengatakan: As-Salam pertama).\"","language":"bahasa"}],"narrated":[{"text":"Abu Umamah Sudaiy bin `Ajlan Al-Bahili (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Umamah Sudaiy bin `Ajlan Al-Bahili radhiyallahu \u0027anhu:","language":"bahasa"}]},{"index":"859","hadith_id":"riyadussalihin","text":[{"text":"عن أبي هريرة رضي الله عنه في حديث المسيء صلاته أنه جاء فصلى، ثم جاء النبي صلى الله عليه وسلم، فسلم عليه، فرد عليه السلام، فقال‏:‏ ‏ \"‏ارجع فصلِ، فإنك لم تصلِ‏\"‏ فرجع فصلى، ثم جاء فسلم على النبي صلى الله عليه وسلم، حتى فعل ذلك ثلاث مرات” ‏(‏‏(‏متفق عليه‏)‏‏)‏","language":"arabic"},{"text":"He came to the Prophet (ﷺ) and greeted him. The Prophet (ﷺ) responded to the greeting and said, \"Go back and repeat your Salat because you have not performed the Salat (properly).\u0027\u0027 He again performed Salat as he had prayed before and came to the Prophet (ﷺ) and greeted him. The Prophet (ﷺ) responded to the greetings (and repeated his words to him). This act of repeating (the Salat and the Salam) was done thrice. [Al-Bukhari and Muslim].","language":"english"},{"text":"Dia datang kepada Nabi (ﷺ) dan menyapanya. Nabi (ﷺ) menanggapi salam tersebut dan berkata, \"Kembalilah dan ulangi shalatmu karena kamu belum melakukan shalat (dengan benar).\u0027\u0027 Dia kembali melakukan shalat seperti yang telah ia doakan sebelumnya dan datang kepada Nabi (ﷺ) dan menyambutnya. Nabi (ﷺ) menanggapi salam (dan mengulangi kata-katanya kepadanya). Tindakan mengulangi (Salat dan Salam) ini dilakukan tiga kali. [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him)reported in the Hadith concerning the person who was at fault in performing his Salat (prayer):","language":"english"},{"text":"Abu Hurairah (ra dengan dia) melaporkan dalam hadits tentang orang yang bersalah dalam melakukan salatnya:","language":"bahasa"}]},{"index":"860","hadith_id":"riyadussalihin","text":[{"text":"وعنه عن رسول الله صلى الله عليه وسلم، قال‏:‏ ‏ \"‏إذا لقي أحدكم أخاه، فليسلم عليه، فإن حالت بينهما شجرة، أو جدار، أو حجر، ثم لقيه، فليسلم عليه‏\"‏ ‏(‏‏(‏رواه أبو داود‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"When one of you meets a brother (in Faith) he should greet him. Then if a tree or a wall or a stone intervenes between them and then he meets him again, he should greet him.\" [Abu Dawud].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, “Jika salah seorang dari kalian bertemu dengan saudara (iman) dia harus menyapanya. Kemudian jika pohon atau tembok atau batu menghalangi di antara mereka dan kemudian dia bertemu dengannya lagi, dia harus menyapanya. .\" [Abu Daud] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"861","hadith_id":"riyadussalihin","text":[{"text":"وعن أنس رضي الله عنه قال‏:‏ قال لي رسول الله صلى الله عليه وسلم ‏:‏ ‏ \"‏يا بُني، إذا دخلت على أهلك، فسلم، يكن بركة عليك، وعلى أهل بيتك‏\"‏ ‏(‏‏(‏رواه الترمذي وقال‏:‏ حديث حسن صحيح‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said to me, \"Dear son, when you enter your house, say As- Salamu \u0027Alaikum to your family, for it will be a blessing both to you and to your family.\" [At-Tirmidhi, who classified it as Hasan Sahih].","language":"english"},{"text":"Rasulullah (ﷺ) berkata kepadaku, \"Anakku, ketika kamu memasuki rumahmu, ucapkan As-Salamu \u0027Alaikum kepada keluargamu, karena itu akan menjadi berkah bagimu dan keluargamu.\" [At-Tirmidzi, yang mengklasifikasikannya sebagai Hasan Sahih] .","language":"bahasa"}],"narrated":[{"text":"Anas bin Malik (May Allah be pleased with him) reported:","language":"english"},{"text":"Anas bin Malik radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"862","hadith_id":"riyadussalihin","text":[{"text":"عن أنس رضي الله عنه أنه مر على صبيان، فسلم عليهم، وقال‏:‏ كان رسول الله صلى الله عليه وسلم يفعله” ‏(‏‏(‏متفق عليه‏)‏‏)‏","language":"arabic"},{"text":"\"Messenger of Allah (ﷺ) used to do the same.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"\"Rasulullah (ﷺ) juga melakukan hal yang sama.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Anas (May Allah be pleased with him) reported that he passed by some children and greeted them. Then he said:","language":"english"},{"text":"Anas (ra dengan dia) melaporkan bahwa dia melewati beberapa anak dan menyapa mereka. Lalu dia berkata:","language":"bahasa"}]},{"index":"863","hadith_id":"riyadussalihin","text":[{"text":"عن سهل بن سعد رضي الله عنه قال‏:‏ كانت فينا امرأة -وفي رواية‏:‏ كانت لنا عجوز- تأخذ من أصول السلق فتطرحه في القدر، وتكركر حبات من شعير، فإذا صلينا الجمعة، وانصرفنا، نُسلم عليها، فتقدمه إلينا‏\"‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","language":"arabic"},{"text":"There was a woman (in another narration; an old woman) among us who would put beet root in a pot and add to it some ground barley. She used to cook them together. On returning from the Friday prayer, we would greet her and she would offer it to us. [Al-Bukhari].","language":"english"},{"text":"Ada seorang wanita (dalam narasi lain; seorang wanita tua) di antara kami yang akan memasukkan akar bit ke dalam pot dan menambahkan beberapa jelai. Dia biasa memasaknya bersama. Sekembalinya dari shalat Jumat, kami akan menyapanya dan dia akan menawarkannya kepada kami. [Al-Bukhari] .","language":"bahasa"}],"narrated":[{"text":"Sahl bin Sa`d (May Allah be pleased with him) reported:","language":"english"},{"text":"Sahl bin Sa`d radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"864","hadith_id":"riyadussalihin","text":[{"text":"وعن أم هانئ فاختة بنت أبي طالب رضي الله عنه قالت‏:‏ أتيت النبي صلى الله عليه وسلم يوم الفتح وهو يغتسل، وفاطمة تستره بثوب، فسلمت، وذكرت الحديث” ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"I went to the Prophet (ﷺ) on the day of the conquest of Makkah. He was taking a bath and Fatimah was screening him with a cloth. I greeted him. And she mentioned the rest of the Hadith. [Muslim].","language":"english"},{"text":"Saya pergi ke Nabi (ﷺ) pada hari penaklukan Mekah. Dia sedang mandi dan Fatimah menyekanya dengan kain. Saya menyapanya. Dan dia menyebutkan sisa hadits. [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Umm Hani (May Allah be pleased with her), the daughter of Abu Talib reported:","language":"english"},{"text":"Ummu Hani (semoga Allah meridhoinya), putri Abu Thalib melaporkan:","language":"bahasa"}]},{"index":"865","hadith_id":"riyadussalihin","text":[{"text":"وعن أسماء بنت يزيد رضي الله عنه قالت‏:‏ مر علينا النبي صلى الله عليه وسلم في نسوة فسلم علينا‏.‏ ‏(‏‏(‏رواه أبو داود، والترمذي وقال‏:‏ حديث حسن، وهذا لفظ أبي داود)) ولفظ الترمذي‏:‏ أن رسول الله صلى الله عليه وسلم مر في المسجد يومًا، وعصبة من النساء قعود، فألوى بيده بالتسليم‏‏‏.‏","language":"arabic"},{"text":"The Prophet (ﷺ) passed by us when we were with a party of women, and he greeted us with salam. [Abu Dawud and At-Tirmidhi who classified it as Hasan]. This is the wording of Abu Dawud. In At-Tirmidhi: that the Messenger of Allah (ﷺ) passed through the Masjid one day, and a group of women were sitting, so he motioned his hand with the salam.","language":"english"},{"text":"Nabi (ﷺ) melewati kami ketika kami bersama sekelompok wanita, dan dia menyapa kami dengan salam. [Abu Dawud dan At-Tirmidzi yang mengklasifikasikannya sebagai Hasan] . Ini adalah kata-kata Abu Dawud. Dalam At-Tirmidzi: bahwa Rasulullah (ﷺ) melewati Masjid pada suatu hari, dan sekelompok wanita sedang duduk, maka dia melambaikan tangannya dengan salam.","language":"bahasa"}],"narrated":[{"text":"Asma bint Yazid (May Allah be pleased with her) reported:","language":"english"},{"text":"Asma binti Yazid radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"866","hadith_id":"riyadussalihin","text":[{"text":"عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏ \"‏ لا تبدءوا اليهود ولا النصارى بالسلام، فإذا لقيتم أحدهم في طريق فاضطروه إلى أضيقه‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"Do not greet the Jews and the Christians before they greet you; and when you meet any one of them on the road, force him to go to the narrowest part of it.\" [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, “Janganlah kamu memberi salam kepada orang Yahudi dan Nasrani sebelum mereka menyapamu; dan jika kamu bertemu salah satu dari mereka di jalan, paksalah dia untuk pergi ke bagian yang paling sempit.” [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"867","hadith_id":"riyadussalihin","text":[{"text":"وعن أنس رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏\"‏إذا سلم عليكم أهل الكتاب فقولوا‏:‏ وعليكم” ‏(‏‏(‏متفق عليه‏)‏‏)‏","language":"arabic"},{"text":"Messenger of Allah (ﷺ) said, \"When the people of the Book greet you, respond with: \u0027Wa \u0027alaikum\u0027 (And upon you)\". [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Jika Ahli Kitab memberi salam kepadamu, jawablah dengan: \u0027Wa \u0027alaikum\u0027 (Dan atasmu)\". [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Anas (May Allah be pleased with him) reported:","language":"english"},{"text":"Anas (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"868","hadith_id":"riyadussalihin","text":[{"text":"وعن أسامة رضي الله عنه أن النبي صلى الله عليه وسلم مر على مجلس فيه أخلاط من المسلمين والمشركين -عبدة الأوثان واليهود- فسلم عليهم النبي صلى الله عليه وسلم‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Prophet (ﷺ) passed by a mixed company of people which included Muslims, polytheists and Jews, and he gave them the greeting (i.e., saying As- Salamu \u0027Alaikum). [Al-Bukhari and Muslim].","language":"english"},{"text":"Nabi (ﷺ) melewati sekelompok orang yang terdiri dari Muslim, musyrik dan Yahudi, dan dia memberi mereka salam (yaitu, mengatakan As-Salamu \u0027Alaikum). [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Usamah bin Zaid (May Allah be pleased with him) reported:","language":"english"},{"text":"Usamah bin Zaid radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"869","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي هريرة رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏\"‏إذا انتهى أحدكم إلى المجلس فليسلم، فإذا أراد أن يقوم فليسلم، فليست الأولى بأحق من الآخرة‏\"‏ ‏(‏‏(‏رواه أبو داود، والترمذي وقال‏:‏ حديث حسن‏\"‏‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"When one of you arrives in a gathering, he should offer Salam to those who are already there, and he should also do so when he intends to depart. The first act of greeting is not more meritorious than the last.\u0027\u0027 [Abu Dawud and At-Tirmidhi].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, “Jika salah seorang dari kalian datang dalam suatu pertemuan, ia harus mengucapkan salam kepada orang-orang yang sudah ada di sana, dan ia juga harus melakukannya ketika ia berniat untuk pergi. Ucapan pertama tidak lebih dari salam. berjasa dari yang terakhir.\u0027\u0027 [Abu Dawud dan At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"870","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي موسي الأشعري رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ “ الاستئذان ثلاث، فإن أذن لك وإلا فارجع‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"Permission is to be sought thrice. If permission is granted, you may enter; otherwise, go back.\" [Al- Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Izin harus diminta tiga kali. Jika izin diberikan, Anda boleh masuk; jika tidak, kembali.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Musa Al-Ash\u0027ari (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Musa Al-Asy\u0027ari r.a. melaporkan:","language":"bahasa"}]},{"index":"871","hadith_id":"riyadussalihin","text":[{"text":"وعن سهل بن سعد قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏ \"‏إنما جعل الاستئذان من أجل البصر‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"Seeking permission to enter (somebody\u0027s house) has been prescribed in order to restrain the eyes (from looking at something we are not supposed to look at).\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Meminta izin untuk masuk (rumah seseorang) telah disyariatkan untuk menahan mata (dari melihat sesuatu yang tidak seharusnya kita lihat).\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Sahl bin Sa\u0027d (May Allah be pleased with him) reported:","language":"english"},{"text":"Sahl bin Sa\u0027d radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"872","hadith_id":"riyadussalihin","text":[{"text":"وعن ربعي بن حراش قال‏:‏ حدثنا رجل من بني عامر استأذن علي النبي صلى الله عليه وسلم وهو في بيت، فقال‏:‏ أألج‏؟‏ فقال رسول الله صلى الله عليه وسلم لخادمه‏:‏ ‏\"‏أخرج إلي هذا وعلمه الاستئذان، فقل له‏:‏ قل‏:‏ السلام عليكم، أأدخل‏؟‏” فسمعه الرجل فقال‏:‏ السلام عليكم، أأدخل‏؟‏ فأذن له النبي صلى الله عليه وسلم ، فدخل‏.‏ ‏(‏‏(‏رواه أبو داود بإسناد صحيح‏)‏‏)‏‏.‏","language":"arabic"},{"text":"A man of Banu \u0027Amir tribe has told us that he had asked the Prophet (ﷺ) for permission to enter when he was at home. He said: \"May I enter?\" the Messenger of Allah (ﷺ) said to the servant, \"Go out and instruct him about the manner of seeking permission. Tell him to say: As-Salamu \u0027Alaikum (may peace be upon you). May I come in?\" The man heard this and said: \"As-Salamu \u0027Alaikum (may peace be upon you). May I come in?\" The Prophet (ﷺ) then granted him permission and he entered. [Abu Dawud].","language":"english"},{"text":"Seorang laki-laki dari suku Banu \u0027Amir mengatakan kepada kami bahwa dia telah meminta izin kepada Nabi (ﷺ) untuk masuk ketika dia berada di rumah. Dia berkata: \"Bolehkah saya masuk?\" Rasulullah (ﷺ) berkata kepada hamba itu, \"Keluarlah dan beri tahu dia tentang cara meminta izin. Katakan padanya untuk mengatakan: As-Salamu \u0027Alaikum (semoga damai menyertaimu). Bolehkah saya masuk?\" Pria itu mendengar ini dan berkata: \"As-Salamu \u0027Alaikum (semoga damai menyertaimu). Bolehkah saya masuk?\" Nabi (ﷺ) kemudian memberinya izin dan dia masuk. [Abu Daud] .","language":"bahasa"}],"narrated":[{"text":"Rib\u0027i bin Hirash (May Allah be pleased with him) reported:","language":"english"},{"text":"Rib\u0027i bin Hirash (ra dengan dia) melaporkan:","language":"bahasa"}]},{"index":"873","hadith_id":"riyadussalihin","text":[{"text":"عن كلدة بن الحنبل رضي الله عنه قال‏:‏ أتيت النبي صلى الله عليه وسلم ، فدخلت عليه ولم أسلم، فقال النبي صلى الله عليه وسلم ‏:‏ ‏ \"‏ارجع فقل السلام عليكم أأدخل‏؟‏‏\"‏ ‏(‏‏(‏رواه أبو داود، والترمذي وقال‏:‏ حديث حسن‏)‏‏)‏‏.‏","language":"arabic"},{"text":"I visited the Prophet (ﷺ) and I entered his house without seeking permission. So he said, \"Go back and say: \u0027As-Salamu \u0027alaikum (may peace be upon you). May I come in?\"\u0027 [Abu Dawud and At- Tirmidhi].","language":"english"},{"text":"Saya mengunjungi Nabi (ﷺ) dan saya memasuki rumahnya tanpa meminta izin. Jadi dia berkata, \"Kembalilah dan katakan: \u0027As-Salamu \u0027alaikum (semoga damai menyertaimu). Bolehkah saya masuk?\"\u0027 [Abu Dawud dan At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Kildah bin Al-Hanbal (May Allah be pleased with him) reported:","language":"english"},{"text":"Kildah bin Al-Hanbal (ra dengan dia) melaporkan:","language":"bahasa"}]},{"index":"874","hadith_id":"riyadussalihin","text":[{"text":"عن أنس رضي الله عنه في حديثه المشهور في الإسراء قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏ \"‏ثم صعد بي جبريل إلي السماء الدنيا فاستفتح، فقيل‏:‏ من هذا‏؟‏ قال‏:‏ جبريل، قيل‏:‏ومن معك‏؟‏ قال‏:‏ محمد‏.‏ ثم صعد إلي السماء الثانية والثالثة والرابعة وسائرهن، ويقال في باب كل سماء‏:‏ من هذا‏؟‏ فيقول‏:‏ جبريل‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"`Who is there?\u0027 He replied: `Jibril.\u0027 He was asked: `Who is with you?\u0027 He said: `Muhammad.\u0027 Then he ascended to the second heaven and requested for the opening of the gate. He was asked: `Who is there?\u0027 He said: `Jibril.\u0027 He was asked: `Who is with you?\u0027 He replied: `Muhammad.\u0027 In the same way he ascended to the third, fourth and all the heavens (i.e., until the seventh). At all of the gates he was asked: `Who is there?\u0027 He replied: Jibril.\u0027\u0027\u0027 [Al-Bukhari and Muslim].","language":"english"},{"text":"\u0027Siapa disana?\u0027 Dia menjawab: \u0027Jibril.\u0027 Dia ditanya: \u0027Siapa yang bersamamu?\u0027 Dia berkata: \u0027Muhammad.\u0027 Kemudian dia naik ke surga kedua dan meminta dibukanya pintu gerbang. Dia ditanya: \u0027Siapa di sana?\u0027 Dia berkata: \u0027Jibril.\u0027 Dia ditanya: \u0027Siapa yang bersamamu?\u0027 Dia menjawab: \u0027Muhammad.\u0027 Dengan cara yang sama ia naik ke langit ketiga, keempat dan semua langit (yaitu, sampai ketujuh). Di semua gerbang dia ditanya: \u0027Siapa di sana?\u0027 Dia menjawab: Jibril.\u0027\u0027\u0027 [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Anas (May Allah be pleased with him) reported in the course of his famous Hadith pertaining to Al-Isra\u0027 (the Ascension) that Messenger of Allah (ﷺ) said, \"Then Jibril (Gabriel) ascended along with me to the nearest heaven and requested for the gate to be opened. He was asked:","language":"english"},{"text":"Anas (semoga Allah meridhoinya) melaporkan dalam haditsnya yang terkenal tentang Al-Isra\u0027 (Naik) bahwa Rasulullah (ﷺ) berkata, \"Kemudian Jibril (Jibril) naik bersamaku ke surga terdekat. dan meminta pintu gerbang dibuka.Dia ditanya:","language":"bahasa"}]},{"index":"875","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي ذر رضي الله عنه قال‏:‏ خرجت ليلة من الليالي، فإذا رسول الله صلى الله عليه وسلم يمشي وحده، فجعلت أمشي في ظل القمر، فالتفت فرآني فقال‏:‏ ‏ \"‏من هذا‏؟‏‏\"‏ فقلت‏:‏ أبو ذر، ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"I stepped out one night and saw the Messenger of Allah (ﷺ) walking by himself. I began to walk in the moonlit night. He turned round and saw me and asked, \"Who is there?\" I replied: \"Abu Dharr.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Suatu malam saya keluar dan melihat Rasulullah () berjalan sendirian. Aku mulai berjalan di malam yang diterangi cahaya bulan. Dia berbalik dan melihat saya dan bertanya, \"Siapa di sana?\" Saya menjawab: \"Abu Dzar.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Dharr (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Dzar radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"876","hadith_id":"riyadussalihin","text":[{"text":"وعن أم هانيء رضي الله عنها قالت‏:‏ أتيت النبي صلى الله عليه وسلم وهو يغتسل وفاطمة تستره فقال ‏ \"‏ من هذه‏؟‏‏\"‏ فقلت‏:‏ أنا أم هانيء‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"I went to the Prophet (ﷺ) who was taking a bath while Fatimah was screening him. He asked, \"Who is there?\" I replied: \"I am Umm Hani.\" [Al- Bukhari and Muslim].","language":"english"},{"text":"Saya pergi ke Nabi (ﷺ) yang sedang mandi sementara Fatimah menyaringnya. Dia bertanya, \"Siapa di sana?\" Saya menjawab: \"Saya Ummu Hani.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Umm Hani (May Allah be pleased with her) reported:","language":"english"},{"text":"Ummu Hani (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"877","hadith_id":"riyadussalihin","text":[{"text":"وعن جابر رضي الله عنه قال‏:‏ أتيت النبي صلى الله عليه وسلم فدققت الباب، فقال ‏\"‏من ذا‏؟‏‏\"‏ فقلت‏:‏ أنا، فقال‏:‏ ‏\"‏أنا أنا‏؟‏‏!‏‏\"‏ كـأنه كرهها ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"I went to the Prophet (ﷺ) and knocked at the door (to seek permission). He asked, \"Who is there?\" I said: \"I\". He repeated, \" I, I?!\" as if he disliked it. [Al-Bukhari and Muslim].","language":"english"},{"text":"Saya pergi ke Nabi (ﷺ) dan mengetuk pintu (untuk meminta izin). Dia bertanya, \"Siapa di sana?\" Saya berkata: \"Saya\". Dia mengulangi, \"Aku, aku?!\" seolah-olah dia tidak menyukainya. [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Jabir (May Allah be pleased with him) reported:","language":"english"},{"text":"Jabir (ra dengan dia) melaporkan:","language":"bahasa"}]},{"index":"878","hadith_id":"riyadussalihin","text":[{"text":"عن أبي هريرة رضي الله عنه أن النبي صلى الله عليه وسلم قال‏:‏ ‏ \"‏إن الله يحب العطاس، ويكره التثاؤب، فإذا عطس أحدكم وحمد الله تعالي كان حقاً علي كل مسلم سمعه أن يقول له‏:‏يرحمك الله، وأما التثاؤب فإنما هو من الشيطان، فإذا تثاءب أحدكم فليرده ما استطاع، فإن أحدكم إذا تثاءب ضحك منه الشيطان‏\"‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Prophet (ﷺ) said, \"Allah likes sneezing and dislikes yawning. When any one of you sneezes and says `Al-hamdu lillah (praise be to Allah)\u0027, it becomes obligatory upon every Muslim who hears him to respond with `Yarhamuk-Allah (may Allah have mercy on you)\u0027. Yawning is from the devil. When one of you feels like yawning, he should restrain it as much as possible, for the devil laughs when one of you yawns.\" [Al-Bukhari].","language":"english"},{"text":"Nabi (ﷺ) bersabda, “Allah menyukai bersin dan tidak menyukai menguap. Jika salah seorang dari kalian bersin dan mengucapkan \u0027Al-hamdu lillah (segala puji bagi Allah)\u0027, maka wajib atas setiap Muslim yang mendengarnya untuk menanggapi dengan `Yarhamuk -Allah (semoga Allah merahmatimu)\u0027. Menguap berasal dari setan. Jika salah satu dari kalian ingin menguap, ia harus menahannya sebisa mungkin, karena setan tertawa ketika salah satu dari kalian menguap.\" [Al-Bukhari] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"879","hadith_id":"riyadussalihin","text":[{"text":"وعنه عن النبي صلى الله عليه وسلم الله قال‏:‏ ‏ \"‏إذا عطس أحدكم فليقل‏:‏ الحمد لله؛ وليقل له أخوه أو أصحابه‏:‏ يرحمك الله، فإذا قال له‏:‏ يرحمك الله، فليقل‏:‏ يهديكم الله ويصلح بالكم‏\"‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Prophet (ﷺ) said, \"When one of you sneezes he should say: \u0027Al-hamdu lillah (praise be to Allah),\u0027 and his brother or his companion should say to him: \u0027Yarhamuk-Allah (may Allah have mercy on you).\u0027 When he says this he should reply: \u0027Yahdikum-ullah wa yuslihu balakum (may Allah guide you and render sound your state of affairs).\"\u0027 [Al- Bukhari].","language":"english"},{"text":"Nabi (ﷺ) berkata, \"Jika salah satu dari kalian bersin, dia harus mengatakan: \u0027Al-hamdu lillah (segala puji bagi Allah)\u0027 dan saudaranya atau temannya harus mengatakan kepadanya: \u0027Yarhamuk-Allah (semoga Allah merahmatinya). padamu).\u0027 Ketika dia mengatakan ini, dia harus menjawab: \u0027Yahdikum-ullah wa yuslihu balakum (semoga Allah memberimu petunjuk dan menjadikan keadaanmu baik-baik saja).\"\u0027 [Al-Bukhari] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"880","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي موسي رضي الله عنه قال‏:‏ سمعت رسول الله صلى الله عليه وسلم يقول‏:‏ ‏ \"‏إذا عطس أحدكم فحمد الله فشمتوه، فإن لم يحمد الله فلا تشمتوه‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"When one of you sneezes and praises Allah (i.e., says Al-hamdu lillah), you should invoke Allah\u0027s Mercy upon him (i.e., say Yarhamuk-Allah); but if he does not praise Allah, you should not respond.\" [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Ketika salah satu dari kalian bersin dan memuji Allah (yaitu, mengucapkan Al-hamdu lillah), Anda harus memohon rahmat Allah atasnya (yaitu, mengatakan Yarhamuk-Allah); tetapi jika dia tidak memuji Allah, Anda tidak harus menanggapi.\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Musa (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Musa (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"881","hadith_id":"riyadussalihin","text":[{"text":"وعن أنس رضي الله عنه قال‏:‏ عطس رجلان عند النبي صلى الله عليه وسلم ، فشمت أحدهما ولم يشمت الآخر، فقال الذي لم يشمته‏:‏ عطس فلان فشمته، وعطست فلم تشمتني‏؟‏ فقال‏:‏ ‏ \"‏هذا حمد الله، وإنك لم تحمد الله‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","language":"arabic"},{"text":"When two men sneezed in the presence of the Prophet (ﷺ), he responded to one with \"Yarhamuk-Allah (may Allah have mercy on you)\" and did not respond to the other. The latter said to him: \"You invoked a blessing on this man but did not do so in my case.\" The Prophet (ﷺ) replied, \"He praised Allah (i.e., he said \u0027Al-hamdu lillah\u0027) but you did not.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Ketika dua orang bersin di hadapan Nabi (ﷺ), dia menjawab satu dengan \"Yarhamuk-Allah (semoga Allah merahmatimu)\" dan tidak menanggapi yang lain. Yang terakhir berkata kepadanya: \"Anda memohon berkah pada orang ini tetapi tidak melakukannya dalam kasus saya.\" Nabi (ﷺ) menjawab, \"Dia memuji Allah (yaitu, dia mengatakan \u0027Al-hamdu lillah\u0027) tetapi kamu tidak.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Anas (May Allah be pleased with him) reported:","language":"english"},{"text":"Anas (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"882","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي هريرة رضي الله عنه قال‏:‏ كان رسول الله صلى الله عليه وسلم إذا عطس وضع يده أو ثوبه علي فيه، وخفض -أو غض- بها صوته‏.‏ شك الراوي‏.‏ ‏(‏‏(‏رواه أبو داود، والترمذي وقال‏:‏ حديث حسن صحيح‏)‏‏)‏‏.‏","language":"arabic"},{"text":"Whenever the Messenger of Allah (ﷺ) sneezed, he would cover his mouth with his hand or a piece of cloth - thereby suppressing the sound. [Abu Dawud and At-Tirmidhi].","language":"english"},{"text":"Setiap kali Rasulullah (ﷺ) bersin, dia akan menutup mulutnya dengan tangan atau selembar kain - sehingga menekan suara. [Abu Dawud dan At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"883","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي موسي رضي الله عنه قال‏:‏ كان اليهود يتعاطسون عند رسول الله صلى الله عليه وسلم يرجون أن يقول لهم‏:‏ يرحمكم الله، فيقول‏:‏ ‏\"‏‏\"‏يهديكم الله ويصلح بالكم‏\"‏ ‏(‏‏(‏رواه أبو داود، والترمذي وقال‏:‏ حديث حسن صحيح‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Jews used to intentionally sneeze in the presence of the Messenger of Allah (ﷺ) hoping that he would say to them: \u0027Yarhamukum-ullah (may Allah have mercy on you),\u0027 but he would respond with: \"Yahdikum-ullahu wa yuslihu balakum (may Allah guide you and render sound your state of affairs).\" [Abu Dawud and At- Tirmidhi].","language":"english"},{"text":"Orang-orang Yahudi biasa bersin dengan sengaja di hadapan Rasulullah (ﷺ) berharap bahwa dia akan mengatakan kepada mereka: \u0027Yarhamukum-ullah (semoga Allah merahmatimu)\u0027 tetapi dia akan menjawab dengan: \"Yahdikum-ullahu wa yuslihu balakum (semoga Allah memberi hidayah dan menjadikan keadaanmu baik-baik saja).” [Abu Dawud dan At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Abu Musa (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Musa (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"884","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي سعيد الخدري رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏ \"‏إذا تثاءب أحدكم فليمسك بيده علي فيه، فإن الشيطان يدخل‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"When one yawns, he should put his hand over his mouth, otherwise the devil will enter.\" [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Jika seseorang menguap, dia harus menutup mulutnya dengan tangannya, jika tidak setan akan masuk.\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Sa\u0027id Al-Khudri (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Sa\u0027id Al-Khudri r.a. melaporkan:","language":"bahasa"}]},{"index":"885","hadith_id":"riyadussalihin","text":[{"text":"عن أبي الخطاب قتادة قال‏:‏ قلت لأنس‏:‏ أكانت المصافحة في أصحاب رسول الله صلى الله عليه وسلم ‏؟‏ قال‏:‏ نعم‏\"‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","language":"arabic"},{"text":"I asked Anas: \"Did the Companions of the Messenger of Allah (ﷺ) use to shake hands?\u0027\u0027 He said: \"Yes.\u0027\u0027 [Al-Bukhari].","language":"english"},{"text":"Saya bertanya kepada Anas: \"Apakah para sahabat Rasulullah (ﷺ) biasa berjabat tangan?\" Dia menjawab: \"Ya.\" [Al-Bukhari] .","language":"bahasa"}],"narrated":[{"text":"Abu Khattab Qatadah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Khattab Qatadah r.a. melaporkan:","language":"bahasa"}]},{"index":"886","hadith_id":"riyadussalihin","text":[{"text":"وعن أنس رضي الله عنه قال‏:‏ لما جاء أهل اليمن قال رسول الله صلى الله عليه وسلم ‏:‏ “قد جاءكم أهل اليمن، وهم أول من جاء بالمصافحة‏\"‏ ‏(‏‏(‏رواه أبو داود بإسناد صحيح‏)‏‏)‏‏.‏","language":"arabic"},{"text":"When the people of Yemen came, the Messenger of Allah (ﷺ) said, \"The people of Yemen have visited you. They are the first to introduce the tradition of handshaking.\" [Abu Dawud].","language":"english"},{"text":"Ketika orang-orang Yaman datang, Rasulullah (ﷺ) berkata, \"Orang-orang Yaman telah mengunjungi Anda. Merekalah yang pertama kali memperkenalkan tradisi berjabat tangan.\" [Abu Daud] .","language":"bahasa"}],"narrated":[{"text":"Anas (May Allah be pleased with him) reported:","language":"english"},{"text":"Anas (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"887","hadith_id":"riyadussalihin","text":[{"text":"وعن البراء رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏ \"‏ما من مسلمين يلتقيان فيتصافحان إلا غفر لهما قبل أن يفترقا‏\"‏ ‏(‏‏(‏رواه أبو داود‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"Two Muslims will not meet and shake hands without having their sins forgiven (by Allah ) before they depart.\" [Abu Dawud].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, “Dua orang Muslim tidak akan bertemu dan berjabat tangan tanpa diampuni dosanya (oleh Allah) sebelum mereka pergi.” [Abu Daud] .","language":"bahasa"}],"narrated":[{"text":"Al-Bara\u0027 (May Allah be pleased with him) reported:","language":"english"},{"text":"Al-Bara\u0027 radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"888","hadith_id":"riyadussalihin","text":[{"text":"وعن أنس رضي الله عنه قال‏:‏ قال رجل‏:‏ يا رسول الله، الرجل منا يلقي أخاه أو صديقه، أينحني له قال‏:‏ ‏\"‏لا‏\"‏ قال‏:‏ أفيلتزمه ويقبله‏؟‏فال‏:‏ ‏\"‏لا‏\"‏ قال‏:‏ فيأخذ بيده ويصافحه‏؟‏ قال‏:‏‏\"‏نعم‏\"‏ ‏(‏‏(‏رواه الترمذي وقال‏:‏ حديث حسن‏)‏‏)‏‏.‏","language":"arabic"},{"text":"A man asked: \"O Messenger of Allah! When a man meets a brother or a friend, should he bow to him?\" He said, \"No.\" The man asked whether he should embrace and kiss him? The Messenger of Allah (ﷺ) replied, \"No.\" He asked whether he should hold his hand and shake it? The Messenger of Allah (ﷺ) replied, \"Yes.\" [At-Tirmidhi].","language":"english"},{"text":"Seorang pria bertanya: \"Ya Rasulullah! Ketika seorang pria bertemu saudara atau teman, apakah dia harus tunduk padanya?\" Dia berkata, \"Tidak.\" Pria itu bertanya apakah dia harus memeluk dan menciumnya? Rasulullah (ﷺ) menjawab, “Tidak.” Dia bertanya apakah dia harus memegang tangannya dan menjabatnya? Rasulullah (ﷺ) menjawab, \"Ya.\" [At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Anas (May Allah be pleased with him) reported:","language":"english"},{"text":"Anas (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"889","hadith_id":"riyadussalihin","text":[{"text":"وعن صفوان بن عسال رضي الله عنه قال‏:‏ قال يهودي لصاحبه‏:‏ اذهب بنا إلي هذا النبي صلى الله عليه وسلم فأتيا رسول الله صلى الله عليه وسلم ، فسألاه عن تسع آيات بينات؛ فذكر الحديث إلي قوله‏:‏ فقبلا يده ورجله، وقالا‏:‏ نشهد أنك نبي‏.‏ ‏(‏‏(‏رواه الترمذي وغيره بأسانيد صحيحة‏)‏‏)‏‏.‏","language":"arabic"},{"text":"A Jew asked his companion to take him to the Prophet (ﷺ); and when they came to the Messenger of Allah (ﷺ), they asked him about the nine clear signs (given to Prophet Musa). Safwan narrated the long Hadith which concludes: They kissed the hands and feet of the Messenger of Allah (ﷺ) and said: \"We testify that you are a Prophet.\" [At-Tirmidhi]","language":"english"},{"text":"Seorang Yahudi meminta temannya untuk membawanya ke Nabi (ﷺ); dan ketika mereka datang ke Rasulullah (ﷺ), mereka bertanya kepadanya tentang sembilan tanda yang jelas (diberikan kepada Nabi Musa). Safwan meriwayatkan hadits panjang yang menyimpulkan: Mereka mencium tangan dan kaki Rasulullah (ﷺ) dan berkata: \"Kami bersaksi bahwa Anda adalah seorang Nabi.\" [At-Tirmidzi]","language":"bahasa"}],"narrated":[{"text":"Safwan bin \u0027Assal (May Allah be pleased with him) reported:","language":"english"},{"text":"Safwan bin \u0027Assal (ra dengan dia) melaporkan:","language":"bahasa"}]},{"index":"890","hadith_id":"riyadussalihin","text":[{"text":"وعن ابن عمر، رضي الله عنهما، قصة قال فيها‏:‏ فدنونا من النبي صلى الله عليه وسلم فقبلنا يده‏\"‏ ‏(‏‏(‏رواه أبو داود‏)‏‏)‏‏.‏","language":"arabic"},{"text":"\"We came near the Prophet (ﷺ) and kissed his hand.\" [Abu Dawud]","language":"english"},{"text":"\"Kami mendekati Nabi (ﷺ) dan mencium tangannya.\" [Abu Daud]","language":"bahasa"}],"narrated":[{"text":"In a narration of Ibn Umar (May Allah be pleased with them) at the end of the narration of the Hadith ) he said:","language":"english"},{"text":"Dalam sebuah riwayat dari Ibnu Umar (Semoga Allah meridhoi mereka) di akhir riwayat hadits) dia berkata:","language":"bahasa"}]},{"index":"891","hadith_id":"riyadussalihin","text":[{"text":"وعن عائشة رضي الله عنها قالت‏:‏ قدم زيد بن حارثة المدينة ورسول الله صلى الله عليه وسلم في بيتي، فأتاه فقرع الباب، فقام إليه النبي صلى الله عليه وسلم يجر ثوبه، فاعتنقه وقبله‏\"‏ ‏(‏‏(‏رواه الترمذي وقال‏:‏ حديث حسن‏)‏‏)‏‏.‏","language":"arabic"},{"text":"Zaid bin Harithah came to the Messenger of Allah (ﷺ) when he was in my house. Zaid knocked at the door. The Prophet (ﷺ) rose to receive him, trailing his garment. He embraced and kissed him. [At- Tirmidhi].","language":"english"},{"text":"Zaid bin Harithah datang kepada Rasulullah (ﷺ) ketika dia berada di rumahku. Zaid mengetuk pintu. Nabi ( ) bangkit untuk menerimanya, mengikuti pakaiannya. Dia memeluk dan menciumnya. [At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"\u0027Aishah (May Allah be pleased with her) reported:","language":"english"},{"text":"\u0027Aisyah r.a. melaporkan:","language":"bahasa"}]},{"index":"892","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي ذر، رضي الله عنه، قال‏:‏ قال لي رسول الله صلى الله عليه وسلم ‏:‏ ‏ \"‏لا تحقرن من المعروف شيئاً، ولو أن تلقي أخاك بوجه طلق‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said to me, \"Do not belittle any good deed, even your meeting with your brother (Muslim) with a cheerful face.\" [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata kepadaku, \"Jangan meremehkan suatu perbuatan baik, bahkan pertemuanmu dengan saudaramu (Muslim) dengan wajah ceria.\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Dharr (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Dzar radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"893","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي هريرة رضي الله عنه قال‏:‏ قبل النبي،صلى الله عليه وسلم الحسن بن على، رضي الله عنهما، فقال الأقرع بن حابس‏:‏ إن لي عشرة من الولد ما قبلت منهم أحداً‏.‏ فقال رسول الله صلى الله عليه وسلم ‏:‏ ‏ \"‏من لا يرحم لا يرحم‏!‏‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","language":"arabic"},{"text":"The Prophet (ﷺ) kissed his grandson Hasan bin \u0027Ali in the presence of Aqra\u0027 bin Habis. Thereupon Aqra\u0027 remarked: \"I have ten children and I have never kissed any one of them.\" The Messenger of Allah (ﷺ) cast a glance upon him and said, \"He who does not show mercy to others, will not be shown mercy.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Nabi (ﷺ) mencium cucunya Hasan bin \u0027Ali di hadapan Aqra\u0027 bin Habis. Kemudian Aqra\u0027 berkata: \"Saya memiliki sepuluh anak dan saya tidak pernah mencium salah satu dari mereka.\" Rasulullah (ﷺ) meliriknya dan berkata, \"Siapa yang tidak menunjukkan belas kasihan kepada orang lain, tidak akan disayangi.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]}]