[{"index":"1393","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي هريرة رضي الله عنه أن النبي صلى الله عليه وسلم أتي ليلة أسري به بقدحين من خمر ولبن، فنظر إليهما فأخذ اللبن، فقال جبريل صلى الله عليه وسلم‏:‏ ‏\"‏الحمد لله الذي هداك للفطرة لو أخذت الخمر غوت أمتك” ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"On the Night of Al-Isra (the Night of Ascension) the Prophet (ﷺ) was presented with two drinking vessels: one full of wine and the other one full of milk. He looked at them. Then he took the vessel which was full of milk. Thereupon Jibril (Gabriel) said: \"Al-hamdu lillah (praise be to Allah) Who has guided you to that, which is in accord with Fitrah (i.e., Islamic Monotheism; pure nature of Islam). Had you selected wine, your people would have gone astray.\" [Muslim].","language":"english"},{"text":"Pada Malam Isra (Malam Kenaikan) Nabi (ﷺ) disajikan dengan dua bejana minum: satu penuh anggur dan yang lainnya penuh susu. Dia melihat mereka. Kemudian dia mengambil bejana yang berisi susu. Kemudian Jibril (Jibril) berkata: \"Al-hamdu lillah (segala puji bagi Allah) Yang telah membimbing Anda untuk itu, yang sesuai dengan Fitrah (yaitu, Tauhid Islam; sifat murni Islam). Seandainya Anda memilih anggur, umat Anda akan tersesat.\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"1394","hadith_id":"riyadussalihin","text":[{"text":"وعنه عن رسول الله صلى الله عليه وسلم قال‏:‏ ‏ \"‏كل أمر ذي بال لا يبدأ فيه‏:‏ بالحمد لله فهو أقطع‏\"‏ حديث حسن، ‏(‏‏(‏رواه أبو داود وغيره‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"Any matter of importance which is not begun with Al-hamdu lillah (praise be to Allah) remains defective.\" [Abu Dawud].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, \"Setiap hal penting yang tidak dimulai dengan Al-hamdu lillah (segala puji bagi Allah) tetap cacat.\" [Abu Daud] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"1395","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي موسى الأشعري رضي الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏ \"‏إذا مات ولد العبد قال الله تعالى لملائكته‏:‏ قبضتم ولد عبدي‏؟‏ فَيقولون : نَعَمْ ، فيقول : قَبَضْتُمْ ثَمَرَةَ فُؤادِهِ ؟ فيقولون : نَعَمْ ، فيقول : فماذا قال عبدي‏؟‏ فيقولون‏:‏ حمدك واسترجع، فيقول الله تعالى‏:‏ ابنوا لعبدي بيتًا في الجنة، وسموه بيت الحمد‏\"‏‏.‏ رواه الترمذي وقال حديث حسن‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"When a slave\u0027s child dies, Allah the Most High asks His angels, \u0027Have you taken out the life of the child of My slave?\" They reply in the affirmative. He then asks, \u0027Have you taken the fruit of his heart?\u0027 They reply in the affirmative. Thereupon he asks, \u0027What has My slave said?\u0027 They say: \u0027He has praised You and said: Inna lillahi wa inna ilaihi raji\u0027un (We belong to Allah and to Him we shall be returned). Allah says: \u0027Build a house for My slave in Jannah and name it as Bait-ul-Hamd (the House of Praise).\"\u0027 [At-Tirmidhi].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Ketika anak seorang budak meninggal, Allah Yang Maha Tinggi bertanya kepada malaikat-Nya, \u0027Apakah kamu telah mencabut nyawa anak hamba-Ku?\" Mereka menjawab dengan setuju. Dia kemudian bertanya, \u0027Sudahkah kamu mengambil buah hatinya?\u0027 Mereka menjawab dengan setuju. Kemudian dia bertanya, \u0027Apa yang dikatakan hamba-Ku?\u0027 Mereka berkata: \u0027Dia memuji-Mu dan berkata: Inna lillahi wa inna ilaihi raji\u0027un (Kami adalah milik Allah dan kepada-Nya kami akan dikembalikan). Allah berfirman: \u0027Bangunlah rumah untuk hamba-Ku di Jannah dan beri nama Bait-ul-Hamd (Rumah Pujian).\"\u0027 [At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Abu Musa Al-Ash\u0027ari (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Musa Al-Asy\u0027ari r.a. melaporkan:","language":"bahasa"}]},{"index":"1396","hadith_id":"riyadussalihin","text":[{"text":"وعن أنس رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏ \"‏إن الله ليرضى عن العبد يأكل الأكلة فيحمده عليها، ويشرب الشربة، فيحمده عليها‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"Allah is pleased with His slave who says: \u0027Al-hamdu lillah (praise be to Allah)\u0027 when he takes a morsel of food and drinks a draught of water.\" [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Allah senang dengan hamba-Nya yang mengatakan: \u0027Al-hamdu lillah (segala puji bagi Allah)\u0027 ketika dia mengambil sesuap makanan dan minum seteguk air.\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Anas bin Malik (May Allah be pleased with him) reported:","language":"english"},{"text":"Anas bin Malik radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]}]