[{"index":"956","hadith_id":"riyadussalihin","text":[{"text":"عن كعب بن مالك، رضي الله عنه أن النبي صلى الله عليه وسلمى الله عليه وسلم الله عليه وسلم خرج في غزوة تبوك يوم الخميس، وكان يحب أن يخرج يوم الخميس‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏ وفي رواية في “الصحيحين” لقلما كان رسول الله صلى الله عليه وسلم يخرج إلا في يوم الخميس‏.‏","language":"arabic"},{"text":"The Prophet (ﷺ) set out on Thursday for the expedition of Tabuk. He liked to set out on a journey on Thursdays. [Al-Bukhari and Muslim]","language":"english"},{"text":"Nabi (ﷺ) berangkat pada hari Kamis untuk ekspedisi Tabuk. Dia suka melakukan perjalanan pada hari Kamis. [Al-Bukhari dan Muslim]","language":"bahasa"}],"narrated":[{"text":"Ka\u0027b bin Malik (May Allah be pleased with him) reported:","language":"english"},{"text":"Ka\u0027b bin Malik radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"957","hadith_id":"riyadussalihin","text":[{"text":"وعن صخر بن وداعة الغامدي الصحابي رضي الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ “اللهم بارك لأمتي في بكورها‏\"‏ وكان إذا بعث سرية أو جيشاً بعثهم من أول النهار‏.‏ وكان صخر تاجراً فكان يبعث تجارته أول النهار، فأثري وكثر ماله” ‏(‏‏(‏رواه أبو داود والترمذي وقال‏:‏ حديث حسن‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"O Allah! Bless my people in the early part of the day (morning). Whenever he dispatched a detachment or an army-unit, he would dispatch it at the beginning of the day (soon after dawn). The narrator, Sakhr (May Allah be pleased with him) was a merchant, and he used to send off his merchandise at the beginning of the day. So his trade flourished and he made a good fortune. [At-Tirmidhi and Abu Dawud].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Ya Allah! Berilah berkah kepada umatku di awal hari (pagi). Setiap kali dia mengirim detasemen atau unit tentara, dia akan mengirimkannya di awal hari (segera). setelah fajar). Perawinya, Sakhr (ra dengan dia) adalah seorang pedagang, dan dia biasa mengirim barang dagangannya di awal hari. Jadi perdagangannya berkembang dan dia mendapat keberuntungan. [At-Tirmidzi dan Abu Daud] .","language":"bahasa"}],"narrated":[{"text":"Sakhr bin Wada\u0027ah Al-Ghamidi (May Allah be pleased with him) reported:","language":"english"},{"text":"Sakhr bin Wada\u0027ah Al-Ghamidi (ra dengan dia) melaporkan:","language":"bahasa"}]},{"index":"958","hadith_id":"riyadussalihin","text":[{"text":"عن ابن عمر رضي الله عنهما قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏لو أن الناس يعلمون من الوحدة ما أعلم ما سار راكب بليل وحده” ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"Were people to know of what I know about the dangers of travelling alone, no rider would travel alone at night.\" [Al-Bukhari].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Seandainya orang mengetahui apa yang saya ketahui tentang bahaya bepergian sendirian, tidak ada pengendara yang bepergian sendirian di malam hari.\" [Al-Bukhari] .","language":"bahasa"}],"narrated":[{"text":"Ibn \u0027Umar (May Allah be pleased with them) reported:","language":"english"},{"text":"Ibnu \u0027Umar radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"959","hadith_id":"riyadussalihin","text":[{"text":"وعن عمر بن شعيب عن أبيه عن جده رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ “الراكب شيطان والراكبان شيطانان والثلاثة ركب‏\"‏ ‏(‏‏(‏رواه أبو داود والترمذي والنسائي بأسانيد صحيحة، وقال الترمذي‏:‏ حديث حسن‏)‏‏)‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"A single rider is (accompanied with) Satan and two riders are (accompanied with) two Satans. Three riders form a group.\" [At-Tirmidhi and Abu Dawud].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Satu penunggang (disertai) setan dan dua penunggang (disertai) dua setan. Tiga penunggang membentuk satu kelompok.\" [At-Tirmidzi dan Abu Dawud] .","language":"bahasa"}],"narrated":[{"text":"\u0027Amr bin Shu\u0027aib (May Allah be pleased with him) reported:","language":"english"},{"text":"\u0027Amr bin Shu\u0027aib (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"960","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي سعيد وأبي هريرة رضي الله عنهما قالا‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ “إذا خرج ثلاثة في سفر فليأمروا أحدهم‏\"‏ حديث حسن، ‏(‏‏(‏رواه أبو داود بإسناد حسن‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"When three persons set out on a journey, they should appoint one of them as their leader.\" [Abu Dawud].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Jika tiga orang bepergian, mereka harus mengangkat salah satu dari mereka sebagai pemimpin mereka.\" [Abu Daud] .","language":"bahasa"}],"narrated":[{"text":"Abu Sa\u0027id Al-Khudri and Abu Hurairah (May Allah be pleased with them) reported:","language":"english"},{"text":"Abu Sa\u0027id Al-Khudri dan Abu Hurairah (semoga Allah meridhoi mereka) melaporkan:","language":"bahasa"}]},{"index":"961","hadith_id":"riyadussalihin","text":[{"text":"وعن ابن عباس رضي الله عنهما عن النبي صلى الله عليه وسلم قال‏:‏ “خير الصحابة أربعة وخير السرايا أربعمائة وخير الجيوش أربعة آلاف ولن يغلب اثنا عشر ألفاً عن قلة‏\"‏ ‏(‏‏(‏رواه أبو داود والترمذي وقال‏:‏ حديث حسن‏)‏‏)‏","language":"arabic"},{"text":"The Prophet (ﷺ) said, \"The best number of companions is four; the best detachment is four hundred and the best army is four thousand; and twelve thousand men will not be defeated as a result of smallness of number.\" [At-Tirmidhi and Abu Dawud].","language":"english"},{"text":"Nabi (ﷺ) berkata, \"Jumlah sahabat terbaik adalah empat; pasukan terbaik adalah empat ratus dan pasukan terbaik adalah empat ribu; dan dua belas ribu orang tidak akan dikalahkan karena kecilnya jumlah.\" [At-Tirmidzi dan Abu Dawud] .","language":"bahasa"}],"narrated":[{"text":"Ibn \u0027Abbas (May Allah be pleased with them) reported:","language":"english"},{"text":"Ibn \u0027Abbas (semoga Allah meridhoi mereka) melaporkan:","language":"bahasa"}]},{"index":"962","hadith_id":"riyadussalihin","text":[{"text":"عن أبي هريرة رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ “إذا سافرتم في الخصب فأعطوا الإبل حظها من الأرض وإذا سافرتم في الجدب فأسرعوا عليها السير وبادروا بها نقيها، وإذا عرستم، فاجتنبوا الطريق، فإن طرق الدواب، ومأوي الهوام بالليل” ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏ معنى‏:‏ “أعطوا الإبل حظها من الأرض” أي‏:‏ ارفقوا بها في السير لترعي في حال سيرها وقوله‏:‏ ‏ ‏نقيها‏ ‏ وهو بكسر النون، وإسكان القاف، وبالياء المثناة من تحت وهو‏:‏ المخ، معناه‏:‏ أسرعوا بها حتي تصلوا المقصد قبل أن يذهب مخها من ضنك السير‏.‏ و‏ ‏التعريس‏ ‏ النزول في الليل‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said: \"When you travel through green and lush land, give the camels their due from the ground, and when you travel through a dry and barren land, make them walk quickly lest their strength falters. When you encamp at night, keep away from the roads, for beasts pass there and they are the resort of insects at night.\" [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda: “Jika kamu bepergian melalui tanah yang hijau dan subur, berikan unta-unta mereka dari tanah, dan ketika kamu melakukan perjalanan melalui tanah yang kering dan tandus, buatlah mereka berjalan dengan cepat agar kekuatannya tidak goyah. berkemah di malam hari, jauhi jalan raya, karena binatang buas lewat di sana dan mereka adalah sarang serangga di malam hari.\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"963","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي قتادة، رضي الله عنه، قال‏:‏ كان رسول الله صلى الله عليه وسلم ، إذا كان في سفر، فعرس بليل اضطجع علي يمينه وإذا عرس قبيل الصبح نصب ذراعه، ووضع رأسه علي كفه‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏ قال العلماء‏:‏ إنما نصب ذراعه لئلا يستغرق في النوم، فتفوته صلاة الصبح عن وقتها أو عن أول وقتها‏.‏","language":"arabic"},{"text":"When the Messenger of Allah (ﷺ) encamped at night during a journey, he would lie down on his right side, and when he stayed a little before dawn he would raise his forearm and place his head on the palm of his hand. [Muslim].","language":"english"},{"text":"Ketika Rasulullah () berkemah di malam hari selama perjalanan, dia akan berbaring di sisi kanannya, dan ketika dia tinggal sedikit sebelum fajar dia akan mengangkat lengannya dan meletakkan kepalanya di telapak tangannya. [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Qatadah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Qatadah r.a. melaporkan:","language":"bahasa"}]},{"index":"964","hadith_id":"riyadussalihin","text":[{"text":"عن أنس، رضي الله عنه، قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏ \"‏عليكم بالدلجة، فإن الأرض تطوي بالليل‏\"‏ ‏(‏‏(‏رواه أبو داود بإسناد حسن‏)‏‏)‏‏ الدلجة‏ ‏ ‏:‏ السير في الليل‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"Keep to travelling by night because the earth is folded (traversed more easily) during the night.\" [Abu Dawud].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, “Teruslah bepergian pada malam hari karena bumi terlipat (lebih mudah dilalui) pada malam hari.” [Abu Daud] .","language":"bahasa"}],"narrated":[{"text":"Anas (May Allah be pleased with him) reported:","language":"english"},{"text":"Anas (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"965","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي ثعلبة الخشني، رضي الله عنه، قال‏:‏ كان الناس إذا نزلوا منزلاً تفرقوا في الشعاب والأودية‏.‏ فقال رسول الله، صلى الله عليه وسلم ‏:‏ ‏ \"‏إن تفرقكم في هذه الشعاب والأودية إنما ذلكم من الشيطان‏!‏‏\"‏ فلم ينزلوا بعد ذلك منزلا إلا انضم بعضهم إلي بعض‏.‏ ‏(‏‏(‏رواه أبو داود بإسناد حسن‏)‏‏)‏‏.‏","language":"arabic"},{"text":"Whenever the people encamped during the journey, they would disperse in the mountain passes and valleys. (When) the Messenger of Allah (ﷺ) noticed this he said, \"Your act of scattering in the mountain passes and valleys is from Satan.\" Afterwards the Companions kept close together whenever they encamped. [Abu Dawud].","language":"english"},{"text":"Setiap kali orang-orang berkemah selama perjalanan, mereka akan menyebar di celah gunung dan lembah. (Ketika) Rasulullah (ﷺ) memperhatikan hal ini, dia berkata, \"Tindakanmu yang berhamburan di celah-celah gunung dan lembah adalah dari setan.\" Setelah itu para Sahabat tetap berdekatan setiap kali mereka berkemah. [Abu Daud] .","language":"bahasa"}],"narrated":[{"text":"Abu Tha\u0027labah Al-Khushani (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Tha\u0027labah Al-Khushani (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"966","hadith_id":"riyadussalihin","text":[{"text":"وعن سهل بن عمرو -وقيل سهل بن الربيع بن عمرو الأنصاري المعروف بابن الحنظلية، وهو من أهل بيعة الرضوان، رضي الله عنه، قال‏:‏ مر رسول الله صلى الله عليه وسلم ببعير قد لحق ظهره بطنه، فقال‏:‏ ‏ \"‏اتقوا الله في هذه البهائهم المعجمة، فاركبوها صالحة وكلوها صالحة‏\"‏ ‏(‏‏(‏رواه أبو داود بإسناد صحيح‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) happened to pass by a camel whose belly was sticking to its back (because of hunger), whereupon he said, \"Fear Allah in respect of these dumb (animals). Ride them while they are fit, and slaughter them and eat their meat when they are fit.\" [Abu Dawud].","language":"english"},{"text":"Rasulullah (ﷺ) kebetulan melewati seekor unta yang perutnya menempel di punggungnya (karena lapar), lalu dia berkata, “Bertakwalah kepada Allah dalam hal (hewan) bisu ini. Tunggangi mereka saat mereka sehat, dan menyembelih mereka dan memakan daging mereka ketika mereka sehat.\" [Abu Daud] .","language":"bahasa"}],"narrated":[{"text":"Sahl bin \u0027Amr known as Ibn Al-Hanzaliyyah reported:","language":"english"},{"text":"Sahl bin \u0027Amr yang dikenal sebagai Ibn Al-Hanzaliyyah melaporkan:","language":"bahasa"}]},{"index":"967","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي جعفر عبد الله بن جعفر، رضي الله عنهما، قال‏:‏ أردفني رسول الله صلى الله عليه وسلم ، ذات يوم خلفه، وأسر إلي حديثاً لا أحدث به أحداً من الناس وكان أحب ما أستتر به رسول الله صلى الله عليه وسلم لحاجته هدف أو حائش نخل‏.‏ يعنى‏:‏ حائط نخل‏\"‏ ‏(‏‏(‏رواه هكذا مختصراً‏)‏‏)‏‏.‏ وزاد فيه البرقاني بإسناد مسلم بعد قوله‏:‏ حائش نخل‏:‏ فدخل حائطاً لرجل من الأنصار، فإذا فيه جمل، فلما رأي رسول الله صلى الله عليه وسلم جرجر وذرفت عيناه، فأتاه النبي صلى الله عليه وسلمى الله عليه وسلم الله عليه وسلم ، فمسح سراته -أى‏:‏ سنامه- وذفراه فسكن؛ فقال‏:‏ ‏ ‏من رب هذا الجمل، لمن هذا الجمل‏؟‏‏ ‏ فجاء فتى من الأنصار، فقال‏:‏ هذا لي يا رسول الله، فقال‏:‏ ‏ ‏أفلا تتقي الله في هذه البهيمة التي ملكك الله إياها‏؟‏ فإنه يشكو إلي أنك تجيعه وتدئبه‏ ‏ ‏(‏‏(‏رواه أبو داود كرواية البرقاني‏)‏‏)‏‏.‏ قوله‏:‏ ‏ ‏ذفراه‏ ‏ وهو بكسر الذال المعجمة وإسكان الفاء، وهو لفظ مفرد مؤنث‏.‏ قال أهل اللغة‏:‏ الذفري‏:‏ الموضع الذي يعرق من البعير خلف الأذن، وقوله‏:‏ ‏ ‏تذئبه‏ ‏ أي‏:‏ تتعبه‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) made me ride behind him one day and confided something to me which I shall never disclose to anyone. (\u0027Abdullah added:) He ((ﷺ) preferred to screen himself from others when responding to the call of nature, either behind a wall or the trunk of a date-palm. [Muslim]. Al-Barqani added: The Messenger of Allah (ﷺ) entered an orchid belonging to an Ansari and saw there a camel. When it saw him, it began to groan and its eyes shed tears. The Messenger of Allah (ﷺ) approached it and patted it on the hump and the base of its head until it quieted down. Then he (ﷺ) asked, \"Who is the owner of this camel? To whom does it belong?\" An Ansari youth stepped forward and said: \"It is mine O Messenger of Allah!\" He said, \"Do you not fear Allah in respect of this beast which Allah has placed in your possession? This camel is complaining to me that you starve it and put it to toil.\" [Abu Dawud].","language":"english"},{"text":"Rasulullah (ﷺ) membuat saya naik di belakangnya suatu hari dan menceritakan sesuatu kepada saya yang tidak akan pernah saya ungkapkan kepada siapa pun. (\u0027Abdullah menambahkan:) Dia ((ﷺ) lebih suka menutupi dirinya dari orang lain ketika menanggapi panggilan alam, baik di balik tembok atau batang pohon kurma. [Muslim] . Al-Barqani menambahkan: Rasulullah (ﷺ) memasuki sebuah anggrek milik seorang Ansari dan melihat di sana seekor unta. Ketika melihatnya, ia mulai mengerang dan matanya meneteskan air mata. Rasulullah (ﷺ) mendekatinya dan menepuk-nepuk punuk dan pangkal kepalanya sampai ia tenang. Kemudian dia (ﷺ) bertanya, \"Siapa pemilik unta ini? Milik siapa?\" Seorang pemuda Ansari melangkah maju dan berkata: \"Ini milikku ya Rasulullah!\" Dia berkata, \"Apakah kamu tidak takut kepada Allah sehubungan dengan binatang yang telah Allah tempatkan sebagai milikmu ini? Unta ini mengeluh kepadaku bahwa kamu membuatnya kelaparan dan membuatnya bekerja keras.\" [Abu Daud] .","language":"bahasa"}],"narrated":[{"text":"Abu Ja\u0027far \u0027Abdullah bin Ja\u0027far (May Allah be pleased with them) reported:","language":"english"},{"text":"Abu Ja\u0027far \u0027Abdullah bin Ja\u0027far (Semoga Allah meridhoi mereka) melaporkan:","language":"bahasa"}]},{"index":"968","hadith_id":"riyadussalihin","text":[{"text":"وعن أنس، رضي الله عنه، قال‏:‏ كنا إذا نزلنا منزلا لا نسبح حتي نحل الرحال‏.‏ ‏(‏‏(‏رواه أبو داود بإسناد علي شرط مسلم‏)‏‏)‏‏.‏ وقوله‏:‏ ‏ ‏لا نسبح‏ ‏‏:‏ أي لا نصلي النافلة، ومعناه‏:‏ أنا -مع حرصنا علي الصلاة- لا نقدمها على حط الرحال وإراحة الدواب","language":"arabic"},{"text":"When we encamped, we would not offer (voluntary) prayers until we had unsaddled our beasts. [Abu Dawud].","language":"english"},{"text":"Ketika kami berkemah, kami tidak akan melakukan salat (sukarela) sampai kami melepaskan hewan kami. [Abu Daud] .","language":"bahasa"}],"narrated":[{"text":"Anas (May Allah be pleased with him) reported:","language":"english"},{"text":"Anas (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"969","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي سعيد الخدري، رضي الله عنه، قال‏:‏ بينما نحن في سفر إذ جاء رجل علي راحلة له، فجعل يصرف بصره يميناً وشمالاً، فقال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏من كان معه فضل ظهر؛ فليعد به علي من لا ظهر له، ومن كان له فضل زاد فليعد به علي من لا زاد له‏\"‏ فذكر من أصناف المال ما ذكره، حتي رأينا‏:‏ أنه لا حق لأحد منا في فضل‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"While we were travelling with the Messenger of Allah (ﷺ), a rider came and began to stare on the right and on the left. The Messenger of Allah (ﷺ) said, \"He who has an extra mount should hand it over to one who has none, and he who possesses surplus provision, should give it to him who is without provision.\" He named various kinds of possessions until we began to think (realize) that none of us had any right to anything surplus. [Muslim].","language":"english"},{"text":"Saat kami bepergian dengan Rasulullah (ﷺ), seorang pengendara datang dan mulai menatap ke kanan dan ke kiri. Rasulullah (ﷺ) bersabda, “Barang siapa yang memiliki kelebihan maka berikanlah kepada yang tidak memilikinya, dan barang siapa yang memiliki kelebihan, hendaknya memberikannya kepada orang yang tidak memilikinya.” Dia menyebutkan berbagai macam harta benda sampai kita mulai berpikir (menyadari) bahwa tidak seorang pun dari kita memiliki hak untuk kelebihan apapun. [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Sa\u0027id Al-Khudri (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Sa\u0027id Al-Khudri r.a. melaporkan:","language":"bahasa"}]},{"index":"970","hadith_id":"riyadussalihin","text":[{"text":"وعن جابر رضي الله عنه، عن رسول الله صلى الله عليه وسلم ، أنه أراد أن يغزو، فقال‏:‏ يا معشر المهاجرين والأنصار‏!‏ إن من إخوانكم قوماً، ليس لهم مال، ولا عشيرة، فليضم أحدكم إليه الرجلين، أو الثلاثة، فما لأحدنا من ظهر يحمله إلا كعقبة، يعني أحدهم‏.‏ قال‏:‏ فضممت إلي اثنين أو ثلاثة مالي إلا عقبة كعقبة أحدهم من جملي‏.‏ ‏(‏‏(‏رواه أبو داود‏)‏‏)‏","language":"arabic"},{"text":"When the Messenger of Allah (ﷺ) made up his mind to go in an expedition, he would say to us, \"O Muhajirin and the Ansar! There are among you such people who have no property and no kinsfolk. Let everyone of you take along with him two or three men. None of us had a spare animal we took rides by turn.\" So I took two or three men with me and I rode my camel by turn equally with them. [Abu Dawud].","language":"english"},{"text":"Ketika Rasulullah (ﷺ) memutuskan untuk pergi dalam sebuah ekspedisi, dia akan berkata kepada kami, \"Hai Muhajirin dan Ansar! Ada di antara kamu orang-orang seperti itu yang tidak memiliki harta dan tidak memiliki kerabat. bersamanya dua atau tiga pria. Tak satu pun dari kami yang memiliki hewan cadangan, kami menungganginya secara bergiliran.\" Jadi saya membawa dua atau tiga orang bersama saya dan saya menunggangi unta saya secara bergiliran dengan mereka. [Abu Daud] .","language":"bahasa"}],"narrated":[{"text":"Jabir (May Allah be pleased with him) reported:","language":"english"},{"text":"Jabir (ra dengan dia) melaporkan:","language":"bahasa"}]},{"index":"971","hadith_id":"riyadussalihin","text":[{"text":"وعنه قال‏:‏ كان رسول الله صلى الله عليه وسلم يتخلف في المسير، فيزجي الضعيف ويردف ويدعو له، ‏(‏‏(‏رواه أبو داود بإسناد حسن‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) used to lag behind while travelling and urge the weak to walk quickly. He used to take up someone behind him and make supplication for him. [Abu Dawud].","language":"english"},{"text":"Rasulullah (ﷺ) sering tertinggal saat bepergian dan mendesak orang yang lemah untuk berjalan cepat. Dia biasa mengambil seseorang di belakangnya dan membuat doa untuknya. [Abu Daud] .","language":"bahasa"}],"narrated":[{"text":"Jabir (May Allah be pleased with him) reported:","language":"english"},{"text":"Jabir (ra dengan dia) melaporkan:","language":"bahasa"}]},{"index":"972","hadith_id":"riyadussalihin","text":[{"text":"وعن ابن عمر، رضي الله عنهما، أن رسول الله صلى الله عليه وسلم كان إذا استوى علي بعيره خارجاً إلى سفر، كبر ثلاثاً، ثم قال‏:‏ ‏\"‏سبحان الذي سخر لنا هذا وما كنا له مقرنين، وإنا إلي ربنا لمنقلبون‏.‏ اللهم إنا نسألك في سفرنا هذا البر والتقوى، ومن العمل ما ترضي‏.‏ اللهم هون علينا سفرنا هذا واطو عنا بعده‏.‏ اللهم أنت الصاحب في السفر والخليفة في الأهل‏.‏ اللهم إني أعوذ بك من وعثاء السفر وكآبة المنظر وسوء المنقلب في الأهل والمال والولد‏\"‏ وإذا رجع قالهن وزاد فيهن‏:‏ ‏\"‏آيبون تائبون عابدون لربنا حامدون‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏ معنى ‏ ‏مقرنين‏ ‏‏:‏ مطيقين‏.‏ ‏ ‏والوعثاء‏ ‏ بفتح الواو وإسكان العين المهملة وبالثاء المثلثة وبالمد، وهي‏:‏ الشدة‏.‏ و‏ ‏الكآبة‏ ‏ بالمد، وهي‏:‏ تغير النفس من حزن ونحوه‏.‏ ‏ ‏والمنقلب‏ ‏‏:‏ المرجع‏.‏","language":"arabic"},{"text":"Whenever the Messenger of Allah (ﷺ) mounted his camel for setting out on a journey, he would recite: \"Allahu Akbar (Allah is Greatest),\" thrice. Then he (ﷺ) would supplicate: \"Subhanal-ladhi sakh-khara lana hadha, wa ma kunna lahu muqrinin, wa inna ila Rabbina lamunqalibun. Allahumma inna nas\u0027aluka fi safarina hadh al-birra wat-taqwa, wa minal-\u0027amali ma tarda. Allahumma hawwin \u0027alaina safarana hadha, watwi \u0027anna bu\u0027dahu. Allahumma Antas-Sahibu fissafari, wal-Khalifatu fil- ahli. Allahumma inni a\u0027udhu bika min wa\u0027ta\u0027is-safari, wa kaabatil- manzari, wa su\u0027il-munqalabi fil-mali wal-ahli wal-waladi (Far removed from imperfection is the One Who has made this subservient to us, for we have no power to subjugate it, and certainly to our Rubb shall we return. O Allah, we ask You during this journey of ours for righteousness, piety and such deeds as are pleasing to You. O Allah, make easy for us this journey of ours and make the distance short for us. O Allah, You are our Companion during the journey and the Guardian of the family and the property in our absence. O Allah, I seek refuge in You from the hardships of travelling, unhappiness connected with ghastly scenes and evil turns in property and family).\" When he returned, he recited this supplication making addition of these words: \"Ayibuna, ta\u0027ibuna, \u0027abiduna, li-Rabbina hamidun (We are those who return; those who repent; those who worship and those who praise our Rubb).\" [Muslim].","language":"english"},{"text":"Setiap kali Rasulullah (ﷺ) menaiki unta untuk berangkat dalam perjalanan, dia akan membaca: \"Allahu Akbar (Allah Maha Besar),\" tiga kali. Kemudian beliau (ﷺ) berdoa: \"Subhanal-ladhi sakh-khara lana hadha, wa ma kunna lahu muqrinin, wa inna ila Rabbina lamunqalibun. Allahumma inna nas\u0027aluka fi safarina hadh al-birra wat-taqwa, wa minal-\u0027amali ma tarda. Allahumma hawwin \u0027alaina safarana hadha, watwi \u0027anna bu\u0027dahu. Allahumma Antas-Sahibu fissafari, wal-Khalifatu fil- ahli. Allahumma inni a\u0027udhu bika min wa\u0027ta\u0027is-safari, wa kaabatil- manzari, wa su\u0027il-munqalabi fil-mali wal-ahli wal-waladi (Jauh dari ketidaksempurnaan yang telah menundukkan ini kepada kami, karena kami tidak memiliki kekuatan untuk menaklukkannya, dan tentu kepada Rubb kami kami akan kembali. Allah, Kami memohon kepada-Mu selama perjalanan kami ini kesalehan, ketakwaan, dan perbuatan-perbuatan yang diridhai-Mu. Ya Allah, mudahkan perjalanan kami ini dan perpendek jarak kami. Ya Allah, Engkau adalah Sahabat kami selama perjalanan dan Penjaga keluarga dan harta benda saat kami tidak ada. Ya Allah, aku berlindung kepada-Mu dari kesulitan perjalanan, ketidakbahagiaan yang berhubungan dengan pemandangan yang mengerikan dan kejahatan dalam harta benda dan keluarga).\" Ketika dia kembali, dia membacakan doa ini dengan menambahkan kata-kata ini: \"Ayibuna, ta\u0027ibuna, \u0027abiduna, li-Rabbina hamidun (Kami adalah orang-orang yang kembali; orang-orang yang bertaubat; orang-orang yang beribadah dan orang-orang yang memuji Rubb kami).\" permudah perjalanan kami ini dan perpendek jarak kami. Ya Allah, Engkau adalah Sahabat kami selama perjalanan dan Penjaga keluarga dan harta benda saat kami tidak ada. Ya Allah, aku berlindung kepada-Mu dari kesulitan perjalanan, ketidakbahagiaan yang berhubungan dengan pemandangan yang mengerikan dan kejahatan dalam harta benda dan keluarga).\" Ketika dia kembali, dia membacakan doa ini dengan menambahkan kata-kata ini: \"Ayibuna, ta\u0027ibuna, \u0027abiduna, li-Rabbina hamidun (Kami adalah orang-orang yang kembali; orang-orang yang bertaubat; orang-orang yang beribadah dan orang-orang yang memuji Rubb kami).\" permudah perjalanan kami ini dan perpendek jarak kami. Ya Allah, Engkau adalah Sahabat kami selama perjalanan dan Penjaga keluarga dan harta benda saat kami tidak ada. Ya Allah, aku berlindung kepada-Mu dari kesulitan perjalanan, ketidakbahagiaan yang berhubungan dengan pemandangan yang mengerikan dan kejahatan dalam harta benda dan keluarga).\" Ketika dia kembali, dia membacakan doa ini dengan menambahkan kata-kata ini: \"Ayibuna, ta\u0027ibuna, \u0027abiduna, li-Rabbina hamidun (Kami adalah orang-orang yang kembali; orang-orang yang bertaubat; orang-orang yang beribadah dan orang-orang yang memuji Rubb kami).\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Ibn \u0027Umar (May Allah be pleased with them) reported:","language":"english"},{"text":"Ibnu \u0027Umar radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"973","hadith_id":"riyadussalihin","text":[{"text":"وعن عبد الله بن سرجس، رضي الله عنه قال‏:‏ كان رسول الله صلى الله عليه وسلم إذا سافر يتعوذ من وعثاء السفر، وكآبة المنقلب، والحور بعد الكون، ودعوة المظلوم‏.‏ وسوء المنظر في الأهل والمال‏.‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏ هكذا هو في صحيح مسلم‏:‏ الحور بعد الكون، بالنون، وكذا رواه الترمذي والنسائي‏.‏ قال الترمذي‏:‏ يروي ‏:‏الكور‏ ‏ بالراء، وكلاهما له وجه‏.‏ قال العلماء‏:‏ ومعناه بالنون والراء جميعاً‏:‏ الرجوع من الاستقامة أو الزيادة إلي النقص‏.‏ قالوا‏:‏ ورواية الراء مأخوذة من تكوير العمامة، وهو لفها وجمعها، ورواية النون، من الكون، مصدراً ‏ ‏كان يكون كوناً‏ ‏ إذا وجد واستقر‏.‏","language":"arabic"},{"text":"Whenever the Messenger of Allah (ﷺ) proceeded on a journey, he would seek refuge in Allah from the hardships of the journey, and against deviation after guidance, and against the supplication of the oppressed, and occurrences of unpleasant events in the family and property. He would say: \"Allahumma inni a\u0027udhu bika min wa\u0027tha\u0027is- safari, wa kaabatil-munqalabi, wal-hauri ba\u0027dal-kauni, wa da\u0027watil- mazlumi, wa su\u0027il-manzari fil-ahli wal- mal.\" [Muslim].","language":"english"},{"text":"Setiap kali Rasulullah (ﷺ) melakukan perjalanan, dia akan meminta perlindungan kepada Allah dari kesulitan perjalanan, dan dari penyimpangan setelah bimbingan, dan dari doa orang yang terzalimi, dan kejadian yang tidak menyenangkan dalam keluarga dan harta benda. . Dia akan mengatakan: \"Allahumma inni a\u0027udhu bika min wa\u0027tha\u0027is-safari, wa kaabatil-munqalabi, wal-hauri ba\u0027dal-kauni, wa da\u0027watil-mazlumi, wa su\u0027il-manzari fil-ahli wal-mal.\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"\u0027Abdullah bin Sarjis (May Allah be pleased with him) reported:","language":"english"},{"text":"\u0027Abdullah bin Sarjis (ra dengan dia) melaporkan:","language":"bahasa"}]},{"index":"974","hadith_id":"riyadussalihin","text":[{"text":"وعن علي بن ربيعة قال‏:‏ شهدت علي بن أبي طالب رضي الله عنه أتي بدابة ليركبها، فلما وضع رجله في الركاب قال‏:‏ بسم الله، فلما استوي علي ظهرها قال‏:‏ الحمد لله الذي سخر لنا هذا، وما كنا له مقرنين، وإنا إلي ربنا لمنقلبون، ثم قال‏:‏ الحمد الله، ثلاث مرات، ثم قال‏:‏ الله اكبر ثلاث مرات، ثم قال‏:‏ سبحانك إني ظلمت نفسي فاغفر لي فإنه لا يغفر الذنوب إلا أنت، ثم ضحك، فقيل‏:‏ يا أمير المؤمنين من أي شئ ضحكت‏؟‏ قال‏:‏ رأيت النبي صلى الله عليه وسلم فعل كما فعلت، ثم ضحك، فقلت‏:‏ يا رسول الله من أي شئ ضحكت‏؟‏ قال‏:‏ “إن ربك سبحانه يعجب من عبده إذا قال‏:‏ اغفر لي ذنوبي، يعلم أنه لا يغفر الذنوب غيره‏\"‏ ‏(‏‏(‏رواه أبو داود والترمذي وقال‏:‏ حديث حسن‏)‏‏)‏ ‏وفي بعض النسخ‏:‏ حديث صحيح‏.‏ وهذا لفظ أبي داود","language":"arabic"},{"text":"In my presence, a beast was brought to \u0027Ali bin Abu Talib (May Allah be pleased with him) for riding. When he put his foot in the stirrup, he said: \"Bismillah (With the Name of Allah).\" When he had settled himself on its back he recited: \"Al-hamdu lillahil-ladhi sakh-khara lana hadha, wa ma kunna lahu muqrinin, wa inna ila Rabbina lamunqalibun. (All praise belongs to Allah Who has made this subservient to us, for we had not the strength to overpower it; and to our Rubb shall we return).\" He then recited thrice: \"Alhamdu lillah (Praise be to Allah),\" and then three times: \"Allahu Abkar (Allah is Greatest).\" Then he said: \"Subhanaka inni zalamtu nafsi faghfir li, innahu la yaghfirudh-dhunuba illa Anta (You are far removed from imperfection I have wronged myself, so forgive me, because none but You can forgive sins).\" Then he smiled. It was asked: \"Why have you smiled, O Amir Al-Mu\u0027minin (Leader of the Believers)?\" He replied: \"I saw the Messenger of Allah (ﷺ) doing as I have done. I (i.e., Ali) asked him (the Messenger of Allah (ﷺ)) the reason for smiling. He (ﷺ) said, \u0027Your Rubb, Glorious is He, is pleased when His slave seeks His forgiveness. He (the slave) has firm faith that none except Allah Alone can forgive sins)\u0027.\" [Abu Dawud and At-Tirmidhi].","language":"english"},{"text":"Di hadapanku, seekor binatang dibawa ke \u0027Ali bin Abu Thalib (ra dengan dia) untuk ditunggangi. Ketika dia meletakkan kakinya di sanggurdi, dia berkata: \"Bismillah (Dengan Nama Allah).\" Ketika dia telah duduk di punggungnya dia membaca: \"Al-hamdu lillahil-ladhi sakh-khara lana hadha, wa ma kunna lahu muqrinin, wa inna ila Rabbina lamunqalibun. (Segala puji bagi Allah yang telah menundukkan kita ini, karena kami tidak memiliki kekuatan untuk mengalahkannya; dan kepada Rubb kami akan kami kembalikan).\" Dia kemudian membaca tiga kali: \"Alhamdu lillah (Segala puji bagi Allah),\" dan kemudian tiga kali: \"Allahu Abkar (Allah Maha Besar).\" Kemudian beliau bersabda: “Subhanaka inni zalamtu nafsi faghfir li, innahu la yaghfirudh-dhunuba illa Anta (Engkau jauh dari ketidaksempurnaan aku telah menganiaya diriku sendiri, maka maafkan aku, karena tidak ada kecuali Engkau yang dapat mengampuni dosa).” Kemudian ia tersenyum. Ditanyakan: “Mengapa engkau tersenyum, wahai Amir Al-Mu\u0027minin (Pemimpin Orang-orang Mukmin)?” Ia menjawab: “Aku melihat Rasulullah ( ) melakukan seperti yang telah saya lakukan. Saya (yaitu, Ali) bertanya kepadanya (Rasulullah ()) alasan untuk tersenyum. Dia (ﷺ) berkata, \u0027Rubb Anda, Maha Suci Dia, senang ketika hamba-Nya mencari pengampunan-Nya. Dia (hamba) memiliki keyakinan yang teguh bahwa tidak ada yang bisa mengampuni dosa kecuali Allah saja)\u0027.\" ridha ketika hamba-Nya memohon ampunan-Nya. Dia (hamba) memiliki keyakinan yang teguh bahwa tidak ada yang bisa mengampuni dosa kecuali Allah saja)\u0027.\" ridha ketika hamba-Nya memohon ampunan-Nya. Dia (hamba) memiliki keyakinan yang teguh bahwa tidak ada yang bisa mengampuni dosa kecuali Allah saja)\u0027.\" [Abu Dawud dan At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"\u0027Ali bin Rabi\u0027ah reported:","language":"english"},{"text":"\u0027Ali bin Rabi\u0027ah melaporkan:","language":"bahasa"}]},{"index":"975","hadith_id":"riyadussalihin","text":[{"text":"عن جابر رضي الله عنه قال‏:‏ كنا إذا صعدنا كبرنا، وإذا نزلنا سبحنا‏.‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","language":"arabic"},{"text":"When we ascended (a height) we would proclaim: \"Allahu Akbar (Allah is Greatest),\" and when we descended (from the height) we would proclaim: \"Subhan Allah (Allah is free from imperfection).\"\u0027 [Al-Bukhari].","language":"english"},{"text":"Ketika kita naik (ketinggian) kita akan menyatakan: \"Allahu Akbar (Allah Maha Besar),\" dan ketika kita turun (dari ketinggian) kita akan menyatakan: \"Subhan Allah (Allah bebas dari ketidaksempurnaan).\"\u0027 [Al- Bukhari] .","language":"bahasa"}],"narrated":[{"text":"Jabir (May Allah be pleased with him) reported:","language":"english"},{"text":"Jabir (ra dengan dia) melaporkan:","language":"bahasa"}]},{"index":"976","hadith_id":"riyadussalihin","text":[{"text":"وعن ابن عمر رضي الله عنهما قال‏:‏ كان النبي صلى الله عليه وسلم وجيوشه إذا علو الثنايا كبروا، وإذا هبطوا سبحوا‏.‏ ‏(‏‏(‏رواه أبو داود بإسناد صحيح‏.‏","language":"arabic"},{"text":"Whenever the Prophet (ﷺ) and his army ascended a height, they would proclaim: \"Allahu Akbar (Allah is Greatest),\" and when they climbed down, they would proclaim: \"Subhan Allah (Allah is free from imperfection).\" [Abu Dawud].","language":"english"},{"text":"Setiap kali Nabi (ﷺ) dan pasukannya naik ke ketinggian, mereka akan mengucapkan: \"Allahu Akbar (Allah Maha Besar),\" dan ketika mereka turun, mereka akan mengucapkan: \"Subhanallah (Allah bebas dari ketidaksempurnaan).\" [Abu Daud] .","language":"bahasa"}],"narrated":[{"text":"Ibn \u0027Umar (May Allah be pleased with them) reported:","language":"english"},{"text":"Ibnu \u0027Umar radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"977","hadith_id":"riyadussalihin","text":[{"text":"وعنه قال كان النبي صلى الله عليه وسلم إذا قفل من الحج أو العمرة كلما أوفى علي ثنيه أو فدفد كبر ثلاثاً، ثم قال‏:‏ ‏ \"‏ لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو علي كل شئ قدير آيبون تائبون عابدون ساجدون لربنا حامدون‏.‏ صدق الله وعده، ونصر عبده، وهزم الأحزاب وحده‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏ وفي رواية لمسلم‏:‏ إذا قفل من الجيوش أو السرايا أو الحج أو العمرة قوله‏:‏ ‏ ‏أوفى‏ ‏ أي‏:‏ ارتفع، وقوله‏:‏ ‏ ‏فدفد‏ ‏ هو بفتح الفاءين بينهما دال مهملة ساكنة وآخره دال أخرى وهو ‏:‏ الغليظ المرتفع من الأرض‏.‏","language":"arabic"},{"text":"Whenever the Prophet (ﷺ) returned from Hajj or \u0027Umrah and ascended a height or hill, he would recite thrice: \"Allahu Akbar (Allah is Greatest).\" Then he would say, \"La ilaha ill-allahu wahdahu la sharika lahu, lahul- mulku, wa lahul-hamdu, wa Huwa \u0027ala kulli shay\u0027in Qadeer. Ayibuna ta\u0027ibuna \u0027abiduna li-Rabbina hamidun. Sadaq-Allahu wa\u0027dahu, wa nasara \u0027abdahu, wa hazamal-ahzaba wahdahu [None has the right to be worshipped but Allah, Who has no partner, to Whom the sovereignty belongs, to Whom all praise is due, and Who is Able to do all things. We are those who return (in safety), feel penitence, worship Allah, prostrate before our Rubb and praise Him. Allah has fulfilled His Promise, helped His slave (i.e., Muhammad (ﷺ)) and He Alone vanquished the Clans].\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Setiap kali Nabi (ﷺ) kembali dari haji atau \u0027umrah dan naik ke ketinggian atau bukit, dia akan membaca tiga kali: \"Allahu Akbar (Allah Maha Besar).\" Kemudian dia berkata, “La ilaha ill-allahu wahdahu la sharika lahu, lahul-mulku, wa lahul-hamdu, wa Huwa \u0027ala kulli shay\u0027in Qadeer. Ayibuna ta\u0027ibuna \u0027abiduna li-Rabbina hamidun. Sadaq-Allahu wa \u0027dahu, wa nasara \u0027abdahu, wa hazamal-ahzaba wahdahu [Tidak ada sesembahan yang berhak disembah selain Allah, Yang tidak ada sekutu bagi-Nya, Yang memiliki kedaulatan, Yang memiliki segala puji, dan Yang Maha Kuasa atas segala sesuatu. Kami adalah orang-orang yang kembali (dalam keselamatan), merasa menyesal, menyembah Allah, bersujud di hadapan Rubb kami dan memuji-Nya. Allah telah memenuhi Janji-Nya, membantu hamba-Nya (yaitu, [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Ibn \u0027Umar (May Allah be pleased with them) reported:","language":"english"},{"text":"Ibnu \u0027Umar radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"978","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي هريرة رضي الله عنه أن رجلاً قال‏:‏ يا رسول الله ، إني أريد أن أسافر فأوصني، قال‏:‏ ‏\"‏عليك بتقوى الله، والتكبيرعلي كل شرف‏\"‏ فلما ولى الرجل قال‏:‏ ‏\"‏ اللهم اطو له البعد، وهون عليه السفر” ‏(‏‏(‏رواه الترمذي وقال حديث حسن‏)‏‏)‏‏.‏","language":"arabic"},{"text":"A man said: \"O Messenger of Allah (ﷺ), I intend to set out on a journey, so counsel me.\" He (ﷺ) said, \"Fear Allah, and ascending towards the raised ground, you should recite: \"Allahu Akbar (Allah is Greatest).\" When the man turned away, he (ﷺ) said, \"O Allah! Shorten the distance for him and make the journey easy for him.\" [At-Tirmidhi].","language":"english"},{"text":"Seorang laki-laki berkata: \"Ya Rasulullah (ﷺ), aku berniat untuk bepergian, maka nasehatilah aku.\" Dia (ﷺ) berkata, “Bertakwalah kepada Allah, dan naik ke tanah yang tinggi, Anda harus membaca: “Allahu Akbar (Allah Maha Besar).” Ketika pria itu berpaling, dia (ﷺ) berkata, “Ya Allah! Perpendek jarak baginya dan permudah perjalanannya.\" [At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"979","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي موسي الأشعري رضي الله عنه قال‏:‏ كنا مع النبي صلى الله عليه وسلم في سفر، فكنا إذا أشرفنا على واد هللنا وكبرنا وارتفعت أصواتنا، فقال النبي صلى الله عليه وسلم ‏:‏”يا أيها الناس أربعوا عل أنفسكم فإنكم لا تدعون أصم ولا غائباً‏.‏ إنه معكم ، إنه سميع قريب‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ أربعوا” بفتح الباء الموحدة أي ‏:‏ أرفقوا بأنفسكم‏.","language":"arabic"},{"text":"We accompanied the Prophet (ﷺ) in a journey, and when we climbed up a height, we proclaimed aloud: \"La ilaha illallah (There is no true god except Allah)\" and \"Allahu Akbar (Allah is Greatest).\" The Prophet (ﷺ) admonished us saying, \"O people, take it easy. He Whom you are calling is not deaf or absent. He is with you (i.e., by His Knowledge), He is Hearing and He is Near.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Kami menemani Nabi (ﷺ) dalam sebuah perjalanan, dan ketika kami mendaki sebuah ketinggian, kami mengucapkan dengan lantang: \"La ilaha illallah (Tidak ada tuhan yang benar selain Allah)\" dan \"Allahu Akbar (Allah Maha Besar).\" Nabi (ﷺ) menasihati kita dengan mengatakan, \"Hai manusia, tenanglah. Dia yang kamu panggil tidak tuli atau tidak hadir. Dia bersamamu (yaitu, dengan Ilmu-Nya), Dia Mendengar dan Dia Dekat.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Musa Al-Ash\u0027ari (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Musa Al-Asy\u0027ari r.a. melaporkan:","language":"bahasa"}]},{"index":"980","hadith_id":"riyadussalihin","text":[{"text":"عن أبي هريرة رضي الله عنه قال‏:‏ قال ‏:‏ رسول الله صلى الله عليه وسلم ‏:‏ ‏ \"‏ ثلاث دعوات مستجابات لا شك فيهن‏:‏ دعوة المظلوم، ودعوة المسافر، ودعوة الوالد على ولده‏\"‏ ‏(‏‏(‏رواه أبو داود، والترمذي وقال‏:‏ حديث حسن‏)‏‏)‏ وليس في رواية أبي داود‏:‏ “على ولده”","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"Three supplications are answered without doubt. The supplication of the oppressed, the supplication of the traveller, and the supplication of the parent for his son.\" [At- Tirmidhi and Abu Dawud].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, “Tiga doa yang dikabulkan tanpa keraguan. Doa orang yang terzalimi, doa seorang musafir, dan doa orang tua kepada anaknya.” [At-Tirmidzi dan Abu Dawud] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"981","hadith_id":"riyadussalihin","text":[{"text":"عن أبي موسي الأشعري رضي الله عنه أن رسول الله كان إذا خاف قوماً قال‏:‏ ‏ \"‏ اللهم إنا نجعلك في نحورهم ، ونعوذ بك من شرورهم‏\"‏ ‏(‏‏(‏رواه أبو داود، والنسائي بإسناد صحيح‏)‏‏)‏‏.‏","language":"arabic"},{"text":"When the Messenger of Allah (ﷺ), feared mischief from a people, he would supplicate: \"Allahumma inna naj\u0027aluka fi nuhurihim, wa na\u0027udhu bika min shururihim (O Allah! We ask You to face them, and seek Your Protection against their evil.\" [Abu Dawud and An- Nasa\u0027i].","language":"english"},{"text":"Ketika Rasulullah (ﷺ), takut akan kerusakan dari suatu kaum, dia akan berdoa: \"Allahumma inna naj\u0027aluka fi nuhurihim, wa na\u0027udhu bika min shururihim (Ya Allah! Kami mohon kepada-Mu untuk menghadapi mereka, dan memohon perlindungan-Mu). terhadap kejahatan mereka.\" [Abu Dawud dan An-Nasa\u0027i] .","language":"bahasa"}],"narrated":[{"text":"Abu Musa Al-Ashari (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Musa Al-Ashari radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"982","hadith_id":"riyadussalihin","text":[{"text":"-عن خولة بنت حكيم رضي الله عنها قالت‏:‏ سمعت رسول الله صلى الله عليه وسلم يقول‏:‏ ‏ \"‏من نزل منزلاً ثم قال‏:‏ أعوذ بكلمات الله التامات من شر ما خلق‏:‏ لم يضره شيء حتي يرتحل من منزله ذلك‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"I heard the Messenger of Allah (ﷺ) saying, \"Whosoever alights somewhere and says: \u0027A\u0027udhu bikalimat-illahit-tammati min sharri ma khalaqa (I seek refuge with the Perfect Words of Allah from the evil of what He has created),\u0027 nothing will harm him until he leaves that place.\" [Muslim].","language":"english"},{"text":"Saya mendengar Rasulullah (ﷺ) berkata, \"Barangsiapa turun di suatu tempat dan berkata: \u0027A\u0027udhu bikalimat-illahit-tammati min sharri ma khalaqa (Aku berlindung dengan Kalimat Allah yang Sempurna dari kejahatan apa yang Dia ciptakan) ,\u0027 tidak ada yang akan menyakitinya sampai dia meninggalkan tempat itu.\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Khaulah bint Hakim (May Allah be pleased with her) reported:","language":"english"},{"text":"Khaulah binti Hakim (ra dengan dia) melaporkan:","language":"bahasa"}]},{"index":"983","hadith_id":"riyadussalihin","text":[{"text":"وعن ابن عمر رضي الله عنهما قال‏:‏ كان رسول الله صلى الله عليه وسلم إذا سافر فأقبل الليل قال‏:‏ ‏ \"‏ يا أرض ، ربي وربك الله، أعوذ بك من شرك وشر ما فيك ، وشر ما خلق فيك، وشر ما يدب عليك أعوذ بالله من شر أسد وأسود، ومن الحية والعقرب، ومن ساكن البلد، ومن والد وما ولد‏\"‏ ‏(‏‏(‏رواه أبو داود‏)‏‏)‏‏ والأسود‏ ‏‏:‏ الشخص، قال الخطابي‏:‏ و‏ ‏ساكن البلد‏ ‏‏:‏ هم الجن الذين هم سكان الأرض ‏.‏ قال‏:‏ والبلد من الأرض‏:‏ ما كان مأوى الحيوان، وإن لم يكن فيه بناء ومنازل ‏.‏ قال‏:‏ ويحتمل أن المراد ‏ ‏ بالوالد‏ ‏ ‏:‏ إبليس ‏ ‏وماولد‏ ‏ ‏:‏ الشياطين","language":"arabic"},{"text":"Whenever the Messenger of Allah (ﷺ) set out on a journey, he would say by nightfall: \"Ya ardu, Rabbi wa Rabbuk-illahu, a\u0027udhu billahi min sharriki wa sharri ma fiki, wa sharri ma khuliqa fiki, wa sharri ma yadibbu \u0027alaiki; a\u0027udhu billahi min sharri asadin wa aswadin, wa minal-hayyati wal-\u0027aqrabi, wa min sakinil-baladi, wa min walidin wa ma walad [O land, my Rubb and your Rubb is Allah, I seek refuge in Him from your evils, the evils of what you contain, the evils of what has been created in you, and the evils of what walks upon you. I seek refuge in Allah from lions, black serpents, scorpions and from the inhabitants of the place, and from the parent (i.e., Satan) and his offspring who inhabit a settlement (i.e., helpers from amongst the devils)].\" [Abu Dawud].","language":"english"},{"text":"Setiap kali Rasulullah (ﷺ) melakukan perjalanan, dia akan mengatakan pada malam hari: \"Ya ardu, Rabbi wa Rabbuk-illahu, a\u0027udhu billahi min sharriki wa sharri ma fiki, wa sharri ma khuliqa fiki, wa sharri ma yadibbu \u0027alaiki; a\u0027udhu billahi min sharri asadin wa aswadin, wa minal-hayyati wal-\u0027aqrabi, wa min sakinil-baladi, wa min walidin wa ma walad [Wahai bumi, Tuhanku dan Tuhanmu, aku berlindung kepada-Nya dari kejelekanmu, kejelekan apa yang kamu isi, kejelekan apa yang diciptakan dalam dirimu, dan kejelekan apa yang berjalan di atasmu. Aku berlindung kepada Allah dari singa, ular hitam, kalajengking, dan dari penduduk bumi. tempat, dan dari orang tua (yaitu, Setan) dan keturunannya yang mendiami pemukiman (yaitu, pembantu dari antara setan)] .\" [Abu Daud].","language":"bahasa"}],"narrated":[{"text":"Ibn \u0027Umar (May Allah be pleased with them) reported:","language":"english"},{"text":"Ibnu \u0027Umar radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"984","hadith_id":"riyadussalihin","text":[{"text":"عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏ \"‏السفر قطعة من العذاب، يمنع أحدكم طعامه، وشرابه ونومه، فإذا قضى أحدكم نهمته من سفره، فليعجل إلى أهله‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏ ‏نهمته‏ ‏ ‏:‏ مقصوده","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"Travelling is a torment because it deprives a traveller of his food, drink and sleep. So when one of you has accomplished his purpose of journey, let him return home quickly.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Perjalanan adalah siksaan karena menghalangi makan, minum, dan tidur seorang musafir. Maka jika salah seorang di antara kalian telah mencapai tujuan perjalanannya, hendaklah dia segera pulang.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"985","hadith_id":"riyadussalihin","text":[{"text":"عن جابر رضي الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏ \"‏إذا أطال أحدكم الغيبة فلا يطرقن أهله ليلاً‏\"‏‏ وفي رواية أن رسول الله صلى الله عليه وسلم نهى أن يطرق الرجل أهله ليلاً‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"When one of you stays away (from his family) for a long period of time, let him not surprise his family by night.\" In another narration, Jabir (May Allah be pleased with him) said: The Messenger of Allah (ﷺ) prohibited us from coming back to our family at night. [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Jika salah satu dari kalian menjauh (dari keluarganya) untuk waktu yang lama, janganlah dia mengejutkan keluarganya di malam hari.\" Dalam riwayat lain, Jabir (ra dengan dia) berkata: Rasulullah (ﷺ) melarang kami kembali ke keluarga kami di malam hari. [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Jabir (May Allah be pleased with him) reported:","language":"english"},{"text":"Jabir (ra dengan dia) melaporkan:","language":"bahasa"}]},{"index":"986","hadith_id":"riyadussalihin","text":[{"text":"وعن أنس رضي الله عنه قال‏:‏ كان رسول الله صلى الله عليه وسلم لا يطرق أهله ليلاً، وكان يأتيهم غدوة أو عشية‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏الطروق‏ ‏ ‏:‏المجيء في الليل‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) would not come (back) to his family by night. He used to come in the morning or in the evening (before dark). [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) tidak akan kembali (kembali) ke keluarganya pada malam hari. Ia biasa datang pada pagi atau sore hari (sebelum gelap). [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Anas (May Allah be pleased with him) reported:","language":"english"},{"text":"Anas (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"987","hadith_id":"riyadussalihin","text":[{"text":"وعن أنس رضي الله عنه قال‏:‏ أقبلنا مع النبي صلى الله عليه وسلم ، حتي إذ كنا بظهر المدينة، قال‏:‏ ‏ \"‏آيبون، تائبون ، عابدون ، لربنا حامدون‏\"‏ فلم يزل يقول ذلك حتي قدمنا المدينة، ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"We returned with the Prophet (ﷺ) from a journey; and when we entered the suburbs of Al- Madinah, he (ﷺ) said: \"Ayibuna, ta\u0027ibuna, \u0027abiduna, li-Rabbina hamidun (We are returning in safety, turning to our Rubb, worshipping Him and praising Him).\" He (ﷺ) continued repeating these words till we entered Al-Madinah. [Muslim].","language":"english"},{"text":"Kami kembali bersama Nabi (ﷺ) dari sebuah perjalanan; dan ketika kami memasuki pinggiran kota Madinah, dia (ﷺ) berkata: \"Ayibuna, ta\u0027ibuna, \u0027abiduna, li-Rabbina hamidun (Kami kembali dengan selamat, kembali ke Rubb kami, menyembah-Nya dan memuji-Nya). \" Dia (ﷺ) terus mengulangi kata-kata ini sampai kami memasuki Al-Madinah. [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Anas (May Allah be pleased with him) reported:","language":"english"},{"text":"Anas (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"988","hadith_id":"riyadussalihin","text":[{"text":"عن كعب بن مالك رضي الله عنه أن رسول الله صلى الله عليه وسلم كان إذا قدم من سفر بدأ بالمسجد فركع فيه ركعتين ‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏","language":"arabic"},{"text":"Whenever the Messenger of Allah (ﷺ) returned from a journey, he would proceed straight to the mosque and perform two Rak\u0027ah of (optional) prayer. [Al-Bukhari and Muslim].","language":"english"},{"text":"Setiap kali Rasulullah (ﷺ) kembali dari perjalanan, ia akan langsung menuju masjid dan melakukan dua rakaat shalat (pilihan). [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Ka\u0027b bin Malik (May Allah be pleased with him) reported:","language":"english"},{"text":"Ka\u0027b bin Malik radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"989","hadith_id":"riyadussalihin","text":[{"text":"عن أبي هريرة رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏ \"‏لا يحل لامرأة تؤمن بالله واليوم الآخر تسافر مسيرة يوم وليلة إلا مع ذي محرم عليها‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"It is not permissible for a woman who believes in Allah and the Last Day to make a journey of one day and night unless she is accompanied by a Mahram (husband or any other relative to whom she is prohibited to marry).\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, “Tidak halal bagi seorang wanita yang beriman kepada Allah dan hari akhir melakukan perjalanan satu hari satu malam kecuali dia ditemani oleh seorang mahram (suami atau kerabat lain yang dia kenal). dilarang menikah). [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"990","hadith_id":"riyadussalihin","text":[{"text":"وعن ابن عباس رضي الله عنهما أنه سمع النبي صلى الله عليه وسلم يقول‏:‏ ‏\"‏لا يخلون رجل بامرأة إلا ومعها ذو محرم، ولا تسافر المرأة إلا مع ذي محرم‏\"‏ فقال له رجل‏:‏ يا رسول الله إن امرأتي خرجت حاجّة، وإني اكتتبت في غزوة كذا وكذا‏؟‏ قال‏:‏ ‏\"‏انطلق فحج مع امرأتك‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Prophet (ﷺ) said, \"No man must not be alone with a woman except in the presence of her (Mahram). No woman should travel except in company of a (Mahram).\" A man said: \"O Messenger of Allah! I have been enrolled for such and such expedition, and my wife left for Hajj.\" He (ﷺ) said to him, \"Go and perform Hajj with your wife.\" [Al- Bukhari and Muslim].","language":"english"},{"text":"Nabi (ﷺ) berkata, \"Tidak ada laki-laki yang tidak boleh berduaan dengan seorang wanita kecuali di hadapannya (Mahram). Tidak ada wanita yang boleh bepergian kecuali ditemani seorang (Mahram).\" Seorang laki-laki berkata: \"Ya Rasulullah! Saya telah terdaftar untuk ekspedisi ini dan itu, dan istri saya berangkat haji.\" Dia (ﷺ) berkata kepadanya, \"Pergi dan lakukan haji dengan istrimu.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Ibn \u0027Abbas (May Allah be pleased with them) reported:","language":"english"},{"text":"Ibn \u0027Abbas (semoga Allah meridhoi mereka) melaporkan:","language":"bahasa"}]}]