[{"index":"1869","hadith_id":"riyadussalihin","text":[{"text":"وعن الأغر المزني رضي الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏ \"‏إنه ليغان على قلبي، وإني لأستغفر الله في اليوم مائة مرة‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"Sometimes I perceive a veil over my heart, and I supplicate Allah for forgiveness a hundred times in a day.\" [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Terkadang aku melihat selubung di hatiku, dan aku berdoa kepada Allah untuk pengampunan seratus kali dalam sehari.\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Al-Agharr Al-Muzani (May Allah be pleased with him) said:","language":"english"},{"text":"Al-Agharr Al-Muzani (semoga Allah meridhoinya) berkata:","language":"bahasa"}]},{"index":"1870","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي هريرة رضي الله عنه قال‏:‏ سمعت رسول الله صلى الله عليه وسلم يقول “والله إني لأستغفر الله وأتوب إليه في اليوم أكثر من سبعين مرة‏\"‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","language":"arabic"},{"text":"I heard the Messenger of Allah (ﷺ) saying, \"I swear by Allah that I seek Allah\u0027s Pardon and turn to Him in repentance more than seventy times a day.\" [Al-Bukhari].","language":"english"},{"text":"Saya mendengar Rasulullah (ﷺ) berkata, \"Saya bersumpah demi Allah bahwa saya mencari pengampunan Allah dan berbalik kepada-Nya dalam pertobatan lebih dari tujuh puluh kali sehari.\" [Al-Bukhari] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) said:","language":"english"},{"text":"Abu Hurairah r.a. berkata:","language":"bahasa"}]},{"index":"1871","hadith_id":"riyadussalihin","text":[{"text":"وعنه رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏ \"‏والذي نفسي بيده لو لم تذنبوا، لذهب الله تعالى بكم، ولجاء بقوم يذنبون فيستغفرون الله تعالى فيغفر لهم‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"By the One in Whose Hand my soul is! If you do not commit sins, Allah would replace you with a people who would commit sins and seek forgiveness from Allah; and Allah will certainly forgive them.\" [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, “Demi Dzat yang jiwaku ada di tangan-Nya! Jika kamu tidak berbuat dosa, Allah akan menggantikanmu dengan kaum yang berbuat dosa dan memohon ampun kepada Allah; dan Allah pasti akan mengampuni mereka. .\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) said:","language":"english"},{"text":"Abu Hurairah r.a. berkata:","language":"bahasa"}]},{"index":"1872","hadith_id":"riyadussalihin","text":[{"text":"وعن بن عمر رضي الله عنه قال‏:‏ كنا نعد لرسول الله صلى الله عليه وسلم في المجلس الواحد مائة مرة‏:‏ ‏ \"‏رب اغفر لي، وتب على إنك أنت التواب الرحيم‏\"‏ ‏(‏‏(‏رواه أبوداود والترمذي‏)‏‏)‏‏.‏ وقال : (( حديث حسن صحيح غريب )) .","language":"arabic"},{"text":"We counted Messenger\u0027s saying a hundred times during one single sitting: Rabb- ighfir li, wa tubb \u0027alayya, innaka Antat-Tawwabur-Rahim. (My Rubb! Forgive me and pardon me. Indeed, You are the Oft-Returning with compassion and Ever Merciful.\" [Abu Dawud and At- Tirmidhi].","language":"english"},{"text":"Kami menghitung sabda Rasul seratus kali dalam satu kali duduk: Rabbighfir li, wa tubb \u0027alayya, innaka Antat-Tawwabur-Rahim. (Rubb-ku! Ampunilah aku dan maafkan aku. Sungguh, Engkau Maha Pengasih Lagi Maha Penyayang.” [Abu Dawud dan At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Ibn \u0027Umar (May Allah be pleased with them) said:","language":"english"},{"text":"Ibn \u0027Umar (semoga Allah meridhoi mereka) berkata:","language":"bahasa"}]},{"index":"1873","hadith_id":"riyadussalihin","text":[{"text":"وعن ابن عباس رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ “من لزم الاستغفار ، جعل الله له من كل ضيق مخرجاً ومن كل هم فرجاً، ورزقه من حيث لا يحتسب‏\"‏ رواه أبو داود‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"If anyone constantly seeks pardon (from Allah), Allah will appoint for him a way out of every distress and a relief from every anxiety, and will provide sustenance for him from where he expects not.\" [Abu Dawud].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, “Barang siapa yang terus menerus memohon ampun (dari Allah), maka Allah akan memberikan baginya jalan keluar dari setiap kesulitan dan kelegaan dari setiap kecemasan, dan akan memberikan rezeki baginya dari tempat yang tidak ia harapkan. \" [Abu Daud] .","language":"bahasa"}],"narrated":[{"text":"Ibn \u0027Abbas (May Allah be pleased with them) said:","language":"english"},{"text":"Ibn \u0027Abbas (semoga Allah meridhoi mereka) berkata:","language":"bahasa"}]},{"index":"1874","hadith_id":"riyadussalihin","text":[{"text":"وعن ابن مسعود رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏ \"‏من قال‏:‏ أستغفر الله الذي لا إله إلا هو الحي القيوم وأتوب إليه ، غفرت ذنوبه ، وإن كان قد فر من الزحف‏\"‏ ‏(‏‏(‏رواه أبو داود والترمذي والحاكم، وقال‏:‏ حديث صحيح على شرط البخاري ومسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"He who says: \u0027Astaghfir ullah-alladhi la ilaha illa Huwal-Haiyul-Qayyumu, wa atubu ilaihi (I seek the forgiveness of Allah, there is no true god except Allah, the Ever-Living, the Self- Subsisting, and I turn to Him in repentance),\u0027 his sins will be forgiven even if he should have run away from the battlefield (while he was engaged in fighting for the Cause of Allah).\" [Abu Dawud, At-Tirmidhi and Al-Hakim (on conditions of Al-Bukhari and Muslim for accepting Hadith)].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, \"Barang siapa yang mengucapkan: \u0027Astaghfir ullah-alladhi la ilaha illa Huwal-Haiyul-Qayyumu, wa atubu ilaihi (Aku memohon ampun kepada Allah, tidak ada Tuhan yang benar selain Allah, Yang Maha Kekal). Hidup, Mencukupi Diri, dan aku kembali kepada-Nya dalam pertobatan),\u0027 dosa-dosanya akan diampuni bahkan jika dia harus melarikan diri dari medan perang (sementara dia terlibat dalam pertempuran di jalan Allah).\" [Abu Dawud, At-Tirmidzi dan Al-Hakim (dengan syarat Al-Bukhari dan Muslim menerima Hadis)] .","language":"bahasa"}],"narrated":[{"text":"Ibn Mas\u0027ud (May Allah be pleased with him) said:","language":"english"},{"text":"Ibnu Mas\u0027ud r.a. berkata:","language":"bahasa"}]},{"index":"1875","hadith_id":"riyadussalihin","text":[{"text":"وعن شداد بن أوس رضي الله عنه عن النبي صلى الله عليه وسلم قال‏:‏ ‏\"‏سيد الإستغفار أن يقول العبد ‏:‏ اللهم أنت ربي، لا إله إلا أنت ، خلقتني وأنا عبدك، وأنا على عهدك ووعدك ما استطعت أعوذ بك من شر ما صنعت أبوء لك بنعمتك علي، وأبوء بذنبي، فاغفر لي فإنه لا يغفر الذنوب إلا أنت، من قالها من النهار موقنا بها، فمات من يومه قبل أن يمسي، فهو من أهل الجنة، ومن قالها من الليل وهو موقن بها فمات قبل أن يصبح، فهو من أهل الجنة” ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏ (1)","language":"arabic"},{"text":"The Prophet (ﷺ) said, \"The best supplication for seeking forgiveness (Syed-ul- Istighfar) is to say: \u0027Allahumma Anta Rabbi, la ilaha illa Anta, khalaqtani wa ana \u0027abduka, wa ana \u0027ala \u0027ahdika wa wa\u0027dika mastata\u0027tu, a\u0027udhu bika min sharri ma sana\u0027tu, abu\u0027u laka bini\u0027matika \u0027alayya, wa abu\u0027u bidhanbi faghfir li, fa innahu la yaghfirudh-dhunuba illa Anta. (O Allah! You are my Rubb. There is no true god except You. You have created me, and I am Your slave, and I hold to Your Covenant as far as I can. I seek refuge in You from the evil of what I have done. I acknowledge the favours that You have bestowed upon me, and I confess my sins. Pardon me, for none but You has the power to pardon).\u0027 He who supplicates in these terms during the day with firm belief in it and dies on the same day (before the evening), he will be one of the dwellers of Jannah; and if anyone supplicates in these terms during the night with firm belief in it and dies before the morning, he will be one of the dwellers of Jannah.\" [Al-Bukhari].","language":"english"},{"text":"Barang siapa yang berdoa dengan syarat-syarat ini di siang hari dengan keyakinan yang teguh padanya dan meninggal pada hari yang sama (sebelum malam), dia akan menjadi salah satu penghuni Jannah; Dan barang siapa yang berdoa dengan doa ini di malam hari dengan penuh keyakinan dan meninggal sebelum pagi hari, dia termasuk penghuni Jannah.” [Al-Bukhari] .","language":"bahasa"}],"narrated":[{"text":"Shaddad bin Aus (May Allah be pleased with him) said:","language":"english"},{"text":"Shaddad bin Aus (semoga Allah meridhoinya) berkata:","language":"bahasa"}]},{"index":"1876","hadith_id":"riyadussalihin","text":[{"text":"- وعن ثوبان رضي الله عنه قال‏:‏ كان رسول الله صلى الله عليه وسلم إذا انصرف من صلاته ، استغفر الله ثلاثاً وقال‏:‏ ‏\"‏اللهم أنت السلام، ومنك السلام، تباركت يا ياذا الجلال والإكرام‏\"‏ قيل للأوزاعي- وهو أحد رواته‏:‏ كيف الإستغفار‏؟‏ قال‏:‏ يقول‏:‏ ‏\"‏أستغفر الله ، أستغفر الله‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"Whenever the Messenger of Allah (ﷺ) finished his Salat (prayer), he would beg forgiveness three times [by saying, \u0027Astaghfirullah\u0027 (3 times)] and then he would say: \"Allahumma Antas-Salamu, wa minkas-Salamu, tabarakta ya Dhal-Jalali wal-Ikram. (O Allah! You are the Bestower of security and security comes from You; Blessed are You. O Possessor of glory and honour).\" Imam Al-Auza\u0027i (one of the subnarrators) of this Hadith was asked: \"How forgiveness should be sought?\" He replied: \"I say: Astaghfirullah, Astaghfirullah (I seek forgiveness from Allah. I seek forgiveness from Allah).\" [Muslim].","language":"english"},{"text":"Setiap kali Rasulullah (ﷺ) menyelesaikan shalatnya, dia akan memohon pengampunan tiga kali [dengan mengatakan, \u0027Astaghfirullah\u0027 (3 kali)] dan kemudian dia akan berkata: \"Allahumma Antas-Salamu, wa minkas-Salamu, tabarakta ya Dhal-Jalali wal-Ikram. (Ya Allah! Engkau adalah Pemberi keamanan dan keamanan datang dari-Mu; Maha Suci Engkau. Wahai Pemilik kemuliaan dan kehormatan).\" Imam Al-Auza\u0027i (salah satu subnarator) dari hadits ini ditanya: \"Bagaimana pengampunan harus dicari?\" Dia menjawab: \"Aku berkata: Astaghfirullah, Astaghfirullah (Aku memohon ampun kepada Allah. Aku memohon pengampunan dari Allah).\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Thauban (May Allah be pleased with him) reported:","language":"english"},{"text":"Thauban (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"1877","hadith_id":"riyadussalihin","text":[{"text":"وعن عائشة رضي الله عنها قالت‏:‏ كان رسول الله صلى الله عليه وسلم يكثر أن يقول قبل موته ‏ \"‏سبحان الله وبحمده، أستغفر الله، وأتوب إليه‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"Prior to his demise, the Messenger of Allah (ﷺ) used to supplicate frequently: Subhan Allahi wa bihamdihi; Astaghfirullaha wa atubu ilaihi (Allah is free from imperfection, and I begin with praising Him. I beg forgiveness from Allah and I turn to Him in repentance.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Sebelum kematiannya, Rasulullah (ﷺ) sering berdoa: Subhan Allahi wa bihamdihi; Astaghfirullaha wa atubu ilaihi (Allah bebas dari ketidaksempurnaan, dan saya mulai dengan memuji-Nya. Saya mohon pengampunan dari Allah dan saya kembali kepada-Nya dalam pertobatan.” [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"\u0027Aishah (May Allah be pleased with her) reported:","language":"english"},{"text":"\u0027Aisyah r.a. melaporkan:","language":"bahasa"}]},{"index":"1878","hadith_id":"riyadussalihin","text":[{"text":"وعن أنس رضي الله عنه قال‏:‏ سمعت رسول الله صلى الله عليه وسلم يقول‏:‏ “قال الله تعالى‏:‏ يا ابن آدم إنك ما دعوتني ورجوتني غفرت لك ما كان منك ولا أبالي، يا ابن آدم لو بلغت ذنوبك عنان السماء، ثم استغفرتني ، غفرت لك ولا أبالي، يا ابن آدم إنك لو أتيتني بقراب الأرض خطايا، ثم لقيتني لا تشرك بي شيئاً، لأتيتك بقرابها مغفرة‏\"‏ ‏.‏ (2)","language":"arabic"},{"text":"I heard the Messenger of Allah (ﷺ) saying, \"Allah, the Exalted, has said: \u0027O son of Adam! I shall go on forgiving you so long as you pray to Me and aspire for My forgiveness whatever may be your sins. O son of Adam! I do not care even if your sins should pile up to the sky and should you beg pardon of Me, I would forgive you. O son of Adam! If you come to Me with an earthful of sins and meet Me, not associating anything with Me in worship, I will certainly grant you as much pardon as will fill the earth.\"\u0027 [At-Tirmidhi].","language":"english"},{"text":"Aku mendengar Rasulullah (ﷺ) berkata, \"Allah Ta\u0027ala berfirman: \u0027Hai anak Adam! Aku akan terus memaafkanmu selama kamu berdoa kepada-Ku dan memohon pengampunan-Ku, apa pun dosamu. Wahai anak Adam! Aku tidak peduli bahkan jika dosamu menumpuk ke langit dan jika kamu meminta maaf kepada-Ku, aku akan memaafkanmu. Wahai anak Adam! Jika kamu datang kepada-Ku dengan segudang dosa dan bertemu dengan-Ku , tidak menyekutukan-Ku dalam beribadah, niscaya Aku akan memberimu ampunan sebanyak yang memenuhi bumi.”\u0027 [At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Anas (May Allah be pleased with him) said:","language":"english"},{"text":"Anas (semoga Allah meridhoinya) berkata:","language":"bahasa"}]},{"index":"1879","hadith_id":"riyadussalihin","text":[{"text":"وعن ابن عمر رضي الله عنهما أن النبي صلى الله عليه وسلم قال‏:‏ ‏\"‏يا معشر النساء تصدقن، وأكثرن من الاستغفار، فإني رأيتكن أكثر أهل النار‏\"‏ قالت امرأة منهن‏:‏ مالنا أكثر أهل النار‏؟‏ قال‏:‏ ‏\"‏تكثرن اللعن، وتكفرن العشير مارأيت من ناقصات عقل ودين أغلب لذي لب منكن‏\"‏ قالت‏:‏ ما نقصان العقل والدين‏؟‏ قال‏\"‏ ‏\"‏شهادة امرأتين بشهادة رجل، وتمكث الأيام لا تصلي‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Prophet (ﷺ) said, \"O women folk! You should give charity and be diligent in seeking Allah\u0027s forgiveness because I have seen (i.e., on the Night of the Ascension to the highest heavens) that dwellers of the Hell are women.\" A woman amongst them said: \"Why is it that the majority of the dwellers of Hell are women?\" The Prophet (ﷺ) replied, \"You curse frequently and are ungrateful to your husbands. In spite of your lacking in wisdom and failing in religion, you are depriving the wisest of men of their intelligence.\" Upon this the woman asked: \"What is the deficiency in our wisdom and in our religion?\" He (ﷺ) replied, \"Your lack of wisdom can be well judged from the fact that the evidence of two women is equal to that one man. You do not offer Salat (prayer) for some days and you do not fast (the whole of) Ramadan sometimes, it is a deficiency in religion.\" [Muslim].","language":"english"},{"text":"Nabi (ﷺ) berkata, \"Hai kaum wanita! Kalian harus bersedekah dan rajin mencari pengampunan Allah karena saya telah melihat (yaitu, pada Malam Kenaikan ke langit tertinggi) bahwa penghuni Neraka adalah wanita.\" Seorang wanita di antara mereka berkata: \"Mengapa mayoritas penghuni Neraka adalah wanita?\" Nabi (ﷺ) menjawab, \"Kamu sering mengutuk dan tidak berterima kasih kepada suamimu. Meskipun kamu kurang dalam kebijaksanaan dan gagal dalam agama, kamu merampas kecerdasan orang yang paling bijaksana.\" Atas pertanyaan ini wanita itu bertanya: \"Apa kekurangan dalam kebijaksanaan kami dan dalam agama kami?\" Dia (ﷺ) menjawab, \"Kekurangan kebijaksanaan Anda dapat dinilai dengan baik dari fakta bahwa bukti dua wanita sama dengan satu pria itu. [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Ibn \u0027Umar (May Allah be pleased with them) said:","language":"english"},{"text":"Ibn \u0027Umar (semoga Allah meridhoi mereka) berkata:","language":"bahasa"}]},{"index":"1880","hadith_id":"riyadussalihin","text":[{"text":"وعن جابر رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ “يأكل أهل الجنة فيها ، ويشربون ، ولا يتغوطون، ولا يتمخطون، ولا يبولون، ولكن طعامهم ذلك جشاء كرشح المسك، يلهمون التسبيح والتكبير، كما يلهمون النفس‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"The inhabitants of Jannah will eat and drink therein, but they will not have to pass excrement, to blow their noses or to urinate. Their food will be digested producing belch which will give out a smell like that of musk. They will be inspired to declare the freedom of Allah from imperfection and proclaim His Greatness as easily as you breathe.\" [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Penghuni Jannah akan makan dan minum di dalamnya, tetapi mereka tidak harus mengeluarkan kotoran, untuk meniup hidung atau buang air kecil. Makanan mereka akan dicerna menghasilkan sendawa yang mengeluarkan bau. seperti musk. Mereka akan terinspirasi untuk menyatakan kebebasan Allah dari ketidaksempurnaan dan menyatakan Keagungan-Nya semudah Anda bernafas.\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Jabir (May Allah be pleased with him) reported:","language":"english"},{"text":"Jabir (ra dengan dia) melaporkan:","language":"bahasa"}]},{"index":"1881","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي هريرة رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏قال الله تعالى أعددت لعبادي الصالحين ما لا عين رأت ولا أذن سمعت ولا خطر على قلب بشر، واقرؤوا إن شئتم‏:‏ ‏{‏فلا تعلم نفس ما أخفي لهم من قرة أعين جزاء بما كانوا يعملون‏}‏ ‏(‏‏(‏السجدة‏:‏17‏)‏‏)‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"Allah, the Exalted, has said: \u0027I have prepared for my righteous slaves what no eye has seen, no ear has heard, and the mind of no man has conceived.\u0027 If you wish, recite: \u0027No person knows what is kept hidden for them of joy as a reward for what they used to do.\"\u0027 (32:17) [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Allah, Ta\u0027ala, telah berfirman: \u0027Aku telah menyediakan untuk hamba-hamba-Ku yang saleh apa yang belum pernah dilihat mata, tidak didengar telinga, dan tidak dipikirkan oleh manusia.\u0027 Jika Anda mau, bacalah: \u0027Tidak ada seorang pun yang mengetahui apa yang disembunyikan bagi mereka sebagai imbalan atas apa yang telah mereka lakukan.\"\u0027 (32:17) [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) said:","language":"english"},{"text":"Abu Hurairah r.a. berkata:","language":"bahasa"}]},{"index":"1882","hadith_id":"riyadussalihin","text":[{"text":"وعنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏ \"‏أول زمرة يدخلون الجنة على صورة القمر ليلة البدر، ثم الذين يلونهم على أشد كوكب دري في السماء إضاءة، لا يبولون ولا يتغوطون، ولا يتفلون، ولا يتمخطون، أمشاطهم الذهب، وريحهم المسك، ومجامرهم الألوة -عود الطيب- أزواجهم الحورالعين، على خلق رجل واحد، على صورة أبيهم آدم ستون ذراعاً في السماء‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏ وفي رواية للبخاري ومسلم‏:‏ آنيتهم فيها الذهب، ورشحهم المسك، ولكل واحد منهم زوجتان يرى مخ ساقهما من وراء اللحم من الحسن، لا اختلاف بينهم ، ولا تباغض‏:‏ قلوبهم قلب رجل واحد، يسبحون الله بكرة وعشياً‏. قوله: (على خلق رجل واحد). رواه بعضهم بفتح الخاء واسكان اللام وبعضهم بضمهما وكلاهما صحيح.","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"The first group (of people) to enter Jannah will be shining like the moon on a full-moon night. Then will come those who follow them who will be like the most shining planet in the sky. They will not stand in need of urinating or relieving of nature or of spitting or blowing their noses. Their combs will be of gold and their sweat will smell like musk; in their censers the aloes-wood will be used. Their wives will be large eyed maidens. All men will be alike in the form of their father \u0027Adam, sixty cubits tall.\" Another narration is: The Messenger of Allah (ﷺ) said, \"Their utensils will be of gold, their perspiration will smell like musk; everyone of them will have two wives; the marrow of the bones of the wives\u0027 legs will be seen through the flesh out of excessive beauty. They (i.e., the people of Jannah) will neither have difference, nor enmity (hatred) amongst themselves; their hearts will be as if one heart, and they will be glorifying Allah in the morning and in the afternoon.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Kelompok (orang) pertama yang masuk Jannah akan bersinar seperti bulan di malam bulan purnama. Kemudian akan datang orang-orang yang mengikuti mereka yang akan menjadi seperti planet yang paling bersinar di bumi. langit. Mereka tidak akan tahan untuk buang air kecil atau buang air besar, atau meludah atau meniup hidung mereka. Sisir mereka dari emas dan keringat mereka berbau kesturi; dalam pedupaan mereka digunakan kayu gaharu. Istri mereka akan jadilah gadis bermata besar. Semua pria akan sama dalam bentuk ayah mereka \u0027Adam, tingginya enam puluh hasta.\" Riwayat lain adalah: Rasulullah (ﷺ) berkata, “Peralatan mereka terbuat dari emas, keringat mereka berbau kesturi; setiap orang dari mereka akan memiliki dua istri; sumsum tulang kaki istri akan terlihat melalui. daging dari keindahan yang berlebihan. Mereka (yaitu, penghuni Jannah) tidak akan ada perbedaan, atau permusuhan (benci) di antara mereka sendiri; hati mereka akan menjadi seolah-olah satu hati, dan mereka akan bertasbih kepada Allah di pagi dan sore hari. sore.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) said:","language":"english"},{"text":"Abu Hurairah r.a. berkata:","language":"bahasa"}]},{"index":"1883","hadith_id":"riyadussalihin","text":[{"text":"وعن المغيرة بن شعبة رضي الله عنه عن رسول الله صلى الله عليه وسلم قال‏:‏ ‏ \"‏سأل موسى صلى الله عليه وسلم ربه، ما أدنى أهل الجنة منزلة ‏؟‏ قال‏:‏ هو رجل يجيء بعد ما أدخل أهل الجنة-الجنة، فيقال له ‏:‏ ادخل الجنة، فيقول‏:‏ أي رب كيف وقد نزل الناس منازلهم، وأخذوا أخذاتهم‏؟‏ فيقول له‏:‏ أترضى أن يكون لك مثل ملك ملك من ملوك الدنيا‏؟‏ فيقول‏:‏ رضيت رب فيقول‏:‏ لك ذلك ومثله ومثله ومثله ومثله، فيقول في الخامسة‏:‏ رضيت يا رب فيقول‏:‏ هذا لك وعشرة أمثاله، ولك ما اشتهيت نفسك، ولذت عينك، فيقول‏:‏ رضيت رب، قال رب فأعلاهم منزلة‏؟‏ قال‏:‏ أولئك الذين أردت؛ غرست كرامتهم بيدي، وختمت عليها، فلم تر عين، ولم تسمع أذن، ولم يخطر على قلب بشر‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"Musa (Moses) (ﷺ) asked his Rubb: \u0027Who amongst the inhabitants of Jannah will be the lowest in rank?\u0027 He said: \u0027It will be a person who will be admitted into Jannah last of all when all the dwellers of Jannah have entered Jannah. It will be said to him: Enter Jannah. But he will say: O my Rubb! How should I enter while the people have settled in their apartments and taken their shares? It will be said to him: Will you be satisfied and pleased if you have a kingdom like that of a monarch of the world? He will say: I will be content, my Rubb. Allah will say: For you is that, and like that and like that and like that and like that. He will say at the fifth time: I am well-pleased, my Rubb. Allah will say: It is for you and ten times more like it. You will have whatever your soul desires and whatever your eyes could delight in. He will say: I am well-pleased, my Rubb.\u0027 Musa (ﷺ) said: \u0027Who will be of the highest rank in Jannah.\u0027 Allah said: \u0027They are those whom I chose and I established their honour with My Own Hand. I attest with My Seal that they will be blessed with such bounties as no eye has seen, no ear has heard and no human mind has perceived.\"\u0027 [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Musa (Musa) (ﷺ) bertanya kepada Rubb-nya: \u0027Siapa di antara penghuni Jannah yang paling rendah derajatnya?\u0027 Dia berkata: \"Ini akan menjadi orang yang akan dimasukkan ke dalam Jannah yang terakhir ketika semua penghuni Jannah telah memasuki Jannah. Akan dikatakan kepadanya: Masuklah ke Jannah. Tetapi dia akan berkata: Wahai Rub-ku! Bagaimana aku harus melakukannya? masuk sementara orang-orang telah menetap di apartemen mereka dan mengambil bagian mereka? Akan dikatakan kepadanya: Apakah Anda akan puas dan senang jika Anda memiliki kerajaan seperti raja dunia? Dia akan berkata: Saya akan puas, Rubb saya. Allah akan berkata: Untuk Anda adalah itu, dan seperti itu dan seperti itu dan seperti itu dan seperti itu. Dia akan berkata pada kelima kalinya: Saya senang, Rubb saya. Allah akan berkata: Ini untukmu dan sepuluh kali lebih menyukainya. Anda akan memiliki apa pun yang diinginkan jiwa Anda dan apa pun yang dapat dinikmati oleh mata Anda. Dia akan berkata: Saya sangat senang, Rubb saya.\u0027 Musa (ﷺ) berkata: \u0027Siapa yang akan menjadi peringkat tertinggi di Jannah.\u0027 Allah berfirman: \u0027Mereka itulah orang-orang yang Aku pilih dan Aku tegakkan kehormatan mereka dengan Tangan-Ku sendiri. Aku bersaksi dengan Meterai-Ku bahwa mereka akan diberkahi dengan karunia yang belum pernah dilihat mata, tidak didengar telinga, dan tidak dirasakan oleh pikiran manusia.\"\u0027 [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Al-Mughirah bin Shu\u0027bah (May Allah be pleased with him) said:","language":"english"},{"text":"Al-Mughirah bin Shu\u0027bah r.a. berkata:","language":"bahasa"}]},{"index":"1884","hadith_id":"riyadussalihin","text":[{"text":"وعن ابن مسعود رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏إني لأعلم آخر النار خروجاً منها، وآخر أهل الجنة دخولاً الجنة، رجل يخرج من النار حبوا؛ فيقول الله عز وجل له‏:‏ اذهب فادخل الجنة، فيأتيها، فيخيل إليه أنها ملأى، فيرجع فيقول‏:‏ يا رب وجدتها ملأى، فيقول الله عز وجل له‏:‏ اذهب فادخل الجنة، فيرجع ، فيقول‏:‏ يا رب وجدتها ملأى، في سورة يقول الله عز وجل له ‏:‏ اذهب فادخل الجنة ، فيأتيها، فيخيل إليه أنها ملأى، فيرجع، فيقول‏:‏ يا رب وجدتها ملأى‏!‏ فيقول الله عز وجل له‏:‏ اذهب فادخل الجنة، فإن لك مثل الدنيا وعشرة أمثالها أو إن لك مثل عشرة أمثال الدنيا، فيقول‏:‏ أتسخر بي، أو تضحك بي وأنت الملك” قال‏:‏ فلقد رأيت رسول الله صلى الله عليه وسلم ضحك حتى بدت نواجذه فكان يقول‏:‏ ‏\"‏ذلك أدنى أهل الجنة منزلة‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"I know of the last of the inhabitants of the Hell to be taken out from there and the last one to enter Jannah. He is a man who will come out of the Fire, crawling on all fours. Allah, the Rubb of glory and honour will say to him: \u0027Go and enter Jannah.\u0027 He will go to it and think that it is full up. He will then come back and say: \u0027O my Rubb, it is full up.\u0027 Allah will say to him: \u0027Go and enter Jannah.\u0027 He will again go to it and think that it is full up. So he will turn back. Allah will again say: \u0027Go and enter Jannah. For you have what is equal to ten times the world.\u0027 He will say: \u0027Are You making fun of me while You are the King?\" At this I (i.e., the narrator) saw the Messenger of Allah (ﷺ) laugh till his premolars were visible and he said, \"Such man will be the last dweller of Jannah in its lowest rank.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Aku tahu penghuni neraka terakhir yang dikeluarkan dari sana dan yang terakhir masuk Jannah. Dia adalah orang yang akan keluar dari Neraka, merangkak di atas segala empat. Allah, Rubb kemuliaan dan kehormatan akan berkata kepadanya: \u0027Pergilah dan masuk Jannah.\u0027 Dia akan pergi ke sana dan berpikir bahwa itu sudah penuh. Dia kemudian akan kembali dan berkata: \u0027O Rubb-ku, itu penuh.\u0027 Allah akan berkata kepadanya: \u0027Pergilah dan masuklah ke Jannah.\u0027 Dia akan kembali ke sana dan berpikir bahwa itu sudah penuh. Jadi dia akan kembali. Allah akan berkata lagi: \u0027Pergilah dan masuklah ke Jannah. Bagimu apa yang setara dengan sepuluh kali dunia.\u0027 Dia akan berkata: \u0027Apakah Anda mengolok-olok saya saat Anda adalah Raja? Pada saat ini saya (yaitu, perawi) melihat Rasulullah (ﷺ) tertawa sampai gigi gerahamnya terlihat dan dia berkata, \" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"\u0027Abdullah bin Mas\u0027ud (May Allah be pleased with him) reported:","language":"english"},{"text":"\u0027Abdullah bin Mas\u0027ud (ra dengan dia) melaporkan:","language":"bahasa"}]},{"index":"1885","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي موسى رضي الله عنه أن النبي صلى الله عليه وسلم قال‏:‏ ‏\"‏إن للمؤمن في الجنة لخيمة من لؤلؤة واحدة مجوفة طولها في السماء ستون ميلاً، للمؤمن فيها أهلون، يطوف عليهم المؤمن فلا يرى بعضهم بعضاً، ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏«الميل» : ستة آلاف ذراع","language":"arabic"},{"text":"The Prophet (ﷺ) said, \"In Jannah the believer will have a tent made of a single hollowed pearl of which the length will be sixty miles in the sky. The believer will have his wives with him and he will visit them and they will not be able to see one another.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Nabi (ﷺ) berkata, \"Di Jannah orang beriman akan memiliki tenda yang terbuat dari satu mutiara berlubang yang panjangnya enam puluh mil di langit. Orang beriman akan memiliki istri bersamanya dan dia akan mengunjungi mereka dan mereka akan tidak bisa bertemu satu sama lain.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Musa (May Allah be pleased with him) said:","language":"english"},{"text":"Abu Musa (semoga Allah meridhoinya) berkata:","language":"bahasa"}]},{"index":"1886","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي سعيد الخدري رضي الله عنه عن النبي صلى الله عليه وسلم قال‏:‏ ‏\"‏إن في الجنة لشجرة يسير الراكب الجواد المضمر السريع مائة سنة ما يقطعها ‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏ وروياه في ‏\"‏الصحيحين‏\"‏ أيضاً من رواية أبي هريرة رضي الله عنه قال‏:‏ ‏\"‏يسير الراكب في سورة في ظلها سنة ما يقطعها‏\"‏‏.‏","language":"arabic"},{"text":"The Prophet (ﷺ) said, \"There is a tree in Jannah that is so huge that if a rider of a swift horse has to cover its distance from one end to another in one hundred years, he will not be able to do so.\" Another narration from Abu Hurairah (May Allah be pleased with him) is: The Messenger of Allah (ﷺ) said, \"A rider will not be able to cross its (the tree\u0027s) shade even after travelling for one hundred years.\" [Al-Bukhari and Muslim]","language":"english"},{"text":"Nabi (ﷺ) berkata, \"Ada pohon di Jannah yang sangat besar sehingga jika penunggang kuda yang cepat harus menempuh jarak dari satu ujung ke ujung lainnya dalam seratus tahun, dia tidak akan mampu melakukannya. \" Riwayat lain dari Abu Hurairah (ra dengan dia) adalah: Rasulullah (ﷺ) berkata, \"Seorang pengendara tidak akan dapat melintasi naungan (pohon) bahkan setelah bepergian selama seratus tahun.\" [Al-Bukhari dan Muslim]","language":"bahasa"}],"narrated":[{"text":"Abu Sa\u0027id Al-Khudri (May Allah be pleased with him) said:","language":"english"},{"text":"Abu Sa\u0027id Al-Khudri r.a. berkata:","language":"bahasa"}]},{"index":"1887","hadith_id":"riyadussalihin","text":[{"text":"وعنه عن النبي صلى الله عليه وسلم قال‏:‏ ‏\"‏إن أهل الجنة ليتراءون أهل الغرف من فوقهم كما تراءون الكوكب الدري الغابر في الأفق من المشرق أو المغرب لتفاضل ملا بينهم‏\"‏ قالوا‏:‏ يا رسول الله، تلك منازل الأنبياء لا يبلغها غيرهم‏؟‏ قال‏:‏ “بلى والذي نفسي بيده رجال آمنوا بالله وصدقوا المرسلين‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Prophet (ﷺ) said, \"The dwellers of Jannah will look at those in the upper abodes above them as you look at a shining star which remains in the eastern or western horizon; such will be the difference in superiority which some of them have over others.\" The Messenger of Allah (ﷺ) was asked: \"Will those be the dwellings of the Prophets which no one else will be able to reach?\" He (ﷺ) replied, \"Yes, but by Him in Whose Hand my soul is! men who believed in Allah and acknowledged the truthfulness of the Messengers will reach them.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Nabi (ﷺ) berkata, \"Penghuni Jannah akan melihat mereka di tempat-tempat atas di atas mereka seperti Anda melihat bintang bersinar yang tetap di ufuk timur atau barat; demikianlah perbedaan keunggulan yang dimiliki sebagian dari mereka. atas orang lain.\" Rasulullah (ﷺ) ditanya: \"Apakah itu akan menjadi tempat tinggal para Nabi yang tidak dapat dijangkau oleh orang lain?\" Dia (ﷺ) menjawab, \"Ya, tetapi demi Dzat yang jiwaku berada di tangan-Nya! Orang-orang yang beriman kepada Allah dan mengakui kebenaran para Rasul akan mencapai mereka.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Sa\u0027id Al-Khudri (May Allah be pleased with him) said:","language":"english"},{"text":"Abu Sa\u0027id Al-Khudri r.a. berkata:","language":"bahasa"}]},{"index":"1888","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏ \"‏لقاب قوس في الجنة خير مما تطلع عليه الشمس أو تغرب‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"A space in Jannah equal to the distance between the middle and the end of a bow will be better than all that upon which the sun rises and sets.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Sebuah ruang di Jannah yang sama dengan jarak antara tengah dan ujung busur akan lebih baik daripada semua tempat matahari terbit dan terbenam.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) said:","language":"english"},{"text":"Abu Hurairah r.a. berkata:","language":"bahasa"}]},{"index":"1889","hadith_id":"riyadussalihin","text":[{"text":"وعن أنس رضي الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏ \"‏إن في الجنة سوقاً يأتونها كل جمعة‏.‏ فتهب ريح الشمال، فتحثوا في وجوههم وثيابهم، فيزدادون حسناً وجمالاً فيرجعون إلى أهليهم، وقد ازدادوا حسناً وجمالاً، فيقول لهم أهلوهم‏:‏ والله لقد ازددتم حسناً وجمالاً‏!‏ فيقولون‏:‏ وأنتم والله لقد ازددتم بعدنا حسناً وجمالاً‏!‏‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"In Jannah there is a market to which the people will come every Friday. The northern wind will blow and shower fragrance on their faces and clothes and, consequently, it will enhance their beauty and loveliness. They will then return to their wives who will also have increased in their beauty and loveliness, and their families will say to them: \u0027We swear by Allah that you have been increased in beauty and loveliness since leaving us.\u0027 Thereupon they will reply: \u0027We swear by Allah that you have also been increased in beauty and loveliness since we left you.\"\u0027 [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Di Jannah ada pasar yang didatangi orang-orang setiap hari Jumat. Angin utara akan bertiup dan menghujani wajah dan pakaian mereka dengan wewangian dan, akibatnya, itu akan meningkatkan kecantikan dan kecantikan mereka. Kemudian mereka akan kembali kepada istri-istri mereka yang juga bertambah kecantikan dan ketampanannya, dan keluarga mereka akan berkata kepada mereka: \u0027Kami bersumpah demi Allah bahwa kecantikan dan ketampanan kalian bertambah sejak meninggalkan kami.\u0027 Kemudian mereka akan menjawab: \u0027Kami bersumpah demi Allah bahwa Anda juga telah meningkat dalam keindahan dan keindahan sejak kami meninggalkan Anda.\"\u0027 [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Anas (May Allah be pleased with him) said:","language":"english"},{"text":"Anas (semoga Allah meridhoinya) berkata:","language":"bahasa"}]},{"index":"1890","hadith_id":"riyadussalihin","text":[{"text":"وعن سهل بن سعد رضي الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏ \"‏إن أهل الجنة ليتراءون الغرف في الجنة كما تتراءون الكوكب في السماء‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"The dwellers of Jannah will see the upper abodes of Jannah as you see the stars in the sky.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Penghuni Jannah akan melihat bagian atas Jannah sebagaimana kalian melihat bintang-bintang di langit.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Sahl bin Sa\u0027d (May Allah be pleased with him) said:","language":"english"},{"text":"Sahl bin Sa\u0027ad r.a. berkata:","language":"bahasa"}]},{"index":"1891","hadith_id":"riyadussalihin","text":[{"text":"وعنه رضي الله عنه قال‏:‏ شهدت من النبي صلى الله عليه وسلم مجلساً وصف فيه الجنة حتى انتهى، ثم قال في آخر حديثه‏:‏ ‏ \"‏فيها مالا عين رأت، ولا أذن سمعت، ولا خطر على قلب بشر‏\"‏ ثم قرأ ‏{‏تتجافى جنوبهم عن المضاجع‏}‏ إلى قوله تعالى‏:‏ ‏{‏فلا تعلم نفس ما أخفي لهم من قرة أعين‏}‏‏.‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","language":"arabic"},{"text":"I was in the company of the Prophet (ﷺ). He gave a description of Jannah and concluded with these words, \"There will be bounties which no eye has seen, no ear has heard and no human heart has ever perceived.\" He (ﷺ) then recited this Verse: \"Their sides forsake their beds, to invoke their Rubb in fear and hope, and they spend (in charity in Allah\u0027s Cause) out of what We have bestowed on them. No person knows what is kept hidden for them of joy...\" (32:16,17) [Al-Bukhari].","language":"english"},{"text":"Saya berada di perusahaan Nabi (ﷺ). Dia memberikan deskripsi Jannah dan menyimpulkan dengan kata-kata ini, \"Akan ada karunia yang tidak pernah dilihat mata, tidak didengar telinga dan tidak pernah dirasakan oleh hati manusia.\" Dia (ﷺ) kemudian membacakan Ayat ini: \"Lambung mereka meninggalkan tempat tidur mereka, untuk berdoa Rubb mereka dalam ketakutan dan harapan, dan mereka menafkahkan (dalam sedekah di jalan Allah) dari apa yang telah Kami berikan kepada mereka. Tidak ada seorang pun yang tahu apa yang disimpan. tersembunyi bagi mereka kebahagiaan...\" (32:16,17) [Al-Bukhari] .","language":"bahasa"}],"narrated":[{"text":"Sahl bin Sa\u0027d (May Allah be pleased with him) said:","language":"english"},{"text":"Sahl bin Sa\u0027ad r.a. berkata:","language":"bahasa"}]},{"index":"1892","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي سعيد وأبي هريرة رضي الله عنهما أن رسول الله صلى الله عليه وسلم قال‏:‏ “إذا دخل أهل الجنة - الجنة- ينادي مناد‏:‏ إن لكم أن تحيوا، فلا تموتوا أبداً، وإن لكم أن تصحوا، فلا تسقموا أبداً، وإن لكم أن تشبوا فلا تهرموا أبداً، وإن لكم أن تنعموا، فلا تبأسوا أبداً‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"When the dwellers of Jannah enter Jannah, an announcer will call: (You have a promise from Allah that) you will live therein and you will never die; you will stay healthy therein and you will never fall ill; you will stay young and you will never become old; you will be under a constant bliss and you will never feel miserable.\" [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Ketika penghuni Jannah memasuki Jannah, seorang penyiar akan memanggil: (Kamu memiliki janji dari Allah bahwa) kamu akan hidup di dalamnya dan kamu tidak akan pernah mati; kamu akan tetap sehat di dalamnya dan kamu akan tidak pernah jatuh sakit; Anda akan tetap muda dan Anda tidak akan pernah menjadi tua; Anda akan berada di bawah kebahagiaan yang konstan dan Anda tidak akan pernah merasa sengsara.” [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Sa\u0027id and Abu Hurairah (May Allah be pleased with them) reported:","language":"english"},{"text":"Abu Sa\u0027id dan Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"1893","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏ \"‏إن أدنى مقعد أحدكم من الجنة أن يقول له‏:‏ تمن فيتمنى ويتمنى، فيقول له‏:‏ هل تمنيت‏؟‏ فيقول‏:‏ نعم، فيقول له‏:‏ فإن لك ما تمنيت ومثله معه‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"The lowest place of any of you in Jannah will be that Allah will tell him to express his wish. He will wish and wish again. Allah will then ask him: \u0027Have you expressed your wish?\u0027 He will answer: \u0027Yes, I have.\u0027 Allah will say: \u0027You will have what you have wished for and the like thereof along with it.\"\u0027 [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Tempat terendah dari kalian di Jannah adalah bahwa Allah akan memberitahu dia untuk mengungkapkan keinginannya. Dia akan berharap dan berharap lagi. Allah kemudian akan bertanya kepadanya: \u0027Sudahkah kamu mengungkapkan keinginanmu? ?\u0027 Dia akan menjawab: \u0027Ya, saya punya.\u0027 Allah akan berfirman: \u0027Kamu akan mendapatkan apa yang kamu inginkan dan yang serupa dengannya.\u0027\u0027 [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) said:","language":"english"},{"text":"Abu Hurairah r.a. berkata:","language":"bahasa"}]},{"index":"1894","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي سعيد الخدري رضي الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏ \"‏إن الله عز وجل يقول لأهل الجنة‏:‏ يا أهل الجنة، فيقولون ‏:‏ لبيك ربنا وسعديك، والخير في يديك فيقول‏:‏ هل رضيتم‏؟‏ فيقولون‏:‏ وما لنا لا نرضى يا ربنا وقد أعطيتنا مالم تعط أحداً من خلقك‏!‏ فيقول‏:‏ ألا أعطيكم أفضل من ذلك فيقولون‏:‏ وأي شيء أفضل من ذلك‏؟‏ فيقول‏:‏ أحل عليكم رضواني، فلا أسخط عليكم بعده أبداً‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"Allah, the Rubb of honour and glory, will say to the inhabitants of Jannah: \u0027O inhabitants of Jannah!\u0027 They will respond: \u0027Here we are! At Your service, O our Rubb. All good is in Your Hand!\u0027 He will ask them: \u0027Are you pleased?\u0027 They will reply: \u0027Why should we not be pleased, O Rubb, when You have given us what You have not given to any of Your creatures?\u0027 Allah will say: \u0027Shall I not give you something better than that?\u0027 They will ask: \u0027O Rubb! What can be better than that?\u0027 Allah will say: \u0027I shall bestow My Pleasure upon you and I shall never be displeased with you.\"\u0027 [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Allah, Rubb kehormatan dan kemuliaan, akan berkata kepada penghuni Jannah: \u0027Wahai penghuni Jannah!\u0027 Mereka akan menjawab: \u0027Inilah kami! Siap melayani Anda, O Karet kami. Segala kebaikan ada di tangan-Mu!\u0027 Dia akan bertanya kepada mereka: \u0027Apakah kamu senang?\u0027 Mereka akan menjawab: \u0027Mengapa kami tidak senang, wahai Rubb, ketika Engkau telah memberi kami apa yang tidak Engkau berikan kepada makhluk-Mu?\u0027 Allah akan berfirman: \u0027Maukah Aku memberimu sesuatu yang lebih baik dari itu?\u0027 Mereka akan bertanya: \u0027O Rubb! Apa yang lebih baik dari itu?\u0027 Allah akan berfirman: \u0027Aku akan melimpahkan keridhaan-Ku kepadamu dan Aku tidak akan pernah murka kepadamu.\"\u0027 [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Sa\u0027id Al-Khudri (May Allah be pleased with him) said:","language":"english"},{"text":"Abu Sa\u0027id Al-Khudri r.a. berkata:","language":"bahasa"}]},{"index":"1895","hadith_id":"riyadussalihin","text":[{"text":"وعن جرير بن عبد الله رضي الله عنه قال‏:‏ كنا عند رسول الله صلى الله عليه وسلم فنظر إلى القمر ليلة البدر، وقال‏:‏ ‏ \"‏إنكم سترون ربكم عياناً كما ترون هذا القمر، لا تضامون في رؤيته‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏ ‏.‏","language":"arabic"},{"text":"We were sitting with the Messenger of Allah (ﷺ) when he looked at the full moon and observed, \"You shall see your Rubb in the Hereafter as you are seeing this moon; and you will not feel the slightest inconvenience in seeing Him.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Kami sedang duduk dengan Rasulullah (ﷺ) ketika ia melihat bulan purnama dan mengamati, \"Anda akan melihat Rubb Anda di akhirat seperti Anda melihat bulan ini, dan Anda tidak akan merasakan ketidaknyamanan sedikit pun dalam melihat-Nya.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Jarir bin \u0027Abdullah (May Allah be pleased with him) reported:","language":"english"},{"text":"Jarir bin \u0027Abdullah (ra dengan dia) melaporkan:","language":"bahasa"}]},{"index":"1896","hadith_id":"riyadussalihin","text":[{"text":"وعن صهيب رضي الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏\"‏إذا دخل أهل الجنة -الجنة- يقول الله تبارك وتعالى‏:‏ تريدون شيئاً أزيدكم‏؟‏ فيقولون‏:‏ ألم تبيض وجوهنا‏؟‏ ألم تدخلنا الجنة وتنجنا من النار‏؟‏ فيكشف الحجاب، فما أعطو شيئاً أحب إليهم من النظر إلى ربهم‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏ قال الله تعالى‏:‏ ‏{‏إن الذين آمنوا وعملوا الصالحات يهديهم ربهم بإيمانهم تجري من تحتهم الأنهار في جنات النعيم* دعواهم فيها سبحانك اللهم وتحيتهم فيها سلام وآخر دعواهم أن الحمد لله رب العالمين‏}‏ ‏(‏‏(‏يونس‏:‏9،10‏)‏‏)‏‏.‏ الحمد لله الذي هدانا لهذا وما كنا لنهتدى لولا أن هدانا الله‏.‏ اللهم صل على محمد وعلى آل محمد، كما صليت على إبراهيم وعلى آل إبراهيم ، وبارك على محمد، وعلى آل محمد، كما باركت على إبراهيم وعلى آل إبراهيم ، إنك حميد مجيد‏.‏ قال مؤلفه رضي الله عنه ‏:‏ ‏\"‏ فرغت منه يوم الاثنين رابع شهر رمضان سنة سبعين وستمائة‏\"‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"When the inhabitants of Jannah enter Jannah, Allah, the Glorious and Exalted, will say to them: \u0027Do you wish me to give you anything more?\u0027 They will reply: \u0027Have You not made our faces bright? Have You not brought us into Jannah and delivered us from the Hell?\u0027 And Allah will remove the Veil. The (dwellers of Jannah) will feel that they have not been awarded anything dearer to them than looking at their Rubb.\" [Muslim]. Allah, the Exalted, says: \"Verily, those who believe and do deeds of righteousness, their Rubb will guide them through their Faith; under them will flow rivers in the Gardens of Delight (Jannah). Their way of request therein will be Subhanaka Allahumma (Glory to You, O Allah!) and Salam (peace, safety from evil) will be their greetings therein (Jannah)! and the close of their request will be: Al-hamdu lillahi Rabbil-\u0027Alamin [All the praises and thanks are to Allah, the Rubb of \u0027Alamin (mankind, jinn and all that exists)].\" (10:9,10)","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Ketika penghuni Jannah memasuki Jannah, Allah, Yang Mulia dan Maha Tinggi, akan berkata kepada mereka: \u0027Apakah kamu ingin aku memberimu sesuatu yang lebih?\u0027 Mereka akan menjawab: \u0027Bukankah Engkau telah membuat wajah kami cerah? Bukankah Engkau telah membawa kami ke Jannah dan membebaskan kami dari Neraka?\u0027 Dan Allah akan membuka selubung itu. Orang-orang (penghuni Jannah) akan merasa bahwa mereka tidak dianugerahi sesuatu yang lebih mereka cintai daripada melihat kotoran mereka.” [Muslim] . Allah Ta\u0027ala berfirman: “Sesungguhnya orang-orang yang beriman dan mengerjakan amal saleh, Rubb mereka akan membimbing mereka melalui Iman mereka; di bawah mereka akan mengalir sungai-sungai di Taman Kesenangan (Jannah). Cara mereka meminta di dalamnya adalah Subhanaka Allahumma (Maha Suci Engkau, ya Allah!) dan Salam (kedamaian, keamanan dari kejahatan) akan menjadi salam mereka di dalamnya (Jannah)! dan penutupan permintaan mereka adalah: Al-hamdu lillahi Rabbil-\u0027Alamin [Segala puji dan syukur bagi Allah, Rubb dari \u0027Alamin (manusia, jin dan semua yang ada)] .\" (10:9,10)","language":"bahasa"}],"narrated":[{"text":"Suhaib (May Allah be pleased with him) reported:","language":"english"},{"text":"Suhaib r.a. melaporkan:","language":"bahasa"}]}]