[{"index":"1397","hadith_id":"riyadussalihin","text":[{"text":"وعن عبد الله بن عمرو بن العاص، رضي الله عنهما أنه سمع رسول الله صلى الله عليه وسلم يقول‏:‏ ‏ \"‏من صلى علي صلاة، صلى الله عليه بها عشرًا‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"I heard the Messenger of Allah (ﷺ) saying: \"Whoever supplicates Allah to exalt my mention, Allah will exalt his mention ten times.\" [Muslim].","language":"english"},{"text":"Aku mendengar Rasulullah (ﷺ) berkata: \"Barangsiapa yang berdoa kepada Allah untuk meninggikan penyebutanku, Allah akan meninggikan penyebutannya sepuluh kali.\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"\u0027Abdullah bin \u0027Amr bin Al-\u0027As (May Allah be pleased with them) reported:","language":"english"},{"text":"\u0027Abdullah bin \u0027Amr bin Al-\u0027As (semoga Allah meridhoi mereka) melaporkan:","language":"bahasa"}]},{"index":"1398","hadith_id":"riyadussalihin","text":[{"text":"وعن ابن مسعود رضي الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ “أولى الناس بي يوم القيامة أكثرهم علي صلاة‏\"‏ رواه الترمذي وقال حديث حسن‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said: \"The people who will be nearest to me on the Day of Resurrection will be those who supplicate Allah more often for me.\" [At-Tirmidhi].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda: “Orang yang paling dekat denganku di hari kiamat adalah orang yang lebih banyak berdoa kepada Allah untukku.” [At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Ibn Mas\u0027ud (May Allah be pleased with him) reported:","language":"english"},{"text":"Ibnu Mas\u0027ud radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"1399","hadith_id":"riyadussalihin","text":[{"text":"وعن أوس بن أوس، رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏\"‏إن من أفضل أيامكم يوم الجمعة، فأكثروا على من الصلاة فيه، فإن صلاتكم معروضة علي‏\"‏ فقالوا‏:‏ يا رسول الله، كيف تعرض صلاتنا عليك وقد أرمت‏؟‏ قال‏:‏ يقول‏:‏ بلىت، قال‏:‏ ‏\"‏إن الله عز وجل حرم على الأرض أجساد الأنبياء‏\"‏ رواه أبو داود بإسناد صحيح‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"Among the best of your days is Friday; so supplicate Allah more often for me in it , for your supplications will be displayed to me.\" He was asked: \"O Messenger of Allah! How will our blessings be displayed to you when your decayed body will have mixed with the earth?\" He (ﷺ) replied, \"Allah has prohibited the earth from consuming the bodies of the Prophets.\" [Abu Dawud].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Di antara hari-hari terbaikmu adalah hari Jumat; maka perbanyaklah berdoa kepada Allah untukku di dalamnya, karena doa-doamu akan dikabulkan kepadaku.\" Dia ditanya: \"Ya Rasulullah! Bagaimana berkah kami akan ditampilkan kepada Anda ketika tubuh membusuk Anda akan bercampur dengan bumi?\" Beliau (ﷺ) menjawab, “Allah telah melarang bumi memakan jenazah para Nabi.” [Abu Daud] .","language":"bahasa"}],"narrated":[{"text":"Aus bin Aus (May Allah be pleased with him) reported:","language":"english"},{"text":"Aus bin Aus (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"1400","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي هريرة رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏ \"‏رغم أنف رجل ذكرت عنده فلم يصلِ علي‏\"‏ رواه الترمذي وقال حديث حسن‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"May his nose soil with dust in whose presence mention is made of me and he does not supplicate for me.\" [At-Tirmidhi].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Semoga hidungnya kotor dengan debu yang di hadapannya disebutkan tentangku dan dia tidak berdoa untukku.\" [At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"1401","hadith_id":"riyadussalihin","text":[{"text":"وعنه رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏ \"‏لا تجعلوا قبري عيدًا وصلوا علي، فإن صلاتكم تبلغني حيث كنتم‏\"‏ رواه أبو داود بإسناد صحيح‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"Do not make my grave a place of festivity, and supplicate Allah for me, for your supplication reaches me wherever you are.\" [Abu Dawud].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Jangan jadikan kuburanku tempat pesta, dan berdoalah untukku, karena doamu sampai padaku di mana pun kamu berada.\" [Abu Daud] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"1402","hadith_id":"riyadussalihin","text":[{"text":"وعنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏ \"‏ما من أحد يسلم علي إلا رد الله علي روحي حتى أرد عليه السلام‏\"‏ ‏(‏‏(‏رواه أبو داود بإسناد صحيح‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"Whenever someone greets me, Allah returns the soul to my body (in the grave) and I return his greeting.\" [Abu Dawud].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Setiap kali seseorang menyapa saya, Allah mengembalikan ruh ke tubuh saya (dalam kubur) dan saya membalas salamnya.\" [Abu Daud] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"1403","hadith_id":"riyadussalihin","text":[{"text":"وعن علي رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏ \"‏ البخيل من ذكرت عنده، فلم يصلِ علي‏\"‏ ‏(‏‏(‏رواه الترمذي وقال‏:‏ حديث حسن صحيح‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"The miser is the one in whose presence I am mentioned but he does not supplicate for me.\" [At- Tirmidhi].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Orang yang kikir adalah orang yang di hadapannya disebutkan aku tetapi dia tidak berdoa untukku.\" [At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"\u0027Ali (May Allah be pleased with him) reported:","language":"english"},{"text":"\u0027Ali (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"1404","hadith_id":"riyadussalihin","text":[{"text":"وعن فضالة بن عبيد رضي الله عنه قال‏:‏ سمع رسول الله صلى الله عليه وسلم رجلا يدعو في صلاته لم يمجد الله تعالى، ولم يصلِ على النبي صلى الله عليه وسلم، فقال رسول الله صلى الله عليه وسلم ‏\"‏عجل هذا‏\"‏ ثم دعاه فقال له -أو لغيره‏:‏ إذا صلى أحدكم فليبدأ بتحميد ربه سبحانه، والثناء عليه، ثم يصلي على النبي صلى الله عليه وسلم ثم يدعو بعد ما شاء‏\"‏ رواه أبو داود والترمذي وقال حديث صحيح‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) heard some one supplicating after his prayer without praising Allah and without supplicating Allah for the Prophet (ﷺ). With regard to him, the Messenger of Allah (ﷺ) said, \"This man rushed.\" Then he called him and said, \"When any one of you have performed Salat (prayer) and wants to supplicate, let him praise Allah first then glorify Him in the beginning and then he should supplicate Allah for me. Then he may supplicate for whatever he likes.\" [Abu Dawud and At-Tirmidhi].","language":"english"},{"text":"Rasulullah () mendengar seseorang berdoa setelah shalatnya tanpa memuji Allah dan tanpa berdoa kepada Allah untuk Nabi (ﷺ). Mengenai dia, Rasulullah (ﷺ) berkata, \"Orang ini bergegas.\" Kemudian dia memanggilnya dan berkata, “Jika salah satu dari kalian telah melakukan shalat dan ingin berdoa, biarkan dia memuji Allah terlebih dahulu kemudian bertasbih kepada-Nya di awal dan kemudian dia harus berdoa kepada Allah untukku. Kemudian dia boleh berdoa untuk apa saja. dia suka.\" [Abu Dawud dan At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Fadalah bin \u0027Ubaid (May Allah be pleased with him) reported:","language":"english"},{"text":"Fadalah bin \u0027Ubaid (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"1405","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي محمد كعب بن عجرة رضي الله عنه قال‏:‏ خرج علينا النبي صلى الله عليه وسلم فقلنا‏:‏ يا رسول الله، قد علمنا كيف نسلم عليك، فكيف نصلي عليك‏؟‏ قال‏:‏ ‏ \"‏قولوا‏:‏ اللهم صلِ على محمد، وعلى آل محمد، كما صليت على آل إبراهيم، إنك حميد مجيد‏.‏ اللهم بارك على محمد وعلى آل محمد، كما باركت على آل إبراهيم، إنك حميد مجيد‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Prophet (ﷺ) came to us and we asked him, \"O Messenger of Allah, we already know how to greet you (i.e., say As-salamu \u0027alaikum), but how should we supplicate for you?\" He (ﷺ) said, \"Say: \u0027Allahumma salli \u0027ala Muhammadin, wa \u0027ala \u0027ali Muhammadin, kama sallaita \u0027ala \u0027ali Ibrahima, innaka Hamidum Majid. Allahumma barik \u0027ala Muhammadin, wa \u0027ala \u0027ali Muhammadin, kama barakta \u0027ala \u0027ali Ibrahima, innaka Hamidum Majid [O Allah, exalt the mention of Muhammad and the family of Muhammad as you exalted the family of Ibrahim. You are Praised and Glorious. O Allah, bless Muhammad and the family of Muhammad as You blessed the family of Ibrahim. You are Praised and Glorious.\"\u0027 [Al-Bukhari and Muslim].","language":"english"},{"text":"Nabi (ﷺ) datang kepada kami dan kami bertanya kepadanya, \"Ya Rasulullah, kami sudah tahu bagaimana menyapa Anda (yaitu, mengucapkan As-salamu \u0027alaikum), tetapi bagaimana kami harus berdoa untuk Anda?\" Dia (ﷺ) berkata, \"Katakanlah: \u0027Allahumma salli \u0027ala Muhammadin, wa \u0027ala \u0027ali Muhammadin, kama sallaita \u0027ala \u0027ali Ibrahima, innaka Hamidum Majid. Allahumma barik \u0027ala Muhammadin, wa \u0027ala \u0027ali Muhammadin, kama barakta \u0027ala \u0027ali Ibrahima, innaka Hamidum Majid [Ya Allah, tinggikanlah penyebutan Muhammad dan keluarga Muhammad sebagaimana Engkau meninggikan keluarga Ibrahim. keluarga Ibrahim. Kamu terpuji dan mulia.\"\u0027 [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Muhammad Ka\u0027b bin \u0027Ujrah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Muhammad Ka\u0027b bin \u0027Ujrah (ra dengan dia) melaporkan:","language":"bahasa"}]},{"index":"1406","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي مسعود بن عبادة البدري، رضي الله عنه، قال‏:‏ أتانا رسول الله صلى الله عليه وسلم، ونحن في مجلس سعد بن عبادة رضي الله عنه، فقال له بشير بن سعد‏:‏ أمرنا الله تعالى أن نصلي عليك يا رسول الله، فكيف نصلي عليك‏؟‏ فسكت رسول الله صلى الله عليه وسلم، حتى تمنينا أنه لم يسأله، ثم قال رسول الله صلى الله عليه وسلم‏:‏ ‏ \"‏قولوا اللهم صلِ على محمد وعلى آل محمد كما صليت على آل إبراهيم وبارك على محمد وعلى آل محمد كما باركت على آل إبراهيم إنك حميد مجيد، والسلام كما قد علمتم‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"We were sitting in the company of Sa\u0027d bin \u0027Ubadah (May Allah be pleased with him), when the Messenger of Allah (ﷺ) came to us. Bashir bin Sa\u0027d said: \"O Messenger of Allah! Allah has commanded us to supplicate for you, but how should we do that?\" The Messenger of Allah (ﷺ) kept silent. We were much perturbed over his silence and we wished he did not asked him this question. The Messenger of Allah (ﷺ) said, \"Say: \u0027O Allah, exalt the mention of Muhammad and the family of Muhammad as you exalted the family of Ibrahim. And bless Muhammad and the family of Muhammad as You blessed the family of Ibrahim. You are the Praised, the Glorified,\u0027 and the method of greeting (i.e., Salam) is as you know.\" [Muslim].","language":"english"},{"text":"Kami sedang duduk di perusahaan Sa\u0027d bin \u0027Ubadah (ra dengan dia), ketika Rasulullah (ﷺ) datang kepada kami. Bashir bin Sa\u0027d berkata: \"Ya Rasulullah! Allah telah memerintahkan kami untuk berdoa untukmu, tetapi bagaimana kami harus melakukannya?\" Rasulullah diam saja. Kami sangat terganggu dengan kebisuannya dan kami berharap dia tidak menanyakan pertanyaan ini kepadanya. Rasulullah (ﷺ) berkata, \"Katakanlah: \u0027Ya Allah, tinggikan penyebutan Muhammad dan keluarga Muhammad seperti Anda meninggikan keluarga Ibrahim. Dan memberkati Muhammad dan keluarga Muhammad seperti Anda memberkati keluarga Ibrahim. Kamu adalah Yang Terpuji, Yang Maha Suci,\u0027 dan metode salam (yaitu, Salam) adalah seperti yang kamu ketahui.\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Mas\u0027ud Al-Badri (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Mas\u0027ud Al-Badri (ra dengan dia) melaporkan:","language":"bahasa"}]},{"index":"1407","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي حميد الساعدي رضي الله عنه قال‏:‏ قالوا‏:‏ يا رسول الله كيف نصلي عليك‏؟‏ قال‏:‏ ‏ \"‏قولوا‏:‏ اللهم صلِ على محمد، وعلى أزواجه وذريته، كما صليت على آل إبراهيم، وبارك على محمد، وعلى أزواجه وذريته، كما باركت على إبراهيم، إنك حميد مجيد‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Companions of the Messenger of Allah (ﷺ) said: \"O Messenger of Allah! How should we supplicate for you?\" He (ﷺ) replied, \"Say: \u0027Allahumma salli \u0027ala Muhammadin wa \u0027ala azwajihi wa dhurriyyatihi, kama sallaita \u0027ala Ibrahima; wa barik \u0027ala Muhammadin wa \u0027ala azwajihi wa dhurriyyatihi, kama barakta \u0027ala Ibrahima, innaka Hamidum-Majid (O Allah sent Your Salat (O Allah, exalt the mention of Muhammad and his wives and offspring as You exalted the mention of the family of Ibrahim, and bless Muhammad and the wives and the offspring of Muhammad as you blessed the family of Ibrahim. You are the Praised, the Glorious\u0027.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Para sahabat Rasulullah (ﷺ) berkata: \"Ya Rasulullah! Bagaimana kami harus mendoakanmu?\" Beliau (ﷺ) menjawab, “Katakanlah: \u0027Allahumma salli \u0027ala Muhammadin wa \u0027ala azwajihi wa dhurriyyatihi, kama sallaita \u0027ala Ibrahima; wa barik \u0027ala Muhammadin wa \u0027ala azwajihi wa dhurriyyatihi, kama barakta \u0027ala Ibrahima, innaka Hamidum- (Ya Allah mengutus shalat-Mu (Ya Allah, tinggikan penyebutan Muhammad dan istri-istri dan keturunannya sebagaimana Engkau meninggikan penyebutan keluarga Ibrahim, dan memberkati Muhammad dan para istri dan anak-anak Muhammad sebagaimana Engkau memberkati keluarga Ibrahim. Engkau Maha Terpuji lagi Maha Agung\u0027.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Humaid As-Sa\u0027idi (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Humaid As-Sa\u0027idi (ra dengan dia) melaporkan:","language":"bahasa"}]}]