[{"index":"894","hadith_id":"riyadussalihin","text":[{"text":"عن البراء بن عازب رضي الله عنهما قال‏:‏ أمرنا رسول الله صلى الله عليه وسلم بعيادة المريض، واتباع الجنازة، وتشميت العاطس، وإبرار المقسم، ونصر المظلوم، وإجابة الداعى، وإفشاء السلام” ‏(‏‏(‏متفق عليه‏)‏‏)‏","language":"arabic"},{"text":"Messenger of Allah (ﷺ) has ordered us to visit the sick, to follow the funeral (of a dead believer), respond to the sneezer (i.e., by saying to him: Yarhamuk-Allah after he says: Al-hamdu lillah), to help those who vow to fulfill it, to help the oppressed, to accept the invitation extended by the inviter; and to promote greetings (i.e., saying As-Salamu `Alaikum). [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) telah memerintahkan kita untuk menjenguk orang sakit, mengikuti pemakaman (orang mukmin yang sudah meninggal), menanggapi bersin (yaitu, dengan mengatakan kepadanya: Yarhamuk-Allah setelah dia mengatakan: Al-hamdu lillah), untuk membantu mereka yang bersumpah untuk memenuhinya, untuk membantu yang tertindas, untuk menerima undangan yang diberikan oleh pengundang; dan untuk mempromosikan salam (yaitu, mengatakan As-Salamu `Alaikum). [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Al-Bara\u0027 bin `Azib (May Allah be pleased with them) reported:","language":"english"},{"text":"Al-Bara\u0027 bin \u0027Azib radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"895","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏\"‏حق المسلم علي المسلم خمس‏:‏ رد السلام، وعيادة المريض، واتباع الجنائز، وإجابة الدعوة، وتشميت العاطس” ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"Every Muslim has five rights over another Muslim (i.e., he has to perform five duties for another Muslim): to return the greetings, to visit the sick, to accompany funeral processions, to accept an invitation, to respond to the sneezer [i.e., to say: \u0027Yarhamuk-Allah (may Allah bestow His Mercy on you),\u0027 when the sneezer praises Allah].\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, “Setiap Muslim memiliki lima hak atas Muslim lainnya (yaitu, dia harus melakukan lima kewajiban bagi Muslim lainnya): membalas salam, menjenguk orang sakit, menemani prosesi pemakaman, menerima undangan, untuk menanggapi orang yang bersin [yaitu, mengatakan: \u0027Yarhamuk-Allah (semoga Allah melimpahkan rahmat-Nya padamu)\u0027 ketika orang yang bersin memuji Allah] .\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"896","hadith_id":"riyadussalihin","text":[{"text":"وعنه قالك قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏عن الله عزو جل يقول يوم القيامة‏:‏ ‏\"‏يا ابن آدم مرضت فلم تعدني‏!‏ قال‏:‏ يا رب كيف أعودك وأنت رب العالمين‏؟‏‏!‏ قال‏:‏ أما علمت أن عبدي فلاناً مرض فلم تعده‏؟‏ أما علمت أنك لو عدته لوجدتني عنده‏؟‏ يا ابن آدم استطعمتك فلم تطعمني‏!‏ قال‏:‏ يا رب كيف أطعمك وأنت رب العالمين‏؟‏‏!‏ قال‏:‏ أما علمت أنه استطعمك عبدي فلان فلم تطعمه، أما علمت أنك لو أطعمته لوجدت ذلك عندي‏؟‏ يا ابن آدم استسقيتك فلم تسقني‏!‏ قال‏:‏ يارب كيف أسقيك وأنت رب العالمين‏؟‏‏!‏ قال‏:‏ استسقاك عبدي فلان فلم تسقه‏!‏ أما علمت أنك لو سقيته لوجدت ذلك عندي‏؟‏‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"Verily, Allah, the Exalted, and Glorious will say on the Day of Resurrection: \u0027O son of Adam, I was ill but you did not visit Me.\u0027 He would say: \u0027O my Rubb, how could I visit you and You are the Rubb of the worlds?\u0027 Thereupon He would say: \u0027Did you not know that such and such a slave of Mine was ill but you did not visit him? Did you not realize that if you had visited him (you would have known that I was aware of your visit to him, for which I would reward you) you would have found Me with him? O son of Adam, I asked food from you but you did not feed Me.\u0027 He would submit: \u0027My Rubb, how could I feed You and You are the Rubb of the worlds?\u0027 He would say: \u0027Did you not know that such and such a slave of Mine asked you for food but you did not feed him? Did you not realize that if you had fed him, you would certainly have found (its reward) with Me? O son of Adam, I asked water from you but you did not give it to Me.\u0027 He would say: \u0027My Rubb, how could I give You (water) and You are the Rubb of the worlds?\u0027 Thereupon He would say: \u0027Such and such a slave of Mine asked you for water to drink but you did not give it to him. Did you not realize that if you had given him to drink you would have found (its reward) with Me?\"\u0027 [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Sesungguhnya, Allah, Yang Maha Tinggi, dan Maha Mulia akan berfirman pada Hari Kebangkitan: \u0027Hai anak Adam, aku sakit tetapi kamu tidak menjenguk-Ku.\u0027 Dia akan berkata: \u0027O Rubb saya, bagaimana saya bisa mengunjungi Anda dan Anda adalah Rubb dunia?\u0027 Kemudian Dia berkata: \"Apakah kamu tidak mengetahui bahwa hamba-Ku ini dan itu sakit tetapi kamu tidak menjenguknya? Tidakkah kamu menyadari bahwa jika kamu telah mengunjunginya (kamu akan mengetahui bahwa Aku mengetahui kunjunganmu ke dia, yang saya akan membalas Anda) Anda akan menemukan Aku bersamanya? Wahai anak Adam, saya meminta makanan dari Anda tetapi Anda tidak memberi saya makan. Dia akan tunduk: \u0027Rubb saya, bagaimana saya bisa memberi makan Anda dan Anda adalah Rubb dunia?\u0027 Dia akan bilang: \u0027 Tidakkah kamu tahu bahwa hamba-Ku ini dan itu memintamu makan tetapi kamu tidak memberinya makan? Tidakkah kamu menyadari bahwa jika kamu memberinya makan, pasti kamu akan mendapatkan (pahalanya) di sisi-Ku? Wahai anak Adam, Aku meminta air darimu tetapi kamu tidak memberikannya kepada-Ku.\u0027 Dia akan berkata: \u0027Rubb saya, bagaimana saya bisa memberi Anda (air) dan Anda adalah Rubb dunia?\u0027 Kemudian Dia berkata: \u0027Hambaku ini dan itu meminta air minum kepadamu, tetapi kamu tidak memberikannya kepadanya. Tidakkah kamu menyadari bahwa jika kamu memberinya minum, kamu akan menemukan (pahalanya) di sisi-Ku?\"\u0027 bagaimana saya bisa memberi Anda (air) dan Anda adalah Rubb dunia?\u0027 Kemudian Dia berkata: \u0027Hambaku ini dan itu meminta air minum kepadamu, tetapi kamu tidak memberikannya kepadanya. Tidakkah kamu menyadari bahwa jika kamu memberinya minum, kamu akan menemukan (pahalanya) di sisi-Ku?\"\u0027 bagaimana saya bisa memberi Anda (air) dan Anda adalah Rubb dunia?\u0027 Kemudian Dia berkata: \u0027Hambaku ini dan itu meminta air minum kepadamu, tetapi kamu tidak memberikannya kepadanya. Tidakkah kamu menyadari bahwa jika kamu memberinya minum, kamu akan menemukan (pahalanya) di sisi-Ku?\"\u0027 [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"897","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي موسي الأشعري رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ، “ عودوا المريض، وأطعموا الجائع، وفكوا العاني‏\"‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"Visit the sick, feed the hungry, and (arrange for the) release of the captive.\u0027\u0027 [Al-Bukhari].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, “Junjungi yang sakit, beri makan yang lapar, dan (atur untuk) pembebasan tawanan.” [Al-Bukhari] .","language":"bahasa"}],"narrated":[{"text":"Abu Musa (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Musa (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"898","hadith_id":"riyadussalihin","text":[{"text":"وعن ثوبان، رضي الله عنه، عن النبي صلى الله عليه وسلم الله عليه وسلم الله عليه وسلم ، قال‏:‏ ‏\"‏إن المسلم إذا عاد أخاه المسلم لم يزل في خرفة الجنة حتي يرجع‏\"‏ قيل‏:‏ يا رسول الله وما خرفة الجنة‏؟‏ قال‏:‏ ‏\"‏جناها” ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Prophet (ﷺ) said, \"He who visits his brother in Faith, will remain engaged in picking the fresh fruits from the garden of Jannah till he returns.\" [Muslim].","language":"english"},{"text":"Nabi (ﷺ) berkata, \"Barangsiapa mengunjungi saudaranya dalam Iman, akan tetap sibuk memetik buah-buahan segar dari taman Jannah sampai dia kembali.\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Thauban (May Allah be pleased with him) reported:","language":"english"},{"text":"Thauban (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"899","hadith_id":"riyadussalihin","text":[{"text":"وعن علي رضي الله عنه قال‏:‏ سمعت رسول الله صلى الله عليه وسلم يقول‏:‏ ‏\"‏ما من مسلم يعود مسلماً غدوة إلا صلى عليه سبعون ألف ملك حتي يمسي، وإن عاده عشية إلا صلى عليه سبعون ألف ملك حتي يصبح، وكان له خريف في الجنة” ‏(‏‏(‏رواه الترمذي وقال‏:‏ حديث حسن‏)‏‏)‏‏.‏","language":"arabic"},{"text":"I heard the Messenger of Allah (ﷺ) saying, \"When a Muslim visits a sick Muslim at dawn, seventy thousand angels keep on praying for him till dusk. If he visits him in the evening, seventy thousand angels keep on praying for him till the morning; and he will have (his share of) reaped fruits in Jannah.\" [At- Tirmidhi].","language":"english"},{"text":"Aku mendengar Rasulullah (ﷺ) bersabda, “Jika seorang Muslim menjenguk seorang Muslim yang sakit di waktu fajar, tujuh puluh ribu malaikat terus mendoakannya sampai senja. Jika dia menjenguknya di malam hari, tujuh puluh ribu malaikat terus mendoakannya sampai pagi hari; dan dia akan mendapatkan (bagiannya) menuai buah-buahan di Jannah.” [At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"\u0027Ali bin Abu Talib (May Allah be pleased with him) reported:","language":"english"},{"text":"\u0027Ali bin Abu Thalib radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"900","hadith_id":"riyadussalihin","text":[{"text":"وعن أنس رضي الله عنه قال‏:‏ كان غلام يهودي يخدم النبي صلى الله عليه وسلمى الله عليه وسلم الله عليه وسلم فمرض فأتاه النبي صلى الله عليه وسلم الله عليه وسلم الله عليه وسلم يعوده، فقعد عند رأسه فقال له‏:‏ ‏ \"‏أسلم‏\"‏ فنظر إلي أبيه وهو عنده‏؟‏ فقال‏:‏ أطع أبا القاسم، فأسلم، فخرج النبي صلى الله عليه وسلمى الله عليه وسلم الله عليه وسلم وهو يقول‏:‏ “الحمد لله الذي أنقذه من النار” ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","language":"arabic"},{"text":"A young Jewish boy who was in the service of the Prophet (ﷺ) fell ill. The Prophet (ﷺ) went to visit him. He sat down by his head and said to him, \"Embrace Islam.\" The little boy looked at his father who was sitting beside him. He said: \"Obey Abul-Qasim (i.e., the Messenger of Allah (ﷺ)).\" So he embraced Islam and the Prophet (ﷺ) stepped out saying, \"Praise be to Allah Who has saved him from Hell-fire.\" [Al-Bukhari].","language":"english"},{"text":"Seorang anak muda Yahudi yang mengabdi pada Nabi (ﷺ) jatuh sakit. Nabi (ﷺ) pergi mengunjunginya. Dia duduk di dekat kepalanya dan berkata kepadanya, \"Peluklah Islam.\" Anak kecil itu menatap ayahnya yang duduk di sampingnya. Dia berkata: \"Taatilah Abul-Qasim (yaitu, Rasulullah (ﷺ)).\" Jadi dia memeluk Islam dan Nabi (ﷺ) melangkah keluar sambil berkata, “Segala puji bagi Allah yang telah menyelamatkan dia dari api neraka.” [Al-Bukhari] .","language":"bahasa"}],"narrated":[{"text":"Anas (May Allah be pleased with him) reported:","language":"english"},{"text":"Anas (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"901","hadith_id":"riyadussalihin","text":[{"text":"عن عائشة رضي الله عنها، أن النبي صلى الله عليه وسلم الله عليه وسلم الله عليه وسلم كان إذا اشتكي الأنسان الشيء منه، أو كانت به قرحة أو جرح، قال النبي صلى الله عليه وسلمى الله عليه وسلم الله عليه وسلم بأصبعه هكذا، ووضع سفيان بن عيينه الراوي سبابته بالأرض ثم رفعها وقال‏:‏ ‏ \"‏بسم الله، تربة أرضنا، بريقة بعضنا، يشفي سقيمنا، بإذن ربنا‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","language":"arabic"},{"text":"When a person complained to the Prophet (ﷺ) about an ailment or suffered from a sore or a wound, the Prophet (ﷺ) would touch the ground with his forefinger and then raise it (Sufyan bin `Uyainah, the narrator, demonstrated this with his forefinger) and would recite: `Bismil-lahi, turbatu ardina, biriqati ba`dina, yushfa bihi saqimuni, bi \u0027idhni Rabbina\u0027 (With the Name of Allah, the dust of our ground mixed with the saliva of some of us would cure our patient with the permission of our Rubb.\u0027\u0027 [Al-Bukhari and Muslim].","language":"english"},{"text":"Ketika seseorang mengadu kepada Nabi (ﷺ) tentang suatu penyakit atau menderita sakit atau luka, Nabi (ﷺ) akan menyentuh tanah dengan jari telunjuknya dan kemudian mengangkatnya (Sufyan bin `Uyainah, perawi, menunjukkan hal ini dengan jari telunjuknya) dan akan membaca: `Bismil-lahi, turbatu ardina, biriqati ba`dina, yushfa bihi saqimuni, bi \u0027idhni Rabbina\u0027 (Dengan menyebut nama Allah, debu tanah kami yang bercampur dengan air liur sebagian dari kami akan menyembuhkan pasien kami dengan izin dari Rubb kami.\u0027\u0027 [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"`Aishah (May Allah be pleased with him) reported:","language":"english"},{"text":"`Aisyah radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"902","hadith_id":"riyadussalihin","text":[{"text":"وعنها أن النبي صلى الله عليه وسلم الله عليه وسلم الله عليه وسلم كان يعود بعض أهله يمسح بيده اليمني ويقول‏:‏ ‏\"‏اللهم رب الناس، أذهب البأس، واشف، أنت الشافي لا شفاء إلا شفاؤك، شفاءً لا يغادر سقماً” ‏(‏‏(‏متفق عليه‏)‏‏)‏","language":"arabic"},{"text":"When the Prophet (ﷺ) visited any ailing member of his family, he would touch the sick person with his right hand and would supplicate: \"Allahumma Rabban-nasi, adhhibil-ba\u0027sa, washfi, Antash-Shafi, la shifa\u0027a illa shifa\u0027uka, shifaan la yughadiru saqaman [O Allah! the Rubb of mankind! Remove this disease and cure (him or her)! You are the Great Curer. There is no cure but through You, which leaves behind no disease].\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Ketika Nabi (ﷺ) mengunjungi anggota keluarganya yang sakit, ia akan menyentuh orang yang sakit dengan tangan kanannya dan akan berdoa: \"Allahumma Rabban-nasi, adhhibil-ba\u0027sa, washfi, Antash-Shafi, la shifa\u0027a illa shifa\u0027uka, shifaan la yughadiru saqaman [Ya Allah! Penghapus umat manusia! Singkirkan penyakit ini dan obati (dia)! Engkau adalah Penyembuh Agung. Tidak ada obat kecuali melalui Engkau, yang tidak meninggalkan penyakit] . \" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"\u0027Aishah (May Allah be pleased with her) reported:","language":"english"},{"text":"\u0027Aisyah r.a. melaporkan:","language":"bahasa"}]},{"index":"903","hadith_id":"riyadussalihin","text":[{"text":"وعن أنس، رضي الله عنه أنه قال لثابت رحمه الله‏:‏ ألا أرقيك برقية رسول الله صلى الله عليه وسلم ‏؟‏ قال‏:‏ بلى، قال‏:‏ اللهم رب الناس، مذهب البأس، اشف أنت الشافي، لا شافي إلا أنت، شفاءً لا يغادر سقماً” ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","language":"arabic"},{"text":"I said to Thabit (May Allah had Mercy upon him) Should I not perform Ruqyah (i.e., recite supplication or Quranic Ayat and blow) over you, such supplication as was practised by the Messenger of Allah (ﷺ)?\" He said: \"Please do so.\" Anas (May Allah be pleased with him) supplicated: \"Allahumma Rabban-nasi, mudh-hibal-ba\u0027si, ishfi Antash-Shafi, la shafiya illa Anta, shifa\u0027an la yughadiru saqaman [O Allah! the Rubb of mankind! Take away this disease and cure (him or her). You are the Curer. There is no cure except through You. Cure (him or her), a cure that leaves no disease].\" [Al-Bukhari].","language":"english"},{"text":"Aku berkata kepada Tsabit (Semoga Allah merahmatinya) Apakah aku tidak boleh melakukan Ruqyah (yaitu, membaca doa atau Ayat Quran dan meniup) atasmu, doa seperti yang dilakukan oleh Rasulullah (ﷺ)?\" Dia berkata: \" Tolong lakukan itu.\" Anas (Semoga Allah senang dengan dia) berdoa: \"Allahumma Rabban-nasi, mudh-hibal-ba\u0027si, ishfi Antash-Shafi, la shafiya illa Anta, shifa\u0027an la yughadiru saqaman [Ya Allah! sampah umat manusia! Singkirkan penyakit ini dan obati (dia). Anda adalah Penyembuh. Tidak ada obat kecuali melalui-Mu. Obat (dia), obat yang tidak meninggalkan penyakit] .” [Al-Bukhari] .","language":"bahasa"}],"narrated":[{"text":"Anas (May Allah be pleased with him) reported:","language":"english"},{"text":"Anas (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"904","hadith_id":"riyadussalihin","text":[{"text":"وعن سعد بن أبي وقاص، رضي الله عنه قال‏:‏ عادني رسول الله صلى الله عليه وسلم فقال‏:‏ ‏ \"‏اللهم اشف سعداً، اللهم اشف سعداً، اللهم اشف سعداً‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) visited me during my illness and supplicated, \"O Allah! Cure Sa\u0027d. O Allah! Cure Sa\u0027d. O\u0027 Allah! Cure Sa\u0027d.\" [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) mengunjungi saya selama saya sakit dan berdoa, \"Ya Allah! Sembuhkan Sa\u0027d. Ya Allah! Sembuhkan Sa\u0027d. Ya Allah! Sembuhkan Sa\u0027d.\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Sa\u0027d bin Abu Waqqas (May Allah be pleased with him) reported:","language":"english"},{"text":"Sa\u0027d bin Abu Waqqas radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"905","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي عبد الله عثمان بن أبي العاص رضي الله عنه أنه شكي إلي رسول الله صلى الله عليه وسلم وجعاً يجده في جسده فقال رسول الله صلى الله عليه وسلم ‏\"‏ضع يدك علي الذي تألم من جسدك وقل‏:‏ بسم الله -ثلاثاً- وقل سبع مرات‏:‏ أعوذ بعزة الله وقدرته من شر ما أجد وأحاذر” ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"I complained to the Messenger of Allah (ﷺ) about a pain I had in my body. The Messenger of Allah (ﷺ) said, \"Place your hand where you feel pain and say: \u0027Bismillah (With the Name of Allah)\u0027 three times; and then repeat seven times: \u0027A\u0027udhu bi\u0027izzatillahi wa qudratihi min sharri ma ajidu wa \u0027uhadhiru (I seek refuge with Allah and with His Power from the evil that afflicts me and that which I apprehend).\"\u0027 [Muslim].","language":"english"},{"text":"Saya mengadu kepada Rasulullah () tentang sakit yang saya alami di tubuh saya. Rasulullah (ﷺ) bersabda, “Letakkan tanganmu di tempat yang terasa sakit dan ucapkan: \u0027Bismillah (Dengan Nama Allah)\u0027 tiga kali; dan kemudian ulangi tujuh kali: \u0027A\u0027udhu bi\u0027izzatillahi wa qudratihi min sharri ma ajidu wa \u0027uhadziru (Aku berlindung kepada Allah dan dengan kekuatan-Nya dari kejahatan yang menimpaku dan apa yang aku ketahui).\"\u0027 [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu \u0027Abdullah bin Abul-\u0027as (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu \u0027Abdullah bin Abul-\u0027as (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"906","hadith_id":"riyadussalihin","text":[{"text":"وعن ابن عباس، رضي الله عنهما، عن النبي،صلى الله عليه وسلمى الله عليه وسلم صلى الله عليه وسلم ، قال‏:‏ ‏ \"‏من عاد مريضاً لم يحضره أجله، فقال عنده سبع مرات‏:‏ أسأل الله العظيم رب العرش العظيم أن يشفيك‏:‏ إلا عافاه الله من ذلك المرض‏\"‏ ‏(‏‏(‏رواه أبو داود والترمذي وقال‏:‏ حديث حسن، وقال الحاكم‏:‏ حديث صحيح علي شرط البخاري‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Prophet (ﷺ) said, \"He who visits a sick person who is not on the point of death and supplicates seven times: As\u0027alullahal-\u0027Azima Rabbal-\u0027Arshil-\u0027Azimi, an yashfiyaka (I beseech Allah the Great, the Rubb of the Great Throne, to heal you), Allah will certainly heal him from that sickness.\" [Abu Dawud and At- Tirmidhi].","language":"english"},{"text":"Nabi (ﷺ) bersabda, “Barangsiapa menjenguk orang sakit yang belum berada di ambang kematian dan berdoa tujuh kali: As\u0027alullahal-\u0027Azima Rabbal-\u0027Arshil-\u0027Azimi, an yashfiyaka (Aku memohon kepada Allah yang Agung, Gosok Arsy yang Agung, untuk menyembuhkanmu), Allah pasti akan menyembuhkannya dari penyakit itu.” [Abu Dawud dan At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Ibn \u0027Abbas (May Allah be pleased with them) reported:","language":"english"},{"text":"Ibn \u0027Abbas (semoga Allah meridhoi mereka) melaporkan:","language":"bahasa"}]},{"index":"907","hadith_id":"riyadussalihin","text":[{"text":"وعنه أن النبي صلى الله عليه وسلم الله عليه وسلم صلى الله عليه وسلم ، دخل علي أعرأبي يعوده وكان إذا دخل علي من يعوده قال‏:‏ ‏ \"‏لا بأس، طهور إن شاء الله‏\"‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Prophet (ﷺ) visited a bedouin who was sick. Whenever he visited an ailing person, he would say, \"La ba\u0027sa, tahurun in sha\u0027 Allah [No harm, (it will be a) purification (from sins), if Allah wills].\" [Al-Bukhari].","language":"english"},{"text":"Nabi (ﷺ) mengunjungi seorang Badui yang sedang sakit. Setiap kali menjenguk orang sakit, dia akan mengucapkan, \"La ba\u0027sa, tahurun in sya\u0027 Allah [Tidak ada salahnya, (itu akan menjadi) penyucian (dari dosa), insya Allah] .\" [Al-Bukhari] .","language":"bahasa"}],"narrated":[{"text":"Ibn \u0027Abbas (May Allah be pleased with them) reported:","language":"english"},{"text":"Ibn \u0027Abbas (semoga Allah meridhoi mereka) melaporkan:","language":"bahasa"}]},{"index":"908","hadith_id":"riyadussalihin","text":[{"text":"وعن أبيسعيد الخدري رضي الله عنه أن جبريل أتي النبي،صلى الله عليه وسلمى الله عليه وسلم صلى الله عليه وسلم ، فقال‏:‏ يا محمد اشتكيت‏؟‏ قال‏:‏ ‏ \"‏نعم‏\"‏ قال‏:‏ بسم الله أرقيك ، من كل شيء يؤذيك، ومن شر كل نفس أو عين حاسد، الله يشفيك، بسم الله أرقيك” ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"Jibril (Gabriel) came to the Prophet (ﷺ) and said: \"O Muhammad (ﷺ)! Do you feel sick?\" He (ﷺ) said, \"Yes.\" Jibril supplicated thus (i.e., he performed Ruqyah): \"Bismillahi arqika, min kulli shay\u0027in yu\u0027dhika, min sharri kulli nafsin aw \u0027ayni hasidi, Allahu yashfika, bismillahi arqika. [With the Name of Allah. I recite over you (to cleanse you) from all that troubles you, and from every harmful mischief and from the evil of the eyes of an envier. Allah will cure you; and with the Name of Allah, I recite over you].\" [Muslim].","language":"english"},{"text":"Jibril (Jibril) mendatangi Nabi (ﷺ) dan berkata: \"Wahai Muhammad (ﷺ)! Apakah kamu merasa sakit?\" Dia (ﷺ) berkata, \"Ya.\" Jibril berdoa demikian (yaitu, ia melakukan Ruqyah): \"Bismillah arqika, min kulli shay\u0027in yu\u0027dhika, min sharri kulli nafsin aw \u0027ayni hasidi, Allahu yashfika, bismillahi arqika. [Dengan Nama Allah. Aku membacakan untukmu (untuk membersihkanmu) dari semua yang menyusahkanmu, dan dari setiap kerusakan yang merugikan dan dari kejahatan mata orang yang iri. Allah akan menyembuhkanmu; dan dengan Nama Allah, aku membacakan untukmu] .\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Sa\u0027id Al-Khudri (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Sa\u0027id Al-Khudri r.a. melaporkan:","language":"bahasa"}]},{"index":"909","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي سعيد الخدري وأبي هريرة، رضي الله عنهما، أنهما شهدا علي رسول الله ، صلى الله عليه وسلم ، أنه قال‏:‏ ‏\"‏من قال‏:‏ لا إله إلا الله والله اكبر، صدقه ربه، فقال‏:‏ لا إله إلا أنا وأنا أكبر‏.‏ وإذا قال‏:‏ لا إله إلا الله وحده لا شريك له، قال‏:‏ يقول‏:‏ لا إله إلا أنا وحدي لا شريك لي‏.‏ وإذا قال‏:‏ لا إله إلا الله له الملك وله الحمد، قال‏:‏ لا إله إلا أنا لي الملك ولي الحمد‏.‏ وإذا قال‏:‏ لا إله إلا الله ولا حول ولا قوة إلا بالله، قال‏:‏ لا إله إلا أنا ولا حول ولا قوة إلا بي‏\"‏ وكان يقول‏:‏ ‏\"‏من قالها في مرضه ثم مات لم تطعمه النار‏\"‏ ‏(‏‏(‏رواه الترمذي وقال‏:‏ حديث حسن‏)‏‏)‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"If a person says: \u0027La ilaha illallahu wallahu Akbar (There is no true god except Allah and Allah is Greatest)\u0027, his Rubb responds to him and affirms: \u0027(Yes!) There is no true god except I, and I am the Greatest.\u0027 When he says: \u0027La ilaha illallahu Wahdahu la sharika Lahu (There is no true god except Allah, the One, He has no partner).\u0027 Allah (SWT) affirms: \u0027(Yes!) There is no true god except I. I have no partner.\u0027 When he says: \u0027La ilaha illallahu Lahul mulku wa Lahul-hamdu (the sovereignty belongs to Him and all the praise is due to Him).\u0027 He (SWT) affirms: \u0027(Yes!) There is no true god except I, Mine is the praise and to Me belongs the sovereignty.\u0027 When he says: \u0027La ilaha illallahu wa la hawla wa la quwwata illa Billah (There is no true god except Allah, and there is no might and power but with Allah).\u0027 He (SWT) affirms: \u0027(Yes!) There is no true god except I, and there is no might and power but with Me.\"\u0027 The Messenger of Allah (ﷺ) added, \"He who recites this during his illness and dies, will not be touched by the Fire (Hell).\" [At-Tirmidhi].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Jika seseorang mengatakan: \u0027La ilaha illallahu wallahu Akbar (Tidak ada Tuhan yang benar selain Allah dan Allah Maha Besar)\u0027, Rubb-nya menanggapinya dan menegaskan: \u0027(Ya!) Ada tidak ada tuhan yang benar kecuali Aku, dan Akulah yang Terbesar.\u0027 Ketika dia mengatakan: \u0027La ilaha illallahu Wahdahu la sharika Lahu (Tidak ada Tuhan yang benar selain Allah, Yang Esa, Dia tidak memiliki sekutu).\u0027 Allah (SWT) menegaskan: \u0027(Ya!) Tidak ada Tuhan yang benar kecuali Aku. Aku tidak punya sekutu.\u0027 Ketika dia mengatakan: \u0027La ilaha illallahu Lahul mulku wa Lahul-hamdu (kedaulatan adalah milik-Nya dan segala puji hanya milik-Nya).\u0027 Dia (SWT) menegaskan: \u0027(Ya!) Tidak ada Tuhan yang benar kecuali Aku, milik-Ku segala puji dan milik-Ku kekuasaan.\u0027 Ketika dia berkata: \u0027 La ilaha illallahu wa la hawla wa la quwwata illa Billah (Tidak ada Tuhan yang benar selain Allah, dan tidak ada daya dan kekuatan kecuali dengan Allah).\u0027 Dia (SWT) menegaskan: \u0027(Ya!) Tidak ada Tuhan yang benar kecuali Aku, dan tidak ada daya dan kekuatan selain dengan Aku. mati, tidak akan tersentuh api (Neraka).” [At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Abu Sa\u0027id Al-Khudri and Abu Hurairah (May Allah be pleased with them) reported:","language":"english"},{"text":"Abu Sa\u0027id Al-Khudri dan Abu Hurairah (semoga Allah meridhoi mereka) melaporkan:","language":"bahasa"}]},{"index":"910","hadith_id":"riyadussalihin","text":[{"text":"عن ابن عباس، رضي الله عنهما، أن علي بن أبي طالب، رضي الله عنه خرج من عند رسول الله صلى الله عليه وسلم ، في وجعه الذي توفي فيه فقال الناس‏:‏ يا أبا الحسن كيف أصبح رسول الله صلى الله عليه وسلم ‏؟‏ قال‏:‏ أصبح بحمد الله بارئاً‏\"‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","language":"arabic"},{"text":"When `Ali (May Allah be pleased with him) came out after visiting the Messenger of Allah (ﷺ) during his last illness, the people asked: \"How is Messenger of Allah (ﷺ), O Abul-Hasan?\u0027\u0027 He replied: \"Praise be to Allah, he (ﷺ) is feeling better.\u0027\u0027 [Al-Bukhari].","language":"english"},{"text":"Ketika `Ali (ra dengan dia) keluar setelah mengunjungi Rasulullah (ﷺ) selama penyakit terakhirnya, orang-orang bertanya: \"Bagaimana keadaan Rasulullah (ﷺ), hai Abul-Hasan?\" Dia menjawab : \"Alhamdulillah, dia (ﷺ) merasa lebih baik.\u0027\u0027 [Al-Bukhari] .","language":"bahasa"}],"narrated":[{"text":"Ibn `Abbas (May Allah be pleased with them) reported:","language":"english"},{"text":"Ibn `Abbas (semoga Allah meridhoi mereka) melaporkan:","language":"bahasa"}]},{"index":"911","hadith_id":"riyadussalihin","text":[{"text":"عن عائشة رضي الله عنها قالت‏:‏ سمعت النبي صلى الله عليه وسلم الله عليه وسلم الله عليه وسلم وهو مستند إلي يقول‏:‏ اللهم اغفر لي وارحمني وألحقني بالرفيق الأعلى‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"While the Prophet (ﷺ) was reclining against me (during his last illness) I heard him saying: \"Allahumma-ghfir li, warhamni, wa alhiqni bir Rafiqil-A`la (O Allah, forgive me, bestow Your Mercy on me and let me join with the exalted companions.\u0027\u0027 [Al-Bukhari and Muslim].","language":"english"},{"text":"Ketika Nabi (ﷺ) sedang berbaring di sampingku (selama penyakit terakhirnya), aku mendengarnya berkata: \"Allahumma-ghfir li, warhamni, wa alhiqni bir Rafiqil-A`la (Ya Allah, ampunilah aku, limpahkan rahmat-Mu kepadaku dan biarkan aku bergabung dengan para sahabat yang mulia.\u0027\u0027 [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"`Aishah (May Allah be pleased with her) reported:","language":"english"},{"text":"`Aisyah radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"912","hadith_id":"riyadussalihin","text":[{"text":"وعنها قالت‏:‏ رأيت رسول الله صلى الله عليه وسلم وهو بالموت عنده قدح فيه ماء وهو يدخل يده في القدح، ثم يمسح وجهه بالماء، ثم يقول‏:‏ ‏ \"‏اللهم أعني علي غمرات الموت وسكرات الموت‏\"‏ ‏(‏‏(‏رواه الترمذي‏)‏‏)‏‏.‏","language":"arabic"},{"text":"I saw the Messenger of Allah (ﷺ) when he was at the point of death. He had a drinking bowl with water in it. He would dip his hand into the bowl, and wipe his face. Then he would supplicate, \"O Allah! Help me over pangs and agony of death.\" [At-Tirmidhi].","language":"english"},{"text":"Saya melihat Rasulullah (ﷺ) ketika dia berada di ambang kematian. Dia memiliki mangkuk minum dengan air di dalamnya. Dia akan mencelupkan tangannya ke dalam mangkuk, dan menyeka wajahnya. Kemudian dia akan berdoa, \"Ya Allah! Bantu aku mengatasi rasa sakit dan penderitaan kematian.\" [At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"\u0027Aishah (May Allah be pleased with her) reported:","language":"english"},{"text":"\u0027Aisyah r.a. melaporkan:","language":"bahasa"}]},{"index":"913","hadith_id":"riyadussalihin","text":[{"text":"عن عمران بن الحصين رضي الله عنهما أن امراة من جهينة أتت النبي صلى الله عليه وسلمى الله عليه وسلم الله عليه وسلم الله عليه وسلم وهي حبلي من الزنا، فقالت‏:‏ يا رسول الله، أصبت حداً فأقمه علي ، فدعا رسول الله صلى الله عليه وسلم وليها، فقال‏:‏ ‏ \"‏أحسن إليها فإذا وضعت فأتني بها” ففعل، فأمر بها النبي صلى الله عليه وسلم الله عليه وسلمى الله عليه وسلم الله عليه وسلم ، فشدت عليها ثيابها، ثم أمر بها فرجمت، ثم صلى عليها‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"A woman belonging to the Juhainah tribe came to the Messenger of Allah (ﷺ) after having conceived from Zina. She submitted: \"O Messenger of Allah! I am liable to Hadd (punishment ordained by Allah), so execute it.\u0027\u0027 The Messenger of Allah (ﷺ) called her guardian and said, \"Treat her well and bring her to me after delivery.\u0027\u0027 He acted accordingly. Then the Messenger of Allah (ﷺ) commanded to tie her clothes firmly around her and then stoned her to death. He (ﷺ) then offered funeral prayer for her. [Muslim].","language":"english"},{"text":"Seorang wanita dari suku Juhainah datang kepada Rasulullah (ﷺ) setelah hamil dari Zina. Dia menyerahkan: \"Ya Rasulullah! Saya bertanggung jawab untuk Hadd (hukuman yang ditetapkan oleh Allah), jadi lakukan itu.\u0027\u0027 Rasulullah (ﷺ) memanggil walinya dan berkata, \"Perlakukan dia dengan baik dan bawa dia kepadaku setelah itu. pengiriman.\u0027\u0027 Dia bertindak sesuai. Kemudian Rasulullah (ﷺ) memerintahkan untuk mengikat pakaiannya dengan kuat di sekelilingnya dan kemudian melemparinya dengan batu sampai mati. Dia (ﷺ) kemudian menawarkan doa pemakaman untuknya. [Muslim] .","language":"bahasa"}],"narrated":[{"text":"`Imran bin Husain (May Allah be pleased with them) reported:","language":"english"},{"text":"`Imran bin Husain r.a. melaporkan:","language":"bahasa"}]},{"index":"914","hadith_id":"riyadussalihin","text":[{"text":"عن بن مسعود رضي الله عنه قال‏:‏ دخلت علي النبي صلى الله عليه وسلمى الله عليه وسلم الله عليه وسلم الله عليه وسلم وهو يوعك، فمسسته، فقلت‏:‏ إنك لتوعك وعكاً شديداً فقال‏:‏ ‏ \"‏إني أوعك كما يوعك رجلان منكم‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","language":"arabic"},{"text":"I visited the Prophet ({ﷺ) while he was suffering. I said: \"(O Messenger of Allah!) You suffer too much.\u0027\u0027 He said, \"Yes, I suffer as much as two men of you.\u0027\u0027 [Al-Bukhari and Muslim].","language":"english"},{"text":"Saya mengunjungi Nabi ({ﷺ) saat dia menderita. Aku berkata: \"(Ya Rasulullah!) Kamu terlalu menderita.\u0027\u0027 Dia berkata, \"Ya, aku menderita sebanyak dua orang di antara kamu.\u0027\u0027 [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Ibn Mas`ud (May Allah be pleased with him) reported:","language":"english"},{"text":"Ibnu Mas\u0027ud radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"915","hadith_id":"riyadussalihin","text":[{"text":"وعن سعد بن أبي وقاص رضي الله عنه قال‏:‏ جاءني رسول الله صلى الله عليه وسلم يعودني من وجع اشتد بي، فقلت‏:‏ بلغ بي ما ترى، وأنا ذو مال، ولايرثني إلا ابنتي، وذكر الحديث‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) came to visit me when I had a severe pain. I said: \"I am suffering from such trouble as you are observing. I am a wealthy man and the only heir of mine is my daughter.\" (Then Sa\u0027d narrated the whole incident). [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) datang mengunjungi saya ketika saya sakit parah. Saya berkata: \"Saya menderita masalah seperti yang Anda amati. Saya orang kaya dan satu-satunya pewaris saya adalah putri saya.\" (Kemudian Sa\u0027d menceritakan seluruh kejadian). [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Sa\u0027d bin Abu Waqqas (May Allah be pleased with him) reported:","language":"english"},{"text":"Sa\u0027d bin Abu Waqqas radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"916","hadith_id":"riyadussalihin","text":[{"text":"وعن القاسم بن محمد قال‏:‏ قالت عائشة رضي الله عنها‏:‏ وا رأساه فقال النبي صلى الله عليه وسلم الله عليه وسلمى الله عليه وسلم الله عليه وسلم ‏:‏ ‏\"‏بل أنا وا رأساه‏\"‏ وذكر الحديث‏\"‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","language":"arabic"},{"text":"\"Oh, my head.\" (It was hurting due to pain.) Thereupon the Prophet (ﷺ) said, \"Rather it is I who says: \u0027Oh, my headache.\"\u0027 (Then Al-Qasim narrated the complete narration). [Al- Bukhari].","language":"english"},{"text":"\"Oh, kepalaku.\" (Rasa sakit karena sakit.) Kemudian Nabi (ﷺ) berkata, \"Sebaliknya aku yang mengatakan: \u0027Oh, sakit kepala saya.\"\u0027 (Kemudian Al-Qasim meriwayatkan narasi lengkap). [Al-Bukhari] .","language":"bahasa"}],"narrated":[{"text":"Al-Qasim bin Muhammad reported \u0027Aishah (May Allah be pleased with her) said:","language":"english"},{"text":"Al-Qasim bin Muhammad melaporkan \u0027Aisyah radhiyallahu \u0027anhu berkata:","language":"bahasa"}]},{"index":"917","hadith_id":"riyadussalihin","text":[{"text":"عن معاذ رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏ \"‏من كان آخر كلامه لا إله إلا الله دخل الجنة‏\"‏ ‏(‏‏(‏رواه أبو داود والحاكم وقال‏:‏ صحيح الإسناد‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"He whose last words are: `La ilaha illallah\u0027 (There is no true god except Allah) will enter Jannah.\u0027\u0027 [Abu Dawud].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Dia yang kata-kata terakhirnya adalah: \u0027La ilaha illallah\u0027 (Tidak ada Tuhan yang benar selain Allah) akan masuk Jannah.\u0027\u0027 [Abu Daud] .","language":"bahasa"}],"narrated":[{"text":"Mu`adh bin Jabal (May Allah be pleased with him) reported:","language":"english"},{"text":"Mu\u0027adz bin Jabal radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"918","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي سعيد الخدري رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ “لقنوا موتاكم لا إله إلا الله‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"Exhort your dying men to recite: \u0027La ilaha illallah\u0027 (There is no true god except Allah).\" [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Nasehatkan orang-orangmu yang sekarat untuk membaca: \u0027La ilaha illallah\u0027 (Tidak ada Tuhan yang benar selain Allah).\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Sa\u0027id Al-Khudri (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Sa\u0027id Al-Khudri r.a. melaporkan:","language":"bahasa"}]},{"index":"919","hadith_id":"riyadussalihin","text":[{"text":"عن أم سلمة رضي الله عنها قالت‏:‏ دخل رسول الله صلى الله عليه وسلم علي أبي سلمه وقد شق بصره فأغمضه، ثم قال‏:‏ ‏\"‏إن الروح إذا قبض، تبعه البصر‏\"‏ فضج ناس من أهله، فقال‏:‏ ‏\"‏لا تدعو علي أنفسكم إلا بخير فإن الملائكة يؤمنون علي ما تقولون” ثم قال‏:‏ “اللهم اغفر لأبي سلمه، وارفع درجته في المهديين،واخلفه في عقبه في الغابرين، واغفر لنا وله يا رب العالمين، وافسح له في قبره، ونور له فيه‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) visited Abu Salamah (May Allah be pleased with him) when his eyes were open soon after he died. He closed them (the eyes) for him and said, \"When the soul is taken away, the sight follows it.\" Some members of his family began to weep. He (ﷺ) said: \"Do not supplicate for yourselves anything but good, for the angels say \u0027amin\u0027 to what you say.\" Then he said, \"O Allah! Forgive Abu Salamah, raise his rank among those who are rightly-guided and grant him a successor from his descendants who remain behind. Grant him pardon and us, too. O Rubb of the worlds. Make his grave spacious for him and give him light in it.\" [Muslim].","language":"english"},{"text":"Rasulullah () mengunjungi Abu Salamah (ra dengan dia) ketika matanya terbuka segera setelah dia meninggal. Dia menutup mereka (mata) untuknya dan berkata, \"Ketika jiwa diambil, penglihatan mengikutinya.\" Beberapa anggota keluarganya mulai menangis. Dia (ﷺ) berkata: \"Jangan berdoa untuk dirimu sendiri selain kebaikan, karena para malaikat mengatakan \u0027amin\u0027 untuk apa yang kamu katakan.\" Kemudian dia berkata, \"Ya Allah! Ampunilah Abu Salamah, naikkan derajatnya di antara orang-orang yang mendapat petunjuk dan berikan dia penerus dari keturunannya yang tertinggal. Ampunilah dia dan kami juga. kubur yang luas untuknya dan berilah dia cahaya di dalamnya.” [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Umm Salamah (May Allah be pleased with her) reported:","language":"english"},{"text":"Ummu Salamah (Semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"920","hadith_id":"riyadussalihin","text":[{"text":"-عن أم سلمة رضي الله عنها قالت‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏إذا حضرتم المريض، أو الميت، فقولوا خيرا، فإن الملائكة يؤمنون علي ما تقولون، قالت‏:‏ فلما مات أبو سلمة، أتيت النبي صلى الله عليه وسلمى الله عليه وسلم الله عليه وسلم الله عليه وسلم فقلت‏:‏ يا رسول الله، إن أبا سلمة قد مات، قال‏:‏ “قولي‏:‏ اللهم اغفر لي وله، واعقبني منه عقبة حسنة‏\"‏ فقلت‏:‏ فأعقبني الله من هو خير لي منه‏:‏ محمداً صلى الله عليه وسلم ‏.‏‏\"‏ ((رواه مسلم هكَذا:\"إِذا حَضَرْتُمُ المَرِيضَ\" أَو\"الميِّت\"عَلَى الشَّكِّ، رواه أبو داود وغيره:\"الميِّت\"بلا شَكٍّ)).","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"When you visit a sick or a dying person, you should utter good words because the angels say `Amin\u0027 at what you say.\u0027\u0027 She added: When Abu Salamah (May Allah be pleased with him) died, I came to the Prophet (ﷺ) and said: \"O Messenger of Allah, Abu Salamah has died.\" He (ﷺ) directed me to supplicate thus: \"Allahummaghfir li wa lahu, wa a`qibni minhu `uqba hasanatan [O Allah, forgive me and him, and bestow upon me a better future (give me a better substitute)].\" So I supplicated as he directed, and Allah gave me a man who was better for me than Abu Salamah (i.e., the Prophet Muhammad (ﷺ)). (The Prophet (ﷺ) married Umm Salamah afterwards.) [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Ketika Anda mengunjungi orang sakit atau sekarat, Anda harus mengucapkan kata-kata yang baik karena para malaikat mengatakan \u0027Amin\u0027 pada apa yang Anda katakan.\u0027\u0027 Dia menambahkan: Ketika Abu Salamah (Semoga Allah senang dengan dia) meninggal, saya datang kepada Nabi (ﷺ) dan berkata: \"Ya Rasulullah, Abu Salamah telah meninggal.\" Dia (ﷺ) mengarahkan saya untuk berdoa sebagai berikut: \"Allahummaghfir li wa lahu, wa a`qibni minhu ` uqba hasanatan [Ya Allah, ampunilah aku dan dia, dan berikan kepadaku masa depan yang lebih baik (beri aku pengganti yang lebih baik)].\" Maka aku memohon sesuai petunjuknya, dan Allah memberiku seorang pria yang lebih baik bagiku daripada Abu Salamah ( yaitu, Nabi Muhammad (ﷺ)). (Nabi (ﷺ) menikah dengan Ummu Salamah sesudahnya.) [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Umm Salamah (May Allah be pleased with her):","language":"english"},{"text":"Ummu Salamah (Semoga Allah meridhoinya):","language":"bahasa"}]},{"index":"921","hadith_id":"riyadussalihin","text":[{"text":"وعنها قالت‏:‏ سمعت رسول الله صلى الله عليه وسلم يقول‏:‏‏\"‏ما من عبد تصيبه مصيبه، فيقول إن لله وإنا إليه راجعون‏:‏ اللهم آجرني في مصيبتي، واخلف لي خيرا منها، إلا آجره الله تعالي في مصيبته واخلف له خيراً منها‏.‏ قالت‏:‏ فلما توفي أبو سلمة، قلت كما أمرني رسول الله صلى الله عليه وسلم ، فاخلف الله خيراص منه رسول الله صلى الله عليه وسلم “ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"I heard the Messenger of Allah (ﷺ) saying, \"When a person suffers from a calamity and utters: \u0027Inna lillahi wa inna ilaihi raji\u0027un. Allahumma ujurni fi musibati, wakhluf li khairan minha (We belong to Allah and to Him we shall return. O Allah! Compensate me in my affliction, recompense my loss and give me something better in exchange for it), then Allah surely compensates him with reward and better substitute.\" Umm Salamah (May Allah be pleased with her) said: When Abu Salamah (May Allah be pleased with him) died, I repeated the same supplication as the Messenger of Allah (ﷺ) had commanded me (to do). So Allah bestowed upon me a better substitute than him (I was married to Muhammad, the Messenger of Allah (ﷺ)). [Muslim].","language":"english"},{"text":"Saya mendengar Rasulullah (ﷺ) bersabda, “Ketika seseorang tertimpa musibah dan mengucapkan: \u0027Inna lillahi wa inna ilaihi raji\u0027un. Allahumma ujurni fi musibati, wakhluf li khairan minha (Kami milik Allah dan kepada-Nya kami akan kembali. Ya Allah! Gantilah aku dalam kesusahanku, ganti kerugianku dan berilah aku sesuatu yang lebih baik sebagai gantinya), maka Allah pasti akan menggantinya dengan pahala dan pengganti yang lebih baik. Ummu Salamah r.a. berkata: Ketika Abu Salamah (ra dengan dia) meninggal, saya mengulangi doa yang sama seperti yang diperintahkan Rasulullah () kepada saya (untuk dilakukan). Maka Allah menganugerahkan kepadaku pengganti yang lebih baik darinya (aku menikah dengan Muhammad, Rasulullah (ﷺ)). [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Umm Salamah (May Allah be pleased with her) reported:","language":"english"},{"text":"Ummu Salamah (Semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"922","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي موسي رضي الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ إذا مات ولد العبد، قال الله تعالي لملائكته‏:‏ قبضتم ولد عبدي، فيقولون‏:‏ نعم، فيقول‏:‏ قبضتم ثمرة فؤاده، فيقولون‏:‏ نعم‏.‏ فيقول‏:‏ ماذا قال عبدي، فيقولون‏:‏ حمدك واسترجع، فيقول الله تعالى‏:‏ ابنوا لعبدي بيتاً في الجنة، وسموه بيت الحمد‏\"‏ ‏(‏‏(‏رواه الترمذي وقال‏:‏ حديث حسن‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"When a man\u0027s child dies, Allah, the Exalted, asks His angels, \u0027Have you taken out the life of the child of My slave?\u0027 and they reply in the affirmative. He (SWT) then asks, \u0027Have you taken the fruit of his heart?\u0027 and they reply in the affirmative. Thereupon He asks, \u0027What did my slave say?\u0027 They say: \u0027He praised You and said: Inna lillahi wa inna ilaihi raji\u0027un (We belong to Allah and to Him we shall return).\u0027 Allah says: \u0027Build a house for my slave in Jannah and name it Baitul-Hamd (the House of Praise).\"\u0027 [At-Tirmidhi].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Ketika seorang anak laki-laki meninggal, Allah Ta\u0027ala bertanya kepada malaikat-Nya, \u0027Apakah kamu telah mencabut nyawa anak hamba-Ku?\u0027 dan mereka menjawab mengiyakan. Dia (SWT) kemudian bertanya, \u0027Sudahkah kamu mengambil buah hatinya?\u0027 dan mereka menjawab dengan setuju. Kemudian Dia bertanya, \u0027Apa yang dikatakan budakku?\u0027 Mereka berkata: \u0027Dia memuji-Mu dan berkata: Inna lillahi wa inna ilaihi raji\u0027un (Kami adalah milik Allah dan kepada-Nya kami akan kembali).\u0027 Allah berfirman: \u0027Bangunlah rumah untuk hamba-Ku di Jannah dan beri nama Baitul-Hamd (Rumah Pujian).\"\u0027 [At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Abu Musa Al-Ash\u0027ari (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Musa Al-Asy\u0027ari r.a. melaporkan:","language":"bahasa"}]},{"index":"923","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ يقول الله تعالى‏:‏ ما لعبدي المؤمن عندي جزاء إذا قبضت صفيه من أهل الدنيا، ثم احتسبه إلا الجنه‏\"‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said: \"Allah, the Exalted, says: \u0027I have no reward except Jannah for a believing slave of Mine who shows patience and anticipates My reward when I take away his favourite one from the inhabitants of the world.\"\u0027 [Al-Bukhari].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda: \"Allah Ta\u0027ala berfirman: \u0027Aku tidak memiliki pahala kecuali surga bagi hamba-Ku yang beriman, yang bersabar dan mengharapkan pahala-Ku ketika Aku mengambil kekasihnya dari penduduk dunia. .”\u0027 [Al-Bukhari] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"924","hadith_id":"riyadussalihin","text":[{"text":"وعن أسامة بن زيد رضي الله عنهما قال‏:‏ أرسلت إحدي بنات النبي صلى الله عليه وسلم الله عليه وسلمى الله عليه وسلم الله عليه وسلم إليه تدعوه وتخبره أن صبياً لها -أو ابناً- في الموت فقال للرسول‏:‏ ارجع إليها فأخبرها أن لله تعالي ما أخذ وله ما أعطى، وكل شئ عنده بأجل مسمى، فمرها، فلتصبر ولتحتسب” وذكر تمام الحديث‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏","language":"arabic"},{"text":"A daughter of the Prophet (ﷺ) sent a message to him that her son was at his last breath, and requested him to come to her. The Messenger of Allah (ﷺ) sent back the informer saying: \"To Allah belongs what He takes and what He gives, and everything has a limited period (in this world). So ask her to endure patiently, and expect the reward of Allah.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Seorang putri Nabi (ﷺ) mengirim pesan kepadanya bahwa putranya berada di nafas terakhirnya, dan memintanya untuk datang kepadanya. Rasulullah (ﷺ) mengirim kembali informan dengan mengatakan: \"Kepunyaan Allah-lah apa yang Dia ambil dan apa yang Dia berikan, dan segala sesuatu memiliki waktu yang terbatas (di dunia ini). Jadi mintalah dia untuk bersabar, dan mengharapkan pahala dari Allah. .\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Usamah bin Zaid (May Allah be pleased with them) reported:","language":"english"},{"text":"Usamah bin Zaid radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"925","hadith_id":"riyadussalihin","text":[{"text":"عن ابن عمر رضي الله عنهما أن رسول الله صلى الله عليه وسلم عاد سعد بن عباده ومعه عبد الرحمن بن عوف، وسعد بن أبي وقاص، وعبد الله بن مسعود رضي الله عنهم، فبكي رسول الله صلى الله عليه وسلم ، فلما رأي القوم بكاء رسول الله صلى الله عليه وسلم ، بكوا ؛ فقال‏:‏ “ألا تسمعون‏؟‏ إن الله لا يعذب بدمع العين، ولا بحزن القلب، ولكن بهذا أو يرحم‏ \"‏ وأشار إلا لسانه‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) visited Sa\u0027d bin \u0027Ubadah during his illness. He was accompanied by \u0027Abdur-Rahman bin \u0027Auf, Sa\u0027d bin Abu Waqqas and \u0027Abdullah bin Mas\u0027ud (May Allah be pleased with them). The Messenger of Allah (ﷺ) began to weep. When his Companions saw this, their tears also started flowing. He (ﷺ) said, \"Do you not hear, Allah does not punish for the shedding of tears or the grief of the heart, but punishes or bestows mercy for the utterances of this (and he pointed to his tongue).\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) mengunjungi Sa\u0027d bin \u0027Ubadah saat sakit. Dia didampingi oleh \u0027Abdur-Rahman bin \u0027Auf, Sa\u0027d bin Abu Waqqas dan \u0027Abdullah bin Mas\u0027ud (Semoga Allah meridhoi mereka). Rasulullah () mulai menangis. Ketika para sahabatnya melihat ini, air mata mereka juga mulai mengalir. Dia (ﷺ) berkata, \"Apakah kamu tidak mendengar, Allah tidak menghukum untuk meneteskan air mata atau kesedihan hati, tetapi menghukum atau melimpahkan rahmat untuk ucapan ini (dan dia menunjuk lidahnya).\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Ibn \u0027Umar (May Allah be pleased with them) reported:","language":"english"},{"text":"Ibnu \u0027Umar radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"926","hadith_id":"riyadussalihin","text":[{"text":"وعن أسامة بن زيد رضي الله عنهما أن رسول الله صلى الله عليه وسلم رفع إليه ابن ابنته وهو في الموت، ففاض عينا رسول الله صلى الله عليه وسلم فقال له سعد‏:‏ ما هذا يا رسول الله‏؟‏‏!‏ قال‏:‏ ‏ \"‏هذه رحمة جعلها الله تعالي في قلوب عباده الرحماء‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏","language":"arabic"},{"text":"A grandson (child of the daughter) of the Messenger of Allah (ﷺ) was presented to him while the child was at his last breath. Tears began to flow from the eyes of the Messenger of Allah (ﷺ). Sa\u0027d said to him: \"What is this, O Messenger of Allah?\" He (ﷺ) said, \"It is mercy which Allah has placed in the hearts of his salves. Allah bestows His Mercy on the merciful among His slaves.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Seorang cucu (anak dari putri) Rasulullah (ﷺ) disajikan kepadanya saat anak itu pada napas terakhirnya. Air mata mulai mengalir dari mata Rasulullah (ﷺ). Sa\u0027d berkata kepadanya: \"Apa ini, ya Rasulullah?\" Dia (ﷺ) berkata, \"Ini adalah rahmat yang Allah tempatkan di dalam hati salepnya. Allah melimpahkan rahmat-Nya kepada orang-orang yang penyayang di antara hamba-hamba-Nya.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Usamah bin Zaid (May Allah be pleased with him) reported:","language":"english"},{"text":"Usamah bin Zaid radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"927","hadith_id":"riyadussalihin","text":[{"text":"وعن أنس رضي الله عنه أن رسول الله صلى الله عليه وسلم دخل علي ابنه إبراهيم رضي الله عنه وهو يجود بنفسه فجعلت عينا رسول الله صلى الله عليه وسلم تذرفان ‏.‏ فقال له عبد الرحمن بن عوف‏:‏ وأنت يا رسول الله ‏؟‏‏!‏ فقال‏:‏ “يا ابن عوف إنها رحمة” ثم أتبعها بأخرى، فقال‏:‏”إن العين تدمع والقلب يحزن ، ولا نقول إلا ما يرضي ربنا، وإنا بفراقك يا إبراهيم لمحزونون‏\"‏‏.‏ ‏(‏‏(‏رواه البخاري، وروي مسلم بعضه‏)‏‏)‏‏.‏ والأحاديث في الباب كثيرة في الصحيح مشهورة والله أعلم‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) came to his son Ibrahim (May Allah be pleased with him) when he was breathing his last. The eyes of the Messenger of Allah (ﷺ) began shedding tears. \u0027Abdur-Rahman bin \u0027Auf (May Allah be pleased with him) said, \"O Messenger of Allah, you too weep?\" He (ﷺ) said, \"O Ibn \u0027Auf! It is mercy.\" Then he began to weep and said, \"The eyes are shedding tears and the heart is grieved, and we will not say except what pleases our Rubb. O Ibrahim! Indeed we are grieved by your departure.\" [Al-Bukhari].","language":"english"},{"text":"Rasulullah () datang kepada putranya Ibrahim (ra dengan dia) ketika dia menghembuskan nafas terakhirnya. Mata Rasulullah (ﷺ) mulai meneteskan air mata. \u0027Abdur-Rahman bin \u0027Auf (ra dengan dia) berkata, \"Ya Rasulullah, kamu juga menangis?\" Dia (ﷺ) berkata, \"O Ibn \u0027Auf! Ini adalah rahmat.\" Kemudian dia mulai menangis dan berkata, \"Mata meneteskan air mata dan hati berduka, dan kami tidak akan mengatakan kecuali apa yang menyenangkan Rubb kami. Wahai Ibrahim! Sungguh kami berduka dengan kepergianmu.\" [Al-Bukhari] .","language":"bahasa"}],"narrated":[{"text":"Anas (May Allah be pleased with him) reported:","language":"english"},{"text":"Anas (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"928","hadith_id":"riyadussalihin","text":[{"text":"عن أبي رافع أسلم مولي رسول الله صلى الله عليه وسلم أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏ \"‏ من غسل ميتاً فكتم عليه ، غفر الله له أربعين مرة‏\"‏ ‏(‏‏(‏رواه الحاكم وقال صحيح علي شرط مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"He who washes a dead body and conceals what he notices of physical defects, he will be forgiven forty times.\u0027\u0027 [Al-Hakim].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, “Barangsiapa memandikan jenazah dan menutupi aibnya, maka diampuni empat puluh kali.” [Al-Hakim] .","language":"bahasa"}],"narrated":[{"text":"Abu Rafi` Aslam (May Allah be pleased with him), the freed slave of the Messenger of Allah (ﷺ) reported:","language":"english"},{"text":"Abu Rafi` Aslam (semoga Allah meridhoinya), budak Rasulullah () yang dibebaskan melaporkan:","language":"bahasa"}]},{"index":"929","hadith_id":"riyadussalihin","text":[{"text":"عن أبي هريرة رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ “من شهد الجنازة حتي يصلى عليها، فله قيراط ، ومن شهدها حتي تدفن، فله قيراطان‏\"‏ قيل‏:‏ وما القيراطان‏؟‏ قال‏:‏ “مثل الجبلين العظيمين” ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"Whoever follows the funeral procession and offers the funeral prayer for it, will get a reward equal to one Qirat, and whoever attends it till burial, will get a reward equal to two Qirat.\u0027\u0027 It was asked, \"What are two Qirat?\u0027\u0027 He (ﷺ) replied, \"Equal to two huge mountains.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Barangsiapa mengikuti prosesi pemakaman dan melakukan shalat jenazah untuk itu, akan mendapatkan pahala satu qirat, dan siapa yang menghadirinya sampai pemakaman, akan mendapatkan pahala dua qirat.\" Ditanyakan, \"Apakah dua Qirat itu?\" Dia (ﷺ) menjawab, \"Sama dengan dua gunung besar.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"930","hadith_id":"riyadussalihin","text":[{"text":"وعنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏\"‏من اتبع جنازة مسلم إيماناً واحتساباً، وكان معه حتي يصلى عليها ويفرغ من دفنها، فإنه يرجع من الأجر بقيراطين كل قيراط مثل أحدٍ، ومن صلى عليها، ثم رجع قبل أن تدفن ، فإنه يرجع بقيراط” ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"Whosoever attends the funeral of a Muslim believing and hoping for the reward from Allah and remains with it until the prayer is offered over it and the burial is completed, he will return with a reward of two Qirat; each Qirat is equivalent to Mount Uhud; and whosoever offers his prayer over it and returns before its burial, he will come back with one Qirat.\" [Al- Bukhari].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, “Barangsiapa yang menghadiri pemakaman seorang Muslim yang beriman dan mengharapkan pahala dari Allah dan tetap dengan itu sampai doa dipanjatkan dan penguburan selesai, dia akan kembali dengan pahala dua. Qirat; setiap Qirat setara dengan Gunung Uhud; dan siapa pun yang berdoa di atasnya dan kembali sebelum penguburannya, dia akan kembali dengan satu Qirat. [Al-Bukhari] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"931","hadith_id":"riyadussalihin","text":[{"text":"وعن أم عطية رضي الله عنها قالت‏:‏ نهينا عن اتباع الجنائز، ولم يعزم علينا‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏ ‏\"‏ومعناه ‏\"‏ ولم يشدد في النهي كما يشدد في المحرمات‏.‏","language":"arabic"},{"text":"We (womenfolk) were prohibited from accompanying a funeral procession, but we were not compelled (not to do so). [Al-Bukhari and Muslim].","language":"english"},{"text":"Kami (perempuan) dilarang mengiringi prosesi pemakaman, tetapi kami tidak dipaksa (untuk tidak melakukannya). [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Umm Atiyyah (May Allah be pleased with her) reported:","language":"english"},{"text":"Ummu Atiyyah (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"932","hadith_id":"riyadussalihin","text":[{"text":"عن عائشة رضي الله عنها، قالت: قال رسول الله صلى الله عليه وسلم: “ما من ميت يصلي عليه أمة من المسلمين يبلغون مائة كلهم يشفعون له إلا شفعوا فيه“ ((رواه مسلم).","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"If a group of Muslims numbering a hundred perform funeral prayer over a dead person, and all of them ask Allah\u0027s forgiveness for him, their prayer for him will be accepted.\" [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, “Jika sekelompok Muslim yang berjumlah seratus orang melakukan salat jenazah atas orang yang sudah meninggal, dan mereka semua memohon ampun kepada Allah untuknya, maka doa mereka untuknya akan diterima.” [Muslim] .","language":"bahasa"}],"narrated":[{"text":"\u0027Aishah (May Allah be pleased with her) reported:","language":"english"},{"text":"\u0027Aisyah r.a. melaporkan:","language":"bahasa"}]},{"index":"933","hadith_id":"riyadussalihin","text":[{"text":"وعن ابن عباس رَضِيَ اللَّهُ عَنهُما قال سمعت رَسُول اللَّهِ صَلَّى اللَّهُ عَلَيهِ وَسَلَّم يقول : \"ما من رجل مسلم يموت فيقوم على جنازته أربعون رجلاً لا يشركون بالله شيئاً إلا شفعهم اللَّه فيه.\" ((رَوَاهُ مُسلِمٌ)).","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"If a Muslim dies and forty people, who do not associate anything with Allah in worship, participate in the funeral prayer over him, Allah will accept their intercession for him.\" [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Jika seorang Muslim meninggal dan empat puluh orang, yang tidak menyekutukan Allah dalam ibadah apa pun, berpartisipasi dalam doa pemakaman atasnya, Allah akan menerima syafaat mereka untuknya.\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Ibn \u0027Abbas (May Allah be pleased with them) reported:","language":"english"},{"text":"Ibn \u0027Abbas (semoga Allah meridhoi mereka) melaporkan:","language":"bahasa"}]},{"index":"934","hadith_id":"riyadussalihin","text":[{"text":"وعن مرثد بن عبد الله اليزني قال‏:‏ كان مالك بن هبيرة رضي الله عنه إذا صلى علي الجنازة ، فتقال الناس عليها، جزأهم عليها ثلاثة أجزاء، ثم قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ “من صلى عليه ثلاثة صفوف، فقد أوجب “ ‏(‏‏(‏رواه أبو دواد، والترمذي وقال‏:‏ حديث حسن‏)‏‏)‏‏.‏","language":"arabic"},{"text":"When Malik bin Hubairah (May Allah be pleased with him) offered a funeral prayer and found a small number of participants, he would divide them into three rows and would say that the Messenger of Allah (ﷺ) said, \"If three rows of men offer funeral prayer over anyone, his entry into Jannah will become certain.\" [Abu Dawud and At- Tirmidhi].","language":"english"},{"text":"Ketika Malik bin Hubairah radhiyallahu \u0027anhu melakukan salat jenazah dan menemukan sejumlah kecil peserta, dia akan membagi mereka menjadi tiga shaf dan berkata bahwa Rasulullah (ﷺ) berkata, \"Jika tiga shaf laki-laki shalat jenazah atas siapa saja, pasti masuknya dia ke Jannah.” [Abu Dawud dan At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Marthad bin \u0027Abdullah Al-Yazni reported:","language":"english"},{"text":"Marthad bin \u0027Abdullah Al-Yazni melaporkan:","language":"bahasa"}]},{"index":"935","hadith_id":"riyadussalihin","text":[{"text":"عن أبي عبد الرحمن بن عوف بن مالك رضي الله عنه قال‏:‏ صلى رسول الله صلى الله عليه وسلم علي جنازة، فحفظت من دعائه وهو يقول‏:‏ ‏\"‏اللهم اغفر له، وارحمه، وعافه، واعف عنه، وأكرم نزله، ووسع مدخله واغسله بالماء والثلج والبرد ونقه من الخطايا، كما نقيت الثوب الأبيض من الدنس، وأبدله داراً خيراً من داره، وأهلاً خيراً من أهله، وزوجاً خيراً من زوجه، وأدخله الجنة، وأعذه من عذاب القبر، ومن عذاب النار” حتي تمنين أن أكون ذلك الميت‏.‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) offered a funeral prayer and I memorized his supplication. He (ﷺ) prayed: \"Allahummaghfir lahu, warhamhu, wa \u0027afihi, wa\u0027fu \u0027anhu, wa akrim nuzulahu, wa wassi\u0027 mudkhalahu, waghsilhu bil-ma\u0027i wath-thalji wal-baradi, wa naqqihi minal-khataya, kama naqqaytath-thawbal-abyada minad-danasi, wa abdilhu daran khairan min darihi, wa ahlan khairan min ahlihi, wa zawjan khairan min zawjihi, wa adkhilhul-Jannata, wa a\u0027idh-hu min \u0027adhabil- qabri, wa min \u0027adhabin-nar [if the dead person is a woman, one should change the ending of certain words in this supplication from hu to ha] (O Allah! Forgive him, bestow mercy upon him, pardon him, accord him a noble provision and make his grave spacious, wash him with water, snow and hail, purify him from sins as You have purified the white garment from soiling, give him a better abode in place of his present one, and a better family in exchange of his present one, and a better spouse in place of his present wife; admit him to Jannah and protect from the trial in the grave and punishment in the Hell).\" (After hearing this supplication of the Messenger of Allah (ﷺ), Abu\u0027 Abdur-Rahman \u0027Auf bin Malik (May Allah be pleased with him) said: I wished I had been that dead man. [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) menawarkan doa pemakaman dan saya menghafal doanya. Dia (ﷺ) berdoa: \"Allahummaghfir lahu, warhamhu, wa \u0027afihi, wa\u0027fu \u0027anhu, wa akrim nuzulahu, wa wassi\u0027 mudkhalahu, waghsilhu bil-ma\u0027i wath-thalji wal-baradi, wa naqqihi minal-khataya, kama naqqaytath-thawbal-abyada minad-danasi, wa abdilhu daran khairan min darihi, wa ahlan khairan min ahlihi, wa zawjan khairan min zawjihi, wa adkhilhul-Jannata, wa a\u0027idh-hu min \u0027adhabil- qabri, wa min \u0027adhabin -nar [jika orang yang meninggal adalah seorang wanita, seseorang harus mengubah akhir kata-kata tertentu dalam doa ini dari hu menjadi ha](Ya Allah! Ampunilah dia, berikan rahmat kepadanya, ampuni dia, beri dia rezeki yang mulia dan luaskan kuburannya, basuh dia dengan air, salju dan hujan es, bersihkan dia dari dosa karena Engkau telah membersihkan pakaian putih dari kotoran, beri dia baginya tempat tinggal yang lebih baik sebagai pengganti istrinya yang sekarang, dan keluarga yang lebih baik sebagai pengganti keluarganya yang sekarang, dan pasangan yang lebih baik sebagai pengganti istrinya yang sekarang; masukkan dia ke Jannah dan peliharalah dia dari cobaan di kubur dan azab di Neraka. ).” (Setelah mendengar doa Rasulullah (ﷺ), Abu \u0027Abdur-Rahman \u0027Auf bin Malik (ra dengan dia) berkata: Saya berharap saya telah orang mati itu [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu \u0027Abdur-Rahman \u0027Auf bin Malik (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu \u0027Abdur-Rahman \u0027Auf bin Malik r.a. melaporkan:","language":"bahasa"}]},{"index":"936","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي هريرة وأبي قتادة، وأبي إبراهيم الأشهلي عن أبيه -وأبوه صحابي- رضي الله عنهم، عن النبي صلى الله عليه وسلمى الله عليه وسلم الله عليه وسلم الله عليه وسلم أنه صلى علي جنازة فقال‏:‏‏ \"‏اللهم اغفر لحينا وميتنا، وصغيرنا وكبيرنا، وذكرنا وأنثانا، وشاهدنا وغائبنا‏.‏ اللهم من أحييته منا، فأحيه علي الإسلام، ومن توفيته منا، فتوفه علي الإيمان؛ اللهم لا تحرمنا أجره، ولا تفتنا بعده‏\"‏ ‏‏(‏‏(‏رواه الترمذي‏)‏‏)‏ من رواية أبي هريرة وأبو هريرة صحيح والأشهلي، ورواه أبو داود من رواية أبي هريرة وأبي قتادة‏.‏ قال الحاكم‏:‏ حديث أبي هريرة صحيح علي شرط البخاري ومسلم، قال الترمذي‏:‏ قال البخاري‏:‏ أصح روايات هذا الحديث رواية الأشهلي‏.‏ قال البخاري‏:‏ وأصح شيء في الباب حديث عوف بن مالك‏.‏","language":"arabic"},{"text":"The Prophet (ﷺ) offered a funeral prayer and said: \"Allahummaghfir lihaiyina wa maiyitina, wa saghirina wa kabirina, wa dhakarina wa unthana, wa shahidina wa gha\u0027ibina. Allahumma man ahyaiytahu minna, fa\u0027ahyihi \u0027alal-Islam, wa man tawaffaiytahu minna, fatawaffahu \u0027alal-Iman. Allahumma la tahrimna ajrahu, wa la taftinna ba\u0027dahu (O Allah, forgive our living and our dead, our present and our absent, our young and our old, our male and our female. O Allah, whosoever of us You keep alive, keep him alive (faithful) to Islam, and whosoever of us You cause to die, let him die having Iman. O Allah, do not deprive us of our reward (for being patient) and do not subject us to trials after his death.\" [Abu Dawud and At-Tirmidhi].","language":"english"},{"text":"Nabi (ﷺ) memanjatkan doa pemakaman dan berkata: \"Allahummaghfir lihaiyina wa maiyitina, wa saghirina wa kabirina, wa dhakarina wa unthana, wa shahidina wa gha\u0027ibina. Allahumma man ahyaiytahu minna, fa\u0027ahyihi \u0027alal-Islam, wa man tawaffaiytahu minna, fatawaffahu \u0027alal-Iman. Allahumma la tahrimna ajrahu, wa la taftinna ba\u0027dahu (Ya Allah, ampunilah kami yang hidup dan yang mati, kami yang sekarang dan yang tidak ada, muda dan tua kami, laki-laki dan perempuan kami. Allah, barang siapa di antara kami yang Engkau hidupkan, peliharalah dia (beriman) kepada Islam, dan barang siapa di antara kami yang Engkau matikan, hendaklah dia mati dalam keadaan beriman. tidak membuat kami diadili setelah kematiannya.\" [Abu Dawud dan At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah, Abu Qatadah, and Abu Ibrahim Al-Ash-hali (May Allah be pleased with them) reported:","language":"english"},{"text":"Abu Hurairah, Abu Qatadah, dan Abu Ibrahim Al-Ash-hali meriwayatkan:","language":"bahasa"}]},{"index":"937","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي هريرة رضي الله عنه قال‏:‏ سمعت رسول الله صلى الله عليه وسلم يقول‏:‏ “إذا صليتم علي الميت، فأخلصوا له الدعاء‏\"‏ ‏(‏‏(‏رواه أبو داود‏)‏‏)‏‏.‏","language":"arabic"},{"text":"I heard the Messenger of Allah (ﷺ) saying: \"When you pray over the dead, make a sincere supplication for him.\" [Abu Dawud].","language":"english"},{"text":"Saya mendengar Rasulullah (ﷺ) berkata: \"Jika Anda berdoa untuk orang mati, buatlah permohonan yang tulus untuknya.\" [Abu Daud] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"938","hadith_id":"riyadussalihin","text":[{"text":"وعنه عن النبي صلى الله عليه وسلم الله عليه وسلمى الله عليه وسلم الله عليه وسلم في الصلاة علي الجنازة‏:‏ “اللهم أنت ربها، وأنت خلقتها، وأنت هديتها للإسلام، وأنت قبضت روحها، وأنت أعلم بسرها وعلانيتها، جئناك شفعاء له، فاغفر له” ‏(‏‏(‏رواه أبو داود‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Prophet (ﷺ) supplicated in course of funeral prayer: \"Allahumma Anta Rabbuha, wa Anta khalaqtaha, wa Anta hadaytaha lil-Islam, wa Anta qabadta ruhaha, wa Anta a\u0027lamu bisirriha wa \u0027alaniyyatiha, ji\u0027naka shufa\u0027a\u0027a lahu [if the dead person is a man, or laha if the dead person is a woman], faghfir lahu [or laha, if it is a woman] (O Allah, You are its Rubb; You created it; You guided it to Islam; You have taken its life back and You know best its insight and outer condition. We have come as intercessors, so forgive him).\" [Abu Dawud].","language":"english"},{"text":"Nabi (ﷺ) berdoa dalam doa pemakaman: \"Allahumma Anta Rabbuha, wa Anta khalaqtaha, wa Anta hadaytaha lil-Islam, wa Anta qabadta ruhaha, wa Anta a\u0027lamu bisirriha wa \u0027alaniyyatiha, ji\u0027naka shufa\u0027a\u0027 a lahu [jika orang yang meninggal adalah laki-laki, atau laha jika orang yang meninggal adalah seorang wanita] , faghfir lahu [atau laha, jika itu seorang wanita] (Ya Allah, Engkau adalah Karetnya; Engkau yang menciptakannya; Engkau yang membimbingnya kepada Islam; Anda telah mengambil nyawanya dan Anda lebih mengetahui wawasan dan kondisi luarnya. Kami datang sebagai pemberi syafaat, maka maafkan dia).\" [Abu Daud] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"939","hadith_id":"riyadussalihin","text":[{"text":"وعن واثلة بن الأسقع رضي الله عنه قال‏:‏ صلى بنا رسول الله صلى الله عليه وسلم علي رجل من المسلمين، فسمعته يقول‏:‏ ‏ \"‏اللهم إن فلان ابن فلان في ذمتك وحبل جوارك، فقه فتنة القبر، وعذاب النار، وأنت أهل الوفاء والحمد؛ اللهم اغفر له وارحمه، إنك أنت الغفور الرحيم‏\"‏ ‏(‏‏(‏رواه أبو داود‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) led the funeral prayer of a Muslim man in our presence, and I heard him saying \"Allahumma inna [name of the dead person] fi dhimmatika wa habli jiwarika, faqihi fitnatal- qabri; wa \u0027adhaban-Nari, wa Anta ahlul-wafa\u0027i wal-hamdi; Allahumma faghfir lahu warhamhu, innaka Antal-Ghafur-ur-Rahim [If the dead person is a woman, one can change hu in some words here with ha] [O Allah, (so-and-so son of so-and-so) is in Your Protection and inside the surroundings of Your Refuge. Safeguard him from the trial of the grave and the punishment of the Hell. You keep Your Promise and You deserve to be praised. O Allah! Forgive him and be merciful to him. Indeed, You are the Forgiving, the Merciful].\" [Abu Dawud].","language":"english"},{"text":"Rasulullah (ﷺ) memimpin doa pemakaman seorang pria Muslim di hadapan kami, dan saya mendengar dia mengatakan \"Allahumma inna [nama orang yang meninggal] fi dhimmatika wa habli jiwarika, faqihi fitnatal-qabri; wa \u0027adhaban-Nari , wa Anta ahlul-wafa\u0027i wal-hamdi; Allahumma faghfir lahu warhamhu, innaka Antal-Ghafur-ur-Rahim [Jika orang yang meninggal adalah seorang wanita, seseorang dapat mengubah hu dalam beberapa kata di sini dengan ha] [Ya Allah, ( fulan putra fulan) berada dalam lindungan-Mu dan dalam lingkungan lindungan-Mu. Peliharalah dia dari siksa kubur dan siksa neraka. . Ya Allah! Ampunilah dia dan kasihilah dia. Sungguh, Engkau Maha Pengampun lagi Penyayang] . [Abu Daud] .","language":"bahasa"}],"narrated":[{"text":"Wathilah bin Al-Asqa\u0027 (May Allah be pleased with him) reported:","language":"english"},{"text":"Wathilah bin Al-Asqa\u0027 radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"940","hadith_id":"riyadussalihin","text":[{"text":"وعن عبد الله بن أبي أوفي رضي الله عنهما أنه كبر علي جنازة ابنة له أربع تكبيرات، فقام بعد الرابعة كقدر ما بين التكبيرتين يستغفر لها ويدعو، ثم قال‏:‏ كان رسول الله صلى الله عليه وسلم يصنع هكذا‏.‏ وفي رواية‏:‏ ‏ ‏كبر أربعاً، فمكث ساعة حتي ظننت أنه سيكبر خمساً، ثم سلم عن يمينه وعن شماله‏.‏ فلما انصرف قلنا له‏:‏ ما هذا‏؟‏ فقال‏:‏ إني لا أزيدكم علي ما رأيت رسول الله صلى الله عليه وسلم يصنع، أو‏:‏ هكذا صنع رسول الله صلى الله عليه وسلم ‏ ‏ ‏(‏‏(‏رواه الحاكم وقال‏:‏ حديث صحيح‏)‏‏)‏‏.‏","language":"arabic"},{"text":"While offering the funeral prayer of one of his daughters, he recited four Takbir, and after the fourth Takbir he continued standing for a time equal to an interval between two Takbir, praying for her and seeking Allah\u0027s forgiveness for her.\" Then he said: \"The Messenger of Allah (ﷺ) used to do so.\" Another narration is: He (Abdullah) recited four Takbir and remained standing in prayer for some time till we thought that he would recite the fifth Takbir. Then he gave Salam on the right and on the left. When he turned aside, we asked him about it. He replied: \"I would add nothing to what I saw the Messenger of Allah (ﷺ) doing,\" or he said: \"The Messenger of Allah (ﷺ) used to do so.\" [Al-Hakim].","language":"english"},{"text":"Saat mempersembahkan salat jenazah salah satu putrinya, dia membaca empat takbir, dan setelah takbir keempat dia terus berdiri untuk waktu yang sama dengan interval antara dua takbir, berdoa untuknya dan mencari pengampunan Allah untuknya.\" Kemudian dia berkata: “Rasulullah (ﷺ) biasa melakukannya.” Riwayat lainnya adalah: Dia (Abdullah) membaca takbir empat dan tetap berdiri dalam doa selama beberapa waktu sampai kami mengira dia akan membaca takbir kelima. Kemudian dia memberi salam pada hari itu. kanan dan kiri. Ketika dia menoleh, kami bertanya kepadanya tentang hal itu. Dia menjawab: \"Saya tidak akan menambahkan apa pun untuk apa yang saya lihat Rasulullah (ﷺ) lakukan,\" atau dia berkata: \"Rasulullah (ﷺ) ) biasa melakukannya.\" [Al-Hakim] .","language":"bahasa"}],"narrated":[{"text":"\u0027Abdullah bin Abu Aufa (May Allah be pleased with them) reported:","language":"english"},{"text":"\u0027Abdullah bin Abu Aufa (semoga Allah meridhoi mereka) melaporkan:","language":"bahasa"}]},{"index":"941","hadith_id":"riyadussalihin","text":[{"text":"عن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلمى الله عليه وسلم الله عليه وسلم الله عليه وسلم قال‏:‏ ‏\"‏أسرعوا بالجنازة، فإن تك صالحة، فخير تقدمونها إليه، وإن تك سوي ذلك، فشر تضعونه عن رقابكم‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏ ‏(‏‏(‏وفي رواية لمسلم‏:‏ ‏\"‏فخير تقدمونها عليه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"I heard the Prophet (ﷺ) saying, \"Hurry up with the dead body (for its burial), for if it is pious, you are speeding it to goodness and if it is otherwise, you are laying an evil off your necks.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Saya mendengar Nabi (ﷺ) berkata, \"Cepatlah dengan mayat (untuk penguburannya), karena jika itu saleh, Anda mempercepatnya untuk kebaikan dan jika sebaliknya, Anda menghilangkan kejahatan dari leher Anda.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"942","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي سعيد الخدري رضي الله عنه قال‏:‏ كان النبي صلى الله عليه وسلم الله عليه وسلمى الله عليه وسلم الله عليه وسلم يقول‏:‏ ‏\"‏إذا وضعت الجنازة، فاحتملها الرجال علي أعناقهم، فإن كانت صالحة، قال‏:‏ قدموني، وإن كانت غير صالحة، قالت لأهلها‏:‏ يا ويلها أين تذهبون بها‏؟‏ يسمع صوتها كل شيء إلا الأنسان، ولو سمع الأنسان لصعق” ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Prophet (ﷺ) said, \"When a dead body is placed on a bier and men carry it on their shoulders, if he was a pious man, it (corpse) says: \u0027Take me in haste.\u0027 But if he was not righteous, it says to its bearers: \u0027Woe to it. Where are you taking it?\u0027 Everything except man hears its voice. Had a human being heard its voice, he would have surely fallen into swoon.\" [Al- Bukhari].","language":"english"},{"text":"Nabi (ﷺ) berkata, \"Ketika mayat diletakkan di atas usungan dan laki-laki memikulnya di pundak mereka, jika dia adalah orang yang saleh, itu (mayat) berkata: \u0027Bawa aku dengan tergesa-gesa.\u0027 Tetapi jika dia tidak benar, ia berkata kepada pembawanya: \u0027Celakalah dia. Ke mana kamu membawanya?\u0027 Semuanya kecuali manusia mendengar suaranya. Seandainya seorang manusia mendengar suaranya, dia pasti akan pingsan.\" [Al-Bukhari] .","language":"bahasa"}],"narrated":[{"text":"Abu Sa\u0027id Al-Khudri (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Sa\u0027id Al-Khudri r.a. melaporkan:","language":"bahasa"}]},{"index":"943","hadith_id":"riyadussalihin","text":[{"text":"عن أبي هريرة رضي الله عنه، عن النبي صلى الله عليه وسلمى الله عليه وسلم الله عليه وسلم الله عليه وسلم قال‏:‏ ‏ \"‏نفس المؤمن معلقة بدينه حتي يقضي عنه‏\"‏ ‏(‏‏(‏رواه الترمذي وقال‏:‏ حديث حسن‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Prophet (ﷺ) said, \"The soul of the deceased believer remains pending on account of the debt till it (the debt) is repayed.\" [At-Tirmidhi].","language":"english"},{"text":"Nabi (ﷺ) berkata, \"Jiwa orang mukmin yang meninggal tetap tertunda karena hutang sampai (hutang) itu dilunasi.\" [At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"944","hadith_id":"riyadussalihin","text":[{"text":"وعن حصين بن وحوح رضي الله عنه أن طلحة بن البراء رضي الله عنه مرض، فأتاه النبي صلى الله عليه وسلم الله عليه وسلمى الله عليه وسلم الله عليه وسلم يعوده فقال‏:‏ إني لا أري طلحة إلا قد حدث فيه الموت فآذوني به وعجلوا به، فإنه لا ينبغي لجيفة مسلم أن تحبس بين ظهراني أهله‏\"‏ ‏(‏‏(‏رواه أبو داود‏)‏‏)‏‏.‏","language":"arabic"},{"text":"When Talhah bin Al-Bara\u0027 (May Allah be pleased with him) fell ill, the Prophet (ﷺ) came to visit him and said, \"Verily, I think that Talhah is about to die. So inform me when he is dead and make haste (in burying him). Indeed, it is improper for the corpse of a Muslim to be kept lying unburied among his family members.\" [Abu Dawud].","language":"english"},{"text":"Ketika Talhah bin Al-Bara\u0027 (ra dengan dia) jatuh sakit, Nabi (ﷺ) datang mengunjunginya dan berkata, \"Sesungguhnya, saya berpikir bahwa Talhah akan mati. Jadi beritahu saya ketika dia sudah mati dan bersegeralah (menguburnya). Sesungguhnya, tidak sepantasnya jenazah seorang Muslim dibiarkan terbaring tanpa dikubur di antara anggota keluarganya.” [Abu Daud] .","language":"bahasa"}],"narrated":[{"text":"Hussain bin Wahwah (May Allah be pleased with him) reported:","language":"english"},{"text":"Hussain bin Wahwah radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"945","hadith_id":"riyadussalihin","text":[{"text":"عن علي رضي الله عنه قال‏:‏ كنا في جنازة في بقيع الغرقد فأتانا رسول الله صلى الله عليه وسلم فقعد، وقعدنا حوله ومعه مخصرة فنكس وجعل ينكت بمخصرته، ثم قال‏:‏ ما منكم من أحد إلا وقد كتب مقعده من النار ومقعده من الجنة” فقالوا‏:‏ يا رسول الله أفلا نتكل علي كتابنا‏؟‏ فقال‏:‏ ‏ \"‏اعملوا فكل ميسر لما خلق له‏\"‏ وذكر تمام الحديث‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","language":"arabic"},{"text":"We were accompanying a funeral procession in Baqi` Al-Gharqad (graveyard in Al-Madinah) when the Messenger of Allah (ﷺ) proceeded towards us and sat down. We sat around him. He had a small stick in his hand. He was bending down his head and scraping the ground with the stick. He said, \"There is none among you but has a place assigned for him either in the Jannah or in the Hell.\" The Companions said: \"O Messenger of Allah, should we not depend upon what has been written for us (and give up doing good deeds)?\u0027\u0027 The Messenger of Allah (ﷺ) said, \"Carry on doing good deeds. Every one will find it easy to do such deeds (as will lead him to his destined place) for which he has been created.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Kami sedang mengiringi prosesi pemakaman di Baqi` Al-Gharqad (makam di Al-Madinah) ketika Rasulullah () berjalan ke arah kami dan duduk. Kami duduk di sekelilingnya. Dia memiliki tongkat kecil di tangannya. Dia membungkukkan kepalanya dan menggores tanah dengan tongkat. Dia berkata, \"Tidak ada seorang pun di antara kamu selain memiliki tempat yang ditugaskan untuknya baik di Jannah atau di Neraka.\" Para sahabat berkata: “Ya Rasulullah, apakah kami tidak bergantung pada apa yang telah dituliskan untuk kami (dan berhenti melakukan perbuatan baik)?” Rasulullah () berkata, “Teruslah berbuat baik. Setiap orang akan merasa mudah untuk melakukan perbuatan seperti itu (yang akan membawanya ke tempat yang telah ditentukan) yang untuknya dia telah diciptakan.” [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"`Ali (May Allah be pleased with him) reported:","language":"english"},{"text":"`Ali (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"946","hadith_id":"riyadussalihin","text":[{"text":"عن أبي عمرو -وقيل‏:‏ أبو عبد الله، وقيل‏:‏ أبو ليلى- عثمان بن عفان رضي الله عنه قال‏:‏ كان النبي صلى الله عليه وسلمى الله عليه وسلم الله عليه وسلم الله عليه وسلم إذا فرغ من دفن الميت وقف عليه، وقال‏:‏ ‏ \"‏استغفروا لأخيكم وسلوا له التثبيت، فإنه الآن يسأل‏\"‏ ‏(‏‏(‏رواه أبو داود‏)‏‏)‏‏.‏","language":"arabic"},{"text":"After the burial of a dead man, the Prophet (ﷺ) would stand by the grave and say, \"Ask Allah to forgive your brother and supplicate for him for steadfastness because he is being questioned (about his deeds) now.\" [Abu Dawud].","language":"english"},{"text":"Setelah penguburan orang mati, Nabi (ﷺ) akan berdiri di dekat kubur dan berkata, \"Mintalah Allah untuk mengampuni saudaramu dan berdoa untuk dia untuk ketabahan karena dia sedang ditanyai (tentang perbuatannya) sekarang.\" [Abu Daud] .","language":"bahasa"}],"narrated":[{"text":"Abu `Amr (also called Abu `Abdullah and also Abu Laila) from `Uthman bin `Affan (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu `Amr (juga disebut Abu `Abdullah dan juga Abu Laila) dari `Utsman bin `Affan (ra dengan dia) melaporkan:","language":"bahasa"}]},{"index":"947","hadith_id":"riyadussalihin","text":[{"text":"وعن عمرو بن العاص رضي الله عنه قال‏:‏ إذا دفنتمونى، فأقيموا حول قبري قدر ما تنحر جذور، ويقسم لحمها حت أستأنس بكم، وأعلم ماذا أراجع به رسل ربي‏\"‏ ‏(‏‏(‏رواه مسلم‏.‏ وقد سبق بطوله‏)‏‏)‏‏.‏ وقال الشافعي رحمه الله‏:‏ ويستحب أن يقرأ عنده شيء من القرآن، وإن ختموا القرآن عنده كان حسناً‏.‏","language":"arabic"},{"text":"\"When you have buried me, keep standing near my grave till (for the time it takes to) a camel is slaughtered and its meat is distributed, so that I may feel your nearness and know what to reply to the angels sent by my Rubb.\" [Muslim].","language":"english"},{"text":"“Jika kamu telah menguburkanku, tetaplah berdiri di dekat kuburanku sampai (untuk waktu yang dibutuhkan) seekor unta disembelih dan dagingnya dibagikan, agar aku dapat merasakan kedekatanmu dan tahu apa yang harus menjawab malaikat yang dikirim oleh Rubb-ku. .\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"\u0027Amr bin Al-\u0027as (May Allah be pleased with him) used to say:","language":"english"},{"text":"\u0027Amr bin Al-\u0027as (semoga Allah meridhoinya) biasa berkata:","language":"bahasa"}]},{"index":"948","hadith_id":"riyadussalihin","text":[{"text":"وعن عائشة رضي الله عنها أن رجلاً قال للنبي صلى الله عليه وسلم ‏:‏ إن أمي افتلتت نفسها وأراها لو تكلمت، تصدقت، فهل لها أجر إن تصدقت عنها‏؟‏ قال‏:‏ ‏ \"‏نعم‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","language":"arabic"},{"text":"A man said to the Prophet (ﷺ): \"My mother has died suddenly. I think that if she were able to talk (alive) she would have given in Sadaqah (charity). So, if I give Sadaqah now on her behalf, will she get the reward?\" The Messenger of Allah (ﷺ) said, \"Yes (she will be rewarded for that).\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Seorang laki-laki berkata kepada Nabi (ﷺ): \"Ibuku meninggal tiba-tiba. Saya pikir jika dia bisa berbicara (hidup) dia akan memberi sedekah. Jadi, jika saya memberi sedekah sekarang atas namanya, apakah dia akan mendapatkan hadiahnya?\" Rasulullah (ﷺ) berkata, \"Ya (dia akan diberi hadiah untuk itu).\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"\u0027Aishah (May Allah be pleased with her) reported:","language":"english"},{"text":"\u0027Aisyah r.a. melaporkan:","language":"bahasa"}]},{"index":"949","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ “إذا مات الأنسان انقطع عمله إلا من ثلاث‏:‏ صدقة جارية، أو علم ينتفع به، أو ولد صالح يدعو له‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"When a man dies, his deeds come to an end, except for three: A continuous charity, knowledge by which people derive benefit, pious son who prays for him.\" [Muslim].","language":"english"},{"text":"Rasulullah SAW bersabda, “Jika seseorang meninggal maka terputuslah amalnya, kecuali tiga hal: sedekah jariyah, ilmu yang bermanfaat bagi manusia, anak shaleh yang mendoakannya.” [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"950","hadith_id":"riyadussalihin","text":[{"text":"عن أنس رضي الله عنه قال‏:‏ مروا بجنازة، فأثنوا عليها خيراً، فقال النبي صلى الله عليه وسلم الله عليه وسلمى الله عليه وسلم الله عليه وسلم ‏:‏ ‏\"‏وجبت”، ثم مروا بأخرى، فأثنوا عليها شراً، فقال النبي صلى الله عليه وسلمى الله عليه وسلم الله عليه وسلم الله عليه وسلم ‏:‏ ‏\"‏وجبت‏\"‏ فقال عمر بن الخطاب رضي الله عنه‏:‏ ما وجبت‏؟‏ قال‏:‏ ‏\"‏هذا أثنيتم عليه خيراً، فوجبت له الجنة، وهذا أثنيتم عليه شراً فوجبت عليه النار، أنتم شهداء الله في الأرض” ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"Some Companions happened to pass by a funeral procession (bier) and they praised him (the deceased). The Prophet (ﷺ) said, \"He will certainly enter it.\" Then they passed by another funeral procession and they spoke ill of the deceased. The Prophet (ﷺ) said, \"He will certainly enter it.\" `Umar bin Al-Khattab (May Allah be pleased with him) said: \"(O Messenger of Allah,) what do you mean by `He will certainly enter it?\u0027\u0027 He (ﷺ) replied, \"You praised the first person, so he will enter Jannah; and you spoke ill of the second person, so he will enter Hell. You are Allah\u0027s witnesses on earth.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Beberapa sahabat kebetulan melewati prosesi pemakaman (bier) dan mereka memujinya (almarhum). Nabi (ﷺ) berkata, \"Dia pasti akan memasukinya.\" Kemudian mereka melewati prosesi pemakaman lain dan mereka berbicara buruk tentang almarhum. Nabi (ﷺ) berkata, \"Dia pasti akan memasukinya.\" `Umar bin Al-Khattab (ra dengan dia) berkata: \"(Ya Rasulullah,) apa yang Anda maksud dengan `Dia pasti akan masuk?\u0027\u0027 Dia (ﷺ) menjawab, \"Kamu memuji orang pertama , maka dia akan masuk Jannah; dan Anda berbicara buruk tentang orang kedua, sehingga dia akan masuk Neraka. Kalian adalah saksi-saksi Allah di bumi.” [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Anas (May Allah be pleased with him) reported:","language":"english"},{"text":"Anas (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"951","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي الأسود قال‏:‏ قدمت المدينة، فجلست إلي عمر بن الخطاب رضي الله عنه فمرت بهم جنازة، فأثني علي صاحبها خيراً فقال عمر‏:‏ وجبت، ثم مر بأخرى، فأثني علي صاحبها خيراً، فقال عمر‏:‏ وجبت، ثم مر بالثالثة، فأثني علي صاحبها شراً، فقال عمر‏:‏ وجبت‏:‏ قال أبو الأسود‏:‏ فقلت‏:‏ وما وجبت يا أمير المؤمنين‏؟‏ قال‏:‏ قلت كما قال النبي صلى الله عليه وسلمى الله عليه وسلم الله عليه وسلم ‏:‏ “أيما مسلم شهد له أربعة بخير، أدخله الله الجنة‏:‏ فقلنا‏:‏ وثلاثة‏؟‏ قال‏:‏ “وثلاثة‏\"‏ فقلنا‏:‏ واثنان‏؟‏ قال‏:‏ ‏\"‏واثنان‏\"‏ ثم لم نسأله عن الواحد‏\"‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","language":"arabic"},{"text":"I came to Al- Madinah, and while I was sitting beside \u0027Umar bin Al-Khattab, a funeral procession passed by. The people praised the deceased, and \u0027Umar bin Al-Khattab said: \"He will certainly enter it.\" Then another funeral procession passed by and the people praised the deceased. \u0027Umar bin Al-Khattab (May Allah be pleased with him) said: \"He will certainly enter it.\" A third funeral procession passed by and the people spoke ill of the deceased. He said: \"He will certainly enter it.\" I (Abul-Aswad) asked: \"O Amir Al-Mu\u0027minin (i.e., Leader of the Believers)! What do you mean by \u0027He will certainly enter it\u0027?\" He replied: \"I said the same as was said by the Prophet (ﷺ). He (ﷺ) said, \u0027If four persons testify the righteousness of a Muslim, Allah will grant him Jannah.\u0027 We asked: \u0027If three persons testify his righteousness?\u0027 He (ﷺ) replied, \u0027Even three\u0027. Then we asked: \u0027If two?\u0027 He (ﷺ) replied, \u0027Even two.\u0027 We did not ask him (regarding the testimony) of one.\" [Al-Bukhari].","language":"english"},{"text":"Saya datang ke Madinah, dan ketika saya sedang duduk di samping \u0027Umar bin Al-Khattab, sebuah prosesi pemakaman lewat. Orang-orang memuji almarhum, dan \u0027Umar bin Al-Khattab berkata: \"Dia pasti akan memasukinya.\" Kemudian prosesi pemakaman lain lewat dan orang-orang memuji almarhum. \u0027Umar bin Al-Khattab (semoga Allah meridhoinya) berkata: \"Dia pasti akan memasukinya.\" Prosesi pemakaman ketiga lewat dan orang-orang berbicara buruk tentang almarhum. Dia berkata: \"Dia pasti akan memasukinya.\" Aku (Abul-Aswad) bertanya: \"Wahai Amir Al-Mu\u0027minin (yaitu, Pemimpin Orang-orang Mukmin)! Apa maksudmu dengan \u0027Dia pasti akan memasukinya\u0027?\" Dia menjawab: \"Saya mengatakan hal yang sama seperti yang dikatakan oleh Nabi (ﷺ). Dia () berkata, \u0027Jika empat orang bersaksi tentang kebenaran seorang Muslim, Allah akan memberinya Jannah. \u0027 Kami bertanya: \u0027Jika tiga orang bersaksi tentang kebenarannya?\u0027 Dia (ﷺ) menjawab, \u0027Bahkan tiga\u0027. Kemudian kami bertanya: \u0027Jika dua?\u0027 Dia (ﷺ) menjawab, \u0027Bahkan dua.\u0027 Kami tidak bertanya kepadanya (tentang kesaksian) satu orang.\" [Al-Bukhari] .","language":"bahasa"}],"narrated":[{"text":"Abul-Aswad (May Allah be pleased with him) reported:","language":"english"},{"text":"Abul Aswad radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"952","hadith_id":"riyadussalihin","text":[{"text":"عن أنس رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏ \"‏ما من مسلم يموت له ثلاثة لم يبلغوا الحنث إلا ادخله الله الجنة بفضل رحمته إياهم‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"Any Muslim who loses three children before they reach the age of maturity, will be granted Jannah by Allah, the Exalted, out of His Mercy for them.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Setiap Muslim yang kehilangan tiga anak sebelum mereka mencapai usia dewasa, akan diberikan Jannah oleh Allah Ta\u0027ala, dari rahmat-Nya bagi mereka.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Anas (May Allah be pleased with him) reported:","language":"english"},{"text":"Anas (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"953","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي هريرة رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ “لا يموت لأحد من المسلمين ثلاثة من الولد لا تمسه النار إلا تحلة القسم‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"A Muslim whose three children die (in infancy) will not be touched by the Fire (of Hell) except for the fulfillment of Allah\u0027s Oath.\" [Al-Bukhari and Muslim]. [Allah\u0027s Oath here refers to His Ayah: \"There is not one of you but will cross over it (Hell).\" (19:71) And the crossing will be across the \u0027Bridge\u0027 set over the Hell.]","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Seorang Muslim yang ketiga anaknya meninggal (saat masih bayi) tidak akan disentuh oleh Api (Neraka) kecuali untuk memenuhi Sumpah Allah.\" [Al-Bukhari dan Muslim] . [Sumpah Allah di sini mengacu pada Ayah-Nya: \"Tidak ada seorang pun di antara kamu tetapi akan menyeberanginya (Neraka).\" (19:71) Dan penyeberangannya akan melintasi \u0027Jembatan\u0027 yang terletak di atas Neraka.]","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"954","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي سعيد الخدري رضي الله عنه قال‏:‏ جاءت امرأة إلي رسول الله صلى الله عليه وسلم ، فقالت‏:‏ يا رسول الله ذهب الرجال بحديثك، فاجعل لنا مننفسك يوماً ناتيك فيه تعلمنا مما علمك الله، قال‏:‏ “اجتمعن يوم كذا وكذا” فاجتمعن، فأتاهن النبي صلى الله عليه وسلم فعلمهن مما علمه الله، ثم قال‏:‏ ‏ \"‏ما منكن من امرأة تقدم ثلاثة من الولد إلا كانوا لها حجاباً من النار‏\"‏ فقالت امرأة‏:‏ واثنين‏؟‏ فقال رسول الله صلى الله عليه وسلم “واثنين” ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"A woman came to the Messenger of Allah (ﷺ) and said: \"O Messenger of Allah! Only men benefit from your talks, so please fix a day for us, to teach us the knowledge which Allah has taught you.\" The Messenger of Allah (ﷺ) fixed a day and directed them to assemble. When they gathered, the Prophet (ﷺ) went to them and taught them what Allah had taught him. He (ﷺ) then said, \"Any woman of you whose three children die (in infancy) they will be a guard for her against Fire (of Hell).\" One of the women asked: \"What if she loses two?\" The Messenger of Allah (ﷺ) replied, \"Even two.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Seorang wanita datang kepada Rasulullah (ﷺ) dan berkata: \"Ya Rasulullah! Hanya laki-laki yang mendapat manfaat dari pembicaraan Anda, jadi tolong tentukan satu hari untuk kami, untuk mengajari kami ilmu yang telah diajarkan Allah kepada Anda.\" Rasulullah (ﷺ) menetapkan hari dan memerintahkan mereka untuk berkumpul. Ketika mereka berkumpul, Nabi (ﷺ) mendatangi mereka dan mengajari mereka apa yang telah diajarkan Allah kepadanya. Dia (ﷺ) kemudian berkata, \"Wanita mana pun di antara kalian yang ketiga anaknya meninggal (saat masih bayi) mereka akan menjadi penjaga baginya dari Api (Neraka).\" Salah satu wanita bertanya: \"Bagaimana jika dia kehilangan dua?\" Rasulullah (ﷺ) menjawab, \"Bahkan dua.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Sa\u0027id Al-Khudri (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Sa\u0027id Al-Khudri r.a. melaporkan:","language":"bahasa"}]},{"index":"955","hadith_id":"riyadussalihin","text":[{"text":"عن ابن عمر رضي الله عنهما أن رسول الله صلى الله عليه وسلم قال لأصحابه -يعني لما وصلوا الحجر‏:‏ ديار ثمود-‏:‏ ‏\"‏لا تدخلوا علي هؤلاء المعذبين إلا أن تكونوا باكين، فإن لم تكونوا باكين، فلا تدخلوا عليهم، لا يصيبكم ما أصابهم” ‏(‏‏(‏متفق عليه‏)‏‏)‏ وفي رواية قال‏:‏ لما مر رسول الله صلى الله عليه وسلم بالحجر قال‏:‏ ‏\"‏لا تدخلوا مساكن الذين ظلموا أنفسهم أن يصيبكم ما أصابهم إلا ان تكونوا باكين‏\"‏ ثم قنع رسول الله صلى الله عليه وسلم رأسه وأسرع السير حتي أجاز الوادي‏.‏","language":"arabic"},{"text":"Ibn `Umar (May Allah be pleased with them) reported: When the Messenger of Allah (ﷺ) and his Companions reached Al-Hijr, the dwellings of the Thamud people, he admonished his Companions (saying), \"Do not pass by these people who are being tormented, without weeping, lest the punishment should befall you as it had befallen them.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Ibn `Umar (ra dengan mereka) melaporkan: Ketika Rasulullah (ﷺ) dan para sahabatnya mencapai Al-Hijr, tempat tinggal orang-orang Tsamud, dia menasihati para sahabatnya (berkata), \"Jangan lewat ini. orang-orang yang disiksa tanpa menangis, supaya kamu jangan sampai azab itu menimpa kamu seperti yang menimpa mereka.” [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Narrated Ibn \u0027Umar:","language":"english"},{"text":"Dikisahkan oleh Ibn \u0027Umar:","language":"bahasa"}]}]