[{"index":"1408","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي هريرة رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏ \"‏كلمتان خفيفتان على اللسان، ثقيلتان في الميزان، حبيبتان إلى الرحمن‏:‏ سبحان الله وبحمده، سبحان الله العظيم‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"There are two statements that are light for the tongue to remember, heavy in the Scales and are dear to the Merciful: \u0027Subhan-Allahi wa bihamdihi, Subhan-Allahil-Azim [Glory be to Allah and His is the praise, (and) Allah, the Greatest is free from imperfection]\u0027.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, “Ada dua kalimat yang ringan diucapkan lisan, berat timbangannya dan disukai oleh Yang Maha Penyayang: \u0027Subhan-Allahi wa bihamdihi, Subhan-Allahil-Azim . Allah dan milik-Nya segala puji, (dan) Allah Yang Maha Besar bebas dari ketidaksempurnaan]\u0027 .\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"1409","hadith_id":"riyadussalihin","text":[{"text":"وعنه رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ لأن أقول‏:‏ سبحان الله، والحمد لله، ولا إله إلا الله، والله أكبر، أحب إلي مما طلعت عليه الشمس” ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"The uttering of the words: \"Subhan-Allah (Allah is free from imperfection), Al-hamdu lillah (all praise is due to Allah), La ilaha illallah (there is no true god except Allah) and Allahu Akbar (Allah is the Greatest)\u0027 is dearer to me than anything over which the sun rises.\" [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, \"Pengucapan kalimat: \"Subhan-Allah (Allah bebas dari ketidaksempurnaan), Al-hamdu lillah (segala puji bagi Allah), La ilaha illallah (tidak ada tuhan yang benar). kecuali Allah) dan Allahu Akbar (Allah Maha Besar)\u0027 lebih aku cintai daripada apa pun yang matahari terbit.\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"1410","hadith_id":"riyadussalihin","text":[{"text":"وعنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏\"‏من قال لا إله إلا الله وحده لا شريك له، له الملك، وله الحمد، وهو على كل شيء قدير، في يوم مائة مرة كانت له عدل عشر رقاب وكتبت له مائة حسنة، ومحيت عنه مائة سيئة، وكانت له حرزًا من الشيطان يومه ذلك حتى يمسي، ولم يأتِ أحد بأفضل مما جاء به إلا رجل عمل أكثر منه‏\"‏ وقال‏:‏ ‏\"‏من قال سبحان الله وبحمده، في يوم مائة مرة حطت عنه خطاياه وإن كانت مثل زبد البحر‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"He who utters a hundred times in a day these words: \u0027La ilaha illallahu, wahdahu la sharika lahu, lahul-mulku wa lahul-hamdu, wa Huwa \u0027ala kulli sha\u0027in Qadir (there is no true god except Allah. He is One and He has no partner with Him; His is the sovereignty and His is the praise, and He is Omnipotent),\u0027 he will have a reward equivalent to that for emancipating ten slaves, a hundred good deeds will be recorded to his credit, hundred of his sins will be blotted out from his scroll, and he will be safeguarded against the devil on that day till the evening; and no one will exceed him in doing more excellent good deeds except someone who has recited these words more often than him. And he who utters: \u0027Subhan-Allahi wa bihamdihi (Allah is free from imperfection and His is the praise)\u0027 one hundred times a day, his sins will be obliterated even if they are equal to the extent of the foam of the ocean.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, “Barangsiapa yang mengucapkan seratus kali dalam sehari kata-kata ini: \u0027La ilaha illallahu, wahdahu la sharika lahu, lahul-mulku wa lahul-hamdu, wa Huwa \u0027ala kulli sha\u0027in Qadir ( tidak ada Tuhan yang benar selain Allah. Dia adalah Satu dan tidak ada sekutu bagi-Nya; milik-Nyalah kekuasaan dan puji-pujian, dan Dia Mahakuasa),\u0027 dia akan mendapatkan pahala yang setara dengan membebaskan sepuluh budak, seorang Dia mencatat seratus kebaikan, seratus dosa dihapus dari gulungannya, dan dia akan dilindungi dari iblis pada hari itu hingga sore hari, dan tidak ada yang melebihi dia dalam melakukan kebaikan yang lebih baik kecuali. seseorang yang telah membaca kata-kata ini lebih sering daripada dia. Dan dia yang mengucapkan: \u0027Subhan-Allahi wa bihamdihi (Allah bebas dari ketidaksempurnaan dan segala puji bagi-Nya)\u0027 seratus kali sehari, dosa-dosanya akan dihapuskan meskipun sebesar buih lautan.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"1411","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي أيوب الأنصاري رضي الله عنه عن النبي صلى الله عليه وسلم قال‏:‏ ‏ \"‏من قال لا إله إلا الله وحده لا شريك له، له الملك وله الحمد، وهو على كل شيء قدير، عشر مرات، كان كمن أعتق أربعة أنفس من ولد إسماعيل‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Prophet (ﷺ) said: \"He who utters ten times: \u0027La ilaha illallahu, wahdahu la sharika lahu, lahulmulku wa lahulhamdu, wa Huwa \u0027ala kulli sha\u0027in Qadir (there is no true god except Allah. He is One and He has no partner with Him. His is the sovereignty and His is the praise, and He is Omnipotent),\u0027 he will have a reward equal to that for freeing four slaves from the progeny of Prophet Isma\u0027il.\" [Al- Bukhari and Muslim].","language":"english"},{"text":"Nabi (ﷺ) berkata: \"Barang siapa yang mengucapkan sepuluh kali: \u0027La ilaha illallahu, wahdahu la sharika lahu, lahulmulku wa lahulhamdu, wa Huwa \u0027ala kulli sha\u0027in Qadir (tidak ada Tuhan yang benar selain Allah. Dia adalah Satu dan Dia tidak memiliki sekutu bagi-Nya. Bagi-Nya kekuasaan dan puji-pujian, dan Dia Mahakuasa),\u0027 dia akan mendapatkan pahala yang setara dengan membebaskan empat budak dari keturunan Nabi Ismail. [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Ayyub Al-Ansari (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Ayyub Al-Ansari radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"1412","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي ذر رضي الله عنه قال‏:‏ قال لي رسول صلى الله عليه وسلم‏:‏ ‏ \"‏ألا أخبرك بأحب الكلام إلى الله‏؟‏ إن أحب الكلام إلى الله‏:‏ سبحان الله وبحمده‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said to me, \"Shall I tell you the expression that is most loved by Allah?\" It is \u0027Subhan-Allahi wa bihamdihi\u0027 (Allah is free from imperfection and His is the praise)\u0027.\" [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata kepadaku, \"Maukah aku memberitahumu ungkapan yang paling dicintai oleh Allah?\" Ini adalah \u0027Subhan-Allahi wa bihamdihi\u0027 (Allah bebas dari ketidaksempurnaan dan bagi-Nya pujian)\u0027.\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Dharr (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Dzar radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"1413","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي مالك الأشعري رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏ \"‏الطهور شطر الإيمان، والحمد لله تملأ الميزان، وسبحان الله، والحمد لله تملآن -أو تملأ- ما بين السماوات والأرض‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said: \"Purity is half of iman (faith). ‘Al-hamdu lillah (all praise and gratitude belong to Allah)’ fills the scales, and ‘subhan-Allah (how far is Allah from every imperfection) and ‘Al-hamdulillah (all praise and gratitude belong to Allah)’ fill that which is between heaven and earth.\" [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata: \"Kesucian adalah setengah dari iman (iman). \u0027Al-hamdu lillah (segala puji dan syukur milik Allah)\u0027 mengisi timbangan, dan \u0027subhan-Allah (seberapa jauh Allah dari setiap ketidaksempurnaan) dan \u0027Al-hamdulillah (segala puji dan syukur milik Allah)\u0027 mengisi apa yang ada di antara langit dan bumi.\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Malik Al-Ash\u0027ari (may Allah be pleased with him) reported:","language":"english"},{"text":"Abu Malik Al-Asy\u0027ari (ra dengan dia) melaporkan:","language":"bahasa"}]},{"index":"1414","hadith_id":"riyadussalihin","text":[{"text":"وعن سعد بن أبي وقاص رضي الله عنه قال‏:‏ جاء أعرابي إلى رسول الله صلى الله عليه وسلم فقال‏:‏ علمني كلامًا أقوله‏.‏ قال‏:‏ ‏\"‏قل لا إله إلا الله وحده لا شريك له، الله أكبر كبيرا والحمد لله كثيرا وسبحان الله رب العالمين، ولا حول ولا قوة إلا بالله العزيز الحكيم” قال فهؤلاء لربي، فما لي‏؟‏ قال‏:‏ ‏\"‏قل اللهم اغفر لي، وارحمني، واهدني، وارزقني‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"A bedouin came to the Messenger of Allah (ﷺ) and said to him, \"Teach me a few words to recite frequently.\" He (ﷺ) said, \"Say: \"La ilaha illallahu wahdahu la sharika lahu; Allahu Akbar kabiran, wal-hamdu lillahi kathiran, wa subhan-Allahi Rabbil-\u0027alamin; wa la hawla wa la quwwata illa billahil-\u0027Azizil-Hakim (there is no true god except Allah the One and He has no partner with Him; Allah is the Greatest and greatness is for Him. All praise is due to Him. Allah, the Rubb of the worlds is free from imperfection; there is no might and power but that of Allah, the All-Powerful and the All-Wise.)\"\u0027 The bedouin said: \"All of these for my Rubb. But what is for me?\" Thereupon he (Messenger of Allah (ﷺ)) said, \"You should say: \u0027Allahummaghfir li, warhamni, wahdini, warzuqni (O Allah! Grant me pardon, have mercy upon me, direct me to righteousness and provide me subsistence)\u0027.\" [Muslim].","language":"english"},{"text":"Seorang Badui datang kepada Rasulullah (ﷺ) dan berkata kepadanya, \"Ajari aku beberapa kata untuk sering dibaca.\" Dia (ﷺ) berkata, “Katakanlah: “La ilaha illallahu wahdahu la sharika lahu; Allahu Akbar kabiran, wal-hamdu lillahi kathiran, wa subhan-Allahi Rabbil-\u0027alamin; wa la hawla wa la quwwata illa billahil-\u0027Azizil-Hakim (Tidak ada Tuhan yang benar selain Allah Yang Esa dan tidak ada sekutu bagi-Nya; Allah Maha Besar dan Maha Besar bagi-Nya. Segala puji bagi-Nya. Allah, Rubb dunia bebas dari ketidaksempurnaan; tidak ada daya dan kekuatan selain dari Allah, Yang Mahakuasa dan Maha Bijaksana.)\"\u0027 Orang Badui itu berkata: \"Semua ini untuk Rubb saya. Tapi apa untukku?\" Kemudian dia (Rasulullah (ﷺ)) berkata, \"Kamu harus mengatakan: \u0027Allahummaghfir li, warhamni, wahdini, warzuqni (Ya Allah! [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Sa\u0027d bin Abu Waqqas (May Allah be pleased with him) reported:","language":"english"},{"text":"Sa\u0027d bin Abu Waqqas radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"1415","hadith_id":"riyadussalihin","text":[{"text":"وعن ثوبان رضي الله عنه قال‏:‏ كان رسول الله صلى الله عليه وسلم‏:‏ إذا انصرف من صلاته استغفر ثلاثا ، وقال ‏:‏ ‏ \"‏ اللهم أنت السلام ومنك السلام تباركت يا ذا الجلال والإكرام “ قيل للأوزاعي ، وهو أحد رواة الحديث ‏:‏ كيف الاستغفار ‏؟‏ قال ‏:‏ يقول ‏:‏ أستغفر الله أستغفر الله ‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"Whenever the Messenger of Allah (ﷺ) concluded his prayer, he would beg forgiveness from Allah thrice and then would recite: \"Allahumma Antas- Salamu, wa minkas-salamu, tabarakta ya Dhal-Jalali wal-Ikram (O Allah, You are the Grantor of security, and security comes from You. You are Blessing, O You Who have majesty and nobility)!\" (Imam) Al-Awza\u0027i, one of the narrators of this Hadith, was asked: \"How forgiveness is to be sought?\" He answered: \"The Messenger of Allah (ﷺ) used to say: \u0027Astaghfirullah! Astaghfirullah! (I beseech Allah for forgiveness, I beseech Allah for forgiveness)\u0027.\" [Muslim].","language":"english"},{"text":"Setiap kali Rasulullah (ﷺ) mengakhiri doanya, dia akan memohon ampun kepada Allah tiga kali dan kemudian membaca: “Allahumma Antas-Salamu, wa minkas-salamu, tabarakta ya Dhal-Jalali wal-Ikram (Ya Allah, Engkau adalah Tuhan). Pemberi rasa aman, dan rasa aman itu datangnya dari-Mu. Engkau Maha Berkah, wahai Engkau yang memiliki keagungan dan kemuliaan)!\" (Imam) Al-Awza\u0027i, salah satu perawi hadis ini, ditanya: \"Bagaimana pengampunan harus dicari?\" Dia menjawab: \"Rasulullah (ﷺ) biasa berkata: \u0027Astaghfirullah! Astaghfirullah! (Aku memohon ampun kepada Allah, aku memohon ampun kepada Allah)\u0027.\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Thauban (May Allah be pleased with him) reported:","language":"english"},{"text":"Thauban (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"1416","hadith_id":"riyadussalihin","text":[{"text":"وعن المغيرة بن شعبة رضي الله عنه أن رسول الله صلى الله عليه وسلم، كان إذا فرغ من الصلاة وسلم قال ‏:‏ ‏ \"‏لا إله إلا الله وحده لا شريك له، له الملك وله الحمد، وهو على كل شيء قدير‏.‏ اللهم لا مانع لما أعطيت، ولا معطي لما منعت، ولا ينفع ذا الجد منك الجد‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"Messenger of Allah (ﷺ) used to say at the conclusion of prayer: \"La ilaha illallahu wahdahu la sharika lahu, lahul-mulku, wa lahul-hamdu, wa Huwa \u0027ala kulli shai\u0027in Qadir. Allahumma la mani\u0027a lima a\u0027tayta, wa la mu\u0027tiya lima mana\u0027ta, wa la yanfa\u0027u dhal-jaddi, minkal-jaddu (there is no true god except Allah. He is One and He has no partner with Him, His is the sovereignty and His is the praise, and He is Omnipotent. O Allah! None can deny that which You bestow and none can bestow that which You hold back; and the greatness of the great will be of no avail to them against You).\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) biasa mengatakan pada akhir doa: \"La ilaha illallahu wahdahu la sharika lahu, lahul-mulku, wa lahul-hamdu, wa Huwa \u0027ala kulli shai\u0027in Qadir. Allahumma la mani\u0027a lima a \u0027tayta, wa la mu\u0027tiya lima mana\u0027ta, wa la yanfa\u0027u dhal-jaddi, minkal-jaddu (tiada Tuhan yang benar selain Allah. Dia Esa dan tidak ada sekutu bagi-Nya. Bagi-Nya segala puji, dan Dia Mahakuasa. Ya Allah! Tidak ada yang dapat mengingkari apa yang Engkau anugerahkan dan tidak ada yang dapat melimpahkan apa yang Engkau tahan; dan keagungan yang agung tidak berguna bagi mereka terhadap-Mu).\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Al-Mughirah bin Shu\u0027bah (May Allah be pleased with him) reported:","language":"english"},{"text":"Al-Mughirah bin Shu\u0027bah (ra dengan dia) melaporkan:","language":"bahasa"}]},{"index":"1417","hadith_id":"riyadussalihin","text":[{"text":"وعن عبد الله ابن الزبير رضي الله عنهما أنه كان يقول دبر كل صلاة، حين يسلم‏:‏ لا إله إلا الله وحده لا شريك له ، له الملك وله الحمد ، وهو على كل شيء قدير ‏.‏ لا حول ولا قوة إلا بالله ،لا إله إلا الله، ولا نعبد إلا إياه، له النعمة، وله الفضل وله الثناء الحسن‏.‏ لا إله إلا الله مخلصين له الدين ولو كره الكافرون ‏.‏ قال ابن الزبير‏:‏ وكان رسول الله صلى الله عليه وسلم، يهلل بهن دبر كل صلاة‏.‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"\"La ilaha illallahu wahdahu la sharika lahu, lahul- mulku, wa lahul-hamdu, wa Huwa \u0027ala kulli shai\u0027in Qadir. La hawla wa la quwwata illa billah. La ilaha illallahu, wa la na\u0027budu illa iyyahu, Lahun-ni\u0027matu, wa lahul-fadlu, wa lahuth-thana\u0027ul-hasan. La ilaha ilallahu, mukhlisina, lahud-dina, wa lau karihal-kafirun (there is no true god except Allah; He is One. To Him belongs the dominion and to Him is all praise, and He is Powerful over all things. There is no power and might except with (the help of) Allah. There is no God but Allah and we worship none except Him, to Him belongs the bounty and to Him belongs the grace, and to Him belongs all excellent praise; there is no deity but Allah. We reserve our devotion exclusively for Him though the disbelievers may detest it).\" Ibn Az-Zubair said: The Messenger of Allah (ﷺ) used to celebrate Allah\u0027s Greatness in those terms after every Salat (prayer). [Muslim].","language":"english"},{"text":"La ilaha illallahu wahdahu la sharika lahu, lahul-mulku, wa lahul-hamdu, wa Huwa \u0027ala kulli shai\u0027in Qadir. La hawla wa la quwwata illa billah. La ilaha illallahu, wa la na\u0027budu illa iyyahu, Lahun- ni\u0027matu, wa lahul-fadlu, wa lahuth-thana\u0027ul-hasan. La ilaha ilallahu, mukhlisina, lahud-dina, wa lau karihal-kafirun (tidak ada Tuhan yang benar selain Allah, Dia Maha Esa. kekuasaan dan bagi-Nya segala puji, dan Dia Mahakuasa atas segala sesuatu. Tidak ada daya dan kekuatan kecuali dengan (pertolongan) Allah. Tidak ada Tuhan selain Allah dan kami tidak menyembah selain Dia, kepunyaan-Nya karunia dan kepunyaan-Nya rahmat, dan kepunyaan-Nya segala puji-pujian yang sangat baik; tidak ada Tuhan selain Allah. Kami mengabdikan pengabdian kami hanya untuk-Nya meskipun orang-orang kafir mungkin membencinya).” Ibnu Az-Zubair berkata: [Muslim] .","language":"bahasa"}],"narrated":[{"text":"It has been reported that \u0027Abdullah bin Zubair (May Allah be pleased with them) used to recite after Taslim at the conclusion of every Salat (prayer):","language":"english"},{"text":"Telah dilaporkan bahwa \u0027Abdullah bin Zubair (Semoga Allah meridhoi mereka) biasa membaca setelah Taslim di setiap akhir salat:","language":"bahasa"}]},{"index":"1418","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي هريرة رضي الله عنه أن فقراء المهاجرين أتوا رسول الله صلى الله عليه وسلم فقالوا‏:‏ ‏\"‏ذهب أهل الدثور بالدرجات العلى، والنعيم المقيم‏:‏ يصلون كما نصلي، ويصومون كما نصوم، ولهم فضل من أموال‏:‏ يحجون، ويعتمرون، ويجاهدون، ويتصدقون‏.‏ فقال‏:‏ ‏\"‏ألا أعلمكم شيئًا تدركون به من سبقكم، وتسبقون به من بعدكم، ولا يكون أحد أفضل منكم إلا من صنع مثل ما صنعتم‏؟‏ قالوا‏:‏ بلى يا رسول الله، قال‏:‏ ‏\"‏تسبحون، وتحمدون، وتكبرون، خلف كل صلاة ثلاثًا وثلاثين قال أبو صالح الراوي عن أبي هريرة، لما سئل عن كيفية ذكرهن، قال‏:‏ يقول‏:‏ سبحان الله، والحمد لله، والله أكبر، حتى يكون منهن كلهن ثلاثًا وثلاثين‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏ وزاد مسلم في روايته‏:‏ فرجع فقراء المهاجرين إلى رسول الله صلى الله عليه وسلم، فقالوا‏:‏ سمع إخواننا أهل الأموال بما فعلنا، وفعلوا مثله‏؟‏ فقال رسول الله‏:‏ ‏\"‏ذلك فضل الله يؤتيه من يشاء‏\"‏‏.‏ ((الدثور))جمع دثر- بفتح الدال و اسكان الثاء المثلثة- و هو: المال الكثير.","language":"arabic"},{"text":"The poor Emigrants came to the Messenger of Allah (ﷺ) and said: \"The wealthy have gone with the highest ranks and lasting bliss.\" He asked: \"How is that?\" They replied: \"They offer Salat (prayer) as we offer it; they observe fast as we do; (and as they are wealthy) they perform Hajj and \u0027Umrah, and go for Jihad, and they spend in charity but we cannot, and they free the slaves but we are unable to do so.\" The Messenger of Allah (ﷺ) said, \"Shall I not teach you something with which you may overtake those who surpassed you and with which you will surpass those who will come after you? None will excel you unless he who does which you do.\" They said: \"Yes, please do, O Messenger of Allah\" He (ﷺ) said, \"You should recite: Tasbih (Allah is free from imperfection), Takbir (Allah is Greatest), Tahmid (Praise be to Allah) thirty-three times after each Salat.\" [Al-Bukhari and Muslim]. Abu Salih, the subnarrator of the Hadith said, when Abu Hurairah (May Allah be pleased with him) was asked about the manner of reciting Tasbih, Tahmid and Takbir, he said, \"Recite: \"Subhan-Allah, wal-hamdulillah, wallahu Akbar\u0027, till all are recited thirty-three times.","language":"english"},{"text":"Muhajirin yang miskin datang kepada Rasulullah (ﷺ) dan berkata: \"Orang kaya telah pergi dengan peringkat tertinggi dan kebahagiaan abadi.\" Dia bertanya: \"Bagaimana itu?\" Mereka menjawab: “Mereka salat seperti yang kami lakukan; mereka berpuasa seperti yang kami lakukan; (dan karena mereka kaya) mereka menunaikan haji dan umrah, dan pergi berjihad, dan mereka menafkahkan sedekah tetapi kami tidak bisa, dan mereka membebaskan budak tetapi kami tidak dapat melakukannya.\" Rasulullah (ﷺ) berkata, \"Maukah aku mengajarimu sesuatu yang dengannya kamu dapat menyusul orang-orang yang melampaui kamu dan dengan itu kamu akan melampaui orang-orang yang akan datang setelah kamu? Tidak ada yang akan melebihi kamu kecuali dia yang melakukan apa yang kamu lakukan. \" Mereka berkata: \"Ya, tolong lakukan, ya Rasulullah\" Dia (ﷺ) berkata, \"Kamu harus membaca: Tasbih (Allah bebas dari ketidaksempurnaan), [Al-Bukhari dan Muslim] . Abu Shalih, subnarator hadis berkata, ketika Abu Hurairah (ra dengan dia) ditanya tentang tata cara membaca Tasbih, Tahmid dan Takbir, dia berkata, \"Bacalah: \"Subhan-Allah, wal-hamdulillah, wallahu Akbar\u0027, sampai semuanya dibacakan tiga puluh tiga kali.","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"1419","hadith_id":"riyadussalihin","text":[{"text":"وعنه عن رسول الله صلى الله عليه وسلم قال‏:‏ ‏\"‏من سبح الله في دبر كل صلاة ثلاثًا وثلاثين، وحمد الله ثلاثًا وثلاثين، وكبر الله ثلاثًا وثلاثين، وقال تمام المائة‏:‏ لا إله إلا الله وحده لا شريك له، له الملك وله الحمد، وهو على كل شيء قدير، غفرت خطاياه وإن كانت مثل زبد البحر” ‏(‏‏(‏رواه مسلم‏)‏‏)‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"He who recites after every prayer: Subhan-Allah (Allah is free from imperfection) thirty-three times; Al-hamdu lillah (praise be to Allah) thirty-three times; Allahu Akbar (Allah is Greatest) thirty-three times; and completes the hundred with: La ilaha illallahu, wahdahu la sharika lahu, lahul-mulku wa lahul-hamdu, wa Huwa \u0027ala kulli shai\u0027in Qadir (there is no true god except Allah. He is One and He has no partner with Him. His is the sovereignty and His is the praise, and He is Omnipotent), will have all his sins pardoned even if they may be as large as the foam on the surface of the sea.\" [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Barangsiapa membaca setelah setiap doa: Subhan-Allah (Allah bebas dari ketidaksempurnaan) tiga puluh tiga kali; Al-hamdu lillah (segala puji bagi Allah) tiga puluh tiga kali; Allahu Akbar ( Allah Maha Besar) tiga puluh tiga kali, dan melengkapi seratus dengan: La ilaha illallahu, wahdahu la sharika lahu, lahul-mulku wa lahul-hamdu, wa Huwa \u0027ala kulli shai\u0027in Qadir (tidak ada Tuhan yang benar selain Allah. Dia Maha Esa dan tidak ada sekutu bagi-Nya, milik-Nya kekuasaan dan puji-pujian, dan Dia Mahakuasa), diampuni segala dosanya meskipun sebesar buih di permukaan laut. \" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"1420","hadith_id":"riyadussalihin","text":[{"text":"وعن كعب بن عجرة رضي الله عنه عن رسول الله صلى الله عليه وسلم قال‏:‏ ‏ \"‏معقبات لا يخيب قائلهن -أو فاعلهن- دبر كل صلاة مكتوبة‏:‏ ثلاثًا وثلاثين تسبيحة وثلاثًا وثلاثين تحميدة، وأربعًا وثلاثين تكبيرة‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"There are some words, the reciters of which will never be disappointed. These are: Tasbih [saying \u0027Subhan-Allah\u0027 (Allah is free from imperfection)], thirty-three times, Tahmid [saying \u0027Al-hamdu lillah\u0027 (praise be to Allah)] thirty-three times and Takbir [saying \u0027Allahu Akbar\u0027 (Allah is Greatest)] thirty-four times; and these should be recited after the conclusion of every prescribed prayer.\" [Muslim]","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, “Ada beberapa kalimat yang tidak akan pernah dikecewakan oleh para pembacanya, yaitu: Tasbih [mengucapkan \u0027Subhan-Allah\u0027 (Allah bebas dari ketidaksempurnaan)] , tiga puluh tiga kali, Tahmid [mengucapkan \u0027Al-hamdu lillah\u0027 (segala puji bagi Allah)] tiga puluh tiga kali dan takbir [mengucapkan \u0027Allahu Akbar\u0027 (Allah Maha Besar)] tiga puluh empat kali; dan ini harus dibaca setelah akhir dari setiap doa yang ditentukan .\" [Muslim]","language":"bahasa"}],"narrated":[{"text":"Ka\u0027b bin \u0027Ujrah (May Allah be pleased with him) reported:","language":"english"},{"text":"Ka\u0027b bin \u0027Ujrah (ra dengan dia) melaporkan:","language":"bahasa"}]},{"index":"1421","hadith_id":"riyadussalihin","text":[{"text":"وعن سعد بن أبي وقاص رضي الله عنه أن رسول الله صلى الله عليه وسلم كان يتعوذ دبر الصلوات بهؤلاء الكلمات‏:‏ ‏\"‏اللهم إني أعوذ بك من الجبن والبخل، وأعوذ بك من أن أرد إلى أرذل العمر وأعوذ بك من فتنة الدنيا، وأعوذ بك من فتنة القبر” ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) used to seek (Allah\u0027s) protection after prayers in these words: \"Alla-humma inni a\u0027udhu bika minal-jubni wal- bukhl, wa a\u0027udhu bika min an uradda ila ardhalil-\u0027umur, wa a\u0027udhu bika min fitnatid-dunya, wa a\u0027udhu bika min fitnatil-qabr (O Allah, I seek refuge with You from cowardice, miserliness and from being sent back to a feeble age; and, seek refuge with You from the trials of this life and those of the grave).\" [Al- Bukhari].","language":"english"},{"text":"Rasulullah (ﷺ) biasa mencari perlindungan (Allah) setelah shalat dengan kata-kata ini: \"Alla-humma inni a\u0027udhu bika minal-jubni wal-bukhl, wa a\u0027udhu bika min an uradda ila ardhalil-\u0027umur, wa a\u0027udhu bika min fitnatid-dunya, wa a\u0027udhu bika min fitnatil-qabr (Ya Allah, aku berlindung kepada-Mu dari sifat pengecut, kikir, dan dari keterpurukan, dan berlindung kepada-Mu dari cobaan hidup ini dan cobaan kubur). [Al-Bukhari] .","language":"bahasa"}],"narrated":[{"text":"Sa\u0027d bin Abu Waqqas (May Allah be pleased with him) reported:","language":"english"},{"text":"Sa\u0027d bin Abu Waqqas radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"1422","hadith_id":"riyadussalihin","text":[{"text":"وعن معاذ رضي الله عنه أن رسول الله صلى الله عليه وسلم أخذ بيده وقال‏:‏ ‏\"‏يا معاذ والله إني لأحبك‏\"‏ فقال‏:‏ ‏\"‏أوصيك يا معاذ لا تدعن في دبر كل صلاة تقول‏:‏ اللهم أعني على ذكرك، وشكرك، وحسن عبادتك‏\"‏‏.‏ رواه أبو داود بإسناد صحيح‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) took hold of my hand and said, \"O Mu\u0027adh! By Allah I love you, so I advise you to never forget to recite after every prayer: \"Allahumma a\u0027inni ala dhikrika, wa shukrika, wa husni \u0027ibadatika (O Allah, help me remember You, to be grateful to You, and to worship You in an excellent manner).\" [Abu Dawud].","language":"english"},{"text":"Rasulullah (ﷺ) memegang tangan saya dan berkata, \"Wahai Mu\u0027adz! Demi Allah aku mencintaimu, jadi saya menyarankan Anda untuk tidak pernah lupa membaca setelah setiap doa: \"Allahumma a\u0027inni ala dzikrika, wa shukrika , wa husni \u0027ibadatika (Ya Allah, bantulah aku mengingat-Mu, bersyukur kepada-Mu, dan beribadah kepada-Mu dengan baik).\" [Abu Dawud] .","language":"bahasa"}],"narrated":[{"text":"Mu\u0027adh (May Allah be pleased with him) reported:","language":"english"},{"text":"Mu\u0027adz (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"1423","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏ \"‏إذا تشهد أحدكم فليستعذ بالله من أربع، يقول‏:‏ اللهم إني أعوذ بك من عذاب جهنم، ومن عذاب القبر ومن فتنة المحيا والممات، ومن شر فتنة المسيح الدجال‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"When anyone of you has done his Tashahhud during Salat (prayer), he should seek refuge in Allah against four things and say: \"Allahumma inni a\u0027udhu bika min \u0027adhabi jahannam, wa min \u0027adhabil-qabr, wa min fitnatil-mahya wal-mamat, wa min sharri fitnatil-masihid-dajjal (O Allah! I seek refuge in You from the torment of Hell, from the torment of the grave, from the trials of life and death, and from the mischief of Al-Masih Ad-Dajjal (Antichrist).\" [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, “Barang siapa di antara kalian yang telah melakukan tasyahudnya saat shalat, dia harus berlindung kepada Allah dari empat hal dan mengatakan: “Allahumma inni a\u0027udhu bika min \u0027adhabi jahannam, wa min. \u0027adhabil-qabr, wa min fitnatil-mahya wal-mamat, wa min sharri fitnatil-masihid-dajjal (Ya Allah! Aku berlindung kepada-Mu dari siksa neraka, dari siksa kubur, dari cobaan hidup dan kematian, dan dari kerusakan Al-Masih Ad-Dajjal (Dajjal).” [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"1424","hadith_id":"riyadussalihin","text":[{"text":"وعن علي رضي الله عنه قال‏:‏ كان رسول الله صلى الله عليه وسلم إذا قام إلى الصلاة يكون من آخر ما يقول بين التشهد والتسليم‏:‏ ‏ \"‏اللهم اغفر لي ما قدمت وما أخرت، وما أسررت وما أعلنت، وما أسرفت، وما أنت أعلم به مني، أنت المقدم، وأنت المؤخر، لا إله إلا أنت‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"When the Messenger of Allah (ﷺ) was in Salat (prayer), he used to supplicate towards the end of prayer after Tashahhud and before the concluding salutations: \"Allahum-maghfir li ma qaddamtu wa ma akh-khartu, wa ma asrartu, wa ma a\u0027lantu, wa ma asraftu, wa ma Anta a\u0027lamu bihi minni. Antal-Muqqadimu, wa Antal-Mu\u0027akh-khiru. La ilaha illa Anta (O Allah! Forgive my former and latter sins, which I have done secretly and those which I have done openly, and that I have wronged others, and those defaults of mine about which You have better knowledge than I have. You Alone can send whomever You will to Jannah, and You Alone can send whomever You will to Hell-fire. None has the right to be worshipped but You.\" [Muslim].","language":"english"},{"text":"Ketika Rasulullah (ﷺ) dalam shalat, ia biasa berdoa menjelang akhir shalat setelah Tasyahhud dan sebelum salam penutup: \"Allahum-maghfir li ma qaddamtu wa ma akh-khartu, wa ma asrartu, wa ma a\u0027lantu, wa ma asraftu, wa ma Anta a\u0027lamu bihi minni. Antal-Muqqadimu, wa Antal-Mu\u0027akh-khiru. La ilaha illa Anta. sembunyi-sembunyi dan yang telah saya lakukan secara terang-terangan, dan bahwa saya telah menganiaya orang lain, dan kesalahan-kesalahan saya yang tentangnya Engkau lebih mengetahui dari pada saya. Hanya Engkau yang dapat mengirim siapa pun yang Anda kehendaki ke Jannah, dan Anda Sendiri yang dapat mengirim siapa pun yang Anda kehendaki. Api neraka. Tidak ada yang berhak disembah selain Engkau.” [Muslim] .","language":"bahasa"}],"narrated":[{"text":"\u0027Ali (May Allah be pleased with him) reported:","language":"english"},{"text":"\u0027Ali (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"1425","hadith_id":"riyadussalihin","text":[{"text":"وعن عائشة رضي الله عنه قالت‏:‏ كان النبي صلى الله عليه وسلم يكثر أن يقول في ركوعه وسجوده‏:‏ سبحانك اللهم ربنا وبحمدك، اللهم اغفر لي‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Prophet (ﷺ) used to recite frequently in his bowing and prostration: \"Subhanak- Allahumma, Rabbana wa bihamdika. Allahum-maghfir li (O Allah! You are free from imperfection and I begin with praising You. Forgive my sins).\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Nabi (ﷺ) sering membaca dalam rukuk dan sujudnya: \"Subhanak-Allahumma, Rabbana wa bihamdika. Allahum-maghfir li (Ya Allah! Engkau bebas dari ketidaksempurnaan dan aku mulai dengan memuji-Mu. Ampunilah dosa-dosaku).\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"\u0027Aishah (May Allah be pleased with her) reported:","language":"english"},{"text":"\u0027Aisyah r.a. melaporkan:","language":"bahasa"}]},{"index":"1426","hadith_id":"riyadussalihin","text":[{"text":"وعنها أن رسول الله صلى الله عليه وسلم كان يقول في ركوعه وسجوده‏:‏ ‏ \"‏سبوح قدوس رب الملائكة والروح‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) used to recite in his bowing and prostration: \"Subbuhun Quddusun, Rabbul-mala\u0027ikati war-ruh [You are the Most Glorious. The Most Holy. You the Rubb of the angels and of Jibril [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) biasa membaca dalam rukuk dan sujudnya: \"Subbuhun Quddusun, Rabbul-mala\u0027ikati war-ruh [ Engkau Maha Mulia. Maha Suci. ] .","language":"bahasa"}],"narrated":[{"text":"\u0027Aishah (May Allah be pleased with her) reported:","language":"english"},{"text":"\u0027Aisyah r.a. melaporkan:","language":"bahasa"}]},{"index":"1427","hadith_id":"riyadussalihin","text":[{"text":"وعن ابن عباس رضي الله عنهما أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏ \"‏ فأما الركوع فعظموا فيه الرب، وأما السجود فاجتهدوا في الدعاء، فقمن أن يستجاب لكم‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said: \"Glorify your Lord in Ruku\u0027 (bowing posture) and exert yourself in supplication in prostration. Thus your supplications are liable to be accepted.\" [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata: \"Maha Suci Tuhanmu dalam Ruku\u0027 (postur ruku\u0027 (postur membungkuk) dan mengerahkan diri dalam permohonan dalam sujud. Dengan demikian permohonan Anda dapat diterima.\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Ibn \u0027Abbas (May Allah be pleased with them) reported:","language":"english"},{"text":"Ibn \u0027Abbas (semoga Allah meridhoi mereka) melaporkan:","language":"bahasa"}]},{"index":"1428","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏ \"‏أقرب ما يكون العبد من ربه وهو ساجد، فأكثروا الدعاء‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"A slave becomes nearest to his Rubb when he is in prostration. So increase supplications while prostrating.\" [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Seorang hamba menjadi paling dekat dengan Rubinya ketika dia sedang sujud. Maka perbanyaklah doa saat sujud.\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"1429","hadith_id":"riyadussalihin","text":[{"text":"وعنه أن رسول الله صلى الله عليه وسلم كان يقول في سجوده‏:‏ “اللهم اغفر لي ذنبي كله دقه وجله، وأوله وآخره، وعلانيته وسره‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) used to say in his prostration: Allahum-maghfir li dhanbi kullahu: diqqahu wa jillahu, wa \u0027awwalahu wa akhirahu, wa alaniyatahu wa sirrahu (O Allah! Forgive all my sins, the small and the great, first and the last, the open and the secret).\" [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) biasa mengatakan dalam sujudnya: Allahum-maghfir li dhanbi kullahu: diqqahu wa jillahu, wa \u0027awwalahu wa akhirahu, wa alaniyatahu wa sirrahu (Ya Allah! Ampunilah semua dosaku, kecil dan besar, pertama dan terakhir, terbuka dan rahasia).” [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"1430","hadith_id":"riyadussalihin","text":[{"text":"وعن عائشة رضي الله عنها قالت‏:‏ افتقدت النبي صلى الله عليه وسلم ذات ليلة فتحسست، فإذا هو راكع‏.‏-أو ساجد- يقول‏:‏ ‏\"‏سبحانك وبحمدك لا إله إلا أنت‏\"‏ ، وفي رواية‏:‏ فوقعت يدي على بطن قدميه، وهو في المسجد، وهما منصوبتان، وهو يقول‏:‏ ‏\"‏اللهم إني أعوذ برضاك من سخطك، وبمعافاتك من عقوبتك، وأعوذ بك منك، لا أحصي ثناء عليك أنت كما أثنيت على نفسك‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"One night I missed the Messenger of Allah (ﷺ) from his bed. I searched for him. When I found him he was in bowing or prostrating posture and was reciting: Subhanaka wa bi hamdika. La ilaha illa Anta (You are free from imperfection and I begin praising You. There is no true god except You).\" Another narration is: My hand fell over his feet while he was in prostration with his feet erect. He was supplicating: \"Allahumma inni a\u0027udhu biridaka min sakhatika, wa bi-mu\u0027afatika min \u0027uqubatika, wa a\u0027udhu bika minka, la uhsi thana\u0027an \u0027alaika, Anta kama athnaita \u0027ala Nafsika (O Allah! I seek protection against Your Wrath in Your Pleasure. I seek protection in Your Pardon against Your chastisement, I am not capable of enumerating praise of You. You are as You have lauded Yourself).\"","language":"english"},{"text":"Suatu malam aku merindukan Rasulullah (ﷺ) dari tempat tidurnya. Aku mencari dia. Ketika saya menemukannya dia dalam posisi rukuk atau sujud dan sedang membaca: Subhanaka wa bi hamdika. La ilaha illa Anta (Engkau bebas dari ketidaksempurnaan dan aku mulai memuji-Mu. Tidak ada Tuhan yang benar kecuali Engkau).” Riwayat lainnya adalah: Tanganku jatuh di atas kakinya ketika dia sedang sujud dengan kakinya tegak. Dia berdoa: Allahumma inni a\u0027udhu biridaka min sakhatika, wa bi-mu\u0027afatika min \u0027uqubatika, wa a\u0027udhu bika minka, la uhsi thana\u0027an \u0027alaika, Anta kama athnaita \u0027ala Nafsika (Ya Allah! Murka dalam keridhaan-Mu, aku memohon perlindungan dengan ampunan-Mu dari azab-Mu, aku tidak mampu menyebut-nyebut puji-pujian kepada-Mu.","language":"bahasa"}],"narrated":[{"text":"\u0027Aishah (May Allah be pleased with her) reported:","language":"english"},{"text":"\u0027Aisyah r.a. melaporkan:","language":"bahasa"}]},{"index":"1431","hadith_id":"riyadussalihin","text":[{"text":"وعن سعد بن أبي وقاص رضي الله عنه قال‏:‏ كنا عند رسول الله صلى الله عليه وسلم فقال‏:‏ ‏\"‏أيعجز أحدكم أن يكسب في كل يوم ألف حسنة‏!‏‏\"‏ فسأله سائل من جلسائه‏:‏ كيف يكسب ألف حسنة‏؟‏ قال‏:‏ ‏\"‏يسبح مائة تسبيحة، فيكتب له ألف حسنة، أو يحط عنه ألف خطيئة‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏. قال الحميدي: كذا هو في كتاب مسلم : ((او يحط)) قال البرقاني: ورواه شعبة و ابو عوانة و يحيى القطان عن موسى الذي رواه مسلم من جهته فقالوا:((و يحط)) بغير الف.","language":"arabic"},{"text":"We were with the Messenger of Allah (ﷺ) when he asked, \"Is anyone of you unable to earn a thousand good deeds?\" One of those present asked: \"How can one earn thousand good deeds in a day?\" He (ﷺ) replied, \"By saying: Subhan Allah a hundred times, then one thousand good deeds will be recorded for him or one thousand sins will be blotted out from his record.\" [Muslim].","language":"english"},{"text":"Kami bersama Rasulullah (ﷺ) ketika dia bertanya, \"Apakah ada di antara kalian yang tidak mampu mengerjakan seribu kebaikan?\" Salah satu yang hadir bertanya: \"Bagaimana seseorang bisa mendapatkan ribuan perbuatan baik dalam sehari?\" Dia (ﷺ) menjawab, \"Dengan mengatakan: Subhanallah seratus kali, maka seribu kebaikan akan dicatat baginya atau seribu dosa akan dihapus dari catatannya.\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Sa\u0027d bin Abu Waqqas (May Allah be pleased with him) reported:","language":"english"},{"text":"Sa\u0027d bin Abu Waqqas radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"1432","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي ذر رضي الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ “يصبح على كل سلامى من أحدكم صدقة‏:‏ فكل تسبيحة صدقة، وكل تحميدة صدقة، وكل تهليلة صدقة، وكل تكبيرة صدقة، وأمر بالمعروف صدقة، ونهي عن المنكر صدقة، ويجزي من ذلك ركعتان يركعهما من الضحى‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"Every morning charity is due from every joint bone of the body of every one of you. Every utterance of Allah\u0027s Glorification (i.e., Subhan-Allah) is an act of charity, and every utterance of praise of Him (i.e., Al-hamdu lillah) is an act of charity, and every utterance of profession of Faith (i.e., La ilaha illallah) is an act of charity, and every utterance of His Greatness (i.e., Allahu Akbar) is an act of charity; and enjoining good is an act of charity and forbidding what is disreputable is an act of charity; and two Rak\u0027ah prayer which one offers in the forenoon (Ad- Duha) will suffice for all this.\" [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, “Setiap pagi ada zakat dari setiap persendian tubuh kalian masing-masing. Setiap ucapan Kemuliaan Allah (yaitu, Subhan-Allah) adalah amal, dan setiap ucapan pujian kepada-Nya (yaitu, Al-hamdu lillah) adalah tindakan amal, dan setiap ucapan pengakuan Iman (yaitu, La ilaha illallah) adalah tindakan amal, dan setiap ucapan Kebesaran-Nya (yaitu, Allahu Akbar) adalah sedekah, dan menyuruh kebaikan adalah sedekah, dan melarang yang munkar adalah sedekah, dan shalat dua rakaat yang satu di waktu zuhur (Ad-Duha) sudah cukup untuk semua ini.” [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Dharr (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Dzar radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"1433","hadith_id":"riyadussalihin","text":[{"text":"وعن أم المؤمنيين جويرية بنت الحارث رضي الله عنها أن النبي صلى الله عليه وسلم خرج من عندها بكرة حين صلى الصبح وهي في مسجدها، ثم رجع بعد أن أضحي وهي جالسة، فقال‏:‏ ‏\"‏مازلت على الحالة التي فارقت عليها‏؟‏‏\"‏ قالت‏:‏ نعم، فقال النبي صلى الله عليه وسلم‏:‏ ‏\"‏لقد كنت بعدك أربع كلمات ثلاث مرات، لو وزنت بما قلت منذ اليوم لوزنتهن‏:‏ سبحان الله وبحمده عدد خلقه، ورضا نفسه، وزنة عرشه، ومداد كلماته‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏ وفي رواية له‏:‏ سبحان الله عدد خلقه، سبحان الله رضا نفسه، سبحان الله زنة عرشه، سبحان الله مداد كلماته‏\"‏‏.‏ وفي رواية الترمذي‏:‏ ألا أعلمك كلمات تقولينها‏؟‏ سبحان الله عدد خلقه، سبحان الله عدد خلقه، سبحان الله عدد خلقه، سبحان الله رضا نفسه، سبحان الله رضا نفسه، سبحان الله رضا نفسه، سبحان الله زنة عرشه، سبحان الله زنة عرشه، سبحان الله زنة عرشه، سبحان الله مداد كلماته، سبحان الله مداد كلماته، سبحان الله مداد كلماته‏\"‏‏.‏","language":"arabic"},{"text":"The Prophet (ﷺ) came out from my apartment in the morning as I was busy in performing the dawn prayer. He came back in the forenoon and found me sitting there. The Prophet (ﷺ) said, \"Are you still in the same position as I left you.\" I replied in the affirmative. Thereupon the Prophet said, \"I recited four words three times after I had left you. If these are to be weighed against all you have recited since morning, these will be heavier. These are: Subhan-Allahi wa bihamdihi, `adada khalqihi, wa rida nafsihi, wa zinatah `arshihi, wa midada kalimatihi [Allah is free from imperfection and I begin with His praise, as many times as the number of His creatures, in accordance with His Good Pleasure, equal to the weight of His Throne and equal to the ink that may be used in recording the words (for His Praise)].\" [Muslim].","language":"english"},{"text":"Nabi (ﷺ) keluar dari apartemenku di pagi hari saat aku sibuk melakukan sholat subuh. Dia kembali di siang hari dan menemukan saya duduk di sana. Nabi (ﷺ) berkata, \"Apakah Anda masih dalam posisi yang sama seperti saya meninggalkan Anda.\" Saya menjawab dengan tegas. Kemudian Nabi berkata, “Aku membaca empat kata tiga kali setelah aku meninggalkanmu. Jika ini ditimbang dengan semua yang telah kamu baca sejak pagi, ini akan lebih berat. Ini adalah: Subhan-Allahi wa bihamdihi, `adada khalqihi, wa rida nafsihi, wa zinatah `arshihi, wa midada kalimatihi [Allah bebas dari ketidaksempurnaan dan saya mulai dengan pujian-Nya, sebanyak jumlah makhluk-Nya, sesuai dengan Keridhaan-Nya, sama dengan berat Arsy-Nya dan sama dengan tinta yang dapat digunakan dalam mencatat kata-kata (untuk Pujian-Nya)] .\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Juwairiyah bint Al-Harith (May Allah be pleased with her), the Mother of the Believers, reported:","language":"english"},{"text":"Juwairiyah binti Al-Harits (semoga Allah meridhoinya), ibu orang-orang beriman, melaporkan:","language":"bahasa"}]},{"index":"1434","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي موسى الأشعري رضي الله عنه عن النبي صلى الله عليه وسلم، قال‏:‏ ‏\"‏مثل الذي يذكر ربه والذي لا يذكره، مثل الحي والميت‏\"‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏ ورواه مسلم فقال‏:‏ ‏\"‏مثل البيت الذي يذكر الله فيه، والبيت الذي لا يذكر الله فيه، مثل الحي والميت‏\"‏‏.‏","language":"arabic"},{"text":"The Prophet (ﷺ) said, \"The similitude of one who remembers his Rubb and one who does not remember Him, is like that of the living and the dead.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Nabi (ﷺ) bersabda, \"Perumpamaan orang yang mengingat Rubb-nya dan orang yang tidak mengingat-Nya, adalah seperti orang yang hidup dan yang mati.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Musa Al-Ash\u0027ari (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Musa Al-Asy\u0027ari r.a. melaporkan:","language":"bahasa"}]},{"index":"1435","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي هريرة، رضي الله عنه، أن رسول الله صلى الله عليه وسلم، قال‏:‏ ‏ \"‏يقول الله تعالى‏:‏ أنا عند ظن عبدي بي، وأنا معه إذا ذكرني، فإن ذكرني في نفسه، ذكرته في نفسي وإن ذكرني في ملإٍ ذكرته في ملإٍ خير منهم‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"Allah the Exalted says: \u0027I am as my slave expects me to be, and I am with him when he remembers Me. If he remembers Me inwardly, I will remember him inwardly, and if he remembers Me in an assembly, I will remember him in a better assembly (i.e., in the assembly of angels).\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Allah Ta\u0027ala berfirman: \u0027Aku seperti yang diharapkan hamba-Ku, dan Aku bersamanya ketika dia mengingat-Ku. Jika dia mengingat-Ku di dalam, Aku akan mengingatnya di dalam, dan jika dia mengingat-Ku dalam majelis, Aku akan mengingatnya dalam majelis yang lebih baik (yaitu, dalam majelis malaikat).” [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"1436","hadith_id":"riyadussalihin","text":[{"text":"وعنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏\"‏سبق المفردون‏\"‏ قالوا‏:‏ وما المفردون يا رسول الله‏؟‏ قال‏:‏ ‏\"‏الذاكرون الله كثيرًا والذكرات‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏ وروي : (( المفردون )) بتشديد الراء وتخفيفها والمشهور الذي قاله الجمهور : التشديد.","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"The Mufarridun have gone ahead.\" He was asked, \"Who are the Mufarridun?\" He (ﷺ) replied, \"Those men and women who frequently celebrate the remembrance of Allah.\" [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Mufarridun telah maju.\" Dia ditanya, \"Siapakah Mufarridun itu?\" Beliau (ﷺ) menjawab, \"Orang-orang yang sering berdzikir dengan mengingat Allah.\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"1437","hadith_id":"riyadussalihin","text":[{"text":"وعن جابر رضي الله عنه قال‏:‏ سمعت رسول الله صلى الله عليه وسلم يقول‏:‏ ‏ \"‏أفضل الذكر‏:‏ لا إله إلا الله‏\"‏‏.‏ رواه الترمذي وقال حديث حسن‏.‏","language":"arabic"},{"text":"I heard the Messenger of Allah (ﷺ) saying, \"The best way to celebrate the remembrance of Allah is to say: La ilaha illallah (there is no true god except Allah).\" [At-Tirmidhi].","language":"english"},{"text":"Saya mendengar Rasulullah (ﷺ) berkata, \"Cara terbaik untuk merayakan mengingat Allah adalah dengan mengatakan: La ilaha illallah (tidak ada Tuhan yang benar selain Allah).\" [At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Jabir (May Allah be pleased with him) reported:","language":"english"},{"text":"Jabir (ra dengan dia) melaporkan:","language":"bahasa"}]},{"index":"1438","hadith_id":"riyadussalihin","text":[{"text":"وعن عبد الله بن بشر رضي الله عنه أن رجلا قال‏:‏ يا رسول الله، إن شرائع الإسلام قد كثرت علي، فأخبرني بشيء أتشبث به قال‏:‏ ‏ \"‏لا يزال لسانك رطبًا من ذكر الله‏\"‏‏.‏ رواه الترمذي وقال حديث حسن‏.‏","language":"arabic"},{"text":"One of the Companions said, \"O Messenger of Allah. There are many injunctions of Islam for me. So tell me something to which I may hold fast.\" He said, \"Keep your tongue wet with the remembrance of Allah.\" [At-Tirmidhi].","language":"english"},{"text":"Salah satu sahabat berkata, \"Ya Rasulullah. Ada banyak perintah Islam bagi saya. Jadi, beri tahu saya sesuatu yang dapat saya pegang teguh.\" Dia berkata, \"Jagalah lidahmu basah dengan mengingat Allah.\" [At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"\u0027Abdullah bin Busr (May Allah be pleased with him) reported:","language":"english"},{"text":"\u0027Abdullah bin Busr (ra dengan dia) melaporkan:","language":"bahasa"}]},{"index":"1439","hadith_id":"riyadussalihin","text":[{"text":"وعن جابر رضي الله عنه، عن النبي صلى الله عليه وسلم قال‏:‏ ‏ \"‏من قال‏:‏ سبحان الله وبحمده، غرست له نخلة في الجنة‏\"‏‏.‏ رواه الترمذي وقال حديث حسن‏.‏","language":"arabic"},{"text":"The Prophet (ﷺ) said, \"For him who says: \u0027Subhan-Allahi wa bi hamdihi (Allah is free from imperfection, and I begin with praising Him, and to Him),\u0027 a palm-tree will be planted in Jannah.\" [At- Tirmidhi].","language":"english"},{"text":"Nabi (ﷺ) berkata, \"Bagi dia yang mengatakan: \u0027Subhan-Allahi wa bi hamdihi (Allah bebas dari ketidaksempurnaan, dan saya mulai dengan memuji-Nya, dan kepada-Nya),\u0027 sebuah pohon palem akan ditanam di Jannah. \" [At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Jabir (May Allah be pleased with him) reported:","language":"english"},{"text":"Jabir (ra dengan dia) melaporkan:","language":"bahasa"}]},{"index":"1440","hadith_id":"riyadussalihin","text":[{"text":"وعن ابن مسعود رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏ \"‏لقيت إبراهيم صلى الله عليه وسلم ليلة أسري بي، فقال‏:‏ يا محمد أقرئ أمتك مني السلام، وأخبرهم أن الجنة طيبة التربة، عذبة الماء، وأنها قيعان، وأن غراسها‏:‏ سبحان الله، والحمد لله، ولا إله إلا الله، والله أكبر‏\"‏‏.‏ رواه الترمذي وقال حديث حسن‏.‏","language":"arabic"},{"text":"Messenger of Allah (ﷺ) said, \"I met Ibrahim (ﷺ) on the Night of Ascension (Al-Asra), and he said to me: \u0027O Muhammad, convey my greetings to your Ummah, and tell them that Jannah has a vast plain of pure soil and sweet water. It is a plain levelled land. The plants grow there by uttering: Subhan-Allah, Al-hamdu lillah, La ilaha illallah and Allahu Akbar (Allah is free from imperfection; praise be to Allah; there is no true god except Allah; and Allah is Greatest).\" [At- Tirmidhi].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Aku bertemu Ibrahim (ﷺ) pada Malam Kenaikan (Al-Asra), dan dia berkata kepadaku: \u0027Wahai Muhammad, sampaikan salamku kepada umatmu, dan katakan kepada mereka bahwa Jannah memiliki surga. dataran luas tanah suci dan air manis Ini adalah tanah datar datar Tanaman tumbuh di sana dengan mengucapkan: Subhan-Allah, Al-hamdu lillah, La ilaha illallah dan Allahu Akbar (Allah bebas dari ketidaksempurnaan; segala puji bagi Allah; tidak ada Tuhan yang benar selain Allah; dan Allah Maha Besar). [At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Ibn Mas\u0027ud (May Allah be pleased with him) reported:","language":"english"},{"text":"Ibnu Mas\u0027ud radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"1441","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي الدرداء، رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏\"‏ألا أنبئكم بخير أعمالكم، وأزكاها عند مليككم، وأرفعها في درجاتكم، وخير لكم من إنفاق الذهب والفضة وخير لكم من أن تلقوا عدوكم فتضربوا أعناقهم، ويضربوا أعناقكم‏؟‏‏\"‏ قالوا‏:‏ بلى، قال‏:‏ ‏\"‏ذكر الله تعالى‏\"‏‏.‏ رواه الترمذي وقال الحاكم أبو عبد الله إسناده صحيح‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"Shall I not inform you of the best of your actions which are the purest to your Rubb, which exalt you to the high ranks, which are more efficacious than spending gold and silver (in charity), and better for you than you should encounter your enemies whom you will smite their necks and they will smite your necks?\" They said, \"Certainly.\" He (ﷺ) said, \"Remembrance of Allah the Exalted.\" [At-Tirmidhi].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Maukah aku memberitahu Anda tentang yang terbaik dari tindakan Anda yang paling murni untuk Rubb Anda, yang mengangkat Anda ke derajat yang tinggi, yang lebih manjur daripada menghabiskan emas dan perak (dalam amal) , dan lebih baik bagimu daripada menghadapi musuh-musuhmu yang akan kamu penggal lehernya dan mereka akan memenggal lehermu?” Mereka berkata, \"Tentu saja.\" Dia (ﷺ) berkata, \"Mengingat Allah Ta\u0027ala.\" [At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Abud-Darda (May Allah be pleased with him) reported:","language":"english"},{"text":"Abud-Darda r.a. melaporkan:","language":"bahasa"}]},{"index":"1442","hadith_id":"riyadussalihin","text":[{"text":"وعن سعد بن أبي وقاص رضي الله عنه أنه دخل مع رسول الله صلى الله عليه وسلم على امرأة وبين يديها نوى -أو حصى- تسبح به فقال‏:‏ ‏\"‏أخبرك بما هو أيسر عليك من هذا - أو أفضل‏\"‏ فقال‏:‏ ‏\"‏سبحان الله عدد ما خلق في السماء، وسبحان الله عدد ما خلق في الأرض، وسبحان الله عدد ما بين ذلك، وسبحان الله عدد ما هو خالق، والله أكبر مثل ذلك، والحمد لله مثل ذلك، ولا إله إلا الله مثل ذلك، ولا حول ولا قوة إلا بالله مثل ذلك‏\"‏‏.‏ ‏(‏‏(‏رواه الترمذي وقال‏:‏ حديث حسن‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) and I went to see a woman. She had date- stones or pebbles in front of her, and she was counting and reciting Tasbih. [\u0027Subhan-Allah\u0027 (Allah is free from imperfection)]. He said, \"Shall I not inform you of what is easier or better than this for you?\" You should say: \u0027Subhan-Allahi \u0027adada ma khalaqa fis-sama\u0027, wa subhan-Allahi \u0027adada ma khalaqa fil-ardi, wa subhan-Allahi \u0027adada ma baina dhalika, wa subhan-Allahi \u0027adada ma Huwa Khaliqun, wallahu Akbaru mithla dhalika, wal-hamdu lillahi mithla dhalika, wa la ilaha illallahu mithla dhalika, wa la hawla wa la quwwata illa billahi mithla dhalika (Subhan-Allah, equal to the number of what He created in the heaven; and Subhan-Allah, equal to the number of His creatures in the earth; and Subhan-Allah, equal to the number in between them; and Subhan-Allah equal to the number of those He will create).\u0027 Then say: \u0027Allahu Akbar\u0027 (Allah is Greatest) in the same way. Then say: \u0027Al-hamdu lillah\u0027 (praise be to Allah) in the same way. Then say: \u0027La ilaha illallah\u0027 (there is no true god except Allah) in the same way. Then say: \u0027La hawla wa la quwwata illa billah\u0027 (there is no change of a condition nor power except by Allah) in the same manner.\" [At-Tirmidhi].","language":"english"},{"text":"Rasulullah (ﷺ) dan aku pergi menemui seorang wanita. Dia memiliki batu kurma atau kerikil di depannya, dan dia sedang menghitung dan membaca Tasbih. [\u0027Subhan-Allah\u0027 (Allah bebas dari ketidaksempurnaan)]. Dia berkata, \"Maukah saya memberitahu Anda apa yang lebih mudah atau lebih baik dari ini untuk Anda?\" Anda harus mengatakan: \u0027Subhan-Allahi \u0027adada ma khalaqa fis-sama\u0027, wa subhan-Allahi \u0027adada ma khalaqa fil-ardi, wa subhan-Allahi \u0027adada ma baina dhalika, wa subhan-Allahi \u0027adada ma Huwa Khaliqun, wallahu Akbaru mithla dhalika, wal-hamdu lillahi mithla dhalika, wa la ilaha illallahu mithla dhalika, wa la hawla wa la quwwata illa billahi mithla dhalika (Subhanallah, sebanyak apa yang Dia ciptakan di langit; dan Subhanallah, sama dengan jumlah makhluk-Nya di bumi, dan Subhan-Allah, sama dengan jumlah di antara mereka, dan Subhan-Allah sama dengan jumlah yang Dia akan menciptakan).\u0027 Kemudian ucapkan: \u0027Allahu Akbar\u0027 (Allah Maha Besar) dengan cara yang sama. Kemudian ucapkan: \u0027Alhamdulillah\u0027 (Segala puji bagi Allah) dengan cara yang sama. Kemudian ucapkan: \u0027La ilaha illallah\u0027 (tidak ada Tuhan yang benar selain Allah) dengan cara yang sama. Kemudian ucapkan: La hawla wa la quwwata illa billah (tidak ada perubahan keadaan dan kekuasaan kecuali dengan izin Allah) dengan cara yang sama. [At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Sa\u0027d bin Abu Waqqas (May Allah be pleased with him) reported:","language":"english"},{"text":"Sa\u0027d bin Abu Waqqas radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"1443","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي موسى رضي الله عنه قال‏:‏ قال لي رسول الله صلى الله عليه وسلم‏:‏ ‏\"‏ألا أدلك على كنز من كنوز الجنة ‏؟‏‏\"‏ فقلت‏:‏ بلى يا رسول الله قال‏:‏ ‏\"‏لا حول ولا قوة إلا بالله‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said to me, \"Shall I not guide you to a treasure from the treasures of Jannah?\" I said: \"Yes, O Messenger of Allah!\" Thereupon he (ﷺ) said, \"(Recite) \u0027La hawla wa la quwwata illa billah\u0027 (There is no change of a condition nor power except by Allah).\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata kepadaku, \"Maukah aku membimbingmu ke harta dari harta Jannah?\" Aku berkata: \"Ya, ya Rasulullah!\" Kemudian dia (ﷺ) berkata, \"(Bacalah) \u0027La hawla wa la quwwata illa billah\u0027 (Tidak ada perubahan suatu kondisi dan kekuatan kecuali dengan Allah).\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Musa (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Musa (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"1444","hadith_id":"riyadussalihin","text":[{"text":"وعن عائشة رضي الله عنها قالت‏:‏ كان رسول الله صلى الله عليه وسلم يذكر الله تعالى على كل أحيانه‏.‏ رواه مسلم‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) used to remember Allah at all times. [Muslim].","language":"english"},{"text":"Rasulullah SAW selalu mengingat Allah setiap saat. [Muslim] .","language":"bahasa"}],"narrated":[{"text":"\u0027Aishah (May Allah be pleased with her) reported:","language":"english"},{"text":"\u0027Aisyah r.a. melaporkan:","language":"bahasa"}]},{"index":"1445","hadith_id":"riyadussalihin","text":[{"text":"وعن ابن عباس رضي الله عنهما عن النبي صلى الله عليه وسلم قال‏:‏ ‏ \"‏لو أن أحدكم إذا أتى أهله قال‏:‏ بسم الله، اللهم جنبنا الشيطان وجنب الشيطان ما رزقتنا، فقضى بينهما ولد لم يضره ‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Prophet (ﷺ) said, \"If anyone intends to have (sexual intercourse) with his wife, he should say: \"Bismillah! Allahumma janibnash-Shaitana, wa jannibish-Shaitana ma razaqtana (In the Name of Allah, O Allah! Keep us away from Satan and keep Satan away from what You have bestowed upon us);\u0027 and if Allah has ordained a child for them, Satan will never harm him.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Nabi (ﷺ) berkata, \"Barang siapa berniat untuk melakukan (hubungan seksual) dengan istrinya, dia harus mengatakan:\" Bismillah! Allahumma janibnash-Shaitana, wa jannibish-Shaitana ma razaqtana (Dengan Nama Allah, ya Allah! Jauhkan kami dari Setan dan jauhkan Setan dari apa yang telah Engkau anugerahkan kepada kami);\u0027 dan jika Allah telah menahbiskan anak untuk mereka, setan tidak akan menyakitinya.” [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Ibn \u0027Abbas (May Allah be pleased with them) reported:","language":"english"},{"text":"Ibn \u0027Abbas (semoga Allah meridhoi mereka) melaporkan:","language":"bahasa"}]},{"index":"1446","hadith_id":"riyadussalihin","text":[{"text":"عن حذيفة، وأبي ذر رضي الله عنهما قالا‏:‏ كان رسول الله صلى الله عليه وسلم إذا أوى إلى فراشه قال‏:‏ ‏\"‏باسمك اللهم أموت وأحيا‏\"‏ وإذا استيقظ قال‏:‏ ‏\"‏الحمد لله الذي أحيانا بعد ما أماتنا وإليه النشور‏\"‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","language":"arabic"},{"text":"Whenever the Messenger of Allah (ﷺ) went to bed, he would supplicate: \"Bismika-Allahumma amut wa ahya (With Your Name, O Allah, I die and return to life)\"; and when he woke up, he would supplicate thus: \"Al-hamdu lillahilladhi ahyana ba\u0027da ma amatana, wa ilaihin-nushur (All praise belongs to Allah Who has restored us back to life after causing us to die; and to Him shall we return).\" [Al-Bukhari]","language":"english"},{"text":"Setiap kali Rasulullah (ﷺ) pergi tidur, dia akan berdoa: \"Bismika-Allahumma amut wa ahya (Dengan Nama-Mu, ya Allah, aku mati dan hidup kembali)\"; dan ketika dia bangun, dia akan berdoa sebagai berikut: \"Al-hamdu lillahilladhi ahyana ba\u0027da ma amatana, wa ilaihin-nushur (Segala puji bagi Allah yang telah menghidupkan kita kembali setelah mematikan kita; dan kepada-Nyalah). kami kembali).\" [Al-Bukhari]","language":"bahasa"}],"narrated":[{"text":"Hudhaifah and Abu Dharr (May Allah be pleased with him) reported:","language":"english"},{"text":"Hudzaifah dan Abu Dzar radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"1447","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي هريرة رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏\"‏إن لله تعالى ملائكة يطوفون في الطرق يلتمسون أهل الذكر، فإذا وجدوا قومًا يذكرون الله عز وجل، تنادوا‏:‏ هلموا إلى حاجتكم، فيحفونهم بأجنحتهم إلى السماء الدنيا، فيسألهم ربهم - وهو أعلم‏:‏ ما يقول عبادي‏؟‏ قال‏:‏ يقولون‏:‏ يسبحونك، ويكبرونك، ويحمدونك، ويمجدونك، فيقول‏:‏ هل رأوني‏؟‏ فيقولون‏:‏ لا لا والله ما رأوك، فيقول‏:‏ كيف لو رأوني‏؟‏‏!‏ قال‏:‏ يقولون‏:‏ لو رأوك كانوا أشد لك عبادة، وأشد لك تمجيدًا، وأكثر لك تسبيحًا فيقول‏:‏ فماذا يسألون‏؟‏ قال‏:‏ يقولون‏:‏ يسألونك الجنة‏.‏ قال‏:‏ يقول‏:‏ وهل رأوها‏؟‏ قال‏:‏ يقولون‏:‏ لا والله يا رب ما رأوها‏.‏ قال‏:‏ يقول‏:‏ فكيف لو رأوها‏؟‏‏!‏ قال‏:‏ يقولون‏:‏ لو أنهم رأوها كانوا أشد عليها حرصًا، وأشد لها طلبًا، وأعظم فيها رغبة‏.‏ قال‏:‏ فمم يتعوذون‏؟‏ قال يقولون‏:‏ يتعوذون من النار، قال‏:‏ فيقول‏:‏ وهل رأوها‏؟‏ قال‏:‏ يقولون‏:‏ ولا والله ما رأوها‏.‏ فيقول‏:‏ كيف لو رأوها‏؟‏‏!‏ قال‏:‏ يقولون‏:‏ لو رأوها كانوا أشد فرارًا، وأشد لها مخافة‏.‏ قال‏:‏ يقول‏:‏ فأشهدكم أني قد غفرت لهم، قال‏:‏ يقول ملك من الملائكة‏:‏ فيهم فلان ليس منهم، إنما جاء لحاجة، قال‏:‏ هم الجلساء لا يشقى بهم جليسهم‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏ وفي رواية لمسلم عن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم قال‏:‏ ‏\"‏إن لله ملائكة سيارة فضلا يتتبعون مجالس الذكر، فإذا وجدوا مجلسًا فيه ذكر، قعدوا معهم، وحف بعضهم بعضًا بأجنحتهم حتى يملئوا ما بينهم وما بين السماء الدنيا، فإذا تفرقوا عرجوا وصعدوا إلى السماء، فيسألهم الله عز وجل - وهو أعلم‏:‏ من أين جئتم‏؟‏ فيقولون‏:‏ جئنا من عند عباد لك في الأرض‏:‏ يسبحونك، ويكبرونك، ويهللونك، ويحمدونك، ويسألونك‏.‏ قال‏:‏ وماذا يسألوني‏؟‏ قالوا‏:‏ يسألونك جنتك‏.‏ قال‏:‏ وهل رأوا جنتي‏؟‏ قالوا‏:‏ لا، أي رب‏.‏ قال‏:‏ فكيف لو رأوا جنتي‏؟‏‏!‏ قالوا‏:‏ ويستجيرونك‏.‏ قال‏:‏ ومم يستجيروني‏؟‏ قالوا‏:‏ من نارك يا رب‏.‏ قال‏:‏ وهل رأوا ناري‏؟‏ قالوا‏:‏ لا، قال‏:‏ فكيف لو رأوا ناري‏؟‏ قالوا‏:‏ ويستغفرونك، فيقول‏:‏ قد غفرت لهم، وأعطيتهم ما سألوا، وأجرتهم ما استجاروا‏.‏ قال‏:‏ فيقولون‏:‏ رب فيهم فلان عبد خطاء إنما مر، فجلس معهم، فيقول‏:‏ وله غفرت، هم القوم لا يشقى بهم جليسهم‏\"‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"Allah, the Exalted, has teams of angels who go about on the roads seeking those who remember Allah. When they find some people remembering Allah they call to one another and say, \u0027Come to what you are looking for;\u0027 and they surround them with their wings till the space between them and the lowest sky is fully covered. Allah, the Exalted and Glorious, asks them (although He is best informed about every thing): \u0027What are my slave saying?\u0027 They say: \u0027They are glorifying Your Tasbih, Tahmid, Takbir, Tamjid, (i.e., they were declaring Your Perfectness, praising, remembering the Greatness and Majesty of Allah).\u0027 He asks: \u0027Have they seen Me?\u0027 They reply, \u0027No, indeed, they have not seen You.\u0027 He asks: \u0027How would they act if they were to see Me?\u0027 Thereupon they reply: \u0027If they were to see You, they would engage more earnestly in worshipping and glorifying You and would extol You more.\u0027 He would say: \u0027What do they beg of Me?\u0027 They say, \u0027They beg You for Your Jannah.\u0027 Allah says, \u0027Have they seen My Jannah?\u0027 They say, \u0027No, our Rubb.\u0027 He says: \u0027How would they act if they were to see My Jannah?\u0027 They reply, \u0027Were they to see it, they would more intensely eager for it.\u0027 They (the angels) say, \u0027They seek Your Protection.\u0027 He asks, \u0027Against what do they seek My Protection?\u0027 They (the angels) say, \u0027Our Rubb, from the fire of Hell.\u0027 (He, the Rubb) says, \u0027Have they seen the fire of Hell?\u0027 They say, \u0027No. By Your Honour, they have not seen it.\u0027 He says: \u0027How would they act if they were to see My Fire?\u0027 They say: \u0027If they were to see it, they would more earnest in being away from it and fearing it. They beg of Your forgiveness.\u0027 He says: \u0027I call you to witness that I hereby grant pardon to them and confer upon them what they ask for; and grant them protection against what they seek protection from.\u0027 One of the angels says: \u0027Our Rubb, there is amongst them such and such slave who does not belong to the assembly of those who are participating in Your remembrance. He passed by them and sat down with them.\u0027 He says: \u0027I also grant him pardon because they are the people by virtue of whom their associates will not be unfortunate\u0027.\" [Al-Bukhari and Muslim]. (The narration in Muslim is also the same with minor changes in wordings).","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Allah, Ta\u0027ala, memiliki pasukan malaikat yang pergi di jalan mencari orang-orang yang mengingat Allah. Ketika mereka menemukan beberapa orang mengingat Allah mereka memanggil satu sama lain dan berkata, \u0027Datanglah ke apa Anda mencari;\u0027 dan mereka mengelilingi mereka dengan sayap mereka sampai ruang antara mereka dan langit terendah tertutup sepenuhnya. Allah, Yang Maha Tinggi dan Maha Agung, bertanya kepada mereka (walaupun Dia paling mengetahui tentang segala sesuatu): \u0027Apa yang dikatakan hambaku?\u0027 Mereka berkata: \u0027Mereka mengagungkan Tasbih, Tahmid, Takbir, Tamjid-Mu, (yaitu, mereka menyatakan Kesempurnaan-Mu, memuji, mengingat Kebesaran dan Keagungan Allah).\u0027 Dia bertanya: \u0027Apakah mereka melihat Aku?\u0027 Mereka menjawab, \u0027Tidak, memang, mereka tidak melihat-Mu.\u0027 Dia bertanya: \u0027Bagaimana mereka akan bertindak jika mereka melihat Aku?\u0027 Kemudian mereka menjawab: \u0027Jika mereka melihat-Mu, mereka akan lebih sungguh-sungguh menyembah dan memuliakan-Mu dan akan lebih memuji-Mu.\u0027 Dia akan berkata: \u0027Apa yang mereka minta dari-Ku?\u0027 Mereka berkata, \u0027Mereka memohon kepada-Mu Jannah-Mu.\u0027 Allah berfirman, \u0027Apakah mereka telah melihat Jannah-Ku?\u0027 Mereka berkata, \u0027Tidak, Karet kami.\u0027 Dia berkata: \u0027Bagaimana mereka akan bertindak jika mereka melihat Jannah-Ku?\u0027 Mereka menjawab, \u0027Jika mereka melihatnya, mereka akan sangat menginginkannya.\u0027 Mereka (malaikat) berkata, \u0027Mereka mencari perlindungan-Mu.\u0027 Dia bertanya, \u0027Melawan apa mereka mencari Perlindungan-Ku?\u0027 Mereka (malaikat) berkata, \u0027Rubb kami, dari api Neraka.\u0027 (Dia, si Rubb) berkata, \u0027Apakah mereka pernah melihat api Neraka?\u0027 Mereka berkata, \u0027Tidak. Demi Yang Mulia, mereka belum melihatnya.\u0027 Dia berkata: \u0027 Bagaimana mereka akan bertindak jika mereka melihat Api-Ku?\u0027 Mereka berkata: \u0027Jika mereka melihatnya, mereka akan lebih bersungguh-sungguh menjauhinya dan takut akan hal itu. Mereka memohon pengampunan-Mu.\u0027 Dia berkata: \u0027Saya memanggil Anda untuk bersaksi bahwa saya dengan ini memberikan pengampunan kepada mereka dan memberi mereka apa yang mereka minta; dan berikan mereka perlindungan dari apa yang mereka cari perlindungan.\u0027 Salah satu malaikat berkata: \u0027Rub kami, ada di antara mereka budak ini dan itu yang tidak termasuk majelis orang-orang yang mengambil bagian dalam mengingat-Mu. Dia melewati mereka dan duduk bersama mereka.\u0027 Dia berkata: \u0027Saya juga memberinya pengampunan karena mereka adalah orang-orang yang menurut mereka tidak akan disayangkan rekan mereka\u0027.\" Mereka memohon pengampunan-Mu.\u0027 Dia berkata: \u0027Saya memanggil Anda untuk bersaksi bahwa saya dengan ini memberikan pengampunan kepada mereka dan memberi mereka apa yang mereka minta; dan berikan mereka perlindungan dari apa yang mereka cari perlindungan.\u0027 Salah satu malaikat berkata: \u0027Rub kami, ada di antara mereka budak ini dan itu yang tidak termasuk majelis orang-orang yang mengambil bagian dalam mengingat-Mu. Dia melewati mereka dan duduk bersama mereka.\u0027 Dia berkata: \u0027Saya juga memberinya pengampunan karena mereka adalah orang-orang yang menurut mereka tidak akan disayangkan rekan mereka\u0027.\" Mereka memohon pengampunan-Mu.\u0027 Dia berkata: \u0027Saya memanggil Anda untuk bersaksi bahwa saya dengan ini memberikan pengampunan kepada mereka dan memberi mereka apa yang mereka minta; dan berikan mereka perlindungan dari apa yang mereka cari perlindungan.\u0027 Salah satu malaikat berkata: \u0027Rub kami, ada di antara mereka budak ini dan itu yang tidak termasuk majelis orang-orang yang mengambil bagian dalam mengingat-Mu. Dia melewati mereka dan duduk bersama mereka.\u0027 Dia berkata: \u0027Saya juga memberinya pengampunan karena mereka adalah orang-orang yang menurut mereka tidak akan disayangkan rekan mereka\u0027.\" ada di antara mereka budak ini dan itu yang tidak termasuk dalam majelis orang-orang yang ikut mengingat-Mu. Dia melewati mereka dan duduk bersama mereka.\u0027 Dia berkata: \u0027Saya juga memberinya pengampunan karena mereka adalah orang-orang yang menurut mereka tidak akan disayangkan rekan mereka\u0027.\" ada di antara mereka budak ini dan itu yang tidak termasuk dalam majelis orang-orang yang ikut mengingat-Mu. Dia melewati mereka dan duduk bersama mereka.\u0027 Dia berkata: \u0027Saya juga memberinya pengampunan karena mereka adalah orang-orang yang menurut mereka tidak akan disayangkan rekan mereka\u0027.\" [Al-Bukhari dan Muslim] . (Narasi dalam Muslim juga sama dengan sedikit perubahan kata-kata).","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"1448","hadith_id":"riyadussalihin","text":[{"text":"وعنه وعن أبي سعيد رضي الله عنهما قالا‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏ \"‏لا يقعد قوم يذكرون الله عز وجل إلا حفتهم الملائكة، وغشيتهم الرحمة ونزلت عليهم السكينة، وذكرهم الله فيمن عنده‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"When a group of people assemble for the remembrance of Allah, the angels surround them (with their wings), (Allah\u0027s) mercy envelops them, Sakinah, or tranquillity descends upon them and Allah makes a mention of them before those who are near Him.\" [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, “Ketika sekelompok orang berkumpul untuk mengingat Allah, para malaikat mengelilingi mereka (dengan sayap mereka), rahmat (Allah) menyelimuti mereka, Sakinah, atau ketenangan turun atas mereka dan Allah menjadikan menyebut mereka di hadapan orang-orang yang dekat dengan-Nya.” [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah and Abu Sa\u0027id Al-Khudri (May Allah be pleased with them) reported:","language":"english"},{"text":"Abu Hurairah dan Abu Sa\u0027id Al-Khudri (semoga Allah meridhoi mereka) melaporkan:","language":"bahasa"}]},{"index":"1449","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي واقد الحارث بن عوف رضي الله عنه أن رسول الله صلى الله عليه وسلم، بينما هو جالس في المسجد، والناس معه، إذ أقبل اثنان إلى رسول الله صلى الله عليه وسلم، وذهب واحد، فوقفا على رسول الله صلى الله عليه وسلم، فأما أحدهما فرأى فرجة في الحلقة، فجلس فيها وأما الآخر، فجلس خلفهم، وأما الثالث فأدبر ذاهبًا‏.‏ فلما فرغ رسول الله صلى الله عليه وسلم، قال‏:‏ ألا أخبركم عن النفر الثلاثة‏:‏ أما أحدهم، فأوى إلى الله، فآواه الله ، وأما الآخر فاستحيى فاستحيى الله منه، وأما الآخر، فأعرض، فأعرض الله عنه‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) was sitting in the mosque with his Companions when three people came to him. Two of them stepped forward to the Messenger of Allah (ﷺ) and the third went away. Those two men stood by the side of Messenger of Allah (ﷺ). One of them found a space in the circle and he filled it, while the other one sat behind him. When the Messenger of Allah (ﷺ) finished, he said, \"Shall I not inform you about these three people? One of them sought refuge with Allah and Allah gave him refuge; the second one felt shy and Allah showed kindness to his shyness (and so he was accommodated in that meeting), and the last one averted, and so Allah turned away His Attention from him.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) sedang duduk di masjid bersama para sahabatnya ketika tiga orang datang kepadanya. Dua dari mereka melangkah ke depan Rasulullah (ﷺ) dan yang ketiga pergi. Kedua orang itu berdiri di sisi Rasulullah (ﷺ). Salah satu dari mereka menemukan ruang di lingkaran dan dia mengisinya, sementara yang lain duduk di belakangnya. Ketika Rasulullah (ﷺ) selesai, dia berkata, \"Maukah aku memberitahumu tentang tiga orang ini? Salah satu dari mereka berlindung kepada Allah dan Allah memberinya perlindungan; yang kedua merasa malu dan Allah menunjukkan kebaikan pada rasa malunya ( dan dia ditampung dalam pertemuan itu), dan yang terakhir menghindar, dan karena itu Allah mengalihkan perhatian-Nya darinya.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Waqid Al-Harith bin \u0027Auf (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Waqid Al-Harits bin \u0027Auf r.a. melaporkan:","language":"bahasa"}]},{"index":"1450","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي سعيد الخدري رضي الله عنه قال‏:‏ خرج معاوية رضي الله عنه على حلقة في المسجد، فقال‏:‏ ما أجلسكم‏؟‏ قالوا‏:‏ جلسنا نذكر الله‏.‏ قال‏:‏ آلله ما أجلسكم إلا ذاك‏؟‏ قالوا‏:‏ ما أجلسنا إلا ذاك، قال‏:‏ أما إني لم أستحلفكم تهمة لكم، وما كان أحد بمنزلتي من رسول الله صلى الله عليه وسلم أقل حديثًا مني‏:‏ إن رسول الله صلى الله عليه وسلم خرج على حلقة من أصحابه فقال‏:‏ ‏\"‏ما أجلسكم‏؟‏‏\"‏ قالوا‏:‏ جلسنا نذكر الله، ونحمده على ما هدانا للإسلام، ومنَّ به علينا‏.‏ قال‏:‏ ‏\"‏آلله ما أجلسكم إلا ذاك‏؟‏‏\"‏ قالوا‏:‏ والله ما أجلسنا إلا ذلك‏\"‏‏.‏ قال‏:‏ ‏\"‏أما إني لم أستحلفكم تهمة لكم، ولكنه أتاني جبريل فأخبرني أن الله يباهي بكم الملائكة‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"Mu\u0027awiyah (May Allah be pleased with him) came to an assembly in the mosque and asked them: \"What has made you sit together?\" They replied, \"We are sitting here to remember Allah.\" He said, \"I adjure you by Allah to tell me whether nothing else has made you to sit together.\" They replied: \"By Allah! We are sitting only to remember Allah.\" Then he said, \"I did not adjure you because I suspected you. No one of my rank in the eyes of the Messenger of Allah (ﷺ) is the narrator of so few traditions as I am. The fact is that the Messenger of Allah (ﷺ) went out to a circle of his Companions and said, \u0027What has made you sit there?\u0027 When they replied that they are sitting together to remember Allah and to praise Him for guiding them to Islam and bestowing favours on them, he (ﷺ) said, \u0027I adjure you by Allah to tell me that nothing else has made you sit together.\u0027 On their reply that there was certainly no other purpose, he (ﷺ) said, \u0027I did not adjure you because I suspected you, but Jibril (Gabriel) came to me and told me that Allah was talking proudly of you to the angels.\"\u0027 [Muslim].","language":"english"},{"text":"Mu\u0027awiyah (ra dengan dia) datang ke sebuah majelis di masjid dan bertanya kepada mereka: \"Apa yang membuat kalian duduk bersama?\" Mereka menjawab, \"Kami duduk di sini untuk mengingat Allah.\" Dia berkata, \"Saya meminta Anda demi Allah untuk memberi tahu saya apakah tidak ada hal lain yang membuat Anda duduk bersama.\" Mereka menjawab: \"Demi Allah! Kami duduk hanya untuk mengingat Allah.\" Kemudian dia berkata, \"Aku tidak memintamu karena aku mencurigaimu. Tidak seorang pun dari peringkatku di mata Rasulullah (ﷺ) adalah perawi hadits yang begitu sedikit seperti aku. Faktanya adalah bahwa Rasulullah () (ﷺ) pergi ke lingkaran para sahabatnya dan berkata, \u0027Apa yang membuatmu duduk di sana?\u0027 Ketika mereka menjawab bahwa mereka duduk bersama untuk mengingat Allah dan memuji-Nya karena telah membimbing mereka ke Islam dan memberikan nikmat kepada mereka, dia (ﷺ) berkata, \u0027Saya mohon Anda demi Allah untuk memberi tahu saya bahwa tidak ada hal lain yang membuat Anda duduk bersama.\u0027 Pada jawaban mereka bahwa tentu saja tidak ada tujuan lain, dia (ﷺ) berkata, \u0027Saya tidak meminta Anda karena saya mencurigai Anda, tetapi Jibril (Jibril) datang kepada saya dan mengatakan kepada saya bahwa Allah berbicara dengan bangga tentang Anda kepada para malaikat. \"\u0027 [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Sa\u0027id Al-Khudri (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Sa\u0027id Al-Khudri r.a. melaporkan:","language":"bahasa"}]},{"index":"1451","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي هريرة رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏ \"‏من قال حين يصبح وحين يمسي‏:‏ سبحان الله وبحمده مائة مرة، لم يأتِ أحد يوم القيامة بأفضل مما جاء به، إلا أحد قال مثل ما قال أو زاد‏\"‏ ‏(‏‏(‏ رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"He who recites in the morning and in the evening the statement: \u0027Subhan-Allahi wa bihamdihi (Allah is free from imperfection and I begin with praising Him)\u0027 one hundred times, will not be surpassed on the Day of Resurrection by anyone with better deeds than one who utters the same words or utters more of these words.\" [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Barangsiapa membaca di pagi dan sore hari kalimat: \u0027Subhan-Allahi wa bihamdihi (Allah bebas dari ketidaksempurnaan dan saya mulai dengan memuji-Nya)\u0027 seratus kali, tidak akan dilampaui pada Hari Kebangkitan oleh siapa pun yang lebih baik perbuatannya daripada orang yang mengucapkan kata-kata yang sama atau lebih banyak mengucapkan kata-kata ini.” [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"1452","hadith_id":"riyadussalihin","text":[{"text":"وعنه قال‏:‏ جاء رجل إلى النبي صلى الله عليه وسلم، فقال‏:‏ يا رسول الله ما لقيت من عقرب لدغتني البارحة‏!‏ قال‏:‏ ‏ \"‏أما لو قلت حين أمسيت‏:‏ أعوذ بكلمات الله التامات من شر ما خلق لم تضرك‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"A man came to the Prophet (ﷺ) and said, \"What a trouble I suffered from a scorpion which stung me last night!\" He (ﷺ) said, \"Had you said in the evening: \u0027A\u0027udhu bikalimatillahit-tammati min sharri ma khalaqa (I seek the protection of Allah\u0027s Perfect Words from the evil of whatever He has created),\u0027 it would not have harmed you.\" [Muslim].","language":"english"},{"text":"Seorang pria datang kepada Nabi (ﷺ) dan berkata, \"Betapa sulitnya saya menderita kalajengking yang menyengat saya tadi malam!\" Dia (ﷺ) berkata, \"Seandainya kamu mengatakan di malam hari: \u0027A\u0027udhu bikalimatillahit-tammati min sharri ma khalaqa (Aku mencari perlindungan Kalimat Allah yang Sempurna dari kejahatan apa pun yang Dia ciptakan),\u0027 itu tidak akan merugikan. Anda.\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"1453","hadith_id":"riyadussalihin","text":[{"text":"وعنه عنه النبي، صلى الله عليه وسلم، أنه كان يقول إذا أصبح‏:‏ ‏\"‏اللهم بك أصبحنا، وبك أمسينا، وبك نحيا، وبك نموت، وإليك النشور‏\"‏‏.‏ وإذا أمسى قال‏:‏ ‏\"‏اللهم بك أمسينا، وبك نحيا، وبك نموت، وإليك المصير‏\"‏‏.‏ رواه أبو داود والترمذي وقال حديث حسن‏.‏","language":"arabic"},{"text":"The Prophet (ﷺ) used to say in the morning: \"Allahumma bika asbahna, wa bika amsaina, wa bika nahya, wa bika namutu, wa ilaikan-nushur (O Allah! With Your Power we have come to the morning, with Your Power we come to the evening, with Your Power we live, and we die, and to You will we return).\" In the evening he would say: \"Allahumma bika amsaina, wa bika nahya, wa bika namutu, wa ilaikan-nushur (O Allah! With Your Power, we have come to the evening, by You do we live, by You do we die, and to You is the return).\" [At-Tirmidhi and Abu Dawud].","language":"english"},{"text":"Nabi (ﷺ) biasa mengatakan di pagi hari: \"Allahumma bika asbahna, wa bika amsaina, wa bika nahya, wa bika namutu, wa ilaikan-nushur (Ya Allah! Dengan Kuasa-Mu kami datang pagi, dengan Kuasa-Mu). kami datang pada petang hari, dengan Kuasa-Mu kami hidup, dan kami mati, dan kepada-Mu kami kembali). Sore harinya ia akan berkata: “Allahumma bika amsaina, wa bika nahya, wa bika namutu, wa ilaikan-nushur (Ya Allah! Dengan Kuasa-Mu kami sampai malam, dengan-Mu kami hidup, dengan-Mu kami mati). , dan kepada-Mu tempat kembali).” [At-Tirmidzi dan Abu Dawud] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"1454","hadith_id":"riyadussalihin","text":[{"text":"وعنه أن أبا بكر الصديق رضي الله عنه قال‏:‏ يا رسول الله مرني بكلمات أقولهن إذا أصبحت وإذا أمسيت، قال‏:‏ قل‏:‏ ‏\"‏اللهم فاطر السماوات والأرض عالم الغيب والشهادة، رب كل شيء ومليكه أشهد أن لا إله إلا أنت، أعوذ بك من شر نفسي وشر الشيطان وشركه‏\"‏ قال‏:‏ ‏\"‏قلها إذا أصبحت، وإذا أمسيت، وإذا أخذت مضجعك‏\"‏‏.‏ رواه أبو داود والترمذي وقال حديث حسن صحيح‏.‏","language":"arabic"},{"text":"Abu Bakr asked, \"O Messenger of Allah! Teach me some words so that I may recite them in the morning and in the evening.\" The Messenger of Allah (ﷺ) said, \"Recite these words: \u0027Allahumma fatiras-samawati wal-ardi, \u0027alimal-ghaibi wash-shahadati, Rabba kulli shai\u0027in wa malikahu. Ash- hadu an la ilaha illa Anta, a\u0027udhu bika min sharri nafsi, wa sharrish- Shaitani wa shirkihi (O Allah! Creator of the heavens and the earth! Knower of the hidden and the exposed! Rubb of everything and every one. I bear witness that none has the right to be worshipped but You. I seek Your Protection from the evil of my own self from the evil of Satan and from the evil of Shirk to which he calls).\"\u0027 The Messenger of Allah (ﷺ) added: \"Recite these words in the morning and the evening and when you go to bed.\" [Abu Dawud and At- Tirmidhi].","language":"english"},{"text":"Abu Bakar bertanya, \"Ya Rasulullah! Ajari aku beberapa kata agar aku bisa membacanya di pagi dan sore hari.\" Rasulullah (ﷺ) berkata, \"Bacalah kata-kata ini: \u0027Allahumma fatiras-samawati wal-ardi, \u0027alimal-ghaibi wash-shahadati, Rabba kulli shai\u0027in wa malikahu. Ash-hadu an la ilaha illa Anta, a\u0027 udhu bika min sharri nafsi, wa sharrish- Shaitani wa shirkihi (Ya Allah! Pencipta langit dan bumi! Mengetahui yang tersembunyi dan yang terbuka! Rub dari segala sesuatu dan setiap orang. Saya bersaksi bahwa tidak ada yang berhak disembah tetapi Engkau. Aku memohon perlindungan-Mu dari kejahatan diriku sendiri dari kejahatan setan dan dari kejahatan Syirik yang dia sebut).” Rasulullah (ﷺ) menambahkan: “Bacalah kata-kata ini di pagi hari dan malam hari dan ketika Anda pergi tidur.\" [Abu Dawud dan At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"1455","hadith_id":"riyadussalihin","text":[{"text":"وعن ابن مسعود رضي الله عنه قال‏:‏ كان نبي الله صلى الله عليه وسلم، إذا أمسى قال‏:‏ أمسينا وأمسى الملك لله، والحمد لله، لا إله إلا الله وحده لا شريك له‏\"‏ قال الراوي‏:‏ أراه قال فيهن‏:‏ ‏\"‏له الملك وله الحمد وهو على كل شيء قدير، رب أسألك خير ما في هذه الليلة، وخير ما بعدها، وأعوذ بك من شر ما في هذه الليلة وشر ما بعدها، رب أعوذ بك من الكسل، وسوء الكبر، رب أعوذ بك من شر ما في هذه الليلة، وخير ما بعدها، وأعوذ بك من شر ما في هذه الليلة وشر ما بعدها، رب أعوذ بك من الكسل، وسوء الكبر، رب أعوذ بك من عذاب النار، وعذاب في القبر‏\"‏ وإذا أصبح قال ذلك أيضًا‏:‏ ‏\"‏أصبحنا وأصبح الملك لله‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"When it was evening, the Prophet (ﷺ) used to supplicate: \"Amsaina wa amsal-mulku lillah, wal-hamdu lillah. La \u0027ilaha illallahu wahdahu la sharika lahu (We have entered upon evening and the whole kingdom of Allah, too, has entered upon evening. Praise is due to Allah. There is none who has the right to be worshiped but Allah, the One who has no partner with Him).\" He (the narrator) said: I think that he (ﷺ) used to follow the recitation with these words: \"Lahul-mulku, wa lahul-hamdu, wa Huwa \u0027ala kulli shi\u0027in Qadir. Rabbi as\u0027aluka khaira ma fi hadhihil-lailati, wa khaira ma ba\u0027daha; wa a\u0027udhu bika min sharri ma fi hadhihil-lailati, wa sharri ma ba\u0027daha; Rabbi a\u0027udhu bika minal- kasali, wa su\u0027il-kibari; Rabbi a\u0027udhu bika min \u0027adhabin fin-nari, wa \u0027adhabin fil-qabri (His is the sovereignty and to Him is all praise due, and He is Omnipotent. My Rubb, I beg of you good that lies in this night and good that follows it, and I seek refuge in You from the evil that lies in this night and from the evil of that which follows it. My Rubb! I seek refuge in You from lethargy and the misery of old age. O Allah! I seek Your Protection from the torment of Hell-fire and the punishment of the grave).\" When it was morning, he (ﷺ) would recite the same, replacing the words: \"We have entered upon evening and the whole kingdom of Allah, too, has entered upon evening\" with \"We have entered upon morning and the whole kingdom of Allah entered upon morning.\" (Replace the words \"Amsaina, amsa, hadhihil-lailati, ma ba\u0027daha with Asbahna, asbaha, hadhal-yaumi, ma ba\u0027dahu, respectively.) [Muslim].","language":"english"},{"text":"Ketika sore hari, Nabi (ﷺ) biasa berdoa: \"Amsaina wa amsal-mulku lillah, wal-hamdu lillah. La \u0027ilaha illallahu wahdahu la sharika lahu (Kami telah memasuki malam dan seluruh kerajaan Allah juga, telah masuk pada waktu petang. Segala puji bagi Allah. Tidak ada sesembahan yang berhak disembah selain Allah, yang tidak ada sekutu bagi-Nya).” Dia (perawi) berkata: Saya pikir dia (ﷺ) biasa mengikuti bacaan dengan kata-kata ini: \"Lahul-mulku, wa lahul-hamdu, wa Huwa \u0027ala kulli shi\u0027in Qadir. Rabbi as\u0027aluka khaira ma fi hadhihil-lailati, wa khaira ma ba\u0027daha; wa a\u0027udhu bika min sharri ma fi hadhihil-lailati, wa sharri ma ba\u0027daha; Rabbi a\u0027udhu bika minal- kasali, wa su\u0027il-kibari; Rabbi a\u0027 udhu bika min \u0027adhabin fin-nari, wa\u0027 [Muslim] .","language":"bahasa"}],"narrated":[{"text":"\u0027Abdullah bin Mas\u0027ud (May Allah be pleased with him) reported:","language":"english"},{"text":"\u0027Abdullah bin Mas\u0027ud (ra dengan dia) melaporkan:","language":"bahasa"}]},{"index":"1456","hadith_id":"riyadussalihin","text":[{"text":"وعن عبد الله بن خُبيب -بضم الخاء المعجمة- رضي الله عنه قال‏:‏ قال لي رسول الله صلى الله عليه وسلم‏:‏ ‏ \"‏اقرأ‏:‏ قل هو الله أحد، والمعوذتين حين تمسي وحين تصبح، ثلاث مرات، تكفيك من كل شيء‏\"‏‏.‏ رواه أبو داود والترمذي وقال حديث حسن صحيح ‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said to me, \"Recite Surat Al-Ikhlas and Al- Mu\u0027awwidhatain (Surat Al-Falaq and Surat An-Nas) three times at dawn and dusk. It will suffice you in all respects.\" [Abu Dawud and At-Tirmidhi].","language":"english"},{"text":"Rasulullah (ﷺ) berkata kepadaku, \"Bacalah Surat Al-Ikhlas dan Al-Mu\u0027awwidhatain (Surat Al-Falaq dan Surat An-Nas) tiga kali saat fajar dan senja. Itu akan mencukupimu dalam segala hal.\" [Abu Dawud dan At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"\u0027Abdullah bin Khubaib (May Allah be pleased with him) reported:","language":"english"},{"text":"\u0027Abdullah bin Khubaib (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"1457","hadith_id":"riyadussalihin","text":[{"text":"وعن عثمان بن عفان رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏ \"‏ما من عبد يقول في صباح كل يوم ومساء كل ليلة‏:‏ بسم الله الذي لا يضر مع اسمه شيء في الأرض ولا في السماء وهو السميع العليم، ثلاث مرات، إلا لم يضره شيء‏\"‏‏.‏ رواه أبو داود والترمذي وقال حديث حسن صحيح ‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"He who recites three times every morning and evening: \u0027Bismillahil-ladhi la yadurru ma\u0027as-mihi shai\u0027un fil-ardi wa la fis-sama\u0027i, wa Huwas-Sami\u0027ul-\u0027Alim (In the Name of Allah with Whose Name there is protection against every kind of harm in the earth or in the heaven, and He is the All-Hearing and All- Knowing),\u0027 nothing will harm him.\" [Abu Dawud and At- Tirmidhi].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, \"Barangsiapa yang membaca tiga kali setiap pagi dan sore: \u0027Bismillahil-ladzi la yadurru ma\u0027as-mihi shai\u0027un fil-ardi wa la fis-sama\u0027i, wa Huwas-Sami\u0027 ul-\u0027Alim (Dengan Nama Allah yang dengan Nama-Nya ada perlindungan dari segala jenis bencana di bumi atau di langit, dan Dia Maha Mendengar lagi Maha Mengetahui),\u0027 tidak ada yang akan membahayakannya.\" [Abu Dawud dan At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"\u0027Uthman bin \u0027Affan (May Allah be pleased with him) reported:","language":"english"},{"text":"\u0027Utsman bin \u0027Affan (ra dengan dia) melaporkan:","language":"bahasa"}]},{"index":"1458","hadith_id":"riyadussalihin","text":[{"text":"وعن حذيفة وأبي ذر رضي الله عنهما أن رسول الله صلى الله عليه وسلم كان إذا أوى إلى فراشه قال‏:‏ ‏ \"‏باسمك اللهم أحيا وأموت‏\"‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) used to supplicate when he went to bed at night: \"Bismik-Allahumma ahya wa amut (With Your Name, O Allah, I expire and return to life).\" [Al- Bukhari].","language":"english"},{"text":"Rasulullah (ﷺ) biasa berdoa ketika dia pergi tidur di malam hari: \"Bismik-Allahumma ahya wa amut (Dengan Nama-Mu, ya Allah, aku mati dan hidup kembali).\" [Al-Bukhari] .","language":"bahasa"}],"narrated":[{"text":"Hudhaifah and Abu Dharr (May Allah be pleased with him) reported:","language":"english"},{"text":"Hudzaifah dan Abu Dzar radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"1459","hadith_id":"riyadussalihin","text":[{"text":"وعن علي رضي الله عنه أن رسول الله صلى الله عليه وسلم قال له ولفاطمة، رضي الله عنهما‏:‏ ‏\"‏إذا أويتما إلى فراشكما، أو‏:‏ إذا أخذتما مضجعكما - فكبرا ثلاثًا وثلاثين، وسبحا ثلاثًا وثلاثين، واحمدا ثلاثًا وثلاثين‏\"‏ وفي رواية‏:‏ التسبيح أربعًا وثلاثين‏\"‏ وفي رواية‏:‏ ‏\"‏التكبير أربعًا وثلاثين‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said to me and to Fatimah (May Allah be pleased with her) (Ali\u0027s wife and the Prophet\u0027s daughter), \"When you go to bed, recite: Takbir (Allahu Akbar) thirty-three times and Tasbih (Subhan-Allah) thirty-three times and Tahmid (Al-hamdu lillah) thirty-three times.\" Another narration is: The Messenger of Allah (ﷺ) said, \"Recite Tasbih thirty-four times.\" Another narration is: The Messenger of Allah(ﷺ) said, \"Recite Takbir thirty-four times.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata kepadaku dan Fatimah (semoga Allah meridhoinya) (istri Ali dan putri Nabi), \"Ketika kamu pergi tidur, bacalah: Takbir (Allahu Akbar) tiga puluh tiga kali dan Tasbih (Subhanallah) tiga puluh tiga kali dan Tahmid (Al-hamdu lillah) tiga puluh tiga kali.\" Narasi lain adalah: Rasulullah (ﷺ) berkata, \"Bacalah Tasbih tiga puluh empat kali.\" Narasi lain adalah: Rasulullah (ﷺ) berkata, \"Bacalah Takbir tiga puluh empat kali.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"\u0027Ali (May Allah be pleased with him) reported:","language":"english"},{"text":"\u0027Ali (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"1460","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي هريرة رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏ \"‏إذا أوى أحدكم إلى فراشه، فلينفض فراشه بداخلة إزاره فإنه لا يدري ما خلفه عليه، ثم يقول‏:‏ باسمك ربي وضعت جنبي، وبك أرفعه؛ إن أمسكت نفسي فارحمها، وإن أرسلتها، فاحفظها بما تحفظ به عبادك الصالحين‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"When any of you goes to bed, he should shake off (or dust off) his bedsheet because he does not know what might have fallen on it after he had left it. Then he should recite: \u0027Bismika Rabbi wada\u0027tu janbi, wa bika arfa\u0027uhu, in amsakta nafsi farhamha, wa in arsaltaha fahfazha bima tahfazu bihi \u0027ibadakas-salihin [With Your Name, my Rubb, I place my side (upon the bed) and with Your Grace I will raise it up. If You withhold my soul (cause me to die), have mercy on it but if You let it go (let me live), guard it against which You guarded Your pious slaves].\"\u0027 [Al- Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Jika salah seorang dari kalian pergi tidur, ia harus mengibaskan (atau membersihkan) seprainya karena ia tidak tahu apa yang mungkin jatuh di atasnya setelah ia meninggalkannya. Kemudian ia harus membaca : \u0027Bismika Rabbi wada\u0027tu janbi, wa bika arfa\u0027uhu, in amsakta nafsi farhamha, wa in arsaltaha fahfazha bima tahfazu bihi \u0027ibadakas-salihin [Dengan Nama-Mu, Karetku, kuletakkan sisiku (di atas tempat tidur) dan dengan Yang Mulia, saya akan mengangkatnya. Jika Anda menahan jiwa saya (menyebabkan saya mati), kasihanilah dia, tetapi jika Anda melepaskannya (biarkan saya hidup), jagalah darinya Anda menjaga hamba-hamba-Mu yang saleh] .\"\u0027 [ Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"1461","hadith_id":"riyadussalihin","text":[{"text":"وعن عائشة، رضي الله عنه، أن رسول الله صلى الله عليه وسلم، كان إذا أخذ مضجعه نفث في يديه، وقرأ بالمعوذات ومسح بهما جسده‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏ وفي رواية لهما‏:‏ ‏ \"‏أن النبي صلى الله عليه وسلم، كان إذا أوى إلى فراشه كل ليلة جمع كفيه، ثم نفث فيهما فقرأ فيهما‏:‏ قل هو الله أحد، وقل أعوذ برب الفلق، وقل أعوذ برب الناس، ثم مسح بهما ما استطاع من جسده، يبدأ بهما على رأسه ووجهه، وما أقبل من جسده، يفعل ذلك ثلاث مرات‏\"‏‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏. قال أهل اللغة : (( النفث )) نفخ لطيف بلا ريق‏","language":"arabic"},{"text":"Whenever the Messenger of Allah (ﷺ) went to bed, he would blow upon his hands recite Al-Mu\u0027awwidhat; and pass his hands over his body. [Al-Bukhari and Muslim].","language":"english"},{"text":"Setiap kali Rasulullah (ﷺ) pergi tidur, beliau meniup tangannya membaca Al-Mu\u0027awwidhat; dan melewati tangannya di atas tubuhnya. [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"\u0027A ishah (May Allah be pleased with her) reported:","language":"english"},{"text":"\u0027A ishah (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"1462","hadith_id":"riyadussalihin","text":[{"text":"وعن البراء بن عازب رضي الله عنهما، قال‏:‏ قال لي رسول الله صلى الله عليه وسلم‏:‏ ‏ \"‏إذا أتيت مضجعك فتوضأ وضوءك للصلاة، ثم اضطجع على شقك الأيمن، وقل‏:‏ اللهم أسلمت نفسي إليك، ووجهت وجهي إليك وفوضت أمري إليك، وألجأت ظهري إليك رغبة ورهبة إليك لا ملجأ ولا منجا منك إلا إليك آمنت بكتابك الذي أنزلت، وبنبيك الذي أرسلت، فإن مت، مت على الفطرة، واجعلهن آخر ما تقول‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"Whenever you intend to go to bed, perform Wudu\u0027 as is done for Salat (prayer); and then lie down on the right side and recite: \u0027Allahumma aslamtu nafsi ilaika, wa fawwadtu amri ilaika, wal-ja\u0027tu zahri ilaika, raghbatan wa rahbatan ilaika, la malja\u0027a wa la manja minka illa ilaika, amantu bikitabik-alladhi anzalta, wa binabiyyik-alladhi arsalta [O Allah! I have submitted myself to You. I have turned my face to You, entrusted my affairs to You and relied completely on You out of desire for and fear of You (expecting Your reward and fearing Your punishment). There is no resort and no deliverer from (hardships) except You. I affirm my faith in Your Book which You have revealed, and in Your Prophet whom You have sent].\u0027 If you die during the night, you will die in the true religion. Let these words be your last words at night.\" [Al- Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Setiap kali Anda ingin pergi tidur, berwudhu\u0027 seperti yang dilakukan untuk salat; dan kemudian berbaring di sisi kanan dan membaca: \u0027Allahumma aslamtu nafsi ilaika, wa fawwadtu amri ilaika, wal-ja\u0027tu zahri ilaika, raghbatan wa rahbatan ilaika, la malja\u0027a wa la manja minka illa ilaika, amantu bikitabik-alladhi anzalta, wa binabiyyik-alladhi arsalta [Ya Allah, aku telah menyerahkan diriku kepada-Mu. menghadapkan wajahku kepada-Mu, mempercayakan urusanku kepada-Mu, dan bersandar sepenuhnya kepada-Mu karena keinginan dan takut kepada-Mu (mengharap pahala-Mu dan takut akan hukuman-Mu). Tidak ada tempat berlindung dan tidak ada pembebas dari (kesulitan) kecuali Engkau. Aku tegaskan imanku kepada Kitab-Mu yang telah Engkau turunkan, dan kepada Nabi-Mu yang telah Engkau utus].\u0027 Jika Anda mati di malam hari, Anda akan mati dalam agama yang benar. Biarlah kata-kata ini menjadi kata-kata terakhirmu di malam hari.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Al-Bara\u0027 bin \u0027Azib (May Allah be pleased with them) reported:","language":"english"},{"text":"Al-Bara\u0027 bin \u0027Azib r.a. melaporkan:","language":"bahasa"}]},{"index":"1463","hadith_id":"riyadussalihin","text":[{"text":"وعن أنس رضي الله عنه، أن النبي صلى الله عليه وسلم، كان إذا أوى فراشه قال‏:‏ ‏ \"‏الحمد لله الذي أطعمنا وسقانا، وكفانا وآوانا، فكم ممن لا كافي له ولا مئوي‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"Whenever the Prophet (ﷺ) went to his bed, he would say: \"Al-hamdu lillah-illadhi at\u0027amana wa saqana, wa kafana wa awana, fakam mimman la kafiya lahu wa la mu\u0027wiya (Praise is due to Allah Who has fed us, provided us drink, satisfied us and gave us protection. Many are those who have no one to provide for them, or give them shelter).\" [Muslim].","language":"english"},{"text":"Setiap kali Nabi (ﷺ) pergi ke tempat tidurnya, dia akan mengatakan: \"Al-hamdu lillah-illadhi at\u0027amana wa saqana, wa kafana wa awana, fakam mimman la kafiya lahu wa la mu\u0027wiya (Segala puji bagi Allah yang telah memberi kami makan, memberi kami minum, memuaskan kami, dan memberi kami perlindungan. Banyak dari mereka yang tidak memiliki siapa pun untuk menyediakan bagi mereka, atau memberi mereka perlindungan).\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Anas (May Allah be pleased with him) reported:","language":"english"},{"text":"Anas (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"1464","hadith_id":"riyadussalihin","text":[{"text":"وعن حذيفة رضي الله عنه أن رسول الله صلى الله عليه وسلم، كان إذا أراد أن يرقد وضع يده اليمنى تحت خده، ثم يقول‏:‏ ‏ \"‏اللهم قني عذابك يوم تبعث عبادك‏\"‏‏.‏ ‏(‏‏(‏رواه الترمذي وقال حديث حسن ورواه أبو داود من رواية حفصة رضي الله عنه وفيه أنه كان يقوله ثلاث مرات‏)‏‏)‏‏.‏","language":"arabic"},{"text":"Whenever the Messenger of Allah (ﷺ) intended to go to sleep, he would place his right hand under his (right) cheek and supplicate: \"Allahumma qini \u0027adhabaka yauma tab\u0027athu \u0027ibadaka (O Allah! Guard me against Your punishment on the Day when You will resurrect Your slaves).\" [At-Tirmidhi]. In a narration in Abu Dawud, Hafsah (May Allah be pleased with her) said: Before going to sleep the Messenger of Allah (ﷺ) would recite this Du\u0027a three times.","language":"english"},{"text":"Setiap kali Rasulullah (ﷺ) hendak tidur, beliau meletakkan tangan kanannya di bawah pipi (kanan) dan berdoa: “Allahumma qini \u0027adhabaka yauma tab\u0027athu \u0027ibadaka (Ya Allah! Jagalah aku dari hukuman-Mu di hari ketika Engkau membangkitkan hamba-hamba-Mu). [At-Tirmidzi] . Dalam sebuah riwayat di Abu Dawud, Hafsah (semoga Allah meridhoinya) berkata: Sebelum tidur Rasulullah (ﷺ) membaca doa ini tiga kali.","language":"bahasa"}],"narrated":[{"text":"Hudhaifah (May Allah be pleased with him) reported:","language":"english"},{"text":"Hudzaifah r.a. melaporkan:","language":"bahasa"}]}]