[{"index":"680","hadith_id":"riyadussalihin","text":[{"text":"وعن ابن عمر رضي الله عنهما أن رسول الله صلى الله عليه وسلم مر على رجل من الأنصار وهو يعظ أخاه في الحياء، فقال رسول الله صلى الله عليه وسلم‏:‏ \"دعه فإن الحياء من الإيمان\" ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏","language":"arabic"},{"text":"Messenger of Allah (ﷺ) passed by a man of the Ansar who was admonishing his brother regarding shyness. Messenger of Allah (ﷺ) said, \"Leave him alone, for modesty is a part of Iman.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) melewati seorang pria Ansar yang sedang menasihati saudaranya tentang rasa malu. Rasulullah (ﷺ) berkata, \"Biarkan dia sendiri, karena kerendahan hati adalah bagian dari Iman.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Ibn \u0027Umar (May Allah be pleased with them) reported:","language":"english"},{"text":"Ibnu \u0027Umar radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"681","hadith_id":"riyadussalihin","text":[{"text":"وعن عمران بن حصين، رضي الله عنهما، قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ “ الحياء لا يأتى إلا بخير” ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏ وفي رواية لمسلم” ‏ \"‏الحياءه خير كله”أوقال‏:‏ “الحياء كله خير‏\"‏‏.‏","language":"arabic"},{"text":"Messenger of Allah (ﷺ) said, \"Shyness does not bring anything except good.\" [Al-Bukhari and Muslim]. In a narration of Muslim: Messenger of Allah (ﷺ) said, \"All of shyness is good.\"","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Rasa malu tidak membawa apa-apa kecuali kebaikan.\" [Al-Bukhari dan Muslim] . Dalam riwayat Muslim: Rasulullah (ﷺ) berkata, \"Semua rasa malu itu baik.\"","language":"bahasa"}],"narrated":[{"text":"\u0027Imran bin Husain (May Allah be pleased with them) reported:","language":"english"},{"text":"\u0027Imran bin Husain r.a. melaporkan:","language":"bahasa"}]},{"index":"682","hadith_id":"riyadussalihin","text":[{"text":"-وعن أبى هريرة رضي الله عنه، أن رسول الله صلى الله عليه وسلم قال‏:‏ “الإيمان بضع وسبعون، أو بضع وستون شعبة، فأفضلها قول لا إله إلا الله، وأدناها إماطة الأذى عن الطريق، والحياء شعبة من الإيمان” ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏","language":"arabic"},{"text":"Messenger of Allah (ﷺ) said, \"Iman has sixty odd or seventy odd branches. The uppermost of all these is the Testimony of Faith: \u0027La ilaha illallah\u0027 (there is no true god except Allah) while the least of them is the removal of harmful object from the road. And shyness is a branch of Iman.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Iman memiliki enam puluh cabang ganjil atau tujuh puluh cabang ganjil. Yang paling atas dari semuanya adalah Kesaksian Iman: \u0027La ilaha illallah\u0027 (tidak ada Tuhan yang benar selain Allah) sedangkan yang paling kecil adalah yang menghilangkan benda berbahaya dari jalan. Dan rasa malu adalah cabang dari Iman.” [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"683","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي سعيد الخدري رضي الله عنه، قال‏:‏ كان رسول الله صلى الله عليه وسلم أشد حياء من العذراء في خدرها، فإذا رأى شيئياً يكرهه عرفناه في وجهه‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏","language":"arabic"},{"text":"Messenger of Allah (ﷺ) was even shier than a virgin behind her veil. When he saw something which he disliked, we could perceive it on his face. [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) bahkan lebih berkilau dari seorang perawan di balik cadarnya. Ketika dia melihat sesuatu yang dia tidak suka, kita bisa melihatnya di wajahnya. [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Sa\u0027id Al-Khudri (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Sa\u0027id Al-Khudri r.a. melaporkan:","language":"bahasa"}]},{"index":"684","hadith_id":"riyadussalihin","text":[{"text":"عن أبى سعيد الخدرى رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏ \"‏إن من شر الناس عند الله منزلة يوم القيامة الرجل يفضي إلى المرأة وتفضي إليه ثم ينشر سرها‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"Messenger of Allah (ﷺ) said, \"The most evil of the people to Allah on the Day of Resurrection will be the man who consorts with his wife and then publicizes her secret.\" [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, \"Orang yang paling jahat di sisi Allah pada hari kiamat adalah laki-laki yang bergaul dengan istrinya dan kemudian mengumumkan rahasianya.\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Sa\u0027id Al-Khudri (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Sa\u0027id Al-Khudri r.a. melaporkan:","language":"bahasa"}]},{"index":"685","hadith_id":"riyadussalihin","text":[{"text":"وعن عبد الله بن عمر رضي الله عنهما أن عمر رضي الله عنه حين تأيمت بنته حفصة قال‏:‏ لقيت عثمان بن عفان رضي الله عنه ، فعرضت عليه حفصة فقلت‏:‏ إن شئت أنكحتك حفصة بنت عمر‏؟‏ قال‏:‏ سأنظر في أمري‏.‏ فلبثت ليالي، ثم لقيني فقال ‎‏:‏ قد بدا لي أن لا أتزوج يومي هذا‏.‏ فلقيت أبا بكر الصديق رضي الله عنه، فلم يرجع إلى شيئاً‏!‏ فكنت عليه أوجد مني على عثمان، فلبثت ليالي، ثم خطبها النبي صلى الله عليه وسلم، فأنكحتها إياه‏.‏ فلقيني أبو بكر فقال‏:‏ لعلك وجدت حين عرضت على حفصة فلم أرجع إليك شيئاً‏؟‏ فقلت‏:‏ نعم‏.‏ قال‏:‏ فإنه لم يمنعني أن أرجع إليك فيما عرضت على إلا أني كنت علمت أن النبي صلى الله عليه وسلم ذكرها، فلم أكن لأفشي سر رسول الله صلى الله عليه وسلم، ولوتركها النبى صلى الله عليه وسلم لقبلتها ‏.‏ ‏(‏‏(‏رواه البخارى‏)‏‏)‏‏.‏","language":"arabic"},{"text":"My father \u0027Umar (May Allah be pleased with him) said: When (his daughter) Hafsah (May Allah be pleased with her) became a widow, I met \u0027Uthman bin \u0027Affan (May Allah be pleased with him) and offered Hafsah for marriage to him. \u0027Uthman said: \"I shall think over the matter.\" I waited for a few days and then \u0027Uthman met me and said: \"It occurred to me that I should not marry at present.\" Then I met Abu Bakr (May Allah be pleased with him) and said to him: \"If you are willing, I shall marry my daughter Hafsah to you.\" Abu Bakr (May Allah be pleased with him) remained silent and did not utter any word to me in reply. I grew more angry with him than with \u0027Uthman. I had waited for only a few days when Messenger of Allah (ﷺ) asked for her hand in marriage and I married her to him. Thereafter, I met Abu Bakr (May Allah be pleased with him) who said, \"Perhaps you were angry with me when you offered Hafsah to me and I said nothing in reply.\" I said, \"Yes, that is so.\" He said, \"Nothing stopped me to respond to your offer except that I knew that Messenger of Allah (ﷺ) had mentioned her and I could not disclose the secret of Messenger of Allah (ﷺ). Had Messenger of Allah (ﷺ) left her, I would have accepted her.\" [Al-Bukhari].","language":"english"},{"text":"Ayah saya \u0027Umar (ra dengan dia) berkata: Ketika (putrinya) Hafsah (ra dengan dia) menjadi janda, saya bertemu \u0027Utsman bin \u0027Affan (ra dengan dia) dan menawarkan Hafsah untuk menikah dengannya. \u0027Utsman berkata: \"Saya akan memikirkan masalah ini.\" Saya menunggu selama beberapa hari dan kemudian \u0027Utsman menemui saya dan berkata: \"Terpikir oleh saya bahwa saya tidak boleh menikah saat ini.\" Kemudian saya bertemu Abu Bakar (semoga Allah meridhoinya) dan berkata kepadanya: \"Jika Anda bersedia, saya akan menikahkan putri saya Hafsah dengan Anda.\" Abu Bakar (semoga Allah senang dengan dia) tetap diam dan tidak mengucapkan sepatah kata pun kepada saya sebagai jawaban. Aku semakin marah padanya daripada dengan \u0027Utsman. Saya telah menunggu hanya beberapa hari ketika Rasulullah (ﷺ) meminta tangannya untuk menikah dan saya menikahinya dengan dia. Kemudian, Saya bertemu Abu Bakar (semoga Allah meridhoinya) yang berkata, \"Mungkin Anda marah kepada saya ketika Anda menawarkan Hafsah kepada saya dan saya tidak menjawab apa-apa.\" Saya berkata, \"Ya, begitulah.\" Dia berkata, \"Tidak ada yang menghentikan saya untuk menanggapi tawaran Anda kecuali bahwa saya tahu bahwa Rasulullah (ﷺ) telah menyebutkannya dan saya tidak bisa mengungkapkan rahasia Rasulullah (ﷺ). Seandainya Rasulullah (ﷺ) meninggalkannya , aku akan menerimanya.\" [Al-Bukhari] .","language":"bahasa"}],"narrated":[{"text":"\u0027Abdullah bin \u0027Umar (May Allah be pleased with them) reported:","language":"english"},{"text":"\u0027Abdullah bin \u0027Umar (semoga Allah meridhoi mereka) melaporkan:","language":"bahasa"}]},{"index":"686","hadith_id":"riyadussalihin","text":[{"text":"وعن عائشة رضي الله عنها قالت‏:‏ كن أزواج النبى صلى الله عليه وسلم عنده، فأقبلت فاطمة رضي الله عنها تمشى، ما تخطئ من مشية رسول الله صلى الله عليه وسلم شيئاً، فلما رآها رحب بها وقال‏:‏ “مرحباً بابنتى” ثم أجلسها عن يمينه أو عن شماله، ثم سارها فبكت بكاء شديداً، فلما رأى جزعها سارها الثانية فضحكت، فقلت لها‏:‏ خصك رسول الله صلى الله عليه وسلم من بين نسائه بالسرار، ثم أنت تبكين ‏!‏ فلما قام رسول الله صلى الله عليه وسلم سألتها‏:‏ ما قال لك رسول الله صلى الله عليه وسلم ‏؟‏ قالت‏:‏ ما كنت لأفشي على رسول الله صلى الله عليه وسلم سره‏.‏ فلما توفي رسول الله صلى الله عليه وسلم قلت‏:‏ عزمت عليك بما لي عليك من الحق، لما حدثتني ما قال لك رسول الله صلى الله عليه وسلم‏؟‏ فقالت‏:‏ أما الآن فنعم، أما حين سارني في المرة الأولى فأخبرني “أن جبريل كان يعارضه القرآن في كل سنة مرة أو مرتين، وأنه عارضه الآن مرتين، وإني لا أرى الأجل إلا قد اقترب، فاتقى الله واصبرى، فغنه نعم السلف أنا لك” فبكيت بكائى الذى رأيت‏.‏ فلما رأى جزعى سارنى الثانية، فقال‏:‏ ‏ \"‏يا فاطمة أما ترضين أن تكونى سيدة نساء المؤمنين، أو سيدة نساء هذه الأمة” فضحكت ضحكى الذى رأيت‏\"‏‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏(‏‏(‏وهذا لفظ مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"On one occasion all the wives of the Prophet (ﷺ) were with him when his daughter, Fatimah (May Allah be pleased with her) who walked after the style of her father, came there. He (ﷺ) welcomed her saying, \"Welcome, O my daughter\", and made her sit on his right side, or on his left side and then whispered something to her at which she wept bitterly. When he perceived her grief, he talked secretly to her again and she smiled (with happiness). I said to her: \"Messenger of Allah (ﷺ chose you from amongst all his wives to speak secretly to you and yet you cried.\" When he left, I asked her, \"What did Messenger of Allah (ﷺ) say to you?\" She said, \"I will not divulge the secret of Messenger of Allah (ﷺ).\" When Messenger of Allah (ﷺ) passed away, I said to her: \"I adjure you by the right I have in respect of you to tell me what Messenger of Allah (ﷺ) had told you.\" She said: \"Now (when Messenger of Allah (ﷺ) has died), I will tell you. When he whispered to me the first time, he told me, \u0027Jibril (Gabriel) used to listen to my recitation of the Qur\u0027an and then recite it back to me once or twice a year, and this time he has done it twice; and so I perceive that my death is approaching. Then be mindful of your duty to Allah and be patient and steadfast, for I shall be an excellent predecessor for you.\u0027 On this I wept as you saw. When he perceived my distress he talked to me secretly the second time and said, \u0027O Fatimah, are you not pleased that you will be the chief among the believing women or of this Ummah?\u0027 This made me smile as you saw.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Pada suatu kesempatan semua istri Nabi (ﷺ) bersamanya ketika putrinya, Fatimah (ra dengan dia) yang berjalan mengikuti gaya ayahnya, datang ke sana. Dia (ﷺ) menyambutnya dengan mengatakan, \"Selamat datang, putriku\", dan membuatnya duduk di sisi kanannya, atau di sisi kirinya dan kemudian membisikkan sesuatu padanya di mana dia menangis dengan sedih. Ketika dia merasakan kesedihannya, dia berbicara diam-diam padanya lagi dan dia tersenyum (dengan kebahagiaan). Aku berkata kepadanya: \"Rasulullah (ﷺ memilihmu di antara semua istrinya untuk berbicara diam-diam kepadamu, namun kamu menangis.\" Ketika dia pergi, aku bertanya padanya, \"Apa yang dikatakan Rasulullah (ﷺ) kepadamu? Dia berkata, \"Saya tidak akan membocorkan rahasia Rasulullah (ﷺ).\" Ketika Rasulullah (ﷺ) meninggal, saya berkata kepadanya: \" Saya meminta Anda dengan hak yang saya miliki sehubungan dengan Anda untuk memberi tahu saya apa yang telah dikatakan Rasulullah () kepada Anda.\" Dia berkata: \"Sekarang (ketika Rasulullah (ﷺ) telah meninggal), saya akan memberi tahu Anda. Ketika dia berbisik kepada saya pertama kali, dia mengatakan kepada saya, \u0027Jibril (Jibril) biasa mendengarkan bacaan Al-Qur\u0027an saya dan kemudian membacakannya kembali kepada saya sekali atau dua kali setahun, dan kali ini dia melakukannya dua kali. ; dan jadi saya melihat bahwa kematian saya semakin dekat. Maka ingatlah kewajibanmu kepada Allah dan bersabarlah dan tabahlah, karena aku akan menjadi pendahulu yang baik bagimu.\u0027 Tentang ini aku menangis seperti yang kamu lihat. Ketika dia merasakan kesusahan saya, dia berbicara kepada saya secara diam-diam untuk kedua kalinya dan berkata, \u0027Wahai Fatimah, apakah kamu tidak senang bahwa kamu akan menjadi pemimpin di antara wanita yang beriman atau dari umat ini?\u0027 Ini membuatku tersenyum seperti yang kamu lihat.\" Dia berkata: \"Sekarang (ketika Rasulullah (ﷺ) telah meninggal), saya akan memberitahu Anda. Ketika dia berbisik kepada saya untuk pertama kalinya, dia mengatakan kepada saya, \u0027Jibril (Jibril) biasa mendengarkan bacaan Al-Qur\u0027an saya\u0027 dan kemudian membacakannya kembali kepadaku sekali atau dua kali setahun, dan kali ini dia melakukannya dua kali, dan aku melihat bahwa kematianku sudah dekat. Maka bertakwalah kepada Allah dan bersabar dan tabah, karena aku akan menjadi pendahulu yang sangat baik bagi Anda.\u0027 Tentang hal ini aku menangis seperti yang kamu lihat. Ketika dia merasakan kesusahanku, dia berbicara kepadaku secara rahasia untuk kedua kalinya dan berkata, \u0027Wahai Fatimah, apakah kamu tidak senang bahwa kamu akan menjadi pemimpin di antara wanita-wanita yang beriman atau umat ini?\u0027 Ini membuatku tersenyum seperti yang kamu lihat.\" Dia berkata: \"Sekarang (ketika Rasulullah (ﷺ) telah meninggal), saya akan memberitahu Anda. Ketika dia berbisik kepada saya untuk pertama kalinya, dia mengatakan kepada saya, \u0027Jibril (Jibril) biasa mendengarkan bacaan Al-Qur\u0027an saya\u0027 dan kemudian membacakannya kembali kepadaku sekali atau dua kali setahun, dan kali ini dia melakukannya dua kali, dan aku melihat bahwa kematianku sudah dekat. Maka bertakwalah kepada Allah dan bersabar dan tabah, karena aku akan menjadi pendahulu yang sangat baik bagi Anda.\u0027 Tentang hal ini aku menangis seperti yang kamu lihat. Ketika dia merasakan kesusahanku, dia berbicara kepadaku secara rahasia untuk kedua kalinya dan berkata, \u0027Wahai Fatimah, apakah kamu tidak senang bahwa kamu akan menjadi pemimpin di antara wanita-wanita yang beriman atau umat ini?\u0027 Ini membuatku tersenyum seperti yang kamu lihat.\" Jibril (Jibril) biasa mendengarkan bacaan Al-Qur\u0027an saya dan kemudian membacakannya kembali kepada saya sekali atau dua kali setahun, dan kali ini dia melakukannya dua kali; dan jadi saya melihat bahwa kematian saya semakin dekat. Maka ingatlah kewajibanmu kepada Allah dan bersabarlah dan tabahlah, karena aku akan menjadi pendahulu yang baik bagimu.\u0027 Tentang ini aku menangis seperti yang kamu lihat. Ketika dia merasakan kesusahan saya, dia berbicara kepada saya secara diam-diam untuk kedua kalinya dan berkata, \u0027Wahai Fatimah, apakah kamu tidak senang bahwa kamu akan menjadi pemimpin di antara wanita yang beriman atau dari umat ini?\u0027 Ini membuatku tersenyum seperti yang kamu lihat.\" Jibril (Jibril) biasa mendengarkan bacaan Al-Qur\u0027an saya dan kemudian membacakannya kembali kepada saya sekali atau dua kali setahun, dan kali ini dia melakukannya dua kali; dan jadi saya melihat bahwa kematian saya semakin dekat. Maka ingatlah kewajibanmu kepada Allah dan bersabarlah dan tabahlah, karena aku akan menjadi pendahulu yang baik bagimu.\u0027 Tentang ini aku menangis seperti yang kamu lihat. Ketika dia merasakan kesusahan saya, dia berbicara kepada saya secara diam-diam untuk kedua kalinya dan berkata, \u0027Wahai Fatimah, apakah kamu tidak senang bahwa kamu akan menjadi pemimpin di antara wanita yang beriman atau dari umat ini?\u0027 Ini membuatku tersenyum seperti yang kamu lihat.\" Maka ingatlah kewajibanmu kepada Allah dan bersabarlah dan tabahlah, karena aku akan menjadi pendahulu yang baik bagimu.\u0027 Tentang ini aku menangis seperti yang kamu lihat. Ketika dia merasakan kesusahan saya, dia berbicara kepada saya secara diam-diam untuk kedua kalinya dan berkata, \u0027Wahai Fatimah, apakah kamu tidak senang bahwa kamu akan menjadi pemimpin di antara wanita yang beriman atau dari umat ini?\u0027 Ini membuatku tersenyum seperti yang kamu lihat.\" Maka ingatlah kewajibanmu kepada Allah dan bersabarlah dan tabahlah, karena aku akan menjadi pendahulu yang baik bagimu.\u0027 Tentang ini aku menangis seperti yang kamu lihat. Ketika dia merasakan kesusahan saya, dia berbicara kepada saya secara diam-diam untuk kedua kalinya dan berkata, \u0027Wahai Fatimah, apakah kamu tidak senang bahwa kamu akan menjadi pemimpin di antara wanita yang beriman atau dari umat ini?\u0027 Ini membuatku tersenyum seperti yang kamu lihat.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"\u0027Aishah (May Allah be pleased with her) reported:","language":"english"},{"text":"\u0027Aisyah r.a. melaporkan:","language":"bahasa"}]},{"index":"687","hadith_id":"riyadussalihin","text":[{"text":"وعن ثابت عن أنس، رضي الله عنه قال‏:‏ أتى على رسول الله صلى الله عليه وسلم وأنا ألعب مع الغلمان، فسلم علينا، فبعثنى في حاجةٍ، فأبطأت على أمي‏.‏ فلما جئت قالت‏:‏ ما حبسك‏؟‏ فقلت‏:‏ بعثنى رسول الله صلى الله عليه وسلم لحاجة، قالت‏:‏ ما حاجته‏؟‏ قلت‏:‏ إنها سر‏.‏قالت‏:‏ لا تخبرن بسر رسول الله صلى الله عليه وسلم أحداً‏.‏ قال أنس‏:‏ والله لو حدثت به أحداً لحدثتك به يا ثابت‏.‏ ‏(‏‏(‏رواه مسلم، وروى البخارى بعضه مختصراً‏)‏‏)‏‏.‏","language":"arabic"},{"text":"Anas (May Allah be pleased with him) said: Messenger of Allah (ﷺ) came to me while I was playing with the boys. He greeted us and sent me on an errand. This delayed my return to my mother. When I came to her, she asked, \"What detained you?\" I said; \"Messenger of Allah (ﷺ) sent me on an errand.\" She asked, \"What was it?\" I said, \"It is a secret.\" My mother said; \"Do not disclose to anyone the secret of Messenger of Allah (ﷺ).\" Anas (May Allah be pleased with him) said to Thabit (May Allah be pleased with him): By Allah, were I to tell it to anyone I would have told you. [Muslim].","language":"english"},{"text":"Anas r.a. berkata: Rasulullah (ﷺ) datang kepadaku ketika aku sedang bermain dengan anak laki-laki. Dia menyapa kami dan mengirim saya untuk suatu tugas. Ini menunda kembalinya saya ke ibu saya. Ketika saya datang kepadanya, dia bertanya, \"Apa yang menahanmu?\" Saya bilang; \"Rasulullah (ﷺ) mengirim saya untuk suatu tugas.\" Dia bertanya, \"Apa itu?\" Saya berkata, \"Itu rahasia.\" Ibu saya berkata; \"Jangan mengungkapkan kepada siapa pun rahasia Rasulullah (ﷺ).\" Anas (semoga Allah meridhoinya) berkata kepada Tsabit (semoga Allah meridhoinya): Demi Allah, seandainya aku menceritakannya kepada siapa pun, aku akan memberitahumu. [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Thabit (May Allah be pleased with him) reported:","language":"english"},{"text":"Tsabit (ra dengan dia) melaporkan:","language":"bahasa"}]},{"index":"688","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي هريرة رضي الله عنه ، أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏\"‏آية المنافق ثلاث‏:‏ إذا حدث كذب، وإذا وعد أخلف، وإذا اؤتمن خان‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏ زاد في ‏(‏‏(‏رواية لمسلم‏)‏‏)‏‏:‏ ‏\"‏وإن صام وصلى وزعم أنه مسلم‏\"‏‏.‏","language":"arabic"},{"text":"Messenger of Allah (ﷺ) said, \"Three are the signs of a hypocrite: When he speaks, he lies; when he makes a promise, he breaks it; and when he is trusted, he betrays his trust.\" [Al-Bukhari and Muslim]. Another narration adds the words: \"Even if he observes Saum (fasts), performs Salat (prayer) and claims to be a Muslim.\"","language":"english"},{"text":"Rasulullah bersabda, “Tanda orang munafik ada tiga: jika berbicara ia berdusta, jika berjanji ia mengingkari, dan jika dipercaya ia berkhianat”. [Al-Bukhari dan Muslim] . Narasi lain menambahkan kata-kata: \"Bahkan jika dia menjalankan Saum (puasa), melakukan Salat (shalat) dan mengaku sebagai seorang Muslim.\"","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"689","hadith_id":"riyadussalihin","text":[{"text":"وعن عبد الله بن عمرو بن العاص رضي الله عنهما، أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏ \"‏أربع من كن فيه كان منافقا خالصاً‏.‏ ومن كانت فيه خصلة منهن كانت فيه خصلة من النفاق حتى يدعها ‏:‏ إذا اؤتمن خان ، وإذا حدث كذب، وإذا عاهد غدر، وإذا خاصم فجر‏\"‏‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"Four are the qualities which, when found in a person, make him a sheer hypocrite, and one who possesses one of them, possesses one characteristic of hypocrisy until he abandons it. These are: When he is entrusted with something, he betrays trust; when he speaks, he lies; when he promises, he acts treacherously; and when he argues, he behaves in a very imprudent, insulting manner.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, “Empat sifat yang jika ditemukan pada seseorang, membuatnya menjadi munafik belaka, dan orang yang memiliki salah satunya, memiliki salah satu sifat kemunafikan sampai ia meninggalkannya. Ini adalah: Ketika dia dipercayakan sesuatu, dia mengkhianati kepercayaan; ketika dia berbicara, dia berbohong; ketika dia berjanji, dia bertindak curang; dan ketika dia berdebat, dia berperilaku dengan cara yang sangat tidak bijaksana dan menghina.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"\u0027Abdullah bin \u0027Amr bin Al-\u0027as (May Allah be pleased with him) reported:","language":"english"},{"text":"\u0027Abdullah bin \u0027Amr bin Al-\u0027as (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"690","hadith_id":"riyadussalihin","text":[{"text":"وعن جابر رضي الله عنه قال‏:‏ قال لي النبى صلى الله عليه وسلم‏:‏ ‏ \"‏لو قد جاء مال البحرين أعطيتك هكذا وهكذا وهكذا‏\"‏ فلم يجئ مال البحرين حتى قبض النبى صلى الله عليه وسلم، فلما جاء مال البحرين أمر أبو بكر رضي الله عنه فنادي‏:‏ من كان له عند رسول صلى الله عليه وسلم عدة أو دين فليأتنا‏.‏ فأتيته وقلت له‏:‏ إن النبى صلى الله عليه وسلم قال لى كذا وكذا، فحثى لى حثية، فعددتها، فإذا هى خمسمائة، فقال لى‏:‏ خذ مثلها‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏","language":"arabic"},{"text":"The Prophet (ﷺ) said to me, \"When the revenues of Bahrain will arrive, I shall give you such and such and such.\" He passed away before the revenues were received. When they arrive during the caliphate of Abu Bakr (May Allah be pleased with him), he ordered to be announced: \"Anyone whom Messenger of Allah (ﷺ) promised or owed anything, should come to him.\" I went to him and said: \"Messenger of Allah (ﷺ) had said to me such and such.\" He took a double handful out of the money and gave it to me. I counted it and found that it was five hundred dirham. Then Abu Bakr (May Allah be pleased with him) said to me: \"Take twice as much more of that amount.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Nabi (ﷺ) berkata kepadaku, \"Ketika pendapatan Bahrain akan tiba, aku akan memberimu ini dan itu dan itu.\" Dia meninggal sebelum pendapatan diterima. Ketika mereka tiba pada masa kekhalifahan Abu Bakar (ra dengan dia), dia memerintahkan untuk diumumkan: \"Siapa pun yang dijanjikan atau berhutang apa pun oleh Rasulullah (), harus datang kepadanya.\" Aku pergi kepadanya dan berkata: \"Rasulullah (ﷺ) telah mengatakan kepadaku ini dan itu.\" Dia mengambil dua genggam dari uang itu dan memberikannya kepada saya. Saya menghitungnya dan menemukan bahwa itu adalah lima ratus dirham. Kemudian Abu Bakar (semoga Allah meridhoinya) berkata kepadaku: \"Ambillah dua kali lebih banyak dari jumlah itu.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Jabir (May Allah be pleased with him) reported:","language":"english"},{"text":"Jabir (ra dengan dia) melaporkan:","language":"bahasa"}]},{"index":"691","hadith_id":"riyadussalihin","text":[{"text":"وعن عبد الله بن عمرو بن العاص رضي الله عنهما قال‏:‏ قال لي رسول الله صلى الله عليه وسلم‏:‏ يا عبد الله ، لا تكن مثل فلان، كان يقوم الليل فترك قيام الليل ‏!‏‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏","language":"arabic"},{"text":"Messenger of Allah (ﷺ) said to me, \"O \u0027Abdullah! Do not be like so-and-so; he used to get up at night for optional prayer but abandoned it later.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata kepadaku, \"O \u0027Abdullah! Jangan seperti fulan; dia biasa bangun di malam hari untuk salat sunnah tetapi kemudian meninggalkannya.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"\u0027Abdullah bin \u0027Amr bin Al-\u0027as (May Allah be pleased with him) reported:","language":"english"},{"text":"\u0027Abdullah bin \u0027Amr bin Al-\u0027as (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"692","hadith_id":"riyadussalihin","text":[{"text":"عن عدي بن حاتم رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏ \"‏اتقوا النار ولو بشق تمرة فمن لم يجد فبكلمة طيبة‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏","language":"arabic"},{"text":"Messenger of Allah (ﷺ) said, \"Guard yourselves against the Fire (of Hell) even if it be only with half a date-fruit (given in charity); and if you cannot afford even that, you should at least say a good word.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, “Jagalah dirimu dari api (Neraka) meskipun hanya dengan setengah buah kurma (disediakan); dan jika kamu tidak mampu, setidaknya kamu harus mengucapkan kata-kata yang baik. kata.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"\u0027Adi bin Hatim (May Allah be pleased with him) reported:","language":"english"},{"text":"\u0027Adi bin Hatim (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"693","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي هريرة أن النبي صلى الله عليه وسلم قال‏:‏ ‏ \"‏والكلمة الطيبة صدقة‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ وهو بعض حديث تقدم بطوله‏.‏","language":"arabic"},{"text":"The Prophet (ﷺ) said, \"It is also charity to utter a good word.\" [Al- Bukhari and Muslim]. It is part of a narration that has preceded in its entirety.","language":"english"},{"text":"Nabi (ﷺ) berkata, \"Ini juga sedekah untuk mengucapkan kata yang baik.\" [Al-Bukhari dan Muslim] . Ini adalah bagian dari narasi yang telah mendahului secara keseluruhan.","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"694","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي ذر رضي الله عنه قال‏:‏ قال لي رسول الله صلى الله عليه وسلم ‏:‏ ‏ \"‏لا تحقرن من المعروف شيئاً، ولو أن تلقى أخاك بوجه طلق‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"Messenger of Allah (ﷺ) said, \"Do not disdain a good deed, (no matter how small it may seem) even if it is your meeting with your (Muslim) brother with a cheerful face.\" [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, “Jangan meremehkan suatu kebaikan, (sekecil apapun kelihatannya) meskipun itu adalah pertemuanmu dengan saudaramu (Muslim) dengan wajah ceria.” [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Dharr (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Dzar radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"695","hadith_id":"riyadussalihin","text":[{"text":"عن أنس رضي الله عنه أن النبى صلى الله عليه وسلم كان إذا تكلم بكلمة أعادها ثلاثاً حتى تفهم عنه، وإذا أتى على قومٍ فسلم عليهم سلم عليهم ثلاثاً‏.‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","language":"arabic"},{"text":"Whenever the Prophet (ﷺ) said something, he would repeat his words thrice so that the meanings would be understood fully; and whenever he came upon a group of people, he would greet them, and he would repeat salutation thrice. [Al-Bukhari].","language":"english"},{"text":"Setiap kali Nabi (ﷺ) mengatakan sesuatu, dia akan mengulangi kata-katanya tiga kali sehingga artinya dapat dipahami sepenuhnya; dan setiap kali dia bertemu sekelompok orang, dia akan menyapa mereka, dan dia akan mengulangi salam tiga kali. [Al-Bukhari] .","language":"bahasa"}],"narrated":[{"text":"Anas (May Allah be pleased with him) reported:","language":"english"},{"text":"Anas (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"696","hadith_id":"riyadussalihin","text":[{"text":"وعن عائشة رضي الله عنها قالت‏:‏ كان كلام رسول الله صلى الله عليه وسلم كلاماً فصلاً يفهمه كل من يسمعه‏.‏ ‏(‏‏(‏رواه أبو داود‏)‏‏)‏‏.‏","language":"arabic"},{"text":"the speech of Messenger of Allah (ﷺ) was so clear that all those who listened to it would understand it. [Abu Dawud].","language":"english"},{"text":"Pidato Rasulullah (ﷺ) begitu jelas sehingga semua orang yang mendengarkannya akan memahaminya. [Abu Daud] .","language":"bahasa"}],"narrated":[{"text":"\u0027Aishah (May Allah be pleased with her) reported:","language":"english"},{"text":"\u0027Aisyah r.a. melaporkan:","language":"bahasa"}]},{"index":"697","hadith_id":"riyadussalihin","text":[{"text":"عن جرير بن عبد الله رضي الله عنه قال‏:‏ قال لي رسول الله صلى الله عليه وسلم في حجة الوداع‏:‏ ‏\"‏استنصت الناس‏\"‏ ثم قال‏:‏ لا ترجعوا بعدي كفاراً يضرب بعضكم رقاب بعض‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏","language":"arabic"},{"text":"Messenger of Allah (ﷺ) asked me on the occasion of the Farewell Pilgrimage to tell the people to keep silent, then he (ﷺ) said, \"Do not revert to disbelief after me, chopping the heads of one another.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) meminta saya pada kesempatan haji perpisahan untuk memberitahu orang-orang untuk tetap diam, kemudian dia () berkata, \"Jangan kembali ke kekafiran setelah saya, memenggal kepala satu sama lain.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Jarir bin \u0027Abdullah (May Allah be pleased with him) reported:","language":"english"},{"text":"Jarir bin \u0027Abdullah (ra dengan dia) melaporkan:","language":"bahasa"}]},{"index":"698","hadith_id":"riyadussalihin","text":[{"text":"عن أبى وائل شقيق بن سلمة قال‏:‏ كان ابن مسعود رضي الله عنه يذكرنا في كل خميس، فقال له رجل‏:‏ يا أبا عبد الرحمن، لوددت أنك ذكرتنا كل يوم، فقال‏:‏ أما إنه يمنعني من ذلك أني أكره أن أملكم وإني أتخولكم بالموعظة، كما كان رسول الله صلى الله عليه وسلم يتخولنا بها مخافة السآمة علينا‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏","language":"arabic"},{"text":"Ibn Mas\u0027ud (May Allah be pleased with him) used to preach to us once every Thursday. A man said to him: \"O Abu \u0027Abdur-Rahman, we love your talk and we wish that you preach us every day.\" He said: \"There is nothing to prevent me from doing so, but I don\u0027t lest I bore you. I follow the same method in preaching to you that Messenger of Allah (ﷺ) adopted in preaching to us for fear of boredom.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Ibnu Mas\u0027ud radhiyallahu \u0027anhu selalu berdakwah kepada kami setiap hari Kamis. Seorang pria berkata kepadanya: \"Wahai Abu \u0027Abdur-Rahman, kami menyukai pembicaraan Anda dan kami berharap Anda mengkhotbahkan kami setiap hari.\" Dia berkata: \"Tidak ada yang mencegah saya dari melakukannya, tapi saya tidak takut saya membuat Anda bosan. Saya mengikuti metode yang sama dalam berkhotbah kepada Anda bahwa Rasulullah (ﷺ) diadopsi dalam berkhotbah kepada kami karena takut bosan. \" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Shaqiq bin Salamah reported:","language":"english"},{"text":"Shaqiq bin Salamah melaporkan:","language":"bahasa"}]},{"index":"699","hadith_id":"riyadussalihin","text":[{"text":"وعن أبى اليقظان عمار بن ياسر رضي الله عنهما قال‏:‏ سمعت رسول الله صلى الله عليه وسلم يقول‏:‏ ‏ \"‏إن طول صلاة الرجل، وقصر خطبته، مئنة من فقهه، فأطيلوا الصلاة، وأقصروا الخطبة‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"I heard Messenger of Allah (ﷺ) saying, \"Prolonging Salat (prayer) and shortening the Khutbah (religious talk) indicate the religious knowledge of the person. Make your Salat long and your sermon short.\" [Muslim].","language":"english"},{"text":"Saya mendengar Rasulullah (ﷺ) berkata, \"Memperpanjang Salat (salat) dan memperpendek Khutbah (pembicaraan agama) menunjukkan pengetahuan agama orang tersebut. Perpanjanglah Salat Anda dan perpendek khotbah Anda.\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"\u0027Ammar bin Yasir (May Allah be pleased with them) reported:","language":"english"},{"text":"\u0027Ammar bin Yasir (semoga Allah meridhoi mereka) melaporkan:","language":"bahasa"}]},{"index":"700","hadith_id":"riyadussalihin","text":[{"text":"وعن معاوية بن الحكم السلمي رضي الله عنه قال‏:‏ ‏\"‏بينا أنا أصلي مع رسول الله صلى الله عليه وسلم ، إذا عطس رجل من القوم فقلت‏:‏ يرحمك الله، فرماني القوم بأبصارهم ‏!‏ فقلت‏:‏ واثكل أمياه ‏!‏ ما شأنكم تنظرون إلى‏؟‏ فجعلوا يضربون بأيديهم على أفخاذهم ‏!‏ فلما رأيتهم يصمتونني لكنى سكت‏.‏ فلما صلى رسول الله صلى الله عليه وسلم، فبأبي هو وأمي، ما رأيت معلما قبله ولا بعده أحسن تعليماً منه، فوالله ما كهرني ولا ضربني ولا شتمني، قال‏:‏ ‏\"‏إن هذه الصلاة لا يصلح فيها شئ من كلام الناس، إنما هى التسبيح والتكبير، وقراءة القرآن‏\"‏ أو كما قال رسول الله صلى الله عليه وسلم قلت‏:‏ يا رسول الله، إنى حديث عهد بجاهلية، وقد جاء الله بالإسلام، وإن منا رجالً يأتون الكهان‏؟‏ قال‏:‏ ‏\"‏فلا تأتهم، قلت‏:‏ ومنا رجال يتطيرون‏؟‏ قال‏:‏ ذاك شئ يجدونه في صدورهم، فلا يصدهم‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"While I was in Salat with Messenger of Allah (ﷺ), a man in the congregation sneezed and I responded with: \u0027Yarhamuk-Allah (Allah have mercy on you).\u0027 The people stared at me with disapproving looks. So I said: \"May my mother lose me. Why are you staring at me?\" Thereupon, they began to strike their thighs with their hands. When I saw them urging to me to remain silent, I became angry but restrained myself. When Messenger of Allah (ﷺ) concluded his Salat. I have never before seen an instructor who gave better instruction than he, may my father and mother be sacrificed for him. He neither remonstrated me, nor beat me, nor abused me. He simply said,\"It is not permissible to talk during Salat because it consists of glorifying Allah, declaring His Greatness as well as recitation of the Qur\u0027an,\" or he said words to that effect.\" I said: \"O Allah\u0027s Messenger, I have but recently accepted Islam, and Allah has favoured us with Islam. There are still some people among us who go to consult soothsayers.\" He said, \"Do not consult them.\" Then I said: \"There are some of us who are guided by omens.\" He said, \"These things which come to their minds. They should not be influenced by them.\" (Muslim).","language":"english"},{"text":"Ketika saya sedang shalat bersama Rasulullah (ﷺ), seorang laki-laki dalam jamaah bersin dan saya menjawab: \u0027Yarhamuk-Allah (Allah merahmatimu).\u0027 Orang-orang menatapku dengan tatapan tidak setuju. Jadi saya berkata: \"Semoga ibu saya kehilangan saya. Mengapa kamu menatapku?\" Setelah itu, mereka mulai memukul paha mereka dengan tangan mereka. Ketika saya melihat mereka mendesak saya untuk tetap diam, saya menjadi marah tetapi menahan diri. Ketika Rasulullah () mengakhiri shalatnya. Saya belum pernah melihat seorang instruktur yang memberikan instruksi lebih baik dari dia, semoga ayah dan ibu saya dikorbankan untuknya. Dia tidak memprotes saya, atau memukuli saya, atau melecehkan saya. Dia hanya berkata, \"Tidak boleh berbicara selama shalat karena itu terdiri dari mengagungkan Allah, menyatakan Kebesaran-Nya serta membaca Al-Qur\u0027an,\" atau dia mengucapkan kata-kata seperti itu.\" Saya berkata: \"Ya Rasulullah, saya baru saja menerima Islam, dan Allah telah memberi kami Islam. Masih ada beberapa orang di antara kita yang pergi untuk berkonsultasi dengan peramal.\" Dia berkata, \"Jangan berkonsultasi dengan mereka.\" Kemudian aku berkata: \"Ada beberapa dari kita yang dipandu oleh pertanda.\" Dia berkata, \"Hal-hal yang datang ke pikiran mereka. Mereka seharusnya tidak terpengaruh oleh mereka.\" (Muslim).","language":"bahasa"}],"narrated":[{"text":"Mu\u0027awiyah bin Al-Hakam As-Sulami (May Allah be pleased with him) reported:","language":"english"},{"text":"Mu\u0027awiyah bin Al-Hakam As-Sulami r.a. melaporkan:","language":"bahasa"}]},{"index":"701","hadith_id":"riyadussalihin","text":[{"text":"وعن العرباض بن سارية رضي الله عنه قال‏:‏ وعظنا رسول الله موعظة وجلت منها القلوب، وذرفت منها العيون وذكر الحديث وقد سبق بكماله في باب الأمر بالمحافظة على السنة، وذكرنا أن الترمذي قال‏:‏ ‏(‏‏(‏إنه حديث حسن صحيح‏)‏‏)‏‏.‏","language":"arabic"},{"text":"One day, Messenger of Allah (ﷺ) delivered a very effective speech, as a result, eyes shed tears and hearts became softened. A man said: \"O Prophet of Allah! It sounds as if this is a farewell speech, so advise us.\" He (ﷺ) said, \"I admonish you to fear Allah, and to listen and obey even if a black slave has been appointed as your leader. For whoever among you lives after me will see much discord. So hold fast to my Sunnah and the Sunnah of the Rightly-Guided Caliphs who will come after me. Adhere to them and hold fast to them. Beware of Bid\u0027ah (in religion) because every Bid\u0027ah is a misguidance.\" [At-Tirmidhi].","language":"english"},{"text":"Suatu hari, Rasulullah (ﷺ) menyampaikan pidato yang sangat efektif, akibatnya, mata meneteskan air mata dan hati menjadi lembut. Seorang laki-laki berkata: \"Ya Nabi Allah! Kedengarannya seperti pidato perpisahan, jadi beri tahu kami.\" Dia (ﷺ) berkata, \"Saya menasihati Anda untuk takut kepada Allah, dan untuk mendengarkan dan mematuhi bahkan jika seorang budak hitam telah ditunjuk sebagai pemimpin Anda. Karena siapa pun di antara kamu yang hidup setelah saya akan melihat banyak perselisihan. Jadi berpegang teguh pada Sunnah saya dan Sunnah para khalifah yang akan datang setelah saya. Patuhi mereka dan pegang teguh mereka. Waspadalah terhadap Bid\u0027ah (dalam agama) karena setiap Bid\u0027ah adalah kesesatan.\" [At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"\u0027Irbad bin Sariyah (May Allah be pleased with him) reported:","language":"english"},{"text":"\u0027Irbad bin Sariyah (ra dengan dia) melaporkan:","language":"bahasa"}]},{"index":"702","hadith_id":"riyadussalihin","text":[{"text":"عن عائشة رضي الله عنها قالت‏:‏ ما رأيت رسول الله صلى الله عليه وسلم مستجمعا قط ضاحكاً حتى ترى منه لهواته، إنما كان يتبسم ‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏","language":"arabic"},{"text":"I have never seen Messenger of Allah (ﷺ) laughing so heartily that his uvula could be seen. He used to smile only. [Al-Bukhari and Muslim].","language":"english"},{"text":"Saya belum pernah melihat Rasulullah (ﷺ) tertawa terbahak-bahak sehingga uvula-nya terlihat. Dulu dia hanya tersenyum. [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"\u0027Aishah (May Allah be pleased with him) reported:","language":"english"},{"text":"\u0027Aisyah radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"703","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي هريرة رضي الله عنه قال‏:‏ سمعت رسول الله صلى الله عليه وسلم يقول‏:‏ “إذا أقيمت الصلاة، فلا تأتوها وأنتم تسعون، وأتوها وأنتم تمشون، وعليكم السكينة، فما أدركتم فصلوا، وما فاتكم فأتموا” ‏(‏‏(‏متفق عليه‏)‏‏)‏ زاد مسلم في رواية له‏:‏ ‏ \"‏فإن أحدكم إذا كان يعمد إلى الصلاة فهو في صلاة‏\"‏‏.‏","language":"arabic"},{"text":"I heard the Messenger of Allah (ﷺ) saying, \"When the Iqamah are pronounced, do not come to it running, you should walk calmly with tranquillity to join the congregation. Then join in what you catch for and complete what you miss.\" [Al-Bukhari and Muslim]. In Muslim it is added: Messenger of Allah (ﷺ) said, \"For when one of you is walking for Salat, he is, in fact, engaged in Salat.\"","language":"english"},{"text":"Saya mendengar Rasulullah (ﷺ) berkata, \"Ketika Iqamah diucapkan, jangan berlari, berjalanlah dengan tenang untuk bergabung dengan jamaah. Kemudian bergabunglah dengan apa yang Anda tangkap dan selesaikan apa yang Anda lewatkan.\" [Al-Bukhari dan Muslim] . Dalam Muslim ditambahkan: Rasulullah (ﷺ) berkata, \"Karena ketika salah satu dari kalian berjalan untuk shalat, dia sebenarnya sedang shalat.\"","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"704","hadith_id":"riyadussalihin","text":[{"text":"وعن ابن عباس رضي الله عنهما أنه دفع مع النبي صلى الله عليه وسلم يوم عرفة فسمع النبي صلى الله عليه وسلم وراءه زجراً شديداً وضرباً وصوتاً للإبل، فأشار بسوطه إليهم وقال‏:‏ “أيها الناس عليكم بالسكينة فإن البر ليس بالإيضاع‏\"‏ ‏(‏‏(‏رواه البخاري، وروى مسلم بعضه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"I accompanied the Prophet (ﷺ) while we were returning from \u0027Arafat. Messenger of Allah (ﷺ) heard behind him a loud noise of beating and of driving the camels forcibly. He pointed towards it with his whip and said, \"O people! Proceed calmly. No virtue lies in rushing.\" [Al- Bukhari and Muslim].","language":"english"},{"text":"Saya menemani Nabi (ﷺ) ketika kami kembali dari \u0027Arafat. Rasulullah (ﷺ) mendengar di belakangnya suara keras pemukulan dan penggembalaan unta secara paksa. Dia menunjuk ke arah itu dengan cambuknya dan berkata, \"Hai manusia! Lanjutkan dengan tenang. Tidak ada kebajikan terletak pada terburu-buru.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Ibn \u0027Abbas (May Allah be pleased with them) reported:","language":"english"},{"text":"Ibn \u0027Abbas (semoga Allah meridhoi mereka) melaporkan:","language":"bahasa"}]},{"index":"705","hadith_id":"riyadussalihin","text":[{"text":"عن أبي هريرة رضي الله عنه أن النبي صلى الله عليه وسلم قال‏:‏ ‏\"‏ من كان يؤمن بالله واليوم الآخر فليكرم ضيفه، ومن كان يؤمن بالله واليوم الآخر فليصل رحمه، ومن كان يؤمن بالله واليوم الآخر فليقل خيراً أو ليصمت” ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏","language":"arabic"},{"text":"The Prophet (ﷺ) said, \"He who believes in Allah and the Last Day, let him show hospitality to his guest; and he who believes in Allah and the Last Day, let him maintain good relation with kins; and he who believes in Allah and the Last Day, let him speak good or remain silent.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Nabi (ﷺ) berkata, \"Barang siapa yang beriman kepada Allah dan Hari Akhir, hendaklah dia bersikap ramah kepada tamunya; dan siapa yang beriman kepada Allah dan Hari Akhir, hendaklah dia menjaga hubungan baik dengan kerabatnya; dan siapa yang beriman kepada Allah dan Hari Akhir, biarkan dia berbicara yang baik atau diam.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"706","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي شريح خويلد بن عمرو الخزاعي رضي الله عنه قال‏:‏ سمعت رسول الله صلى الله عليه وسلم يقول‏:‏ ‏\"‏من كان يؤمن بالله واليوم الآخر فليكرم ضيفه جائزته‏\"‏ قالوا‏:‏ وما جائزته يا رسول الله صلى الله عليه وسلم قال‏:‏ ‏\"‏يومه وليلته‏.‏ والضيافة ثلاثة أيام، فما كان وراء ذلك فهو صدقة عليه” ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏ وفي ‏(‏‏(‏رواية لمسلم‏)‏‏)‏‏:‏ ‏\"‏لا يحل لمسلم أن يقيم عند أخيه حتى يؤثمة‏\"‏ قالوا‏:‏ يا رسول الله ، وكيف يؤثمه‏؟‏ قال‏:‏ ‏\"‏يقيم عنده ولا شيء له يقريه به‏\"‏‏.‏","language":"arabic"},{"text":"I heard Messenger of Allah (ﷺ) saying, \"He who believes in Allah and the Last Day, should accommodate his guest according to his right.\" He was asked: \"What is his right, O Messenger of Allah?\" He (ﷺ) replied: \"It is (to accommodate him) for a day and a night, and hospitality extends for three days, and what is beyond that is charity.\" [Al-Bukhari and Muslim]. In Muslim it is added: Messenger of Allah (ﷺ) said, \"It is not permissible for a Muslim to stay so long with his brother till he makes him sinful.\" He was asked: \"O Messenger of Allah, how can he make him sinful?\" He replied, \"He prolongs his stay with him till nothing is left with the host to entertain him (guest).\"","language":"english"},{"text":"Saya mendengar Rasulullah (ﷺ) berkata, \"Barang siapa yang beriman kepada Allah dan Hari Akhir, hendaklah menampung tamunya sesuai dengan haknya.\" Dia ditanya: \"Apa haknya, ya Rasulullah?\" Beliau (ﷺ) menjawab: \"Ini (untuk menampungnya) selama satu hari dan satu malam, dan keramahan meluas selama tiga hari, dan apa yang di luar itu adalah sedekah.\" [Al-Bukhari dan Muslim] . Dalam Muslim ditambahkan: Rasulullah (ﷺ) berkata, \"Tidak halal bagi seorang Muslim untuk tinggal terlalu lama dengan saudaranya sampai dia membuatnya berdosa.\" Dia ditanya: \"Ya Rasulullah, bagaimana dia bisa membuatnya berdosa?\" Dia menjawab, \"Dia memperpanjang tinggal bersamanya sampai tidak ada yang tersisa dengan tuan rumah untuk menjamu dia (tamu).\"","language":"bahasa"}],"narrated":[{"text":"Abu Shuraih Khuwailid bin \u0027Amr Al-Khuza\u0027i (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Syuraih Khuwailid bin \u0027Amr Al-Khuza\u0027i r.a. melaporkan:","language":"bahasa"}]},{"index":"707","hadith_id":"riyadussalihin","text":[{"text":"عن أبي إبراهيم- ويقال أبو محمد، ويقال أبو معاوية- عبد الله بن أبي أوفى رضي الله عنه أن رسول الله صلى الله عليه وسلم بشر خديجة، رضي الله عنها، ببيت في الجنة من قصب ، لا صخب فيه ولا نصب‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏","language":"arabic"},{"text":"Messenger of Allah (ﷺ) gave glad tidings to Khadijah (May Allah be pleased with her) about a palace of hollowed pearls in Jannah, free from noise and toil. [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) memberi kabar gembira kepada Khadijah (ra dengan dia) tentang istana mutiara berlubang di Jannah, bebas dari kebisingan dan kerja keras. [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"\u0027Abdullah bin Abu Aufa (May Allah be pleased with him) reported:","language":"english"},{"text":"\u0027Abdullah bin Abu Aufa (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"708","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي موسى الأشعري رضي الله عنه ، أنه توضأ في بيته، ثم خرج فقال‏:‏ لألزمن رسول الله صلى الله عليه وسلم ، ولأكونن معه يومي هذا، فجاء المسجد، فسأل عن النبي صلى الله عليه وسلم الله عليه وسلم ، فقالوا‏:‏ وجه ههنا، قال‏:‏ فخرجت على أثره أسأل عنه ، حتى دخل بئر أريس، فجلست عند الباب حتى قضى رسول الله صلى الله عليه وسلم حاجته وتوضأ، فقمت إليه، فإذا هو قد جلس على بئر أريس وتوسط قفها، وكشف عن ساقيه ودلاهما في البئر، فسلمت عليه ثم انصرفت، فجلست عند الباب فقلت‏:‏ لأكونن بواب رسول الله صلى الله عليه وسلم اليوم، فجاء أبو بكر رضي الله عنه فدفع الباب فقلت‏:‏ من هذا‏؟‏ فقال‏:‏ أبو بكر، فقلت على رسلك، ثم ذهبت فقلت‏:‏ يا رسول الله هذا أبو بكر يستأذن، فقال‏:‏ ‏\"‏ائذن له وبشره بالجنة‏\"‏ فأقلبت حتى قلت لأبي بكر‏:‏ ادخل ورسول الله يبشرك بالجنة، فدخل أبو بكر حتى جلس عن يمين النبي صلى الله عليه وسلمى الله عليه وسلم معه في القف، ودلى رجليه في البئر كما صنع رسول الله صلى الله عليه وسلم ، وكشف عن ساقيه، ثم رجعت وجلست، وقد تركت أخي يتوضأ ويلحقني ، فقلت‏:‏ إن يرد الله بفلان -يرد أخاه- خيراً يأت به، فإذا إنسان يحرك الباب، فقلت‏:‏ من هذا‏؟‏ فقال‏:‏ عمر بن الخطاب‏:‏ فقلت‏:‏ على رسلك ، ثم جئت إلى رسول الله صلى الله عليه وسلم ، فسلمت عليه وقلت‏:‏ هذا عمر يستأذن‏؟‏ فقال‏:‏”ائذن له وبشره بالجنة‏\"‏ فجئت عمر، فقلت‏:‏ أذن ويبشرك رسول الله صلى الله عليه وسلم بالجنة، فدخل فجلس مع رسول الله صلى الله عليه وسلم في القف عن يساره، ودلى رجليه في البئر، ثم رجعت فجلست فقلت‏:‏ إن يرد الله بفلان خيراً -يعني أخاه- يأت به، فجاء إنسان فحرك الباب‏.‏ فقلت‏:‏ من هذا ‏؟‏ فقال‏:‏ عثمان بن عفان فقلت‏:‏ على رسلك، وجئت النبي صلى الله عليه وسلم الله عليه وسلم ، فأخبرته فقال‏:‏ ‏\"‏ائذن له وبشره بالجنة مع بلوى تصيبه‏\"‏ فجئت فقلت له‏:‏ ادخل ويبشرك رسول الله صلى الله عليه وسلم بالجنة مع بلوى تصيبك، فدخل فوجد القف قد ملئ، فجلس وجاههم من الشق الآخر‏.‏ قال سعيد بن المسيب‏:‏ فأولتها قبورهم ‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏ وزاد في رواية‏:‏ “وأمرني رسول الله صلى الله عليه وسلم بحفظ الباب‏.‏ وفيها أن عثمان حين بشره حمد الله تعالى، ثم قال‏:‏ الله المستعان‏.‏","language":"arabic"},{"text":"One day, I performed my Wudu\u0027 in my house and then set forth with the determination that I would stick to Messenger of Allah (ﷺ) and spend the whole day with him. I came to the mosque and asked about him. The Companions told that he (ﷺ) had gone in a certain direction. Abu Musa added: I followed him inquiring until I came to Bi\u0027r Aris (a well in the suburb of Al-Madinah). (There) I sat down at the door till he (ﷺ) had relieved himself and performed Wudu\u0027. Then I went to him and saw him sitting on the platform of the well with his shanks uncovered and his legs dangling in the well. I greeted him and returned to the door of the garden, saying to myself, \"I will be the doorkeeper of the Messenger of Allah today.\" Abu Bakr (May Allah be pleased with him) came and knocked at the door. I said; \"Who is that?\" He said: \"Abu Bakr.\" I said, \"Wait a moment.\" Then I went to the Messenger of Allah (ﷺ) and said, \"O Messenger of Allah! Abu Bakr is at the door seeking permission to enter.\" He said, \"Admit him and give him the glad tidings of Jannah.\" I returned and said to Abu Bakr (May Allah be pleased with him): \"You may enter and Messenger of Allah (ﷺ) has given you the glad tidings of (entering) Jannah.\" Abu Bakr (May Allah be pleased with him) came in and sat down on the right side of Messenger of Allah (ﷺ) and suspended his legs into the well and uncovered his shanks, as the Messenger of Allah had done. I returned to the door and sat down. I had left my brother at home while he was performing Wudu\u0027 and intending to join me. I said to myself: \"If Allah intends good for him (i.e., to be blessed to come at this time and receive the glad tidings of entering Jannah), He will bring him here.\" Someone knocked at the door and I said, \"Who is it?\" He said, \"Umar bin Al-Khattab.\" I said, \"Wait a moment.\" Then I proceeded towards Messenger of Allah (ﷺ). I greeted him and said, \"Umar is at the door, seeking permission to enter. He said, \"Let him in and give him the glad tidings of entering Jannah.\" I went back to \u0027Umar (May Allah be pleased with him) and said to him, \"Messenger of Allah has given you permission as well as glad tidings of entering Jannah.\" He entered and sat down with Messenger of Allah (ﷺ) on his left side and dangled his feet into the well. I returned to the door and sat down and said to myself: \"If Allah intends good for my brother, He will bring him here.\" Someone knocked at the door and I said, \"Who is it?\" He said, \"Uthman bin \u0027Affan.\" I said, \"Wait a moment.\" I went to Messenger of Allah (ﷺ) and informed him about his arrival. He said, \"Let him in and give him glad tidings of entering Jannah together with a tribulation which he will have to face.\" I came back to him and said, \"You may enter; and Messenger of Allah (ﷺ) gives you the glad tidings of entering Jannah together with a tribulation that will afflict you.\" He got in and saw that the elevated platform round the well was fully occupied. So he sat on opposite side. Sa\u0027id bin Al- Musaiyab (May Allah be pleased with him) a subnarrator has reported: The order in which they sat down indicated the places of their burial. [Al-Bukhari and Muslim]. Another narration adds: Abu Musa Al-Ash\u0027ari (May Allah be pleased with him) said: The Prophet (ﷺ) ordered me to guard the door. When \u0027Uthman was told (about the misfortune) he praised Allah then said: \"Allahu Musta\u0027an (His help is to be sought).\" (The interpretation of Sa\u0027id bin Al-Musaiyab is that the graves of Abu Bakr and \u0027Umar (May Allah be pleased with them) are by the side of the Prophet (ﷺ), in the same position they took when they sat next to the Prophet (ﷺ) while the grave of \u0027Uthman is away from their graves, in the public graveyard of Al-Madinah known as Baqi\u0027 Al-Gharqad).","language":"english"},{"text":"Suatu hari, saya melakukan Wudu saya di rumah saya dan kemudian menetapkan dengan tekad bahwa saya akan berpegang teguh pada Rasulullah (ﷺ) dan menghabiskan sepanjang hari bersamanya. Saya datang ke masjid dan bertanya tentang dia. Para sahabat mengatakan bahwa dia (ﷺ) telah pergi ke arah tertentu. Abu Musa menambahkan: Saya mengikutinya bertanya sampai saya tiba di Bi\u0027r Aris (sebuah sumur di pinggiran kota Al-Madinah). (Di sana) aku duduk di depan pintu sampai dia (ﷺ) buang air besar dan berwudhu. Kemudian saya pergi ke dia dan melihatnya duduk di platform sumur dengan betisnya terbuka dan kakinya menjuntai di dalam sumur. Aku menyapanya dan kembali ke pintu taman, berkata pada diriku sendiri, \"Aku akan menjadi penjaga pintu Rasulullah hari ini.\" Abu Bakar (ra dengan dia) datang dan mengetuk pintu. Saya bilang; \"Siapa itu?\" Dia berkata: \"Abu Bakar.\" Saya berkata, \"Tunggu sebentar.\" Lalu aku pergi ke Rasulullah (ﷺ) dan berkata, \"Ya Rasulullah! Abu Bakar ada di pintu meminta izin untuk masuk.\" Dia berkata, \"Akui dia dan beri dia kabar gembira tentang Jannah.\" Aku kembali dan berkata kepada Abu Bakar (semoga Allah meridhoinya): \"Kamu boleh masuk dan Rasulullah (ﷺ) memberimu kabar gembira (masuk) Jannah.\" Abu Bakar (ra dengan dia) masuk dan duduk di sisi kanan Rasulullah (ﷺ) dan memasukkan kakinya ke dalam sumur dan membuka betisnya, seperti yang dilakukan Rasulullah. Aku kembali ke pintu dan duduk. Saya telah meninggalkan saudara saya di rumah ketika dia sedang berwudhu\u0027 dan berniat untuk bergabung dengan saya. Aku berkata pada diriku sendiri: \"Jika Allah menghendaki kebaikan baginya (yaitu, diberkati untuk datang saat ini dan menerima kabar gembira memasuki Jannah), Dia akan membawanya ke sini.\" Seseorang mengetuk pintu dan saya berkata, \"Siapa itu?\" Dia berkata, \"Umar bin Al-Khattab. Aku berkata, \"Tunggu sebentar.\" Lalu aku berjalan menuju Rasulullah (ﷺ). Aku menyapanya dan berkata, \"Umar ada di pintu, meminta izin untuk masuk. Dia berkata, \"Biarkan dia masuk dan beri dia kabar gembira memasuki Jannah.\" Aku kembali ke \u0027Umar (semoga Allah meridhoinya) dan berkata kepadanya, \"Rasulullah telah memberimu izin serta kabar gembira untuk memasuki Jannah.\" Dia masuk dan duduk dengan Rasulullah (ﷺ) di sisi kirinya dan menjuntai kakinya ke dalam sumur. Aku kembali ke pintu dan duduk dan berkata pada diriku sendiri: \"Jika Allah menghendaki kebaikan untuk saudaraku, Dia akan membawanya ke sini.\" Seseorang mengetuk pintu dan saya berkata, \"Siapa itu?\" Dia berkata, \"Utsman bin \u0027Affan.\" Saya berkata, \"Tunggu sebentar.\" Saya pergi ke Rasulullah (ﷺ) dan memberitahunya tentang kedatangannya. Dia berkata, \"Biarkan dia masuk dan beri dia kabar gembira memasuki Jannah bersama dengan kesengsaraan yang harus dia hadapi.\" Aku kembali kepadanya dan berkata, \"Kamu boleh masuk; dan Rasulullah (ﷺ) memberimu kabar gembira memasuki Jannah bersama dengan kesengsaraan yang akan menimpamu.\" Dia masuk dan melihat bahwa platform tinggi di sekitar sumur telah terisi penuh. Jadi dia duduk di sisi yang berlawanan. Sa\u0027 id bin Al-Musaiyab (ra dengan dia) seorang subnarator telah melaporkan: Urutan di mana mereka duduk menunjukkan tempat pemakaman mereka. Seseorang mengetuk pintu dan saya berkata, \"Siapa itu?\" Dia berkata, \"Utsman bin \u0027Affan.\" Saya berkata, \"Tunggu sebentar.\" Saya pergi ke Rasulullah (ﷺ) dan memberitahu dia tentang kedatangannya. Dia berkata, \"Biarkan dia masuk dan beri dia kabar gembira memasuki Jannah bersama dengan kesengsaraan yang harus dia hadapi.\" Aku kembali kepadanya dan berkata, \"Kamu boleh masuk; dan Rasulullah (ﷺ) memberimu kabar gembira memasuki Jannah bersama dengan kesengsaraan yang akan menimpamu.\" Dia masuk dan melihat bahwa platform yang ditinggikan di sekitar sumur telah terisi penuh. Jadi dia duduk di sisi yang berlawanan. Sa\u0027id bin Al-Musaiyab (ra dengan dia) seorang subnarator telah melaporkan: Urutan di mana mereka duduk menunjukkan tempat pemakaman mereka. Seseorang mengetuk pintu dan saya berkata, \"Siapa itu?\" Dia berkata, \"Utsman bin \u0027Affan.\" Saya berkata, \"Tunggu sebentar.\" Saya pergi ke Rasulullah (ﷺ) dan memberitahu dia tentang kedatangannya. Dia berkata, \"Biarkan dia masuk dan beri dia kabar gembira memasuki Jannah bersama dengan kesengsaraan yang harus dia hadapi.\" Aku kembali kepadanya dan berkata, \"Kamu boleh masuk; dan Rasulullah (ﷺ) memberimu kabar gembira memasuki Jannah bersama dengan kesengsaraan yang akan menimpamu.\" Dia masuk dan melihat bahwa platform yang ditinggikan di sekitar sumur telah terisi penuh. Jadi dia duduk di sisi yang berlawanan. Sa\u0027id bin Al-Musaiyab (ra dengan dia) seorang subnarator telah melaporkan: Urutan di mana mereka duduk menunjukkan tempat pemakaman mereka. Dia berkata, \"Utsman bin \u0027Affan.\" Saya berkata, \"Tunggu sebentar.\" Saya pergi ke Rasulullah (ﷺ) dan memberitahu dia tentang kedatangannya. Dia berkata, \"Biarkan dia masuk dan beri dia kabar gembira memasuki Jannah bersama dengan kesengsaraan yang harus dia hadapi.\" Aku kembali kepadanya dan berkata, \"Kamu boleh masuk; dan Rasulullah (ﷺ) memberimu kabar gembira memasuki Jannah bersama dengan kesengsaraan yang akan menimpamu.\" Dia masuk dan melihat bahwa platform yang ditinggikan di sekitar sumur telah terisi penuh. Jadi dia duduk di sisi yang berlawanan. Sa\u0027id bin Al-Musaiyab (ra dengan dia) seorang subnarator telah melaporkan: Urutan di mana mereka duduk menunjukkan tempat pemakaman mereka. Dia berkata, \"Utsman bin \u0027Affan.\" Saya berkata, \"Tunggu sebentar.\" Saya pergi ke Rasulullah (ﷺ) dan memberitahu dia tentang kedatangannya. Dia berkata, \"Biarkan dia masuk dan beri dia kabar gembira memasuki Jannah bersama dengan kesengsaraan yang harus dia hadapi.\" Aku kembali kepadanya dan berkata, \"Kamu boleh masuk; dan Rasulullah (ﷺ) memberimu kabar gembira memasuki Jannah bersama dengan kesengsaraan yang akan menimpamu.\" Dia masuk dan melihat bahwa platform yang ditinggikan di sekitar sumur telah terisi penuh. Jadi dia duduk di sisi yang berlawanan. Sa\u0027id bin Al-Musaiyab (ra dengan dia) seorang subnarator telah melaporkan: Urutan di mana mereka duduk menunjukkan tempat pemakaman mereka. Saya pergi ke Rasulullah (ﷺ) dan memberitahu dia tentang kedatangannya. Dia berkata, \"Biarkan dia masuk dan beri dia kabar gembira memasuki Jannah bersama dengan kesengsaraan yang harus dia hadapi.\" Aku kembali kepadanya dan berkata, \"Kamu boleh masuk; dan Rasulullah (ﷺ) memberimu kabar gembira memasuki Jannah bersama dengan kesengsaraan yang akan menimpamu.\" Dia masuk dan melihat bahwa platform yang ditinggikan di sekitar sumur telah terisi penuh. Jadi dia duduk di sisi yang berlawanan. Sa\u0027id bin Al-Musaiyab (ra dengan dia) seorang subnarator telah melaporkan: Urutan di mana mereka duduk menunjukkan tempat pemakaman mereka. Saya pergi ke Rasulullah (ﷺ) dan memberitahu dia tentang kedatangannya. Dia berkata, \"Biarkan dia masuk dan beri dia kabar gembira memasuki Jannah bersama dengan kesengsaraan yang harus dia hadapi.\" Aku kembali kepadanya dan berkata, \"Kamu boleh masuk; dan Rasulullah (ﷺ) memberimu kabar gembira memasuki Jannah bersama dengan kesengsaraan yang akan menimpamu.\" Dia masuk dan melihat bahwa platform yang ditinggikan di sekitar sumur telah terisi penuh. Jadi dia duduk di sisi yang berlawanan. Sa\u0027id bin Al-Musaiyab (ra dengan dia) seorang subnarator telah melaporkan: Urutan di mana mereka duduk menunjukkan tempat pemakaman mereka. Anda boleh masuk; dan Rasulullah (ﷺ) memberimu kabar gembira memasuki Jannah bersama dengan kesengsaraan yang akan menimpamu.\" Dia masuk dan melihat bahwa platform tinggi di sekitar sumur telah terisi penuh. Jadi dia duduk di sisi yang berlawanan. Sa\u0027 id bin Al-Musaiyab (ra dengan dia) seorang subnarator telah melaporkan: Urutan di mana mereka duduk menunjukkan tempat pemakaman mereka. Anda boleh masuk; dan Rasulullah (ﷺ) memberimu kabar gembira memasuki Jannah bersama dengan kesengsaraan yang akan menimpamu.\" Dia masuk dan melihat bahwa platform tinggi di sekitar sumur telah terisi penuh. Jadi dia duduk di sisi yang berlawanan. Sa\u0027 id bin Al-Musaiyab (ra dengan dia) seorang subnarator telah melaporkan: Urutan di mana mereka duduk menunjukkan tempat pemakaman mereka. [Al-Bukhari dan Muslim] . Narasi lain menambahkan: Abu Musa Al-Asy\u0027ari (ra dengan dia) berkata: Nabi (ﷺ) memerintahkan saya untuk menjaga pintu. Ketika \u0027Utsman diberitahu (tentang kemalangan) dia memuji Allah lalu berkata: \"Allahu Musta\u0027an (pertolongan-Nya harus dicari).\" (Penafsiran Sa\u0027id bin Al-Musaiyab adalah bahwa kuburan Abu Bakar dan \u0027Umar (ra dengan mereka) berada di sisi Nabi (ﷺ), dalam posisi yang sama ketika mereka duduk di sebelahnya. kepada Nabi (ﷺ) sedangkan kuburan \u0027Utsman jauh dari kuburan mereka, di kuburan umum Al-Madinah yang dikenal sebagai Baqi\u0027 Al-Gharqad).","language":"bahasa"}],"narrated":[{"text":"Abu Musa Al-Ash\u0027ari (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Musa Al-Asy\u0027ari r.a. melaporkan:","language":"bahasa"}]},{"index":"709","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي هريرة رضي الله عنه قال‏:‏ كنا قعوداً حول رسول الله صلى الله عليه وسلم ، ومعنا أبو بكر وعمر رضي الله عنهما في نفر، فقام رسول الله صلى الله عليه وسلم من بين أظهرنا فأبطأ علينا، وخشينا أن يقتطع دوننا وفزعنا فقمنا، فكنت أول من فزع، فخرجت أبتغي رسول الله صلى الله عليه وسلم ، حتى أتيت حائطاً للأنصار لبني النجار، فدرت به هل أجد له باب، فلم أجد، فإذا ربيع يدخل في جوف حائط من بئر خارجه -والربيع‏:‏ الجدول الصغير -فاحتفزت، فدخلت على رسول الله صلى الله عليه وسلم فقال‏:‏ “أبو هريرة‏؟‏” فقلت‏:‏ نعم يا رسول الله ، قال‏:‏ “ما شأنك” قلت‏:‏ كنت بين أظهرنا فقمت فأبطأت علينا، فخشينا أن تقتطع دوننا، ففزعنا، فكنت أول من فزع، فأتيت هذا الحائط فاحتفرت كما يحتفر الثعلب، وهؤلاء الناس ورائي‏.‏ فقال‏:‏ ‏\"‏يا أبا هريرة‏\"‏ وأعطاني نعليه فقال‏:‏ ‏\"‏اذهب بنعلي هاتين، فمن لقيت من وراء هذا الحائط يشهد أن لا إله إلا الله مستيقنا بها قلبه، فبشره بالجنة‏\"‏ وذكر الحديث بطوله، ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"We were sitting in the company of the Messenger of Allah (ﷺ), and Abu Bakr and \u0027Umar (May Allah be pleased with them) were also present. All of a sudden the Messenger of Allah (ﷺ) got up and left us. When he was late to return to us we began to worry lest he should meet with trouble in our absence. I was the first to be alarmed and set out in search of him until I came to a garden belonging to Banu-Najjar (a section of the Ansar). I went round it looking for an entrance, but failed to find one. However, I saw a stream of water flowing into the garden from a well outside. I drew myself together like a fox and slinked into the place and reached the Messenger of Allah (ﷺ). He said, \"Is it Abu Hurairah?\" I replied in the affirmative. He asked, \"What is the matter with you?\" I replied, \"You were sitting with us and then you left us and delayed for a time. Fearing you had met with some adversities we got alarmed. I was the first to be alarmed. So when I came to this garden, I squeezed myself like a fox and these people are coming behind me.\" He (the Prophet (ﷺ)) gave me his sandals and said, \"O Abu Hurairah! Take these sandals of mine, and whoever you meet outside this garden testifying that La ilaha illallah (There is no true god except Allah), being assured of it in his heart, give him the glad tidings that he will enter Jannah.\" (Abu Hurairah then narrated the Hadith in full). [Muslim].","language":"english"},{"text":"Kami duduk bersama Rasulullah (ﷺ), dan Abu Bakar serta \u0027Umar (ra dengan mereka) juga hadir. Tiba-tiba Rasulullah () bangun dan meninggalkan kami. Ketika dia terlambat untuk kembali kepada kami, kami mulai khawatir kalau-kalau dia akan menemui masalah saat kami tidak ada. Saya adalah orang pertama yang waspada dan berangkat mencarinya sampai saya tiba di sebuah taman milik Banu-Najjar (bagian dari Ansar). Saya mengelilinginya untuk mencari jalan masuk, tetapi gagal menemukannya. Namun, saya melihat aliran air mengalir ke taman dari sebuah sumur di luar. Saya menarik diri saya seperti rubah dan menyelinap ke tempat itu dan mencapai Rasulullah (ﷺ). Dia berkata, \"Apakah itu Abu Hurairah?\" Saya menjawab dengan tegas. Dia bertanya, \"Ada apa denganmu?\" Saya membalas, \" Anda duduk bersama kami dan kemudian Anda meninggalkan kami dan menunda untuk sementara waktu. Khawatir Anda telah bertemu dengan beberapa kesulitan, kami menjadi khawatir. Saya adalah orang pertama yang khawatir. Jadi ketika saya datang ke taman ini, saya meremas diri saya seperti rubah dan orang-orang ini datang di belakang saya.\" Dia (Nabi (ﷺ)) memberi saya sandal dan berkata, \"Wahai Abu Hurairah! Ambillah sandalku ini, dan barang siapa yang kamu temui di luar taman ini bersaksi bahwa La ilaha illallah (Tidak ada Tuhan yang benar selain Allah), dengan keyakinan di dalam hatinya, beri dia kabar gembira bahwa dia akan masuk Jannah.” (Abu Hurairah kemudian meriwayatkan hadits secara lengkap). Saya meremas diri saya seperti rubah dan orang-orang ini datang di belakang saya.\" Dia (Nabi (ﷺ)) memberi saya sandal dan berkata, \"Wahai Abu Hurairah! Ambillah sandalku ini, dan barang siapa yang kamu temui di luar taman ini bersaksi bahwa La ilaha illallah (Tidak ada Tuhan yang benar selain Allah), dengan keyakinan di dalam hatinya, beri dia kabar gembira bahwa dia akan masuk Jannah.” (Abu Hurairah kemudian meriwayatkan hadits secara lengkap). Saya meremas diri saya seperti rubah dan orang-orang ini datang di belakang saya.\" Dia (Nabi (ﷺ)) memberi saya sandal dan berkata, \"Wahai Abu Hurairah! Ambillah sandalku ini, dan barang siapa yang kamu temui di luar taman ini bersaksi bahwa La ilaha illallah (Tidak ada Tuhan yang benar selain Allah), dengan keyakinan di dalam hatinya, beri dia kabar gembira bahwa dia akan masuk Jannah.” (Abu Hurairah kemudian meriwayatkan hadits secara lengkap). [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"710","hadith_id":"riyadussalihin","text":[{"text":"وعن ابن شماسة قال‏:‏ حضرنا عمرو بن العاص رضي الله عنه ، وهو في سياقة الموت فبكى طويلاً، وحول وجهه إلى الجدار، فجعل ابنه يقول‏:‏ يا أبتاه، أما بشرك رسول الله صلى الله عليه وسلم بكذا‏؟‏ أما بشرك رسول الله صلى الله عليه وسلم بكذا‏؟‏ فأقبل بوجهه فقال‏:‏ إن أفضل ما نعد شهادة أن لا إله إلا الله، وأن محمداً رسول الله ، إني قد كنت على أطباق ثلاث‏:‏ لقد رأيتني وما أحد أشداً بغضاً لرسول الله صلى الله عليه وسلم مني ، ولا أحب إلي من أن أكون قد استمكنت منه فقتلته، فلو مت على تلك الحال لكنت من أهل النار، فلما جعل الله الإسلام في قلبي أتيت النبي صلى الله عليه وسلمى الله عليه وسلم فقلت‏:‏ أبسط يمينك فلأبايعك، فبسط يمينه فقبضت يدي، فقال‏:‏”مالك يا عمرو‏؟‏‏\"‏ قلت‏:‏ أردت أن أشترط قال‏:‏ ‏\"‏تشترط ماذا‏؟‏‏\"‏ قلت ‏:‏ أن يغفر لي، قال‏:‏ ‏\"‏أماعلمت أن الإسلام يهدم ما كان قبله، وأن الهجرة تهدم ما كان قبلها، وأن الحج يهدم ما كان قبله” وما كان أحد أحب إلي من رسول الله صلى الله عليه وسلم ، ولا أجل في عيني منه، وما كنت أطيق أن املأ عيني منه إجلالاً له؛ ولو سئلت أن أصفه ما أطقت؛ لأني لم أكن أملاً عيني منه، ولو مت على تلك الحال لرجوت أن أكون من أهل الجنة، ثم ولينا أشياء ما أدري مال حالي فيها‏؟‏ فإذا أنا مت فلا تصحبني نائحة ولا نار، فإذا دفنتموني، فشنوا على التراب شناً، ثم أقيموا حول قبري قدر ما تنحر جزور، ويقسم لحمها، حتى أستأنس بكم، وأنظر ما أراجع به رسل ربي ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"We visited \u0027Amr bin Al-\u0027as (May Allah be pleased with him) when he was in his deathbed. He wept for a long time and turned his face towards the wall. His son said: \"O father, did not the Messenger of Allah (ﷺ) give you the good news of such and such? Did he not give you glad tidings of such and such?\" Then he (\u0027Amr) turned his face towards us and said: \"The best thing which you can count upon is the affirmation that: La ilaha illallah (there is no true god except Allah), and that Muhammad is the Messenger of Allah. I have passed through three phases. I remember when I hated none more than I hated the Messenger of Allah (ﷺ), and there was no other desire stronger in me than that of killing him. Had I died in that state, I would have definitely been one of the dwellers of Fire (Hell). When Allah instilled the love for Islam in my heart, I went to Messenger of Allah (ﷺ) and said, \u0027Extend your right hand, so that I pledge allegiance to you.\u0027 He (ﷺ) stretched out his right hand, but I withdrew my hand. He said, \u0027What is the matter, \u0027Amr?\u0027 I said, \u0027I wish to lay down same conditions.\u0027 He asked, \u0027What conditions do you wish to put forward?\u0027 I replied, \u0027To be granted forgiveness.\u0027 He said, \u0027Do you not know that (embracing) Islam wipes out all that has gone before it (previous misdeeds). Verily, emigration wipes out all the previous sins, and the Hajj (pilgrimage) wipes out all the previous sins.\u0027 Thereafter, no one was dearer to me than Messenger of Allah (ﷺ), and none was more respectable than him in my eyes. So bright was his splendour that I could not gather enough courage to look at his face for any length of time. If I were asked to describe his feature, I would not be able to do so because I have never caught a full glimpse of his face. Had I died in that state I could have hoped to be one of the dwellers of Jannah. Thereafter, we were made responsible for many things and in the light of which I am unable to know what is in store for me. When I die, no mourner, nor fire should accompany my bier. When you bury me, throw the earth gently over me and stand over my grave for the space of time within which a camel is slaughtered and its meat is distributed so that I may enjoy your intimacy, and in your presence ascertain what answer can I give to the Messengers of my Rubb (the angels in grave).\" [Muslim].","language":"english"},{"text":"Kami mengunjungi \u0027Amr bin Al-\u0027as (semoga Allah meridhoinya) ketika dia berada di ranjang kematiannya. Dia menangis untuk waktu yang lama dan memalingkan wajahnya ke dinding. Putranya berkata: \"Wahai ayah, bukankah Rasulullah (ﷺ) memberimu kabar gembira tentang ini dan itu? Bukankah dia memberimu kabar gembira tentang ini dan itu?\" Kemudian dia (\u0027Amr) menghadapkan wajahnya ke arah kami dan berkata: \"Hal terbaik yang dapat Anda andalkan adalah penegasan bahwa: La ilaha illallah (tidak ada Tuhan yang benar selain Allah), dan bahwa Muhammad adalah utusan Allah. Saya telah melewati tiga fase. Saya ingat ketika saya membenci tidak lebih dari saya membenci Rasulullah (ﷺ), dan tidak ada keinginan lain yang lebih kuat dalam diri saya selain membunuhnya. Seandainya saya mati dalam keadaan itu, saya akan memilikinya. pasti pernah menjadi salah satu penghuni Api (Neraka). Ketika Allah menanamkan cinta Islam di hati saya, saya pergi ke Rasulullah (ﷺ) dan berkata, \u0027Ulurkan tangan kanan Anda, sehingga saya berjanji setia kepada Anda.\u0027 Dia () mengulurkan tangan kanannya, tapi aku menarik tanganku. Dia berkata, \u0027Ada apa, \u0027Amr?\u0027 Saya berkata, \u0027Saya ingin menetapkan kondisi yang sama.\u0027 Dia bertanya, \u0027Kondisi apa yang ingin Anda kemukakan?\u0027 Saya menjawab, \u0027Agar diberikan pengampunan.\u0027 Dia berkata, \u0027Apakah kamu tidak tahu bahwa (memeluk) Islam menghapus semua yang telah terjadi sebelumnya (kejahatan sebelumnya). Sesungguhnya hijrah menghapus dosa-dosa sebelumnya, dan haji menghapus semua dosa-dosa sebelumnya.\u0027 Setelah itu, tidak ada yang lebih saya cintai daripada Rasulullah (ﷺ), dan tidak ada yang lebih terhormat darinya di mata saya. Begitu cerah kemegahannya sehingga saya tidak bisa mengumpulkan cukup keberanian untuk melihat wajahnya untuk waktu yang lama. Jika saya diminta untuk menggambarkan fiturnya, saya tidak akan bisa melakukannya karena saya tidak pernah melihat wajahnya secara sekilas. Seandainya saya meninggal dalam keadaan seperti itu, saya bisa berharap menjadi salah satu penghuni Jannah. Setelah itu, kami bertanggung jawab atas banyak hal dan karena itu saya tidak dapat mengetahui apa yang akan terjadi pada saya. Ketika saya mati, tidak ada pelayat, atau api yang harus menemani usungan saya. Ketika Anda mengubur saya, lemparkan tanah dengan lembut ke atas saya dan berdiri di atas kuburan saya untuk ruang waktu di mana seekor unta disembelih dan dagingnya dibagikan sehingga saya dapat menikmati keintiman Anda, dan di hadapan Anda memastikan jawaban apa yang bisa saya berikan kepada Utusan Rubb saya (para malaikat di kuburan).\" Jika saya diminta untuk menggambarkan fiturnya, saya tidak akan bisa melakukannya karena saya tidak pernah melihat wajahnya secara sekilas. Seandainya saya meninggal dalam keadaan seperti itu, saya bisa berharap menjadi salah satu penghuni Jannah. Setelah itu, kami bertanggung jawab atas banyak hal dan karena itu saya tidak dapat mengetahui apa yang akan terjadi pada saya. Ketika saya mati, tidak ada pelayat, atau api yang harus menemani usungan saya. Ketika Anda mengubur saya, lemparkan tanah dengan lembut ke atas saya dan berdiri di atas kuburan saya untuk ruang waktu di mana seekor unta disembelih dan dagingnya dibagikan sehingga saya dapat menikmati keintiman Anda, dan di hadapan Anda memastikan jawaban apa yang bisa saya berikan kepada Utusan Rubb saya (para malaikat di kuburan).\" Jika saya diminta untuk menggambarkan fiturnya, saya tidak akan bisa melakukannya karena saya tidak pernah melihat wajahnya secara sekilas. Seandainya saya meninggal dalam keadaan seperti itu, saya bisa berharap menjadi salah satu penghuni Jannah. Setelah itu, kami bertanggung jawab atas banyak hal dan karena itu saya tidak dapat mengetahui apa yang akan terjadi pada saya. Ketika saya mati, tidak ada pelayat, atau api yang harus menemani usungan saya. Ketika Anda mengubur saya, lemparkan tanah dengan lembut ke atas saya dan berdiri di atas kuburan saya untuk ruang waktu di mana seekor unta disembelih dan dagingnya dibagikan sehingga saya dapat menikmati keintiman Anda, dan di hadapan Anda memastikan jawaban apa yang bisa saya berikan kepada Utusan Rubb saya (para malaikat di kuburan).\" Seandainya saya meninggal dalam keadaan seperti itu, saya bisa berharap menjadi salah satu penghuni Jannah. Setelah itu, kami bertanggung jawab atas banyak hal dan karena itu saya tidak dapat mengetahui apa yang akan terjadi pada saya. Ketika saya mati, tidak ada pelayat, atau api yang harus menemani usungan saya. Ketika Anda mengubur saya, lemparkan tanah dengan lembut ke atas saya dan berdiri di atas kuburan saya untuk ruang waktu di mana seekor unta disembelih dan dagingnya dibagikan sehingga saya dapat menikmati keintiman Anda, dan di hadapan Anda memastikan jawaban apa yang bisa saya berikan kepada Utusan Rubb saya (para malaikat di kuburan).\" Seandainya saya meninggal dalam keadaan seperti itu, saya bisa berharap menjadi salah satu penghuni Jannah. Setelah itu, kami bertanggung jawab atas banyak hal dan karena itu saya tidak dapat mengetahui apa yang akan terjadi pada saya. Ketika saya mati, tidak ada pelayat, atau api yang harus menemani usungan saya. Ketika Anda mengubur saya, lemparkan tanah dengan lembut ke atas saya dan berdiri di atas kuburan saya untuk ruang waktu di mana seekor unta disembelih dan dagingnya dibagikan sehingga saya dapat menikmati keintiman Anda, dan di hadapan Anda memastikan jawaban apa yang bisa saya berikan kepada Utusan Rubb saya (para malaikat di kuburan).\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Ibn Shumasah reported:","language":"english"},{"text":"Ibnu Shumasah melaporkan:","language":"bahasa"}]},{"index":"711","hadith_id":"riyadussalihin","text":[{"text":"فمنها حديث زيد بن أرقم رضي الله عنه -الذي سبق في باب إكرام أهل بيت رسول الله صلى الله عليه وسلم -قال‏:‏ قام رسول الله صلى الله عليه وسلم فينا خطيباً، فحمد الله، وأثنى عليه، ووعظ وذكر، ثم قال‏:‏ “أما بعد”ألا أيها الناس إنما أنا بشر يوشك أن يأتي رسول الله ربي فأجيب، وأنا تارك فيكم ثقلين ‏:‏‏ \"‏ أولهما‏:‏ كتاب الله، فيه الهدى والنور، فخذو بكتاب الله، واستمسكوا به” فحث على كتاب الله، ورغب فيه، ثم قال‏:‏ “وأهل بيتي، أذكركم الله في أهل بيتي‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏ وقد سبق بطوله‏.‏","language":"arabic"},{"text":"\"One day Messenger of Allah (ﷺ) stood amongst us to deliver a Khutbah. So he praised Allah, extolled Him, exhorted and reminded (us) and said: \u0027Amma Ba\u0027du (now then)! O people, certainly I am a human being. I am about to receive a messenger of Allah my Lord (the angel of death) and I respond. And I am leaving among you two weighty things: There first of which is the Book of Allah. In is guidance and light, so hold fast to the Book of Allah and adhere to it.\u0027 So he exhorted (us) (to hold fast to it) and encouraged it then said, \u0027And the members of my household, I remind you of Allah with regards (of your duties) to the members of my family.\"\u0027 [Muslim]. And it has preceded in its entirety.","language":"english"},{"text":"“Suatu hari Rasulullah (ﷺ) berdiri di antara kami untuk menyampaikan Khutbah. Maka dia memuji Allah, memuji-Nya, menasihati dan mengingatkan (kami) dan berkata: \u0027Amma Ba\u0027du (sekarang)! seorang manusia, aku akan menerima utusan Allah Tuhanku (malaikat maut) dan aku menjawab. Dan aku meninggalkan di antara kalian dua hal yang berat: Yang pertama adalah Kitab Allah. Di dalamnya ada petunjuk dan cahaya , maka berpegang teguhlah pada Kitab Allah dan taatilah itu.\u0027 Maka dia menasihati (kami) (untuk berpegang teguh padanya) dan mendorongnya lalu berkata, \u0027Dan anggota rumah tanggaku, aku mengingatkanmu kepada Allah tentang (tugasmu) kepada anggota keluargaku.\"\u0027 [Muslim ] . Dan itu telah mendahului secara keseluruhan.","language":"bahasa"}],"narrated":[{"text":"Then from it is the narration of Zaid bin Arqam (May Allah be pleased with them) that preceded in the Chapter of \"Showing reverence to the Family of Allah\u0027s Messenger (ﷺ)\". He said:","language":"english"},{"text":"Kemudian darinya diriwayatkan Zaid bin Arqam radhiyallahu ‘anhu yang didahului dengan Bab “Menunjukkan Kehormatan kepada Keluarga Rasulullah (ﷺ)”. Dia berkata:","language":"bahasa"}]},{"index":"712","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي سليمان مالك بن الحويرث رضي الله عنه قال‏:‏ أتينا رسول الله صلى الله عليه وسلم ونحن شببه متقاربون، فأقمنا عنده عشرين ليلة، وكان رسول الله صلى الله عليه وسلم رحيماً رفيقاً، فظن أنّا قد اشتقنا أهلنا، فسألنا عمن تركنا من أهلنا، فأخبرناه، فقال‏:‏ “ارجعوا إلى أهليكم، فأقيموا فيهم، وعلموهم ومروهم ، وصلو صلاة كذا في حين كذا، وصلوا كذا في حين كذا، فإذا حضرت الصلاة فليؤذن لكم أحدكم، وليؤمكم أكبركم” ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏ ‏(‏‏(‏زاد البخاري في رواية له‏:‏ ‏ \"‏ وصلوا كما رأيتموني أصلي‏\"‏‏)‏‏)‏","language":"arabic"},{"text":"We came to the Messenger of Allah (ﷺ) when we were all young men of nearly equal age. We stayed with him for twenty days. He was extremely kind and considerate. He perceived that we missed our families so he asked us about those we left behind, and we informed him. Then he (ﷺ) said, \"Go back to your families, stay with them, teach them (about Islam) and exhort them to do good. Perform such Salat (prayer) at such a time and such Salat at such a time. When the time for Salat is due, one of you should announce Adhan (call for prayer) and the oldest among you should lead Salat.\" [Al-Bukhari and Muslim]. Al-Bukhari added in a version of his \"And pray as you have seen me pray.\"","language":"english"},{"text":"Kami datang kepada Rasulullah (ﷺ) ketika kami semua masih muda dengan usia yang hampir sama. Kami tinggal bersamanya selama dua puluh hari. Dia sangat baik dan perhatian. Dia merasa bahwa kami merindukan keluarga kami sehingga dia bertanya kepada kami tentang orang-orang yang kami tinggalkan, dan kami memberi tahu dia. Kemudian beliau (ﷺ) berkata, “Kembalilah ke keluargamu, tinggallah bersama mereka, ajari mereka (tentang Islam) dan nasehati mereka untuk berbuat baik. waktu shalat telah tiba, salah satu dari kalian harus mengumandangkan adzan dan yang tertua di antara kalian harus memimpin shalat.” [Al-Bukhari dan Muslim] . Al-Bukhari menambahkan dalam versinya \"Dan berdoalah seperti kamu telah melihatku berdoa.\"","language":"bahasa"}],"narrated":[{"text":"Malik bin Al-Huwairith (May Allah be pleased with him) reported:","language":"english"},{"text":"Malik bin Al-Huwairith radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"713","hadith_id":"riyadussalihin","text":[{"text":"وعن عمر بن الخطاب رضي الله عنه قال‏:‏ استأذنت النبي صلى الله عليه وسلم الله عليه وسلم في العمرة، فأذن ، وقال‏:‏‏ \"‏لا تنسانا يا أخي من دعائك‏\"‏ فقال كلمة ما يسرني أن لي بها الدنيا‏.‏ وفي رواية قال‏:‏ “أشركنا يا أخي في دعائك” ‏(‏‏(‏رواه أبوداود، والترمذي وقال‏:‏ حديث حسن صحيح‏)‏‏)‏‏.‏","language":"arabic"},{"text":"I sought permission of the Prophet (ﷺ) to perform \u0027Umrah, and he granted me leave and said, \"Brother, do not forget us in your supplications.\" I would not exchange these words of his for the whole world. Another narration is: He (ﷺ) said, \"Include us, my brother, in your supplications.\" [Abu Dawud and At- Tirmidhi].","language":"english"},{"text":"Saya meminta izin Nabi (ﷺ) untuk melakukan \u0027Umrah, dan dia memberi saya izin dan berkata, \"Saudaraku, jangan lupakan kami dalam doa-doamu.\" Saya tidak akan menukar kata-katanya ini untuk seluruh dunia. Narasi lain adalah: Dia (ﷺ) berkata, \"Sertakan kami, saudaraku, dalam doa-doamu.\" [Abu Dawud dan At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"\u0027Umar bin Al-Khattab (May Allah be pleased with him) reported:","language":"english"},{"text":"\u0027Umar bin Al-Khattab (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"714","hadith_id":"riyadussalihin","text":[{"text":"وعن سالم بن عبد الله بن عمر أن عبد الله بن عمر رضي الله عنهما كان يقول للرجل إذا أراد سفراً‏:‏ ادن مني حتى أودعك كما كان رسول الله صلى الله عليه وسلم يودعنا، فيقول‏:‏ أستودع الله دينك، وأمانتك، وخواتيم عملك‏.‏ ‏(‏‏(‏رواه الترمذي، وقال‏:‏ حديث حسن صحيح‏)‏‏)‏‏.‏","language":"arabic"},{"text":"When a man was to set out on a journey, \u0027Abdullah bin \u0027Umar (May Allah be pleased with them) would say to him: \"Draw near so that I may bid farewell to you as Messenger of Allah (ﷺ) used to bid farewell to us. (The Messenger of Allah (ﷺ) used to say: \"\u0027Astaudi\u0027ullaha dinaka, wa amanataka, wa khawatima \u0027amalika\u0027 (I entrust Allah with your Deen, your trust and your last deeds).\" [At-Tirmidhi].","language":"english"},{"text":"Ketika seorang laki-laki hendak melakukan perjalanan, \u0027Abdullah bin \u0027Umar (semoga Allah meridhoi mereka) akan berkata kepadanya: \"Mendekatlah agar aku dapat mengucapkan selamat tinggal kepadamu seperti yang biasa dilakukan oleh Rasulullah (ﷺ) selamat tinggal kami.(Rasulullah (ﷺ) biasa mengatakan: \"\u0027Astaudi\u0027ullaha dinaka, wa amanataka, wa khawatima \u0027amalika\u0027 (Aku mempercayakan Allah dengan Dienmu, amanahmu dan amal terakhirmu).\" [At -Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Salim bin \u0027Abdullah bin \u0027Umar (May Allah be pleased with them) reported:","language":"english"},{"text":"Salim bin \u0027Abdullah bin \u0027Umar (Semoga Allah meridhoi mereka) melaporkan:","language":"bahasa"}]},{"index":"715","hadith_id":"riyadussalihin","text":[{"text":"وعن عبد الله بن يزيد الخطمي الصحبي رضي الله عنه قال‏:‏ كان رسول الله صلى الله عليه وسلم إذا أراد أن يودع الجيش قال‏:‏ ‏ \"‏أستودع الله دينكم، وأماناتكم،وخواتيم أعمالكم‏\"‏‏.‏ حديث صحيح، ‏(‏‏(‏رواه أبو داود وغيره بإسناد صحيح‏)‏‏)‏‏.‏","language":"arabic"},{"text":"When Messenger of Allah (ﷺ) intended to bid farewell to his army he would say: \"Astau-di\u0027ullaha dinakaum, wa amanatakum, wa khawatima \u0027amalikum (I entrust Allah with your Deen, your trust and your last deeds).\" [Abu Dawud].","language":"english"},{"text":"Ketika Rasulullah (ﷺ) bermaksud untuk mengucapkan selamat tinggal kepada pasukannya, dia akan mengatakan: \"Astau-di\u0027ullaha dinakaum, wa amanatakum, wa khawatima \u0027amalikum (Aku mempercayakan Allah dengan Dienmu, amanatmu, dan amal terakhirmu).\" [Abu Daud] .","language":"bahasa"}],"narrated":[{"text":"\u0027Abdullah bin Yazid Al-Khatmi (May Allah be pleased with him) reported:","language":"english"},{"text":"\u0027Abdullah bin Yazid Al-Khatmi (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"716","hadith_id":"riyadussalihin","text":[{"text":"وعن أنس رضي الله عنه قال‏:‏ جاء رجل إلى النبي صلى الله عليه وسلمى الله عليه وسلم فقال يا رسول الله ، إني أريدُ سفراً، فزودني، فقال‏:‏ زودك الله التقوى‏\"‏ قال‏:‏ زدني، فقال‏:‏ ‏\"‏وغفر ذنبك‏\"‏ ، قال‏:‏ زدني، قال‏:‏ “ويسر لك الخير حيثما كنت” ‏(‏‏(‏رواه الترمذي وقال ‏:‏ حديث حسن‏)‏‏)‏","language":"arabic"},{"text":"A man came to the Prophet (ﷺ) and said: \"O Messenger of Allah! I intend to go on a journey, so supplicate for me.\" He (ﷺ) said, \"May Allah grant you the provision of piety.\" The man said: \"Please supplicate more for me.\" He (ﷺ) said, \"May He forgive your sins!\" The man repeated: \"Please supplicate more for me.\" Messenger of Allah (ﷺ) said, \"May He facilitate for you the doing of good wherever you are.\" [At-Tirmidhi].","language":"english"},{"text":"Seorang laki-laki datang kepada Nabi (ﷺ) dan berkata: \"Ya Rasulullah! Saya berniat untuk melakukan perjalanan, maka berdoalah untuk saya.\" Dia (ﷺ) berkata, \"Semoga Allah memberimu rezeki takwa.\" Pria itu berkata: \"Tolong doakan lebih banyak untukku.\" Dia (ﷺ) berkata, \"Semoga Dia mengampuni dosa-dosamu!\" Pria itu mengulangi: \"Tolong doakan lebih banyak untukku.\" Rasulullah (ﷺ) bersabda, “Semoga Dia memudahkan bagimu untuk berbuat kebaikan dimanapun kamu berada.” [At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Anas (May Allah be pleased with him) reported:","language":"english"},{"text":"Anas (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"717","hadith_id":"riyadussalihin","text":[{"text":"-وعن جابر رضي الله عنه قال‏:‏ كان رسول الله صلى الله عليه وسلم يعلمنا الإستخارة في الأمور كلها كالسورة من القرآن ، يقول ‏:‏ إذا همّ أحدكم بالأمر، فليركع ركعتين من غير الفريضة، ثم ليقل، اللهم إني أستخيرك بعلمك، وأستقدرك بقدرتك، وأسألك من فضلك العظيم؛ فإنك تقدر ولا أقدر وتعلم ولا أعلم، وأنت علام الغيوب‏.‏ اللهم إن كنت تعلم أن هذا الأمر خير لي في ديني ومعاشي وعاقبة أمري‏\"‏ أو قال‏:‏ ‏\"‏عاجل أمري وآجله ، فاقدره لي ويسره لي، ثم بارك لي فيه، وإن كنت تعلم أن هذا الأمر شر لي في ديني ومعاشي وعاقبة أمري‏\"‏ أو قال‏:‏ ‏\"‏عاجل أمري وآجله، فاصرفه عني ، واصرفني عنه، واقدر لي الخير حيث كان، ثم ارضني به‏\"‏ قال‏:‏ ويسمي حاجته‏.‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","language":"arabic"},{"text":"Messenger of Allah (ﷺ) used to teach us the Istikharah (seeking guidance from Allah) in all matters as he would teach us a Surah of the Qur\u0027an. He used to say: \"When one of you contemplates entering upon an enterprise, let him perform two Rak\u0027ah of optional prayer other than Fard prayers and then supplicate: \"Allahumma inni astakhiruka bi \u0027ilmika, wa astaqdiruka bi qudratika, wa as-\u0027aluka min fadlikal-\u0027azim. Fainnaka taqdiru wa la aqdiru, wa ta\u0027lamu wa la a\u0027lamu, wa Anta \u0027allamul- ghuyub. Allahumma in kunta ta\u0027lamu anna hadhal-\u0027amra (and name what you want to do) khairun li fi dini wa ma\u0027ashi wa \u0027aqibati amri, (or he said) \u0027ajili amri ajilihi, faqdurhu li wa yassirhu li, thumma barik li fihi. Wa in kunta ta\u0027lamu anna hadhal \u0027amra (and name what you want to do) sharrun li fi dini wa ma\u0027ashi wa \u0027aqibati amri, (or he said) wa \u0027ajili amri wa ajilihi, fasrifhu \u0027anni, wasrifni \u0027anhu, waqdur liyal- khaira haithu kana, thumma ardini bihi.\" (O Allah, I consult You through Your Knowledge, and I seek strength through Your Power, and ask of Your Great Bounty; for You are Capable whereas I am not and, You know and I do not, and You are the Knower of hidden things. O Allah, if You know that this matter (and name it) is good for me in respect of my Deen, my livelihood and the consequences of my affairs, (or he said), the sooner or the later of my affairs then ordain it for me, make it easy for me, and bless it for me. But if You know this matter (and name it) to be bad for my Deen, my livelihood or the consequences of my affairs, (or he said) the sooner or the later of my affairs then turn it away from me, and turn me away from it, and grant me power to do good whatever it may be, and cause me to be contented with it). And let the supplicant specify the object.\" [Al-Bukhari]","language":"english"},{"text":"Rasulullah (ﷺ) biasa mengajari kita Istikharah (mencari petunjuk dari Allah) dalam segala hal seperti dia mengajari kita sebuah Surah Al-Qur\u0027an. Beliau bersabda: “Jika salah seorang di antara kalian hendak memasuki suatu perusahaan, hendaklah dia mengerjakan dua rakaat shalat sunnah selain shalat fardhu, lalu berdoa: “Allahumma inni astakhiruka bi \u0027ilmika, wa astaqdiruka bi qudratika, wa as- \u0027aluka min fadlikal-\u0027azim. Fainnaka taqdiru wa la aqdiru, wa ta\u0027lamu wa la a\u0027lamu, wa Anta \u0027allamul-ghuyub. Allahumma in kunta ta\u0027lamu anna hadhal-\u0027amra (dan sebutkan apa yang ingin kamu lakukan) khairun li fi dini wa ma\u0027ashi wa \u0027aqibati amri, (atau dia berkata) \u0027ajili amri ajilihi, faqdurhu li wa yassirhu li, thumma barik li fihi. Wa in kunta ta\u0027lamu anna hadhal\u0027 (atau dia berkata) cepat atau lambat urusanku maka jauhkan dariku, dan jauhkan aku darinya, dan beri aku kekuatan untuk melakukan kebaikan apa pun itu, dan buat aku puas dengannya). Dan biarkan pemohon menentukan objeknya.\" [Al-Bukhari]","language":"bahasa"}],"narrated":[{"text":"Jabir (May Allah be pleased with him) reported:","language":"english"},{"text":"Jabir (ra dengan dia) melaporkan:","language":"bahasa"}]},{"index":"718","hadith_id":"riyadussalihin","text":[{"text":"عن جابر رضي الله عنه ‏:‏ كان النبي صلى الله عليه وسلم الله عليه وسلم إذا كان يوم عيد خالف الطريق‏.‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","language":"arabic"},{"text":"On the occasion of the \u0027Eid, the Prophet (ﷺ) would proceed to the prayer place taking one route and returning from another. [Al-Bukhari].","language":"english"},{"text":"Pada kesempatan Idul Fitri, Nabi (ﷺ) akan melanjutkan ke tempat shalat mengambil satu rute dan kembali dari yang lain. [Al-Bukhari] .","language":"bahasa"}],"narrated":[{"text":"Jabir (May Allah be pleased with him) reported:","language":"english"},{"text":"Jabir (ra dengan dia) melaporkan:","language":"bahasa"}]},{"index":"719","hadith_id":"riyadussalihin","text":[{"text":"وعن ابن عمر رضي الله عنهما أن رسول الله صلى الله عليه وسلم كان يخرج من طريق الشجرة، ويدخل من طريق المعرس، وإذا دخل مكة دخل من الثنية العليا ويخرج من الثنية السفلى‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏","language":"arabic"},{"text":"Messenger of Allah (ﷺ) used to go by way of Ash-Shajarah and return by way of Al-Mu\u0027arras. He would also enter Makkah through the Higher Pass and would leave it through the Lower Pass. [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) biasa pergi melalui Asy-Shajarah dan kembali melalui Al-Mu\u0027arras. Dia juga akan memasuki Mekah melalui Celah Tinggi dan akan meninggalkannya melalui Celah Bawah. [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Ibn \u0027Umar (May Allah be pleased with them) reported:","language":"english"},{"text":"Ibnu \u0027Umar radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"720","hadith_id":"riyadussalihin","text":[{"text":"وعن عائشة رضي الله عنها قالت‏:‏ كان رسول الله صلى الله عليه وسلم يعجبه التيمن في شأنه كله‏:‏ في طهوره، وترجله، وتنعله‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏","language":"arabic"},{"text":"Messenger of Allah (ﷺ) liked to use his right hand in all matters: in combing his hair and wearing his shoes. [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) suka menggunakan tangan kanannya dalam segala hal: dalam menyisir rambut dan memakai sepatunya. [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"\u0027Aishah (May Allah be pleased with her) reported:","language":"english"},{"text":"\u0027Aisyah r.a. melaporkan:","language":"bahasa"}]},{"index":"721","hadith_id":"riyadussalihin","text":[{"text":"وعنها قالت‏:‏ كانت يد رسول الله صلى الله عليه وسلم ، اليمنى لطهوره وطعامه، وكان اليسرى لخلائه وما كان من أذى‏.‏ حديث صحيح، ‏(‏‏(‏رواه أبو داود وغيره بإسناد صحيح‏)‏‏)‏‏.‏","language":"arabic"},{"text":"Messenger of Allah was used to using his right hand for performing Wudu\u0027 and for eating his food whereas he was used to using his left hand in his toilet and for other similar purposes. [Abu Dawud]","language":"english"},{"text":"Rasulullah terbiasa menggunakan tangan kanannya untuk berwudhu dan memakan makanannya sedangkan beliau menggunakan tangan kirinya di toilet dan untuk keperluan lain yang serupa. [Abu Daud]","language":"bahasa"}],"narrated":[{"text":"\u0027Aishah (May Allah be pleased with her) reported:","language":"english"},{"text":"\u0027Aisyah r.a. melaporkan:","language":"bahasa"}]},{"index":"722","hadith_id":"riyadussalihin","text":[{"text":"وعن أم عطية رضي الله عنها أن النبي صلى الله عليه وسلمى الله عليه وسلم ، قال لهن في غسل ابنته زينب رضي الله عنها ‏:‏ ‏ \"‏ابدأن بميامنها ومواضع الوضوء منها‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏","language":"arabic"},{"text":"The Prophet (ﷺ) instructed us at the time of washing the dead body of his daughter Zainab (May Allah be pleased with her) to begin with her right side, and from the parts that are washed in Wudu\u0027. [Al-Bukhari and Muslim].","language":"english"},{"text":"Nabi (ﷺ) menginstruksikan kita pada saat memandikan jenazah putrinya Zainab (ra dengan dia) untuk memulai dengan sisi kanannya, dan dari bagian-bagian yang dibasuh dalam Wudu\u0027. [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Umm \u0027Atiyyah (May Allah be pleased with her) reported:","language":"english"},{"text":"Ummu \u0027Atiyyah (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"723","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ “ إذا انتعل أحدكم فليبدأ باليمنى، وإذا نزع فليبدأ بالشمال‏.‏لتكن اليمنى أولهما تنعل، وآخرهما تنزع‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏","language":"arabic"},{"text":"Messenger of Allah (ﷺ) said, \"When any of you puts on his shoes, he should put on the right one first; and when he takes them off, he should begin with the left. Let the right shoe be the first to be put on and the last to be taken off.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, “Jika salah seorang dari kalian memakai sepatunya, hendaknya ia memakai yang kanan terlebih dahulu; dan ketika ia melepasnya, ia harus mulai dengan yang kiri. Hendaklah sepatu kanan menjadi yang pertama. pakai dan yang terakhir dilepas.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"724","hadith_id":"riyadussalihin","text":[{"text":"وعن حفصة رضي الله عنها أن رسول الله صلى الله عليه وسلم ، كان يجعل يمينه لطعامه وشرابه وثيابه، ويجعل يساره لما سوى ذلك‏.‏ ‏(‏‏(‏رواه أبو داود والترمذي وغيره‏)‏‏)‏‏.‏","language":"arabic"},{"text":"Messenger of Allah (ﷺ) used to use his right hand for eating, drinking and wearing his clothes and used to use his left hand for other purposes. [Abu Dawud and At-Tirmidhi].","language":"english"},{"text":"Rasulullah (ﷺ) biasa menggunakan tangan kanannya untuk makan, minum dan memakai pakaiannya dan biasa menggunakan tangan kirinya untuk keperluan lain. [Abu Dawud dan At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Hafsah (May Allah be pleased with her) reported:","language":"english"},{"text":"Hafsah (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"725","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ “ إذا لبستم،وإذا توضأتم، فابدؤا بأيمانكم” حديث صحيح، ‏(‏‏(‏رواه أبو داود والترمذي بإسناد صحيح‏)‏‏)‏‏.‏","language":"arabic"},{"text":"Messenger of Allah (ﷺ) said, \"When you wear your clothes or perform your Wudu\u0027, begin with your right side.\" [Abu Dawud and At- Tirmidhi].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Ketika Anda mengenakan pakaian Anda atau melakukan Wudhu Anda, mulailah dengan sisi kanan Anda.\" [Abu Dawud dan At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"726","hadith_id":"riyadussalihin","text":[{"text":"وعن أنس رضي الله عنه أن رسول الله صلى الله عليه وسلم أتى منى‏:‏ فأتى الجمرة فرماها، ثم أتى منزله بمنى، ونحر، ثم قال للحلاق “خذ” وأشار إلى جانبه الأيمن، ثم الأيسر، ثم جعل يعطيه الناس‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏وفي رواية‏:‏ لما رمى الجمرة، ونحر نسكه وحلق‏:‏ ناول الحلاق شقه الأيمن فحلقه، ثم دعا أبا طلحة الأنصارى رضي الله عنه ، فأعطاه إياه،ثم ناوله الشق الأيسر فقال “احلق” فحلقه فأعطاه أبا طلحة فقال‏:‏ ‏ \"‏اقسمه بين الناس‏\"‏‏.‏","language":"arabic"},{"text":"When Messenger of Allah (ﷺ) went to Mina, he came to Jamrat-ul-\u0027Aqabah and threw pebbles at it. After that, he went to his lodge in Mina and sacrificed. Then he called for a barber and pointed his right side to him, said, \"Shave from here.\" Then he pointed his left side and said, \"Take (hair) from here.\" Then he distributed his hair among the people. [Al-Bukhari and Muslim]. Another narration is: After the Messenger of Allah (ﷺ) had thrown pebbles at Jamrah and sacrificed an animal, he turned the right side of his head towards the barber who shaved it for him. Then he called Abu Talhah Ansari (May Allah be pleased with him) and gave his hair to him. Then he turned his head to the left side and asked the barber to shave it. He gave the hair to Abu Talhah and told him, \"Distribute it among the people.\"","language":"english"},{"text":"Ketika Rasulullah (ﷺ) pergi ke Mina, dia datang ke Jamrat-ul-\u0027Aqabah dan melemparkan kerikil ke sana. Setelah itu, dia pergi ke pondoknya di Mina dan berqurban. Kemudian dia memanggil tukang cukur dan mengarahkan sisi kanannya ke arahnya, berkata, \"Cukur dari sini.\" Kemudian dia menunjuk sisi kirinya dan berkata, \"Ambil (rambut) dari sini.\" Kemudian dia membagikan rambutnya di antara orang-orang. [Al-Bukhari dan Muslim] . Riwayat lainnya adalah: Setelah Rasulullah (ﷺ) melemparkan kerikil ke Jamrah dan menyembelih seekor hewan, dia menghadapkan sisi kanan kepalanya ke arah tukang cukur yang mencukurnya untuknya. Kemudian dia memanggil Abu Thalhah Ansari radhiyallahu \u0027anhu dan memberikan rambutnya kepadanya. Kemudian dia menoleh ke kiri dan meminta tukang cukur untuk mencukurnya. Dia memberikan rambut itu kepada Abu Talhah dan mengatakan kepadanya, \"Bagikan di antara orang-orang.\"","language":"bahasa"}],"narrated":[{"text":"Anas (May Allah be pleased with him) reported:","language":"english"},{"text":"Anas (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]}]