[{"index":"813","hadith_id":"riyadussalihin","text":[{"text":"عن البراء بن عازب رضى الله عنهما قال‏:‏ كان رسول الله صلى الله عليه وسلم ِإذا أوى إلى فراشه نام على شقه الأيمن، ثم قال‏:‏ ‏ \"‏ اللهم أسلمت نفسي إليك، ووجهت وجهي إليك، وفوضت أمري إليك، وألجأت ظهري إليك، رغبة ورهبة إليك، لا ملجأ ولا منجى منك إلا إليك‏.‏ آمنت بكتابك الذي أنزلت ‏.‏ ونبيك الذي أرسلت‏\"‏‏.‏ ‏((رواه البخاري بهذا اللفظ في كتاب الأدب من صحيحه‏)‏‏)‏","language":"arabic"},{"text":"Whenever Messenger of Allah (ﷺ) went to bed, he would lie down on his right side and recite: \"Allahumma aslamtu nafsi ilaika, wa wajjahtu wajhi ilaika, wa fawwadtu amri ilaika, wa \u0027alja\u0027tu zahri ilaika, raghbatan wa rahbatan ilaika, la malja\u0027a wa la manja illa ilaika. Amantu bikitabikal-ladhi anzalta, wa nabiyyikal-ladhi arsalta [O Allah! I have submitted myself to You, I have turned my face to You, committed my affairs to You, and depend on You for protection out of desire for You and out of fear of You (expecting Your reward and fearing Your punishment). There is no refuge and no place of safety from You but with You. I believed in the Book You have revealed, and in the Prophet You have sent (i.e., Muhammad (ﷺ)).]\" [Al-Bukhari].","language":"english"},{"text":"Setiap kali Rasulullah (ﷺ) pergi tidur, ia akan berbaring di sisi kanannya dan membaca: \"Allahumma aslamtu nafsi ilaika, wa wajjahtu wajhi ilaika, wa fawwadtu amri ilaika, wa \u0027alja\u0027tu zahri ilaika, raghbatan wa rahbatan ilaika , la malja\u0027a wa la manja illa ilaika. Amantu bikitabikal-ladhi anzalta, wa nabiyyikal-ladhi arsalta [Ya Allah! Aku telah menyerahkan diriku kepada-Mu, aku menghadapkan wajahku kepada-Mu, menyerahkan urusanku kepada-Mu, dan bergantung pada-Mu perlindungan kepada-Mu karena keinginan kepada-Mu dan karena takut kepada-Mu (mengharap pahala-Mu dan takut akan azab-Mu). Tidak ada perlindungan dan tempat perlindungan dari-Mu kecuali dengan-Mu. Aku beriman kepada Kitab yang telah Engkau turunkan, dan kepada-Mu Nabi yang telah Engkau utus (yaitu, Muhammad (ﷺ)).]\" [Al-Bukhari] .","language":"bahasa"}],"narrated":[{"text":"Al-Bara\u0027 bin \u0027Azib (May Allah be pleased with them) reported:","language":"english"},{"text":"Al-Bara\u0027 bin \u0027Azib r.a. melaporkan:","language":"bahasa"}]},{"index":"814","hadith_id":"riyadussalihin","text":[{"text":"وعنه قال‏:‏ قال لي رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏إذا أتيت مضجعك فتوضأ وضوءك للصلاة، ثم اضطجع على شقك الأيمن ، وقل ‏.‏‏.‏‏.‏ ‏\"‏ وذكر نحوهن وفيه‏:‏ ‏\"‏ واجعلهن آخر ما تقول‏\" (‏‏(‏متفق عليه‏)‏‏)‏.‏‏","language":"arabic"},{"text":"Messenger of Allah (ﷺ) directed me thus: \"Whenever you go to bed, perform Wudu\u0027 as you do for Salat then (before sleeping) recite: \u0027O Allah! I have submitted myself to You, I have turned myself to You, committed my affairs to You and sought Your refuge for protection out of desire for You and fear of You (expecting Your reward and fearing Your punishment). There is no refuge and no place of safety from You but with You. I believe in the Book You have revealed and in the Prophet (ﷺ) You have sent.\"\u0027 Messenger of Allah (ﷺ) added: \"If anyone recites these words and dies during the night, he will die on the true Deen, and if he remains alive till the morning, he will obtain good. And make this supplication your last words (before sleeping).\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) mengarahkan saya demikian: \"Setiap kali Anda pergi tidur, lakukan Wudhu\u0027 seperti yang Anda lakukan untuk Salat kemudian (sebelum tidur) ucapkan: \u0027Ya Allah! Saya telah menyerahkan diri kepada-Mu, saya telah menyerahkan diri kepada-Mu, menyerahkan urusanku kepada-Mu dan berlindung kepada-Mu karena keinginan kepada-Mu dan takut kepada-Mu (mengharap pahala-Mu dan takut akan hukuman-Mu). Tidak ada perlindungan dan tidak ada tempat perlindungan dari-Mu kecuali dengan-Mu. Aku beriman kepada Kitab Anda telah mengungkapkan dan di dalam Nabi (ﷺ) Anda telah mengutus.\"\u0027 Rasulullah (ﷺ) menambahkan: \"Jika seseorang membaca kata-kata ini dan mati pada malam hari, dia akan mati di Dien yang benar, dan jika dia tetap hidup sampai paginya, dia akan memperoleh kebaikan. Dan jadikan doa ini sebagai kata terakhirmu (sebelum tidur).” [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Al-Bara\u0027 bin \u0027Azib (May Allah be pleased with them) reported:","language":"english"},{"text":"Al-Bara\u0027 bin \u0027Azib r.a. melaporkan:","language":"bahasa"}]},{"index":"815","hadith_id":"riyadussalihin","text":[{"text":"وعن عائشة رضى الله عنها قالت‏:‏ كان النبي صلى الله عليه وسلم يصلى من الليل إحدى عشرا ركعة، فإذا طلع الفجر صلى ركعتين خفيفتين ، ثم اضطجع على شقه الأيمن حتى يجئ المؤذن فيؤذنه (‏‏(‏متفق عليه‏)‏‏)‏‏.‏ ‏‏","language":"arabic"},{"text":"The Prophet (ﷺ) used to offer eleven Rak\u0027ah of optional Salat (prayers) in the latter part of night. When it was about dawn, he would offer two short Rak\u0027ah and then would lie down on his right side till the Mu\u0027adhdhin (one who calls for prayer) would come to inform him that the congregation had gathered (for prayer). [Al-Bukhari and Muslim].","language":"english"},{"text":"Nabi (ﷺ) biasa menawarkan sebelas rakaat salat opsional di bagian akhir malam. Ketika menjelang subuh, dia akan melakukan dua rakaat pendek dan kemudian berbaring di sisi kanannya sampai Mu\u0027adzin (orang yang mengumandangkan sholat) datang untuk mengabarkan bahwa jamaah telah berkumpul (untuk sholat). [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"\u0027Aishah (May Allah be pleased with her) reported:","language":"english"},{"text":"\u0027Aisyah r.a. melaporkan:","language":"bahasa"}]},{"index":"816","hadith_id":"riyadussalihin","text":[{"text":"وعن حذيفة رضى الله عنه قال‏:‏كان النبي صلى الله عليه وسلم إذا أخذ مضجعه من الليل وضع يده تحت خده، ثم يقول‏:‏ ‏\"‏اللهم باسمك أموت وأحيا‏\"‏ وإذا استيقظ قال‏:‏ ‏\"‏الحمد لله الذي أحيانا بعد ما أماتنا وإليه النشور‏\"‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏.‏","language":"arabic"},{"text":"Whenever the Prophet (ﷺ) lay down for sleep at night, he would place his (right) hand under his (right) cheek and supplicate: \"Allahumma bismika amutu wa ahya [O Allah, with Your Name will I die and live (wake up)].\" And when he woke up, he would supplicate: \"Al-hamdu lillahil-ladhi ahyana ba\u0027da ma amatana, wa ilaihin-nushur (All praise is due to Allah, Who has brought us back to life after He has caused us to die, and to Him is the return).\" [Al-Bukhari].","language":"english"},{"text":"Setiap kali Nabi (ﷺ) berbaring untuk tidur di malam hari, dia akan meletakkan tangan (kanan) di bawah pipi (kanan) dan berdoa: \"Allahumma bismika amutu wa ahya [Ya Allah, dengan Nama-Mu aku akan mati dan hidup (bangun). ke atas)].\" Dan ketika dia bangun, dia akan berdoa: \"Al-hamdu lillahil-ladhi ahyana ba\u0027da ma amatana, wa ilaihin-nushur (Segala puji bagi Allah yang menghidupkan kita kembali setelah Dia mematikan kita). , dan hanya kepada-Nya tempat kembali). [Al-Bukhari] .","language":"bahasa"}],"narrated":[{"text":"Hudhaifah (May Allah be pleased with him) reported:","language":"english"},{"text":"Hudzaifah r.a. melaporkan:","language":"bahasa"}]},{"index":"817","hadith_id":"riyadussalihin","text":[{"text":"وعن يعيش بن طخفة الغفارى رضى الله عنه قال‏:‏ قال أبى‏:‏ بينما أنا مضطجع في المسجد على بطني إذا رجل يحركني برجله فقال‏:‏ ‏ \"‏إن هذه ضجعة يبغضها الله‏\"‏ قال‏:‏ فنظرت ، فإذا رسول الله صلى الله عليه وسلم‏. ((رواه أبو داود بإسناد صحيح))‏.‏","language":"arabic"},{"text":"My father said: I was lying down on my belly in the mosque when someone shook me with his foot and said, \"Lying down this way is disapproved by Allah.\" I looked up and saw that it was Messenger of Allah (ﷺ). [Abu Dawud].","language":"english"},{"text":"Ayah saya berkata: Saya sedang berbaring tengkurap di masjid ketika seseorang mengguncang saya dengan kakinya dan berkata, \"Berbaring dengan cara ini tidak disetujui oleh Allah.\" Aku mendongak dan melihat bahwa itu adalah Rasulullah (ﷺ). [Abu Daud] .","language":"bahasa"}],"narrated":[{"text":"Ya\u0027ish bin Tikhfah Al-Ghifari (May Allah be pleased with him) reported:","language":"english"},{"text":"Ya\u0027ish bin Tikhfah Al-Ghifari (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"818","hadith_id":"riyadussalihin","text":[{"text":"وعن أبى هريرة رضى الله عنه ، عن رسول الله صلى الله عليه وسلم قال‏:‏ ‏\"‏ من قعد مقعداً لم يذكر الله تعالى فيه،كانت عليه من الله تعالى ترة، ومن اضطجع مضجعاً لا يذكر الله تعالى فيه، كانت عليه من الله ترة‏\"‏ ((رواه أبو داود بإسناد حسن)).‏ \"الترة\" بكسر التاء المثناة من فوق، وهي: النقص، وقيل: التبعة.","language":"arabic"},{"text":"Messenger of Allah (ﷺ) said, \"Whoever sits in a place where he does not remember Allah (SWT), he will suffer loss and incur displeasure of Allah; and whoever lies down (to sleep) in a place where he does not remember Allah, he will suffer sorrow and incur displeasure of Allah.\" [Abu Dawud].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, “Barangsiapa duduk di tempat yang tidak mengingat Allah (SWT), dia akan menderita kerugian dan mendapat kemurkaan Allah; dan siapa pun yang berbaring (tidur) di tempat yang tidak dia ingat. Allah, dia akan menderita kesedihan dan menimbulkan kemurkaan Allah.” [Abu Daud] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"819","hadith_id":"riyadussalihin","text":[{"text":"عن عبد الله بن زيد رضى الله عنه أنه رأى رسول الله صلى الله عليه وسلم مستلقياً في المسجد، واضعاً إحدى رجليه على الأخرى‏. (‏‏(‏متفق عليه‏)‏‏)‏‏‏.","language":"arabic"},{"text":"I saw Messenger of Allah (ﷺ) lying down on his back in the mosque, placing one leg on the other. [Al-Bukhari and Muslim].","language":"english"},{"text":"Saya melihat Rasulullah (ﷺ) berbaring telentang di masjid, meletakkan satu kaki di atas yang lain. [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"\u0027Abdullah bin Zaid (May Allah be pleased with them) reported:","language":"english"},{"text":"\u0027Abdullah bin Zaid (ra dengan mereka) melaporkan:","language":"bahasa"}]},{"index":"820","hadith_id":"riyadussalihin","text":[{"text":"وعن جابر بن سمرة رضى الله عنه قال‏:‏ كان النبي صلى الله عليه وسلم إذا صلى الفجر تربع في مجلسه حتى تطلع الشمس حسناء‏.‏ حديث صحيح، رواه أبو داود وغيره بأسانيد صحيحة‏.‏","language":"arabic"},{"text":"After the Fajr (dawn) prayer the Prophet (ﷺ) used to sit crossed legged in the same place in which he had prayed till the sun shone brightly. [Abu Dawud].","language":"english"},{"text":"Setelah salat Subuh Nabi (ﷺ) biasa duduk bersila di tempat yang sama di mana ia telah berdoa sampai matahari bersinar terang. [Abu Daud] .","language":"bahasa"}],"narrated":[{"text":"Jabir bin Samurah (May Allah be pleased with him) reported:","language":"english"},{"text":"Jabir bin Samurah radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"821","hadith_id":"riyadussalihin","text":[{"text":"وعن ابن عمر رضى الله عنهما قال‏:‏ رأيت رسول الله صلى الله عليه وسلم بفناء الكعبة محتبياً بيديه هكذا‏.‏ ووصف بيديه الاحتباء، وهو القرفصاء‏.‏ ‏‏(‏‏(‏رواه البخاري‏)‏‏)‏.‏","language":"arabic"},{"text":"I saw Messenger of Allah (ﷺ) sitting in the compound of the Holy Ka\u0027bah, with the thighs against the stomach and arms around his legs. [Al- Bukhari].","language":"english"},{"text":"Saya melihat Rasulullah (ﷺ) duduk di halaman Ka\u0027bah Suci, dengan paha menempel pada perut dan tangan melingkari kakinya. [Al-Bukhari] .","language":"bahasa"}],"narrated":[{"text":"Ibn \u0027Umar (May Allah be pleased with them) reported:","language":"english"},{"text":"Ibnu \u0027Umar radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"822","hadith_id":"riyadussalihin","text":[{"text":"وعن قيلة بنت مخرمة رضى الله عنها قالت‏:‏ رأيت النبي صلى الله عليه وسلم وهو قاعد القرفصاء، فلما رأيت رسول الله صلى الله عليه وسلم المتخشع في الجلسة أرعدت من الفرق‏.‏ ((رواه أبو داود والترمذي))‏.‏","language":"arabic"},{"text":"I saw the Prophet (ﷺ) seated with his arms enfolding his legs; and when I saw him in such a state of humble guise I trembled with fear due to the awe (he showed in that posture). [Abu Dawud and At-Tirmidhi].","language":"english"},{"text":"Aku melihat Nabi (ﷺ) duduk dengan tangan terlipat di kedua kakinya; dan ketika saya melihatnya dalam keadaan penyamaran yang begitu rendah hati, saya gemetar ketakutan karena kekaguman (dia menunjukkan dalam postur itu). [Abu Dawud dan At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Qailah bint Makhramah (May Allah be pleased with her) reported:","language":"english"},{"text":"Qailah binti Makhramah (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"823","hadith_id":"riyadussalihin","text":[{"text":"وعن الشريد بن سويد رضى الله عنه قال‏:‏ مر بي رسول الله صلى الله عليه وسلم وأنا جالس هكذا، وقد وضعت يدي اليسرى خلف ظهري، واتكأت على إلية يدي فقال‏:‏ ‏ \"‏أتقعد قعدة المغضوب عليهم‏؟‏‏!‏‏\"‏ ((رواه أبو داود بإسناد صحيح)).‏","language":"arabic"},{"text":"Messenger of Allah (ﷺ) passed by me when I was sitting with my left hand behind my back and leaning on my palm. On seeing me in this posture he said, \"Do you sit like those upon whom the Wrath of Allah has descended?\" [Abu Dawud].","language":"english"},{"text":"Rasulullah (ﷺ) melewatiku ketika aku sedang duduk dengan tangan kiri di belakang punggungku dan bersandar pada telapak tanganku. Saat melihatku dalam posisi ini, dia berkata, \"Apakah kamu duduk seperti orang-orang yang diturunkan kemurkaan Allah?\" [Abu Daud] .","language":"bahasa"}],"narrated":[{"text":"Ash-Sharid bin Suwaid (May Allah be pleased with him) reported:","language":"english"},{"text":"Ash-Sharid bin Suwaid (ra dengan dia) melaporkan:","language":"bahasa"}]},{"index":"824","hadith_id":"riyadussalihin","text":[{"text":"عن ابن عمر رضى الله عنهما قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏ \"‏لا يقمن أحدكم من مجلسه ثم يجلس فيه، ولكن توسعوا وتفسحوا‏\"‏ وكان ابن عمر إذا قام له رجل من مجلسه لم يجلس فيه‏.‏ (‏‏(‏متفق عليه‏)‏‏)‏.","language":"arabic"},{"text":"Messenger of Allah (ﷺ) said, \"Do not ask someone to give up his seat in order to take it, but make accommodation wide and sit at ease.\" It was Ibn \u0027Umar\u0027s habit that if a person left his seat for him, he would not take it. [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Jangan meminta seseorang untuk menyerahkan kursinya untuk mengambilnya, tetapi buatlah akomodasi yang luas dan duduklah dengan nyaman.\" Sudah menjadi kebiasaan Ibn \u0027Umar bahwa jika seseorang meninggalkan tempat duduknya untuknya, dia tidak akan mengambilnya. [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Ibn \u0027Umar (May Allah be pleased with them) reported:","language":"english"},{"text":"Ibnu \u0027Umar radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"825","hadith_id":"riyadussalihin","text":[{"text":"وعن أبى هريرة رضى الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏ \"‏إذا قام أحدكم من مجلس، ثم رجع إليه، فهو أحق به‏\"‏. ((رواه مسلم)).","language":"arabic"},{"text":"Messenger of Allah (ﷺ) said, \"If someone leaves his seat (for one reason or another) and returns to it, he is better entitled to it.\" [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Jika seseorang meninggalkan tempat duduknya (karena satu dan lain alasan) dan kembali ke tempat itu, dia lebih berhak atasnya.\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"826","hadith_id":"riyadussalihin","text":[{"text":"وعن جابر بن سمرة رضى الله عنهما قال‏:‏ كنا إذا أتينا النبي صلى الله عليه وسلم جلس أحدنا حيث ينتهي‏.‏ ((رواه أبو داود والترمذي، وقال: \"حديث حسن\")). ‏","language":"arabic"},{"text":"Whenever we came to the gathering of the Prophet, we would sit down at the end (of the assembly). [Abu Dawud and At-Tirmidhi].","language":"english"},{"text":"Setiap kali kami datang ke majelis Nabi, kami akan duduk di akhir (majelis). [Abu Dawud dan At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Jabir bin Samurah (May Allah be pleased with them) reported:","language":"english"},{"text":"Jabir bin Samurah (semoga Allah meridhoi mereka) melaporkan:","language":"bahasa"}]},{"index":"827","hadith_id":"riyadussalihin","text":[{"text":"وعن أبى عبد الله سلمان الفارسي رضى الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏ \"‏لا يغتسل رجل يوم الجمعة، ويتطهر ما استطاع من طهر، ويدهن من دهنه، أو يمس من طيب بيته، ثم يخرج فلا يفرق بين اثنين، ثم يصلى ما كتب له، ثم ينصت إذا تكلم الإمام، إلا غفر له ما بينه وبين الجمعة الأخرى‏\"‏ ((رواه البخاري)).‏","language":"arabic"},{"text":"Messenger of Allah (ﷺ) said, \"If a man takes a bath on Friday, purifies himself thoroughly, uses oil and perfume which is available in the house, sets forth for the mosque, does not (forcibly) sit between two persons, offers the prayer that is prescribed for him and listens to the Imam silently, his sins between this Friday and the previous Friday will be forgiven.\" [Al- Bukhari].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, “Jika seorang pria mandi pada hari Jumat, bersuci, menggunakan minyak dan wewangian yang tersedia di rumahnya, berangkat ke masjid, tidak (secara paksa) duduk di antara dua orang, menawarkan shalat yang diwajibkan baginya dan mendengarkan imam dengan tenang, dosa-dosanya antara Jumat ini dan Jumat sebelumnya akan diampuni.” [Al-Bukhari] .","language":"bahasa"}],"narrated":[{"text":"Salman Al-Farisi (May Allah be pleased with him) reported:","language":"english"},{"text":"Salman Al-Farisi (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"828","hadith_id":"riyadussalihin","text":[{"text":"وعن عمرو بن شعيب عن أبيه عن جده رضى الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏\"‏لا يحل لرجل أن يفرق بين اثنين إلا بإذنهما‏\"‏ رواه أبو داود والترمذي وقال \"حديث حسن\"‏‏.‏ ‏‏وفى رواية لأبى داود‏:‏ ‏\"‏لا يجلس بين رجلين إلا بإذنهما‏\"‏‏‏‏.‏","language":"arabic"},{"text":"Messenger of Allah (ﷺ) said, \"It is not permissible for a man to separate between two [people] without their permission.\" [Abu Dawud and At-Tirmidhi]. And in a version narrated by Abu Dawud \"He should not sit between two men without their permission.\"","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, \"Tidak halal bagi seorang pria untuk memisahkan antara dua [orang] tanpa izin mereka.\" [Abu Dawud dan At-Tirmidzi] . Dan dalam sebuah versi yang diriwayatkan oleh Abu Dawud “Dia tidak boleh duduk di antara dua orang tanpa izin mereka.”","language":"bahasa"}],"narrated":[{"text":"\u0027Amr bin Shu\u0027aib on the authority of his father and grandfather reported:","language":"english"},{"text":"\u0027Amr bin Shu\u0027aib atas otoritas ayah dan kakeknya melaporkan:","language":"bahasa"}]},{"index":"829","hadith_id":"riyadussalihin","text":[{"text":"وعن حذيفة بن اليمان رضى الله عنه أن رسول الله صلى الله عليه وسلم لعن من جلس وسط الحلقة‏‏.‏ ‏‏رواه أبو داود بإسناد صحيح. وروى الترمذى عن أبى مجلز‏:‏ أن رجلا قعد وسط الحلقة، فقال حذيفة‏:‏ ملعون على لسان محمد صلى الله عليه وسلم -من جلس وسط الحلقة‏. قال الترمذى: \"حديث حسن صحيح\".‏","language":"arabic"},{"text":"The Messenger of Allah curses the one who sits in the middle of people\u0027s circle. [Abu Dawud]. A man sat in the middle of a circle so Hudhaifah (May Allah be pleased with him) said: Cursed upon the tongue of Muhammad (ﷺ) or [he said] Allah has cursed upon the tongue of Muhammad (ﷺ) he who sits in the middle of the circle [of a gathering]. [At-Tirmidhi].","language":"english"},{"text":"Rasulullah melaknat orang yang duduk di tengah-tengah lingkaran orang. [Abu Daud] . Seorang pria duduk di tengah lingkaran sehingga Hudhaifah (semoga Allah meridhoinya) berkata: Terkutuklah lidah Muhammad (ﷺ) atau [dia berkata] Allah telah melaknat lidah Muhammad (ﷺ) orang yang duduk di tengah lingkaran [sebuah pertemuan]. [At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Hudhaifah bin Al-Yaman (May Allah be pleased with him) reported:","language":"english"},{"text":"Hudhaifah bin Al-Yaman radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"830","hadith_id":"riyadussalihin","text":[{"text":"وعن أبى سعيد الخدرى رضى الله عنه قال‏:‏ سمعت رسول الله صلى الله عليه وسلم يقول‏:‏ ‏ \"‏خير المجالس أوسعها‏\"‏‏.‏ ((رواه أبو داود بإسناد صحيح على شرط البخاري.‏))","language":"arabic"},{"text":"I heard Messenger of Allah (ﷺ) saying \"The best assemblies are those in which people make room for one another.\" [Abu Dawud].","language":"english"},{"text":"Saya mendengar Rasulullah (ﷺ) berkata, \"Majelis terbaik adalah pertemuan di mana orang-orang memberi ruang untuk satu sama lain.\" [Abu Daud] .","language":"bahasa"}],"narrated":[{"text":"Abu Sa\u0027id Al-Khudri (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Sa\u0027id Al-Khudri r.a. melaporkan:","language":"bahasa"}]},{"index":"831","hadith_id":"riyadussalihin","text":[{"text":"وعن أبى هريرة رضى الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏ \"‏من جلس في مجلس، فكثر فيه لغطه فقال قبل أن يقوم من مجلسه ذلك‏:‏ سبحانك اللهم وبحمدك، أشهد أن لا إله إلا أنت، أستغفرك وأتوب إليك، إلا غفر له ما كان في مجلسه ذلك‏\"‏ ((‏‏رَوَاهُ التِّرمِذِيُّ وَقَالَ حَدِيثٌ حَسَنٌ صحيح)).‏","language":"arabic"},{"text":"Messenger of Allah (ﷺ) said, \"Whoever sits in a gathering and indulges in useless talk and before getting up supplicates: \u0027Subhanaka Allahumma wa bihamdika, ash-hadu an la ilaha illa Anta, astaghfiruka wa atubu ilaika (O Allah, You are free from every imperfection; praise be to You. I testify that there is no true god except You; I ask Your Pardon and turn to You in repentance),\u0027 he will be forgiven for (the sins he may have intentionally or unintentionally committed) in that assembly.\" [At-Tirmidhi].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, \"Barangsiapa duduk dalam suatu pertemuan dan menikmati pembicaraan yang tidak berguna dan sebelum bangun, berdoa: \u0027Subhanaka Allahumma wa bihamdika, ash-hadu an la ilaha illa Anta, astaghfiruka wa atubu ilaika (Ya Allah, Engkau bebas dari segala ketidaksempurnaan; segala puji bagi-Mu. Aku bersaksi bahwa tidak ada Tuhan yang benar selain Engkau; aku memohon ampunan-Mu dan kembali kepada-Mu dalam pertobatan),\u0027 dia akan diampuni (dosa-dosa yang mungkin telah dia lakukan dengan sengaja atau tidak sengaja) dalam majelis itu.\" [At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"832","hadith_id":"riyadussalihin","text":[{"text":"وعن أبى برزة رضى الله عنه قال‏:‏ كان رسول الله صلى الله عليه وسلم يقول بآخرة إذا أراد أن يقوم من المجلس‏:‏ ‏\"‏سبحانك الله وبحمدك، أشهد أن لا إله إلا أنت، أستغفرك وأتوب إليك‏\"‏ فقال رجل‏:‏ يا رسول الله، إنك لتقول قولاً ما كنت تقوله فيما مضى‏؟‏ قال‏:‏ ‏\"‏ذلك كفارة لما يكون في المجلس‏. ‏‏(‏‏(‏رواه أبو داود‏)‏‏)‏‏.‏‏(‏‏(‏ورواه الحاكم أبو عبيد الله في ‏ ‏المستدرك‏ ‏ من رواية عائشة رضى الله عنها وقال‏:‏ صحيح بإسناد‏)‏‏)‏‏‏","language":"arabic"},{"text":"Towards the end of his life, Messenger of Allah (ﷺ) would supplicate before leaving an assembly thus: \"Subhanaka Allahumma wa bihamdika, ash-hadu an la ilaha illa Anta, astaghfiruka wa atubu ilaika (O Allah, You are free from every imperfection; all praise is for You. I testify that there is no true god except You, I ask Your forgiveness and turn to You in repentance).\u0027\u0027 A man once said to him: \"O Messenger of Allah! You have spoken such words as you have never uttered before.\u0027\u0027 He said, \"It is an expiation of that which goes on in the assembly.\u0027\u0027 [Abu Dawud and Al-Hakim].","language":"english"},{"text":"Menjelang akhir hayatnya, Rasulullah (ﷺ) akan berdoa sebelum meninggalkan majelis sebagai berikut: \"Subhanaka Allahumma wa bihamdika, ash-hadu an la ilaha illa Anta, astaghfiruka wa atubu ilaika (Ya Allah, Engkau bebas dari segala ketidaksempurnaan). ; segala puji bagi-Mu. Aku bersaksi bahwa tidak ada Tuhan yang benar selain Engkau, aku memohon ampunan-Mu dan kembali kepada-Mu dalam pertobatan).\u0027\u0027 Seorang laki-laki pernah berkata kepadanya: \"Wahai Rasulullah! Anda telah mengucapkan kata-kata seperti yang belum pernah Anda ucapkan sebelumnya.\u0027\u0027 Dia berkata, \"Ini adalah penebusan dari apa yang terjadi di majelis.\u0027\u0027 [Abu Dawud dan Al-Hakim] .","language":"bahasa"}],"narrated":[{"text":"Abu Barzah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Barzah radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"833","hadith_id":"riyadussalihin","text":[{"text":"وعن ابن عمر رَضِيَ اللَّهُ عَنهُ قال: قلما كان رَسُول اللَّهِ ﷺ يقوم من مجلس حتى يدعو بهؤلاء الدعوات: \"اللهم اقسم لنا من خشيتك ما تحول به بيننا وبين معاصيك، ومن طاعتك ما تبلغنا به جنتك، ومن اليقين ما تهون به علينا مصائب الدنيا، اللهم متعنا بأسماعنا وأبصارنا وقوتنا ما أحييتنا، واجعله الوارث منا، واجعل ثأرنا على من ظلمنا، وانصرنا على من عادانا، ولا تجعل مصيبتنا في ديننا، ولا تجعل الدنيا أكبر همنا، ولا مبلغ علمنا، ولا تسلط علينا من لا يرحمنا\" ((رَوَاهُ التِّرمِذِيُّ وَقَالَ حَدِيثٌ حَسَنٌ)).","language":"arabic"},{"text":"Messenger of Allah (ﷺ) seldom left a gathering without supplicating in these terms: \"Allahumma-qsim lana min khashyatika ma tahulu bihi bainana wa baina ma\u0027sika, wa min ta\u0027atika ma tuballighuna bihi jannataka, wa minal-yaqini ma tuhawwinu \u0027alaina masa-\u0027ibad-dunya. Allahumma matti\u0027na biasma\u0027ina, wa absarina, wa quwwatina ma ahyaitana, waj\u0027alhul-waritha minna, waj\u0027al tharana \u0027ala man zalamana, wansurna \u0027ala man \u0027adana, wa la taj\u0027al musibatana fi dinina, wa la taj\u0027alid-dunya akbara hammina, wa la mablagha \u0027ilmina, wa la tusallit \u0027alaina man-la yarhamuna, (O Allah, apportion to us such fear as should serve as a barrier between us and acts of disobedience; and such obedience as will take us to Your Jannah; and such as will make easy for us to bear in the calamities of this world. O Allah! let us enjoy our hearing, our sight and our power as long as You keep us alive and make our heirs from our own offspring, and make our revenge restricted to those who oppress us, and support us against those who are hostile to us let no misfortune afflict our Deen; let not worldly affairs be our principal concern, or the ultimate limit of our knowledge, and let not those rule over us who do not show mercy to us).\" [At- Tirmidhi].","language":"english"},{"text":"dan hal-hal seperti itu akan memudahkan kita menanggung musibah di dunia ini. Ya Allah! biarkan kami menikmati pendengaran, penglihatan, dan kekuatan kami selama Anda membuat kami tetap hidup dan menjadikan kami ahli waris dari keturunan kami sendiri, dan membuat pembalasan kami terbatas pada mereka yang menindas kami, dan mendukung kami melawan mereka yang memusuhi kami. kemalangan menimpa Dien kita; jangan biarkan urusan duniawi menjadi perhatian utama kami, atau batas akhir pengetahuan kami, dan jangan biarkan mereka yang memerintah kami yang tidak menunjukkan belas kasihan kepada kami).\" [At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Ibn \u0027Umar (May Allah be pleased with them) reported:","language":"english"},{"text":"Ibnu \u0027Umar radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"834","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي هريرة رَضِيَ اللَّهُ عَنهُ قال، قال رَسُول اللَّهِ ﷺ: \"ما من قوم يقومون من مجلس ولا يذكرون اللَّه تعالى فيه إلا قاموا عن مثل جيفة حمار وكان لهم حسرة\" ((رَوَاهُ أبُو دَاوُدَ بإسناد صحيح)).","language":"arabic"},{"text":"Messenger of Allah (ﷺ) said, \"Those people who leave a gathering in which they have not remembered Allah, will conclude it as if it has foul odour similar to that of a rotten carcass of a donkey. And it will be a cause of grief to them.\" [Abu Dawud].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, “Orang-orang yang meninggalkan suatu perkumpulan yang di dalamnya mereka tidak mengingat Allah, akan menyimpulkannya seolah-olah ada bau busuk seperti bangkai keledai yang busuk. Dan itu akan menjadi penyebab kesedihan bagi mereka.\" [Abu Daud] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"835","hadith_id":"riyadussalihin","text":[{"text":"وعنه عن النبي صلى الله عليه وسلم قال‏:‏ ‏\"‏ما جلس قوم مجلساً لم يذكروا الله تعالى فيه، ولم يصلوا على نبيهم فيه، إلا كان عليهم ترة؛ فإن شاء عذبهم، وإن شاء غفر لهم‏\"‏ ((رَوَاهُ التِّرمِذِيُّ وَقَالَ: \"حَدِيثٌ حَسَنٌ\"))‏.‏","language":"arabic"},{"text":"The Prophet (ﷺ) said, \"Whenever a group of people sit in a gathering in which they do not remember Allah the Exalted, nor supplicate to elevate the rank of their Prophet, such a gathering will be a cause of grief to them. If Allah wills, He will punish them, and if He wills He will forgive them.\" [At-Tirmidhi].","language":"english"},{"text":"Nabi (ﷺ) berkata, “Setiap kali sekelompok orang duduk dalam suatu pertemuan di mana mereka tidak mengingat Allah Ta’ala, atau berdoa untuk mengangkat derajat Nabi mereka, pertemuan seperti itu akan menjadi kesedihan bagi mereka. Jika Allah berkehendak, Dia akan menghukum mereka, dan jika Dia menghendaki Dia akan mengampuni mereka.” [At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"836","hadith_id":"riyadussalihin","text":[{"text":"وعنه عن رسول الله صلى الله عليه وسلم قال‏:‏ ‏\"‏من قعد مقعداً لم يذكر الله تعالى فيه كانت عليه من الله ترة، ومن اضطجع مضجعاً لم يذكر الله فيه كانت عليه من الله ترة‏\"‏ ((رَوَاهُ أبُو دَاوُدَ))‏‏‏.‏ ‏وقد سبق قريباً، وشرحنا \"‏الترة‏\"‏ فيه‏.","language":"arabic"},{"text":"Messenger of Allah (ﷺ) said, \"If anyone sits in a gathering where he does not remember Allah, he will bring grief upon himself (on the Day of Resurrection), and he who lies down in a place where he does not remember Allah, will bring grief upon himself (on the Day of Resurrection).\" [Abu Dawud].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, “Barangsiapa duduk dalam suatu perkumpulan yang tidak mengingat Allah, maka dia akan mendatangkan kesedihan (pada hari kiamat) dan orang yang berbaring di tempat yang tidak mengingat Allah. , akan mendatangkan kesedihan atas dirinya (pada hari kiamat).” [Abu Daud] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"837","hadith_id":"riyadussalihin","text":[{"text":"وعن أبى هريرة رضى الله عنه قال‏:‏ سمعت رسول الله صلى الله عليه وسلم يقول‏:‏ ‏\"‏لم يبق من النبوة إلا المبشرات‏\"‏ قالوا‏:‏ وما المبشرات‏؟‏ قال‏:‏ ‏\"‏الرؤيا الصالحة‏\"‏ (( رَوَاهُ البُخَارِيُّ))‏.‏","language":"arabic"},{"text":"Messenger of Allah (ﷺ) said, \"All that is left from Prophethood is the glad tidings.\" He was asked what the glad tidings were, and he said, \"The good dream.\" [Al-Bukhari].","language":"english"},{"text":"Rasulullah SAW bersabda, “Yang tersisa dari kenabian hanyalah kabar gembira.” Dia ditanya apa kabar gembira itu, dan dia berkata, \"Mimpi yang indah.\" [Al-Bukhari] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"838","hadith_id":"riyadussalihin","text":[{"text":"وعنه أن النبي صلى الله عليه وسلم قال‏:‏ ‏\"‏إذا اقترب الزمان لم تكد رؤيا المؤمن تكذب، ورؤيا المؤمن جزء من ستة وأربعين جزءاً من النبوة‏\"‏ ((مُتَّفَقٌ عَلَيهِ))‏.‏ ‏ ‏وفى رواية‏:‏ ‏\"‏أصدقكم رؤيا أصدقكم حديثاً‏\"‏‏.‏","language":"arabic"},{"text":"The Prophet (ﷺ) said, \"When the time draws near (i.e., near the end of the world), the dream of a believer can hardly be false; and the dream of a believer represents one part from forty-six parts of Prophethood.\" [Al-Bukhari and Muslim]. One narration says: Messenger of Allah (ﷺ) said, \"The most truthful of you in their speech are those who see the truest visions.\"","language":"english"},{"text":"Nabi (ﷺ) berkata, \"Ketika waktunya semakin dekat (yaitu, mendekati akhir dunia), mimpi seorang mukmin tidak mungkin salah; dan mimpi seorang mukmin mewakili satu bagian dari empat puluh enam bagian kenabian. .\" [Al-Bukhari dan Muslim] . Salah satu riwayat mengatakan: Rasulullah (ﷺ) berkata, \"Yang paling jujur di antara kamu dalam ucapan mereka adalah mereka yang melihat penglihatan yang paling benar.\"","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"839","hadith_id":"riyadussalihin","text":[{"text":"وعنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏ \"‏من رآني في المنام فسيراني في اليقظة -أو كأنما رآني في اليقظة- لا يتمثل الشيطان بي‏\"‏ ((مُتَّفَقٌ عَلَيهِ)).‏","language":"arabic"},{"text":"Messenger of Allah (ﷺ) said, \"He who sees me in his dream will see me in his wakefulness (or he (ﷺ) may have said it is as though he has seen me in a state of wakefulness), for Satan does not appear in my form.\" [Al-Bukhari and Muslim ].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, “Barangsiapa melihatku dalam mimpinya akan melihatku dalam keadaan terjaganya (atau dia (ﷺ) mungkin mengatakan seolah-olah dia telah melihatku dalam keadaan terjaga), karena Setan tidak muncul dalam wujudku.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"840","hadith_id":"riyadussalihin","text":[{"text":"وعن أبى سعيد الخدرى رضى الله عنه انه سمع النبي صلى الله عليه وسلم، يقول‏:‏ ‏ \"‏إذا رأى أحدكم رؤيا يحبها، فإنما هي من الله تعالى، فليحمد الله عليها، وليحدث بها -وفى رواية، فلا يحدث بها إلا من يحب- وإذا رأى غير ذلك مما يكره، فإنما هي من الشيطان، فليستعذ من شرها، ولا يذكرها لأحد، فإنها لا تضره‏\"‏ (( مُتَّفَقٌ عَلَيهِ)).","language":"arabic"},{"text":"I heard the Prophet (ﷺ) saying, \"When one of you sees a dream that he likes, then it is from Allah. He should praise Allah for it and relate it to (others).\" Another narration adds: Messenger of Allah(ﷺ) said, \"He should not report it except to those whom he loves. And if he sees one which he dislikes, then it is from the Satan. He should seek refuge in Allah against its evil and should not mention it to anyone. Then it will not harm him.\" [Al- Bukhari and Muslim].","language":"english"},{"text":"Saya mendengar Nabi (ﷺ) berkata, \"Ketika salah satu dari kalian melihat mimpi yang dia sukai, maka itu dari Allah. Dia harus memuji Allah untuk itu dan menceritakannya kepada (orang lain).\" Narasi lain menambahkan: Rasulullah (ﷺ) berkata, \"Dia tidak melaporkannya kecuali kepada orang yang dia cintai. Dan jika dia melihat yang dia tidak suka, maka itu dari setan. Dia harus berlindung kepada Allah dari kejahatannya. dan tidak boleh menyebutkannya kepada siapa pun. Maka itu tidak akan membahayakannya.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Sa\u0027id Al-Khudri (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Sa\u0027id Al-Khudri r.a. melaporkan:","language":"bahasa"}]},{"index":"841","hadith_id":"riyadussalihin","text":[{"text":"وعن أبى قتادة رضى الله عنه قال‏:‏ قال النبي صلى الله عليه وسلم‏:‏ ‏ \"‏الرؤيا الصالحة -وفى رواية‏:‏ الرؤيا الحسنة- من الله، والحلم من الشيطان، فمن رأى شيئاً يكره فلينفث عن شماله ثلاثاً، وليتعوذ من الشيطان فإنها لا تضره‏\"‏ (( مُتَّفَقٌ عَلَيهِ)). ‏النفث‏ ‏ نفخ لطيف لا ريق معه‏.‏","language":"arabic"},{"text":"The Prophet (ﷺ) said, \"A good vision (dream) is from Allah and a bad dream is from the Satan. He who sees something in a dream that he dislikes, should blow thrice on his left, must seek Allah\u0027s Refuge from the evil of the Satan (i.e., by saying: A\u0027udhu billahi minash-Shaitanir-Rajim). Then it will not harm him.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Nabi (ﷺ) berkata, \"Penglihatan (mimpi) yang baik itu dari Allah dan mimpi buruk itu dari setan. Barangsiapa melihat sesuatu dalam mimpi yang tidak disukainya, harus meniup tiga kali di sebelah kirinya, harus mencari Perlindungan Allah dari kejahatan setan (yaitu, dengan mengatakan: A\u0027udhu billahi minash-Shaitanir-Rajim). Maka itu tidak akan menyakitinya.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Qatadah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Qatadah r.a. melaporkan:","language":"bahasa"}]},{"index":"842","hadith_id":"riyadussalihin","text":[{"text":"وعن جابر رضى الله عنه عن رسول الله صلى الله عليه وسلم قال‏:‏ ‏ \"‏إذا رأى أحدكم الرؤيا يكرهها، فليبصق عن يساره ثلاثاً، وليستعذ بالله من الشيطان ثلاثاً، وليتحول عن جنبه الذي كان عليه‏\"‏ ((رَوَاهُ مُسلِمٌ)).","language":"arabic"},{"text":"Messenger of Allah (ﷺ) said, \"When one of you sees a bad dream let him blow three times on his left, seek refuge in Allah from the Satan three times (i.e., by saying: A\u0027udhu billahi minash-Shaitanir-Rajim) and change the side on which he was lying.\" [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, “Jika salah satu dari kalian melihat mimpi buruk, biarkan dia meniup tiga kali di sebelah kirinya, berlindung kepada Allah dari setan tiga kali (yaitu, dengan mengatakan: A\u0027udhu billahi minash-Shaitanir-Rajim) ) dan ubah sisi tempat dia berbaring.\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Jabir (May Allah be pleased with him) reported:","language":"english"},{"text":"Jabir (ra dengan dia) melaporkan:","language":"bahasa"}]},{"index":"843","hadith_id":"riyadussalihin","text":[{"text":"وعن أبى الأسقع واثلة بن الأسقع رضى الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏ \"‏إن من أعظم الفرى أن يدعى الرجل إلى غير أبيه، أو يرى عينيه ما لم تر، أو يقول على رسول الله صلى الله عليه وسلم ما لم يقل‏\"‏ ‏((رَوَاهُ البُخَارِيُّ)).","language":"arabic"},{"text":"Messenger of Allah (ﷺ) said, \"Of the worst lies are: to claim a false father, or to pretend to have seen what one has not seen (tell a false dream), or to attribute to the Messenger of Allah (ﷺ) what he has not said.\" [Al-Bukhari].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, “Di antara kebohongan yang paling buruk adalah: mengklaim ayah palsu, atau berpura-pura telah melihat apa yang belum pernah dilihatnya (menceritakan mimpi palsu), atau menyebut-nyebut Rasulullah (ﷺ). apa yang belum dia katakan.\" [Al-Bukhari] .","language":"bahasa"}],"narrated":[{"text":"Wathilah bin Al-Asqa\u0027 (May Allah be pleased with him) reported:","language":"english"},{"text":"Wathilah bin Al-Asqa\u0027 radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]}]