[{"index":"727","hadith_id":"riyadussalihin","text":[{"text":"عن عمر بن أبى سلمة رضى الله عنهما قال‏:‏ قال لي رسول الله صلى الله عليه وسلم‏:‏‏ \"‏سم الله وكل بيمينك، وكل مما يليك‏\"‏.‏ ((متفق عليه))","language":"arabic"},{"text":"Messenger of Allah (ﷺ), said to me, \"Mention Allah\u0027s Name (i.e., say Bismillah before starting eating), eat with your right hand, and eat from what is near you.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ), berkata kepadaku, \"Sebutlah Nama Allah (yaitu, ucapkan Bismillah sebelum mulai makan), makanlah dengan tangan kananmu, dan makanlah dari apa yang ada di dekatmu.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"\u0027Umar bin Abu Salamah (May Allah be pleased with him) reported:","language":"english"},{"text":"Umar bin Abu Salamah radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"728","hadith_id":"riyadussalihin","text":[{"text":"وعن عائشة رضى الله عنها قالت ‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏ \"‏إذا أكل أحدكم فليذكر اسم الله تعالى، فإذا نسى أن يذكر اسم الله تعالى في أوله، فليقل، بسم الله أوله وآخره‏\"‏‏.‏ ((رواه أبو داود والترمذي))","language":"arabic"},{"text":"Messenger of Allah (ﷺ) said, \"When any of you wants to eat, he should mention the Name of Allah in the begining, (i.e., say Bismillah). If he forgets to do it in the beginning, he should say Bismillah awwalahu wa akhirahu (I begin with the Name of Allah at the beginning and at the end).\" [At-Tirmidhi and Abu Dawud].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, “Jika ada di antara kalian yang ingin makan, hendaknya ia menyebut Nama Allah di awal, (yaitu, ucapkan Bismillah). Jika ia lupa melakukannya di awal, ia harus mengucapkan Bismillah awwalahu wa akhirahu (Aku memulai dengan Nama Allah di awal dan di akhir).\" [At-Tirmidzi dan Abu Dawud] .","language":"bahasa"}],"narrated":[{"text":"\u0027Aishah (May Allah be pleased with her) reported:","language":"english"},{"text":"\u0027Aisyah r.a. melaporkan:","language":"bahasa"}]},{"index":"729","hadith_id":"riyadussalihin","text":[{"text":"وعن جابر، رضى الله عنه قال‏:‏ سمعت رسول الله صلى الله عليه وسلم يقول‏:‏ ‏ \"‏إذا دخل الرجل بيته، فذكر الله تعالى عند دخوله وعند طعامه، قال الشيطان لأصحابه‏:‏ لا مبيت لكم ولا عشاء، وإذا دخل ، فلم يذكر الله تعالى عند دخوله، قال الشيطان‏:‏ أدركتم المبيت؛ وإذا لم يذكر الله تعالى عند طعامه قال‏:‏ أدركتم المبيت والعشاء‏\"‏ ‏. ((رواه مسلم))","language":"arabic"},{"text":"I heard Messenger of Allah (ﷺ) saying, \"If a person mentions the Name of Allah upon entering his house or eating, Satan says, addressing his followers: \u0027You will find no where to spend the night and no dinner.\u0027 But if he enters without mentioning the Name of Allah, Satan says (to his followers); \u0027You have found (a place) to spend the night in, and if he does not mention the Name of Allah at the time of eating, Satan says: \u0027You have found (a place) to spend the night in as well as food.\"\u0027 [Muslim].","language":"english"},{"text":"Saya mendengar Rasulullah (ﷺ) berkata, \"Jika seseorang menyebut Nama Allah saat memasuki rumahnya atau makan, Setan berkata, menyapa para pengikutnya: \u0027Kamu tidak akan menemukan tempat untuk bermalam dan tidak makan malam.\u0027 Tetapi jika dia masuk tanpa menyebut Nama Allah, Setan berkata (kepada pengikutnya); \u0027Kamu telah menemukan (tempat) untuk bermalam, dan jika dia tidak menyebut Nama Allah pada saat makan, Setan bersabda: \u0027Kamu telah menemukan (tempat) untuk bermalam dan juga makanan.\"\u0027 [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Jabir (May Allah be pleased with him) reported:","language":"english"},{"text":"Jabir (ra dengan dia) melaporkan:","language":"bahasa"}]},{"index":"730","hadith_id":"riyadussalihin","text":[{"text":"وعن حذيفة رضى الله عنه قال‏:‏ كنا إذا حضرنا مع رسول الله صلى الله عليه وسلم طعاماً، لم نضع أيدينا حتى يبدأ رسول الله صلى الله عليه وسلم فيضع يده‏.‏ وإنا حضرنا معه مرةً طعاماً، فجاءت جارية كأنها تدفع، فذهبت لتضع يدها في الطعام، فأخذ رسول الله صلى الله عليه وسلم بيدها، ثم جاء أعرابي كأنما يدفع فأخذ بيده، فقال رسول الله صلى الله عليه وسلم‏:‏ ‏ \"‏إن الشيطان يستحل الطعام أن لا يذكر اسم الله تعالى عليه، وإنه جاء بهذه الجارية ليستحل بها، فأخذت بيدها، فجاء بهذا الأعرابي ليستحل به، فأخذت بيده، والذي نفسي بيده إن يده في يدي مع يديهما‏\"‏ ثم ذكر اسم الله تعالى وأكل‏.‏ ‏‏((رواه مسلم))‏","language":"arabic"},{"text":"When we attended a meal with the Messenger of Allah (ﷺ), we would not stretch forth our hands towards the food until he (ﷺ) would start eating first. Once, we were with him when a little girl rushed in as if someone was impelling her. She was about to lay her hand on the food when the Messenger of Allah (ﷺ) caught her hand. Then a bedouin came in rushing as if someone were pushing him. He (ﷺ) caught his hand also and said, \"Satan considers that food lawful for himself on which the Name of Allah is not mentioned. He (Satan) brought this girl to make the food lawful through her but I caught her hand. Then he brought the bedouin to make it lawful through him but I caught his hand too. By Him in Whose Hand my soul is, now Satan\u0027s hand is in my grasp along with their hands.\" Then he mentioned the Name of Allah and began to eat. [Muslim].","language":"english"},{"text":"Ketika kami menghadiri makan bersama Rasulullah (ﷺ), kami tidak akan mengulurkan tangan kami ke arah makanan sampai dia (ﷺ) mulai makan lebih dulu. Suatu kali, kami bersamanya ketika seorang gadis kecil bergegas masuk seolah-olah seseorang mendorongnya. Dia hendak meletakkan tangannya di atas makanan ketika Rasulullah () menangkap tangannya. Kemudian seorang Badui datang dengan tergesa-gesa seolah-olah seseorang mendorongnya. Dia (ﷺ) menangkap tangannya juga dan berkata, \"Setan menganggap makanan itu halal untuk dirinya sendiri yang tidak menyebut Nama Allah. Dia (Setan) membawa gadis ini untuk menghalalkan makanan melalui dia tapi aku menangkap tangannya. Lalu aku menangkap tangannya. dia membawa orang Badui untuk menghalalkannya melalui dia tapi aku menangkap tangannya juga. Demi Dia yang jiwaku ada di tangan-Nya, sekarang tangan setan ada di genggamanku bersama dengan tangan mereka.” Kemudian dia menyebut Nama Allah dan mulai makan. [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Hudhaifah (May Allah be pleased with him) reported:","language":"english"},{"text":"Hudzaifah r.a. melaporkan:","language":"bahasa"}]},{"index":"731","hadith_id":"riyadussalihin","text":[{"text":"وعن أمية بن مخشى الصحابي رضى الله عنه قال‏:‏ كان رسول الله صلى الله عليه وسلم جالساً ، ورجل يأكل، فلم يسم الله حتى لم يبق من طعامه إلا لقمة، فلما رفعها إلى فيه، قال‏:‏ بسم الله أوله وآخره، فضحك النبي صلى الله عليه وسلم، ثم قال‏:‏‏ \"‏ما زال الشيطان يأكل معه، فلما ذكر اسم الله استقاء ما فيه بطنه‏\"‏ ‏.‏ ‏‏((رواه أبو داود والنسائي))","language":"arabic"},{"text":"Messenger of Allah (ﷺ) was sitting while a man was eating food. That man did not mention the Name of Allah (before commencing to eat) till only a morsel of food was left. When he raised it to his mouth, he said: \"Bismillah awwalahu wa akhirahu (With the Name of Allah, in the beginning and in the end).\" Messenger of Allah (ﷺ) smiled at this and said, \"Satan had been eating with him but when he mentioned the Name of Allah, Satan vomited all that was in his stomach.\" [Abu Dawud and An-Nasa\u0027i].","language":"english"},{"text":"Rasulullah (ﷺ) sedang duduk ketika seorang pria sedang makan. Orang itu tidak menyebut Nama Allah (sebelum mulai makan) hingga hanya tersisa secuil makanan. Ketika dia mengangkatnya ke mulutnya, dia berkata: \"Bismillah awwalahu wa akhirahu (Dengan Nama Allah, di awal dan di akhir).\" Rasulullah (ﷺ) tersenyum mendengarnya dan berkata, \"Setan telah makan bersamanya tetapi ketika dia menyebut Nama Allah, Setan memuntahkan semua yang ada di perutnya.\" [Abu Dawud dan An-Nasa\u0027i] .","language":"bahasa"}],"narrated":[{"text":"Umaiyyah bin Makhshi (May Allah be pleased with him) reported:","language":"english"},{"text":"Umaiyyah bin Makhshi radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"732","hadith_id":"riyadussalihin","text":[{"text":"وعن عائشة رضى الله عنها قالت‏:‏ كان رسول الله صلى الله عليه وسلم يأكل طعاماً في ستة من أصحابه، فجاء أعرابى، فأكله بلقمتين‏.‏ فقال رسول الله صلى الله عليه وسلم ‏ \"‏أما إنه لو سمى لكفاكم‏\"‏‏.‏((رواه الترمذي))","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) was eating with his six Companions when a desert Arab came and ate up the food in two mouthfuls. Messenger of Allah (ﷺ) said, \"Had he mentioned the Name of Allah, it would have sufficed for all of you.\" [At-Tirmidhi].","language":"english"},{"text":"Rasulullah (ﷺ) sedang makan dengan enam sahabatnya ketika seorang Arab gurun datang dan memakan makanan itu dalam dua suap. Rasulullah (ﷺ) berkata, \"Seandainya dia menyebut Nama Allah, itu sudah cukup bagi kalian semua.\" [At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"\u0027Aishah (May Allah be pleased with her) reported:","language":"english"},{"text":"\u0027Aisyah r.a. melaporkan:","language":"bahasa"}]},{"index":"733","hadith_id":"riyadussalihin","text":[{"text":"وعن أبى أمامة رضى الله عنه أن النبي صلى الله عليه وسلم كان إذا رفع مائدته قال‏:‏ ‏ \"‏الحمد لله حمداً كثيراً طَيِّباً مباركاً فيه، غير مكفى ولامودع، ولا مستغنى عنه ربنا‏\"‏ ‏‏.‏(‏‏(‏رواه البخارى‏)‏‏)‏‏","language":"arabic"},{"text":"Whenever the Prophet (ﷺ) finished a meal, he would say: \"Al-hamdu lillahi hamdan kathiran taiyyiban mubarakan fihi, ghaira makfiyyin wa la muwadda`in, wa la mustaghnan `anhu, Rabbuna. (All praise is due to Allah, praise which is abundant, pure, and full of blessings, which is indispensable and to which one cannot be indifferent).\u0027\u0027 [Al-Bukhari].","language":"english"},{"text":"Setiap kali Nabi (ﷺ) selesai makan, dia akan mengatakan: \"Al-hamdu lillahi hamdan kathiran taiyyiban mubarakan fihi, ghaira makfiyyin wa la muwadda`in, wa la mustaghnan `anhu, Rabbuna. (Segala puji bagi Allah, segala puji bagi Allah). yang berlimpah, murni, dan penuh berkah, yang sangat diperlukan dan yang tidak dapat diabaikan oleh seseorang).\u0027\u0027 [Al-Bukhari] .","language":"bahasa"}],"narrated":[{"text":"Abu Umamah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Umamah r.a. melaporkan:","language":"bahasa"}]},{"index":"734","hadith_id":"riyadussalihin","text":[{"text":"وعن معاذ بن أنس رضى الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏ \"‏من أكل طعاماً فقال‏:‏ الحمد الله الذي أطعمني هذا، ورزقنيه من غير حول منى ولا قوةٍ، غفر له ما تقدم من ذنبه‏\"‏ ‏‏.‏((رواه أبو داود والترمذي))","language":"arabic"},{"text":"Messenger of Allah (ﷺ) said, \"He who has taken food and says at the end: \u0027Al- hamdu lillahi-lladhi at\u0027amani hadha, wa razaqanihi min ghairi haulin minni wa la quwwatin (All praise is due to Allah Who has given me food to eat and provided it without any endeavour on my part or any power),\u0027 all his past sins will be forgiven.\" [Abu Dawud and At- Tirmidhi].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, \"Barangsiapa yang telah mengambil makanan dan pada akhirnya mengucapkan: \u0027Alhamdu lillahi-lladhi at\u0027amani hadha, wa razaqanihi min ghairi haulin minni wa la quwwatin (Segala puji bagi Allah yang telah memberi saya makanan untuk dimakan dan menyediakannya tanpa usaha saya atau kekuatan apa pun),\u0027 semua dosa masa lalunya akan diampuni. [Abu Dawud dan At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Mu\u0027adh bin Anas (May Allah be pleased with him) reported:","language":"english"},{"text":"Mu\u0027adz bin Anas radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"735","hadith_id":"riyadussalihin","text":[{"text":"وعن أبى هريرة رضى الله عنه قال‏:‏ ‏ \"‏ما عاب رسول الله صلى الله عليه وسلم طعاماً قط، إن اشتهاه أكله، وإن كرهه تركه‏\"‏ ‏.‏ ((متفق عليه))","language":"arabic"},{"text":"Messenger of Allah (ﷺ) never found fault with food. If he had inclination to eating it, he would eat; and if he disliked it, he would leave it. [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) tidak pernah menemukan kesalahan dengan makanan. Jika dia memiliki keinginan untuk memakannya, dia akan memakannya; dan jika dia tidak menyukainya, dia akan meninggalkannya. [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"736","hadith_id":"riyadussalihin","text":[{"text":"وعن جابر رضى الله عنه أن النبي صلى الله عليه وسلم سأل أهله الأدم فقالوا‏:‏ ما عندنا إلا خل، فدعا به، فجعل يأكل ويقول‏:‏ ‏ \"‏نعم الأدم الخل، نعم الأدم الخل‏\"‏ ‏.‏‏‏((رواه مسلم))‏","language":"arabic"},{"text":"The Prophet (ﷺ) asked for sauce and was told that there was nothing except vinegar. He asked for it and began to eat from it saying, \"How excellent is vinegar when eaten as sauce! How excellent is vinegar when eaten as Udm!\" [Muslim].","language":"english"},{"text":"Nabi (ﷺ) meminta saus dan diberitahu bahwa tidak ada apa pun kecuali cuka. Dia memintanya dan mulai memakannya sambil berkata, \"Betapa enaknya cuka jika dimakan sebagai saus! Betapa bagusnya cuka jika dimakan sebagai Udm!\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Jabir (May Allah be pleased with him) reported:","language":"english"},{"text":"Jabir (ra dengan dia) melaporkan:","language":"bahasa"}]},{"index":"737","hadith_id":"riyadussalihin","text":[{"text":"عن أبى هريرة رضى الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏ \"‏إذا دعي أحدكم ، فليجب، فإن كان صائما فليصل، وإن كان مفطراً فليطعم‏\"‏ .‏‏‏((رواه مسلم))‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"When any of you is invited to a meal, he should accept the invitation. If he is observing Saum (fasting), he should supplicate for the betterment of the host and if he is not fasting, he should eat.\" [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, “Jika ada di antara kalian yang diundang untuk makan, dia harus menerima undangan itu. Jika dia sedang menjalankan Saum (puasa), dia harus berdoa untuk kebaikan tuan rumah dan jika dia tidak berpuasa. , dia harus makan.\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"738","hadith_id":"riyadussalihin","text":[{"text":"عن أبى مسعود البدرى رضى الله عنه قال‏:‏ دعا رجل النبي صلى الله عليه وسلم لطعام صنعه له خامس خمسة، فتبعهم رجل، فلما بلغ الباب، قال النبي صلى الله عليه وسلم‏:‏ ‏ \"‏إن هذا تبعنا؛ فإن شئت أن تأذن له، وإن شئت رجع‏\"‏ قال‏:‏ بل آذن له يا رسول الله ‏.‏((متفق عليه))","language":"arabic"},{"text":"A man prepared some food especially for the Prophet (ﷺ) and invited him along with four others. But a man accompanied him. Having arrived at the door, Messenger of Allah (ﷺ) said to the host, \"This person has followed us. You may allow him, if you like, and if you like he will return.\" He said: \"O Messenger of Allah, I allow him, too.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Seorang pria menyiapkan makanan khusus untuk Nabi (ﷺ) dan mengundangnya bersama empat orang lainnya. Tapi seorang pria menemaninya. Setelah tiba di pintu, Rasulullah (ﷺ) berkata kepada tuan rumah, \"Orang ini telah mengikuti kami. Anda dapat mengizinkannya, jika Anda suka, dan jika Anda suka dia akan kembali.\" Dia berkata: \"Ya Rasulullah, aku mengizinkannya juga.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Mas\u0027ud Al-Badri (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Mas\u0027ud Al-Badri (ra dengan dia) melaporkan:","language":"bahasa"}]},{"index":"739","hadith_id":"riyadussalihin","text":[{"text":"عن عمر بن أبى سلمة رضى الله عنهما قال‏:‏ كنت غلاماً في حجر رسول الله صلى الله عليه وسلم، وكانت يدي تطيش في الصحفة، فقال لي رسول الله صلى الله عليه وسلم‏:‏ ‏ \"‏ يا غلام سم الله تعالى، وكل بيمينك،وكل مما يليك‏\"‏ .((متفق عليه))","language":"arabic"},{"text":"I was a boy under the care of Messenger of Allah (ﷺ), and as my hand used to wander around in the dish, he (ﷺ) said to me once, \"Mention Allah\u0027s Name (i.e., say Bismillah), eat with your right hand, and eat from what is in front of you.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Saya adalah seorang anak laki-laki di bawah asuhan Rasulullah (ﷺ), dan ketika tangan saya biasa mengembara di piring, dia () berkata kepada saya suatu kali, \"Sebutkan Nama Allah (yaitu, ucapkan Bismillah), makanlah dengan tangan kanannya, dan makanlah dari apa yang ada di hadapanmu.” [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"\u0027Umar bin Abu Salamah (May Allah be pleased with them) reported:","language":"english"},{"text":"Umar bin Abu Salamah radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"740","hadith_id":"riyadussalihin","text":[{"text":"وعن سلمةَ بن الأَكْوَع أنَّ رَجُلاً أَكَلَ عِنْدَ رَسُولِ الله بِشِمَالِهِ ، فَقَالَ : « كُلْ بِيَمِينِكَ » قَالَ : لا أسْتَطِيعُ . قَالَ : « لا اسْتَطَعْتَ » ! مَا مَنَعَهُ إِلا الكِبْرُ ! فَمَا رَفَعَهَا إِلَى فِيهِ . ((رواه مسلم))","language":"arabic"},{"text":"A man ate with his left hand in the presence of Messenger of Allah (ﷺ), whereupon he said, \"Eat with your right hand.\" The man said: \"I cannot do that.\" Thereupon he (the Prophet (ﷺ)) said, \"May you not be able to do that.\" It was vanity that prevented him from doing it and he could not raise it (the right hand) up to his mouth afterwards. [Muslim].","language":"english"},{"text":"Seorang laki-laki makan dengan tangan kirinya di hadapan Rasulullah (ﷺ), lalu dia berkata, \"Makanlah dengan tangan kananmu.\" Pria itu berkata: \"Saya tidak bisa melakukan itu.\" Kemudian dia (Nabi (ﷺ)) berkata, \"Semoga kamu tidak bisa melakukan itu.\" Kesombonganlah yang menghalanginya untuk melakukannya dan dia tidak bisa mengangkatnya (tangan kanan) ke mulutnya sesudahnya. [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Salamah bin Al-Akwa\u0027 (May Allah be pleased with him) reported on the authority of his father:","language":"english"},{"text":"Salamah bin Al-Akwa\u0027 (ra dengan dia) melaporkan otoritas ayahnya:","language":"bahasa"}]},{"index":"741","hadith_id":"riyadussalihin","text":[{"text":"عن جبلة بن سحيم قال: أصابنا عام سنةٍ مع ابن الزبير، فرزقنا تمراً، وكان عبد الله بن عمر رضى الله عنهما يمر بنا ونحن نأكل، فيقول: لا تقارونوا، فإن النبى نهى عن الإقران، ثم يقول: \"إلا أن يستأذن الرجل أخاه\" ((متفق عليه))","language":"arabic"},{"text":"We were with \u0027Abdullah bin Az-Zubair (May Allah be pleased with them) in a time of famine, then we were provided with dates. (Once) when we were eating, \u0027Abdullah bin \u0027Umar (May Allah be pleased with them) passed by us and said: \"Do not eat two dates together, for Messenger of Allah (ﷺ) prohibited it, unless one seeks permission from his brother (partner).\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Kami bersama \u0027Abdullah bin Az-Zubair (Semoga Allah meridhoi mereka) di masa kelaparan, kemudian kami diberi kurma. (Suatu ketika) ketika kami sedang makan, \u0027Abdullah bin \u0027Umar (ra dengan mereka) melewati kami dan berkata: \"Jangan makan dua kurma bersama-sama, karena Rasulullah (ﷺ) melarangnya, kecuali jika seseorang meminta izin dari saudaranya (pasangan).\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Jabalah bin Suhaim reported:","language":"english"},{"text":"Jabalah bin Suhaim melaporkan:","language":"bahasa"}]},{"index":"742","hadith_id":"riyadussalihin","text":[{"text":"عن وحشى بن حرب رضى الله عنه أن أصحاب رسول الله صلى الله عليه وسلم قالوا‏:‏ يا رسول الله ، إنا نأكل ولا نشبع قال‏:‏ ‏\"‏فلعلكم تفترقون‏\"‏ قالوا‏:‏ نعم‏.‏ قال‏:‏ فاجتمعوا على طعامكم، واذكروا اسم الله ، يبارك لكم فيه‏\"‏ ((رواه أبو داود)) ‏‏‏","language":"arabic"},{"text":"Some of the Companions of Messenger of Allah (ﷺ) said: \"We eat but are not satisfied.\" He (ﷺ) said, \"Perhaps you eat separately.\" The Companions replied in affirmative. He then said: \"Eat together and mention the Name of Allah over your food. It will be blessed for you.\" [Abu Dawud].","language":"english"},{"text":"Beberapa sahabat Rasulullah () berkata: \"Kami makan tetapi tidak kenyang.\" Dia (ﷺ) berkata, \"Mungkin kamu makan secara terpisah.\" Para sahabat menjawab setuju. Dia kemudian berkata: \"Makanlah bersama-sama dan menyebut Nama Allah atas makanan Anda. Ini akan diberkati untuk Anda.\" [Abu Daud] .","language":"bahasa"}],"narrated":[{"text":"Wahshi bin Harb (May Allah be pleased with him) reported:","language":"english"},{"text":"Wahshi bin Harb (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"743","hadith_id":"riyadussalihin","text":[{"text":"وعن ابن عباس رضى الله عنهما عن النبي صلى الله عليه وسلم قال‏:‏ ‏ \"‏البركة تنزل وسط الطعام، فكلوا من حافتيه ولا تأكلوا من وسطه‏\"‏‏‏.((رواه أبو داود والترمذي))","language":"arabic"},{"text":"The Prophet (ﷺ) said, \"Blessing descends upon food in its middle, so eat from the sides of the vessel and do not eat from its middle.\" [Abu Dawud and At-Tirmidhi].","language":"english"},{"text":"Nabi (ﷺ) berkata, \"Berkah turun atas makanan di tengahnya, jadi makanlah dari sisi bejana dan jangan makan dari tengahnya.\" [Abu Dawud dan At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Ibn \u0027Abbas (May Allah be pleased with them) reported:","language":"english"},{"text":"Ibn \u0027Abbas (semoga Allah meridhoi mereka) melaporkan:","language":"bahasa"}]},{"index":"744","hadith_id":"riyadussalihin","text":[{"text":"وعن عبد الله بن بشر رضى الله عنه قال‏:‏ كان للنبي صلى الله عليه وسلم قصعة يقال لها‏:‏ الغراء، يحملها أربعة رجال، فلما أضحوا وسجدوا الضحى أتى بتلك القصعة، يعنى وقد ثرد فيها، فالتقوا عليه ، فلما كثروا جثا رسول الله صلى الله عليه وسلم‏.‏فقال أعرابي ‏:‏ ما هذه الجلسة‏؟‏ قال رسول الله صلى الله عليه وسلم ‏:‏ إن الله جعلني عبداً كريماً، ولم يجعلني جباراً عنيداً، ثم قال رسول الله صلى الله عليه وسلم ‏:‏‏ \"‏كلوا من حواليها، ودعوا ذروتها يبارك فيها‏\"‏ .‏((رواه أبو داود))","language":"arabic"},{"text":"The Prophet (ﷺ) had a large bowl called Al-Gharra\u0027, which would be carried by four men. One day, when the Companions finished their Duha (forenoon optional) prayer, Al-Gharra\u0027 was brought full of sopped bread, meat and broth, and they sat down around it. When their number increased, Messenger of Allah (ﷺ) sat down on his knees and rested on the soles of his feet. A bedouin said to him: \"What sort of sitting is that?\" Thereupon Messenger of Allah (ﷺ) said, \"Verily, Allah has made me a courteous slave not a fierce tyrant.\" Then he said, \"Eat from the sides of the bowl and leave the central part of it so that your food will be blessed.\" [Abu Dawud].","language":"english"},{"text":"Nabi (ﷺ) memiliki mangkuk besar yang disebut Al-Gharra\u0027, yang akan dibawa oleh empat orang. Suatu hari, ketika para sahabat selesai sholat Dhuha, Al-Gharra\u0027 didatangkan dengan roti basah, daging dan kaldu, dan mereka duduk mengelilinginya. Ketika jumlah mereka bertambah, Rasulullah (ﷺ) duduk berlutut dan bertumpu pada telapak kakinya. Seorang Badui berkata kepadanya: \"Duduk macam apa itu?\" Kemudian Rasulullah (ﷺ) berkata, \"Sesungguhnya Allah telah menjadikan saya seorang hamba yang sopan, bukan seorang tiran yang kejam.\" Kemudian dia berkata, \"Makanlah dari sisi mangkuk dan tinggalkan bagian tengahnya agar makananmu diberkati.\" [Abu Daud] .","language":"bahasa"}],"narrated":[{"text":"\u0027Abdullah bin Busr (May Allah be pleased with him) reported:","language":"english"},{"text":"\u0027Abdullah bin Busr (ra dengan dia) melaporkan:","language":"bahasa"}]},{"index":"745","hadith_id":"riyadussalihin","text":[{"text":"عن أبى جحيفة وهب بن عبد الله رضى الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏ \"‏ لا آكل متكئاً‏\"‏.‏‏‏((‏رواه البخارى‏)‏‏)‏‏","language":"arabic"},{"text":"Messenger of Allah (ﷺ) said, \"I do not eat reclining (against a pillow).\" [Al-Bukhari].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Aku tidak makan sambil berbaring (dengan bantal).\" [Al-Bukhari] .","language":"bahasa"}],"narrated":[{"text":"Abu Juhaifah Wahb bin \u0027Abdullah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Juhaifah Wahb bin \u0027Abdullah (ra dengan dia) melaporkan:","language":"bahasa"}]},{"index":"746","hadith_id":"riyadussalihin","text":[{"text":"وعن أنس رضى الله عنه قال‏:‏ رأيت رسول الله صلى الله عليه وسلم جالساً مقعياً يأكل تمراً.‏ ‏‏((رواه مسلم))‏","language":"arabic"},{"text":"I saw Messenger of Allah (ﷺ) eating some dates while sitting on his buttocks, with his legs raised. [Muslim].","language":"english"},{"text":"Aku melihat Rasulullah (ﷺ) makan beberapa kurma sambil duduk di pantatnya, dengan kaki terangkat. [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Anas (May Allah be pleased with him) reported:","language":"english"},{"text":"Anas (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"747","hadith_id":"riyadussalihin","text":[{"text":"عن ابن عباس رضى الله عنهما قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏ \"‏إذا أكل أحدكم طعاماً، فلا يمسح أصابعه حتى يلعقها أو يلعقها‏\"‏‏.‏ ‏((متفق عليه))","language":"arabic"},{"text":"Messenger of Allah (ﷺ) said, \"When one of you finishes eating, he should not wipe his fingers until he has licked them himself or has given them to someone else to lick for him.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, “Jika salah seorang dari kalian selesai makan, jangan mengusap jari-jarinya sampai dia menjilatnya sendiri atau memberikannya kepada orang lain untuk dijilatnya.” [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Ibn \u0027Abbas (May Allah be pleased with them) reported:","language":"english"},{"text":"Ibn \u0027Abbas (semoga Allah meridhoi mereka) melaporkan:","language":"bahasa"}]},{"index":"748","hadith_id":"riyadussalihin","text":[{"text":"وعن كعب بن مالك رضى الله عنه قال‏:‏ رأيت رسول الله صلى الله عليه وسلم يأكل بثلاث أصابع ، فإذا فرغ لعقها‏.‏‏‏((رواه مسلم))‏ ‏","language":"arabic"},{"text":"I saw Messenger of Allah (ﷺ) eating with three fingers (i.e., the thumb, the index finger and the middle finger) and licking them after having finished the food. [Muslim].","language":"english"},{"text":"Saya melihat Rasulullah (ﷺ) makan dengan tiga jari (yaitu, ibu jari, jari telunjuk dan jari tengah) dan menjilatnya setelah selesai makan. [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Ka\u0027b bin Malik (May Allah be pleased with him) reported:","language":"english"},{"text":"Ka\u0027b bin Malik radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"749","hadith_id":"riyadussalihin","text":[{"text":"وعن جابر رضى الله عنه أن رسول الله صلى الله عليه وسلم أمر بلعق الأصابع والصحفة، وقال‏:‏ ‏ \"‏إنكم لا تدرون في أي طعامكم البركة‏\"‏.‏‏‏((رواه مسلم))‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) commanded the licking of fingers and the gleaning of the dish, saying, \"You do not know in which portion the blessing lies.\" [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) memerintahkan penjilatan jari dan pengambilan piring, dengan mengatakan, \"Kamu tidak tahu di bagian mana berkah itu berada.\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Jabir (May Allah be pleased with him) reported:","language":"english"},{"text":"Jabir (ra dengan dia) melaporkan:","language":"bahasa"}]},{"index":"750","hadith_id":"riyadussalihin","text":[{"text":"وعنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏ \"‏إذا وقعت لقمة أحدكم، فليأخذها فليمط ما كان بها من أذى وليأكلها، ولا يدعها للشيطان، ولا يمسح يده بالمنديل حتى يلعق أصابعه؛ فإنه لا يدرى في أي طعامه البركة‏\"‏ .‏‏((رواه مسلم))‏ ‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"When a morsel of any of you falls, he should pick it up and remove any of the dirt on it and then eat it, and should not leave it for Satan nor should wipe his hand with towel until he has licked his fingers, for he does not know in what portion of the food the blessing lies.\" [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, “Jika ada di antara kalian yang jatuh, hendaknya ia mengambilnya dan menghilangkan kotoran yang ada di atasnya, lalu memakannya, dan tidak meninggalkannya untuk setan, dan tidak boleh menyeka tangannya dengan air. handuk sampai dia menjilat jarinya, karena dia tidak tahu di bagian mana dari makanan itu ada berkah.\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Jabir (May Allah be pleased with him) reported:","language":"english"},{"text":"Jabir (ra dengan dia) melaporkan:","language":"bahasa"}]},{"index":"751","hadith_id":"riyadussalihin","text":[{"text":"وعنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏ \"‏إن الشيطان يحضر أحدكم عند كل شئ من شأنه، حتى يحضره عند طعامه؛ فإذا سقطت لقمة أحدكم فليأخذها فليمط ما كان بها من أذى، ثم ليأكلها ولا يدعها للشيطان، فإذا فرغ فليلعق أصابعه؛ فإنه لا يدرى في أي طعامه البركة‏\"‏‏‏.‏‏‏((رواه مسلم))‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"Satan appears at every thing done by you; he appears even at one\u0027s dinner. When a morsel of any of you falls, he should pick it up and remove any dirt on it, and then eat it. He should not leave it for Satan, nor should he wipe his hand with the towel until he has licked his fingers, for he does not know in what portion of the food the blessing lies.\" [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, “Setan muncul di setiap hal yang kamu lakukan; dia muncul bahkan saat makan malam. Jika ada di antara kamu yang jatuh, dia harus mengambilnya dan membersihkan kotorannya, lalu memakannya. itu. Dia tidak boleh meninggalkannya untuk setan, dan dia juga tidak boleh menyeka tangannya dengan handuk sampai dia menjilat jarinya, karena dia tidak tahu di bagian mana dari makanan itu ada berkah. [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Jabir (May Allah be pleased with him) reported:","language":"english"},{"text":"Jabir (ra dengan dia) melaporkan:","language":"bahasa"}]},{"index":"752","hadith_id":"riyadussalihin","text":[{"text":"وعن أنس رضى الله عنه قال‏:‏ كان رسول الله صلى الله عليه وسلم إذا أكل طعاماً، لعق أصابعه الثلاث، وقال‏:‏‏\"‏إذا سقطت لقمة أحدكم فليأخذها، وليمط عنها الأذى، وليأكلها،ولا يدعها للشيطان‏\"‏ وأمرنا أن نسلت القصعة وقال‏:‏ ‏\"‏إنكم لا تدرون في أي طعامكم البركة‏\"‏ ‏.‏‏‏((رواه مسلم))‏","language":"arabic"},{"text":"Whenever the Messenger of Allah (ﷺ) ate food, he would lick his three fingers and say, \"If anyone of you drops a morsel of food, he should remove any dirt that may have stuck on it and then eat it, and should not leave it for Satan.\" He (ﷺ) also commanded us that we should glean the pot, saying, \"You do not know in which part of your food the blessings lies.\" [Muslim].","language":"english"},{"text":"Setiap kali Rasulullah (ﷺ) makan makanan, dia akan menjilat ketiga jarinya dan berkata, \"Jika ada di antara kalian yang menjatuhkan makanan, dia harus menghilangkan kotoran yang mungkin menempel di atasnya dan kemudian memakannya, dan tidak boleh serahkan pada Setan.\" Dia (ﷺ) juga memerintahkan kita untuk memungut periuk, dengan mengatakan, \"Kamu tidak tahu di bagian mana dari makananmu berkah itu berada.\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Anas (May Allah be pleased with him) reported:","language":"english"},{"text":"Anas (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"753","hadith_id":"riyadussalihin","text":[{"text":"وعن سعيد بن الحارث أنه سأل جابراً رضى الله عنه عن الوضوء مما مست النار، فقال‏:‏ لا ، قد كنا زمن النبي صلى الله عليه وسلم لا نجد مثل ذلك الطعام إلا قليلاً، فإذا نحن وجدناه، لم يكن لنا مناديل إلا أكفنا وسواعدنا وأقدامنا، ثم نصلى ولا نتوضأ‏.‏ ‏‏((‏رواه البخارى‏)‏‏)‏‏","language":"arabic"},{"text":"I asked Jabir (May Allah be pleased with him) whether it was obligatory to make Wudu\u0027 for Salat (prayer) after eating cooked food. He said: \"No, because in the lifetime of Messenger of Allah (ﷺ), such food was rarely available. We had no handkerchiefs, so when we ate such food we would wipe our fingers against our palms, forearms or (the sole of our) feet, and would offer Salat without fresh Wudu\u0027 (for prayer).\" [Al- Bukhari].","language":"english"},{"text":"Saya bertanya kepada Jabir (ra dengan dia) apakah wajib berwudhu untuk salat setelah makan makanan yang dimasak. Dia berkata: \"Tidak, karena pada masa Rasulullah (ﷺ), makanan seperti itu jarang tersedia. Kami tidak memiliki sapu tangan, jadi ketika kami makan makanan seperti itu, kami akan mengusapkan jari-jari kami ke telapak tangan, lengan atau (telapak tangan). kaki kami, dan akan melakukan salat tanpa wudhu yang baru (untuk shalat). [Al-Bukhari] .","language":"bahasa"}],"narrated":[{"text":"Sa\u0027id bin Al-Harith reported:","language":"english"},{"text":"Sa\u0027id bin Al-Harits melaporkan:","language":"bahasa"}]},{"index":"754","hadith_id":"riyadussalihin","text":[{"text":"عن أبى هريرة رضى الله عنه قال ‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏طعام الاثنين كافي الثلاثة، وطعام الثلاثة كافي الأربعة‏\"‏.‏ ((متفق عليه))","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"The food of two persons suffices for three persons, and the food of three persons suffices for four persons.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah SAW bersabda, “Makanan dua orang cukup untuk tiga orang, dan makanan tiga orang cukup untuk empat orang.” [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"755","hadith_id":"riyadussalihin","text":[{"text":"وعن جابر رضى الله عنه قال‏:‏ سمعت رسول الله صلى الله عليه وسلم يقول‏:‏ ‏ \"‏طعام الواحد يكفى الاثنين، وطعام الاثنين يكفى الأربعة، وطعام الأربعة يكفى الثمانية‏\"‏.‏‏‏((رواه مسلم))‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"The food of one person suffices for two, the food of two persons suffices for four persons, and the food of four persons suffices for eight persons.\" [Muslim].","language":"english"},{"text":"Rasulullah SAW bersabda, “Makanan satu orang cukup untuk dua orang, makanan dua orang cukup untuk empat orang, dan makanan empat orang cukup untuk delapan orang.” [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Jabir bin \u0027Abdullah (May Allah be pleased with him) reported:","language":"english"},{"text":"Jabir bin \u0027Abdullah (ra dengan dia) melaporkan:","language":"bahasa"}]},{"index":"756","hadith_id":"riyadussalihin","text":[{"text":"عن أنس رضى الله عنه أن رسول الله صلى الله عليه وسلم كان يتنفس في الشراب ثلاثاً‏.‏((متفق عليه))","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) used to breathe three times in the course of a drink (he used to drink in three gulps). [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) biasa bernafas tiga kali saat minum (dia biasa minum dalam tiga tegukan). [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Anas (May Allah be pleased with him) reported:","language":"english"},{"text":"Anas (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"757","hadith_id":"riyadussalihin","text":[{"text":"وعن ابن عباس رضى الله عنهما قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏ \"‏لا تشربوا واحداً كشرب البعير، ولكن اشربوا مثنى وثلاث، وسموا إذا أنتم شربتم،واحمدوا إذا أنتم رفعتم‏\"‏‏.‏((رواه الترمذي))","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"Do not drink in one gulp like a camel, but in two or three (gulps). Mention the Name of Allah (i.e., say Bismillah) when you start drinking and praise Him (i.e., say Al-hamdu lillah) after you have finished (drinking).\" [At- Tirmidhi].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Jangan minum dalam satu tegukan seperti unta, tetapi dalam dua atau tiga (teguk). Sebutkan Nama Allah (yaitu, ucapkan Bismillah) ketika Anda mulai minum dan memuji Dia (yaitu, ucapkan Al-hamdu lillah) setelah kamu selesai (minum).” [At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Ibn \u0027Abbas (May Allah be pleased with them) reported:","language":"english"},{"text":"Ibn \u0027Abbas (semoga Allah meridhoi mereka) melaporkan:","language":"bahasa"}]},{"index":"758","hadith_id":"riyadussalihin","text":[{"text":"وعن أبى قتادة رضى الله عنه أن النبي صلى الله عليه وسلم نهى أن يتنفس في الإناء‏.‏‏((متفق عليه))","language":"arabic"},{"text":"The Prophet (ﷺ) forbade breathing into the vessel while drinking. [Al-Bukhari and Muslim].","language":"english"},{"text":"Nabi (ﷺ) melarang bernapas ke dalam bejana sambil minum. [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Qatadah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Qatadah r.a. melaporkan:","language":"bahasa"}]},{"index":"759","hadith_id":"riyadussalihin","text":[{"text":"وعن أنس رضى الله عنه أن رسول الله صلى الله عليه وسلم أتى بلبن قد شيب بماء، وعن يمينه أعرابي، وعن يساره أبو بكر رضى الله عنه ، فشرب، ثم أعطى الأعرابي وقال‏:‏ ‏ \"‏الأيمن فالأيمن‏\"‏.((متفق عليه))","language":"arabic"},{"text":"Milk mixed with water was brought to the Messenger of Allah (ﷺ). On his right side was sitting a bedouin and on his left was sitting Abu Bakr (May Allah be pleased with him). He (ﷺ) drank from it and handed the rest to the bedouin saying, \"One who is on the right has preference, then again the one who is on the right.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Susu dicampur dengan air dibawa ke Rasulullah (ﷺ). Di sebelah kanannya duduk seorang Badui dan di sebelah kirinya duduk Abu Bakar ra. Dia (ﷺ) meminumnya dan menyerahkan sisanya kepada orang Badui sambil berkata, \"Orang yang di sebelah kanan lebih diprioritaskan, kemudian orang yang di sebelah kanan lagi.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Anas (May Allah be pleased with him) reported:","language":"english"},{"text":"Anas (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"760","hadith_id":"riyadussalihin","text":[{"text":"وعن سهل بن سعد رضى الله عنه أن رسول الله صلى الله عليه وسلم أتى بشراب، فشرب منه وعن يمينه غلام، وعن يساره أشياخ، فقال للغلام‏:‏ ‏ \"‏أتأذن لي أن أعطى هؤلاء‏.‏‏؟‏‏\"‏ فقال الغلام‏:‏ لا والله ، لا أوثر بنصيبي منك أحدا، فتله رسول الله صلى الله عليه وسلم في يده‏.‏((متفق عليه)) ‏","language":"arabic"},{"text":"A drink was brought to the Messenger of Allah (ﷺ) and he drank (some) from it. On his right was a boy and on his left were some elderly people. He (ﷺ) said to the boy, \"Would you permit me to give rest of this drink to these on my left?\" The boy said: \"O Messenger of Allah, I would certainly not give preference to anyone in anything that might come to me from you.\" So he (ﷺ) handed over the rest of the drink to him. [Al-Bukhari and Muslim].","language":"english"},{"text":"Minuman dibawa ke Rasulullah (ﷺ) dan dia minum (sebagian) dari itu. Di sebelah kanannya ada seorang anak laki-laki dan di sebelah kirinya ada beberapa orang tua. Dia (ﷺ) berkata kepada anak laki-laki itu, \"Maukah Anda mengizinkan saya untuk memberikan sisa minuman ini kepada orang-orang di sebelah kiri saya?\" Anak laki-laki itu berkata: \"Ya Rasulullah, saya tidak akan memberikan preferensi kepada siapa pun dalam apa pun yang mungkin datang kepada saya dari Anda.\" Jadi dia (ﷺ) menyerahkan sisa minuman kepadanya. [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Sahl bin Sa\u0027d (May Allah be pleased with him) reported:","language":"english"},{"text":"Sahl bin Sa\u0027d radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"761","hadith_id":"riyadussalihin","text":[{"text":"عن أبى سعيد الخدرى رضى الله عنه قال ‏:‏ نهى رسول الله عن اختناث الأسقية ‏:‏ يعنى‏:‏ أن تكسر أفواهها، ويشرب منها‏.‏((متفق عليه))","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) forbade turning the water-skin upside down and drinking directly from its mouth. [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) melarang membalikkan kantong air dan meminum langsung dari mulutnya. [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Sa\u0027id Al-Khudri (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Sa\u0027id Al-Khudri r.a. melaporkan:","language":"bahasa"}]},{"index":"762","hadith_id":"riyadussalihin","text":[{"text":"وعن أبى هريرة رضى الله عنه قال‏:‏ نهى رسول الله صلى الله عليه وسلم أن يشرب من في السقاء أو القربة.‏((متفق عليه))","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) prohibited drinking directly out of the mouth of a water- skin. [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) melarang minum langsung dari mulut kulit air. [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"763","hadith_id":"riyadussalihin","text":[{"text":"وعن أم ثابت كبشة بنت ثابت أخت حسان بن ثابت رضى الله عنه وعنها قالت‏:‏ دخل عليَّ رسول الله صلى الله عليه وسلم، فشرب من فيّ قربة معلقة قائماً، فقمت إلى فيها فقطعته‏ ‏((رواه الترمذي وقال: حديث حسن صحيح)). وإنما قطعتها لتحفظ موضع فم رَسُول اللَّهِ ﷺ وتتبرك به وتصونه عن الابتذال. وهذا الحديث محمول على بيان الجواز، والحديثان السابقان لبيان الأفضل والأكمل، والله أعلم.","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) visited me and drank some water from a hanging water-skin while he was in a standing posture. So, I stood up and cut off the mouth (of that water-skin). [At- Tirmidhi]. An-Nawawi said that the reason why she did this was to preserve the part of the water-skin which the lips of Messenger of Allah (ﷺ) touched, gain blessings from it, and preserve it from dishonor. This narration is understood to show permissibility whereas the previous two narrations are to show what is better and closer to perfection. Allah knows best.","language":"english"},{"text":"Rasulullah (ﷺ) mengunjungi saya dan minum air dari kantong air yang tergantung saat dia dalam posisi berdiri. Jadi, saya berdiri dan memotong mulut (kulit air itu). [At-Tirmidzi] . An-Nawawi mengatakan bahwa alasan dia melakukan ini adalah untuk menjaga bagian kantong air yang disentuh oleh bibir Rasulullah (ﷺ), mendapatkan berkah darinya, dan menjaganya dari kehinaan. Narasi ini dipahami untuk menunjukkan kebolehan sedangkan dua riwayat sebelumnya adalah untuk menunjukkan apa yang lebih baik dan lebih dekat dengan kesempurnaan. Allah tahu yang terbaik.","language":"bahasa"}],"narrated":[{"text":"Umm Thabit Kabshah (May Allah be pleased with her), daughter of Thabit (May Allah be pleased with him) and the sister of Hassan bin Thabit, the Prophet\u0027s poet) reported:","language":"english"},{"text":"Ummu Tsabit Kabshah (ra dengan dia), putri Tsabit (ra dengan dia) dan saudara perempuan Hassan bin Tsabit, penyair Nabi) melaporkan:","language":"bahasa"}]},{"index":"764","hadith_id":"riyadussalihin","text":[{"text":"عن أبى سعيد الخدرى رضى الله عنه أن النبي صلى الله عليه وسلم نهى عن النفخ في الشراب، فقال رجل ‏:‏ القذاة أراها في الإناء‏؟‏ فقالب‏:‏ ‏\"‏أهرقها‏\"‏ قال‏:‏ إني لا أروى من نفس واحد‏؟‏ قال‏:‏ ‏\"‏فأبن القدح إذاً عن فيك‏\"‏.‏((رواه الترمذي))","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) prohibited us blowing in the drinking water. A man said: \"O Messenger of Allah! Sometimes I see some litter floating about on the surface. What should I do then?\" He (ﷺ) replied, \"Pour them out.\" Then the man said: \"My thirst is not quenched with one draught.\" Messenger of Allah (ﷺ) said, \"Then put away the cup from your mouth (in between three gulps), and take breath.\" [At-Tirmidhi].","language":"english"},{"text":"Rasulullah (ﷺ) melarang kita meniup air minum. Seorang laki-laki berkata: \"Ya Rasulullah! Kadang-kadang saya melihat sampah mengambang di permukaan. Apa yang harus saya lakukan?\" Dia (ﷺ) menjawab, \"Tuang mereka.\" Kemudian laki-laki itu berkata: \"Hausku tidak terpuaskan dengan satu hembusan.\" Rasulullah (ﷺ) berkata, \"Maka jauhkan cangkir dari mulutmu (di antara tiga tegukan), dan tarik napas.\" [At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Abu Sa\u0027id Al-Khudri (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Sa\u0027id Al-Khudri r.a. melaporkan:","language":"bahasa"}]},{"index":"765","hadith_id":"riyadussalihin","text":[{"text":"وعن ابن عباس رضى الله عنهما أن النبي صلى الله عليه وسلم نهى أن يتنفس في الإناء، أو ينفخ فيه‏.‏((رواه الترمذي))","language":"arabic"},{"text":"The Prophet (ﷺ) prohibited us from breathing into the drinking vessel or blowing in it. [At-Tirmidhi].","language":"english"},{"text":"Nabi (ﷺ) melarang kita bernapas ke dalam bejana minum atau meniup di dalamnya. [At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Ibn \u0027Abbas (May Allah be pleased with them) reported:","language":"english"},{"text":"Ibn \u0027Abbas (semoga Allah meridhoi mereka) melaporkan:","language":"bahasa"}]},{"index":"766","hadith_id":"riyadussalihin","text":[{"text":"وعن ابن عباس رضى الله عنهما قال‏:‏ سقيت النبي صلى الله عليه وسلم من زمزم، فشرب وهو قائم ‏.‏((متفق عليه))","language":"arabic"},{"text":"I served the Messenger of Allah (ﷺ) Zamzam water to drink and he drank it while he was standing. [Al-Bukhari and Muslim].","language":"english"},{"text":"Saya menyajikan air zamzam Rasulullah (ﷺ) untuk diminum dan dia meminumnya sambil berdiri. [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Ibn \u0027Abbas (May Allah be pleased with them) reported:","language":"english"},{"text":"Ibn \u0027Abbas (semoga Allah meridhoi mereka) melaporkan:","language":"bahasa"}]},{"index":"767","hadith_id":"riyadussalihin","text":[{"text":"وعن النزال بن سبرة رضى الله عنه قال‏:‏ أتى علي رضى الله عنه باب الرحبة فشرب قائماً، وقال‏:‏ إني رأيت رسول الله صلى الله عليه وسلم فعل كما رأيتموني فعلت‏.‏‏‏((‏رواه البخارى‏)‏‏)‏‏","language":"arabic"},{"text":"\u0027Ali bin Abu Talib (May Allah be pleased with him) arrived at Bab Ar-Rahbah (in Kufah) and drank water in a standing posture. Then he said: \"I saw the Messenger of Allah (ﷺ) doing what you have seen me doing.\" [Al-Bukhari].","language":"english"},{"text":"\u0027Ali bin Abu Thalib RA tiba di Bab Ar-Rahbah (di Kufah) dan minum air dalam posisi berdiri. Kemudian dia berkata: \"Saya melihat Rasulullah (ﷺ) melakukan apa yang Anda lihat saya lakukan.\" [Al-Bukhari] .","language":"bahasa"}],"narrated":[{"text":"An-Nazzal bin Sabrah (May Allah be pleased with him) reported:","language":"english"},{"text":"An-Nazzal bin Sabrah radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"768","hadith_id":"riyadussalihin","text":[{"text":"وعن ابن عمر رضى الله عنهما قال‏:‏كنا نأكل على عهد رسول الله صلى الله عليه وسلم ونحن نمشى ، ونشرب ونحن قيام‏.‏((رواه الترمذي))","language":"arabic"},{"text":"During the lifetime of the Messenger of Allah (ﷺ) we would eat while walking and would drink while standing. [At- Tirmidhi].","language":"english"},{"text":"Selama hidup Rasulullah () kita akan makan sambil berjalan dan minum sambil berdiri. [At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Ibn \u0027Umar (May Allah be pleased with them) reported:","language":"english"},{"text":"Ibnu \u0027Umar radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"769","hadith_id":"riyadussalihin","text":[{"text":"وعن عمرو بن شعيب عن أبيه عن جده رضى الله عنه قال‏:‏ رأيت رسول الله صلى الله عليه وسلم يشرب قائماً أو قاعداً‏.‏ ((رواه الترمذي))","language":"arabic"},{"text":"I saw Messenger of Allah (ﷺ) drink standing, or sitting. [At-Tirmidhi].","language":"english"},{"text":"Aku melihat Rasulullah () minum sambil berdiri atau duduk. [At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"\u0027Amr bin Shu\u0027aib on the authority of his father and grandfather reported:","language":"english"},{"text":"\u0027Amr bin Shu\u0027aib atas otoritas ayah dan kakeknya melaporkan:","language":"bahasa"}]},{"index":"770","hadith_id":"riyadussalihin","text":[{"text":"وعن أنس رضى الله عنه عن النبي صلى الله عليه وسلم أنه نهى أن يشرب الرجل قائماً‏.‏ قال قتادة‏:‏ فقلنا لأنس‏:‏ فالأكل‏؟‏ قال‏:‏ ذلك أشر -أو أخبث- ‏.‏ وفى رواية له أن النبي صلى الله عليه وسلم زجر عن الشرب قائما.‏‏((رواه مسلم))‏ وفى رواية له أن النبي صلى الله عليه وسلم زجر عن الشرب قائماً‏.‏","language":"arabic"},{"text":"The Prophet (ﷺ) forbade us from drinking while standing. Qatadah reported: \"We asked him: \u0027What about eating?\"\u0027 He said: \"That is even worse, (or may be he said) more detestable.\" Another narration is: The Messenger of Allah (ﷺ) reprimanded [us] for drinking while standing. [Muslim].","language":"english"},{"text":"Nabi (ﷺ) melarang kita minum sambil berdiri. Qatadah melaporkan: \"Kami bertanya kepadanya: \u0027Bagaimana dengan makan?\" Dia berkata: \"Itu bahkan lebih buruk, (atau mungkin dia katakan) lebih menjijikkan.\" Riwayat lainnya adalah: Rasulullah (ﷺ) menegur [kita] karena minum sambil berdiri. [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Anas (May Allah be pleased with him) reported:","language":"english"},{"text":"Anas (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"771","hadith_id":"riyadussalihin","text":[{"text":"وعن أبى هريرة رضى الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ لا يشربن أحد منكم قائماً، فمن نسى فليستقئ‏\"‏‏‏‏. ((رواه مسلم))‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"None of you should drink standing; and if any one forgets, he must vomit.\" [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, “Janganlah salah satu dari kalian minum sambil berdiri, dan jika ada yang lupa, dia harus muntah.” [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"772","hadith_id":"riyadussalihin","text":[{"text":"عن أبى قتادة رضى الله عنه عن النبي صلى الله عليه وسلم قال‏:‏ ‏ \"‏ ساقي القوم آخرهم شرباً‏\"‏. ((رواه الترمذي))","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"He who serves others with drinking water should be the last to drink himself.\" [At-Tirmidhi].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, “Barangsiapa yang melayani orang lain dengan air minum, maka dialah yang terakhir meminum dirinya sendiri.” [At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Abu Qatadah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Qatadah r.a. melaporkan:","language":"bahasa"}]},{"index":"773","hadith_id":"riyadussalihin","text":[{"text":"عن أنس رضى الله عنه قال‏:‏ حضرت الصلاة، فقام من كان قريب الدار إلى أهله، وبقى قوم فأتى رسول الله صلى الله عليه وسلم بمخضب من حجارة، فصغر المخضب أن يبسط فيه كفه، فتوضأ القوم كلهم‏.‏ قالوا‏:‏ كم كنتم‏؟‏ قال‏:‏ ثمانين وزيادة‏.‏((متفق عليه))، هذه رواية البخاري. وفي رواية مسلم:‏ أن النبي صلى الله عليه وسلم دعا بإناء من ماء، فأتى بقدح رحراح فيه شئ من ماء، فوضع أصابعه فيه‏.‏ قال أنس ‏:‏ فجعلت أنظر إلى الماء ينبع من بين أصابعه ‎، فحزرت من توضأ ما بين السبعين إلى الثمانين‏.‏","language":"arabic"},{"text":"Once the time for As-Salat (the prayer) approached. Those whose houses were near, went to their houses (to perform Wudu\u0027) while some of the people remained with the Messenger of Allah (ﷺ). A stone (containing some water) bowl was brought for him. It was too small for him to spread his hand over it. He performed his Wudu\u0027 and it (the water) sufficed for all the others also. Anas was asked: \"How many of you were present there?\" He said: \"Eighty or more.\" [Al-Bukhari and Muslim]. This is Al-Bukhari\u0027s version. In Muslim\u0027s version \"\u0027that Allah\u0027s Apostle (ﷺ) called for a container of water so he was given a vessel that had some water.\u0027 Anas said \u0027Then I started looking at the water spouting from his fingers. Then I estimated (the persons) and they were between seventy and eighty.\u0027\"","language":"english"},{"text":"Setelah waktu As-Salat (doa) mendekat. Orang-orang yang rumahnya dekat, pergi ke rumahnya (untuk berwudhu), sementara sebagian orang tetap bersama Rasulullah (ﷺ). Sebuah mangkuk batu (berisi air) dibawakan untuknya. Itu terlalu kecil baginya untuk merentangkan tangannya di atasnya. Dia melakukan Wudu\u0027 dan itu (air) cukup untuk semua yang lain juga. Anas ditanya: \"Berapa banyak dari Anda yang hadir di sana?\" Dia berkata: \"Delapan puluh atau lebih.\" [Al-Bukhari dan Muslim]. Ini versi Al-Bukhari. Dalam versi Muslim \"\u0027bahwa Rasul Allah (ﷺ) meminta wadah berisi air sehingga dia diberi bejana yang berisi air.\u0027 Anas berkata \u0027Kemudian saya mulai melihat air yang menyembur dari jari-jarinya. Kemudian saya memperkirakan (orang-orangnya) dan mereka antara tujuh puluh dan delapan puluh.\u0027\"","language":"bahasa"}],"narrated":[{"text":"Anas bin Malik (May Allah be pleased with him) reported:","language":"english"},{"text":"Anas bin Malik radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"774","hadith_id":"riyadussalihin","text":[{"text":"وعن عبد الله بن زيد رضى الله عنه قال‏:‏ أتانا النبي صلى الله عليه وسلم، فأخرجنا له ماء في نور من صفر فتوضأ‏.‏‏‏((‏رواه البخارى‏)‏‏)‏‏","language":"arabic"},{"text":"The Prophet (ﷺ) visited us and we brought water for him in a brass vessel for his ablution and he performed ablution. [Al- Bukhari].","language":"english"},{"text":"Nabi (ﷺ) mengunjungi kami dan kami membawakan air untuknya dalam bejana kuningan untuk wudhunya dan dia melakukan wudhu. [Al-Bukhari] .","language":"bahasa"}],"narrated":[{"text":"\u0027Abdullah bin Zaid (May Allah be pleased with him) reported:","language":"english"},{"text":"\u0027Abdullah bin Zaid (ra dengan dia) melaporkan:","language":"bahasa"}]},{"index":"775","hadith_id":"riyadussalihin","text":[{"text":"وعن جابر رضى الله عنه أن رسول الله صلى الله عليه وسلم دخل على رجل من الأنصار، ومعه صاحب له، فقال رسول الله صلى الله عليه وسلم‏:‏ ‏ \"‏إن كان عندك ماء بات هذه الليلة في سنة وإلا كرعنا‏\"‏‏‏.‏‏‏((‏رواه البخارى‏)‏‏)‏‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) visited the house of a man of the Ansar with one of his Companions and said to him, \"If you have some water in the water-skin left over from last night, give it to us for drinking; otherwise, we shall drink from some stream directly.\" [Al- Bukhari].","language":"english"},{"text":"Rasulullah (ﷺ) mengunjungi rumah seorang Ansar dengan salah satu sahabatnya dan berkata kepadanya, \"Jika Anda memiliki sedikit air di kantong air yang tersisa dari semalam, berikan kepada kami untuk diminum; jika tidak, kita akan minum dari aliran tertentu secara langsung.\" [Al-Bukhari] .","language":"bahasa"}],"narrated":[{"text":"Jabir (May Allah be pleased with him) reported:","language":"english"},{"text":"Jabir (ra dengan dia) melaporkan:","language":"bahasa"}]},{"index":"776","hadith_id":"riyadussalihin","text":[{"text":"وعن حذيفة رضى الله عنه قال‏:‏ إن النبي صلى الله عليه وسلم نهانا عن الحرير والديباج والشرب في آنية الذهب والفضة، وقال‏:‏ ‏ \"‏هي لهم في الدنيا، وهى لكم في الآخرة‏\"‏‏.((متفق عليه)) ‏","language":"arabic"},{"text":"The Prophet (ﷺ) prohibited us from wearing brocade or silk and drinking out of gold or silver vessels and said, \"These are meant for them (disbelievers) in this world and for you in the Hereafter.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Nabi (ﷺ) melarang kami mengenakan brokat atau sutra dan minum dari bejana emas atau perak dan berkata, \"Ini dimaksudkan untuk mereka (kafir) di dunia ini dan untuk Anda di akhirat.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Hudhaifah (May Allah be pleased with him) reported:","language":"english"},{"text":"Hudzaifah r.a. melaporkan:","language":"bahasa"}]},{"index":"777","hadith_id":"riyadussalihin","text":[{"text":"وعن أم سلمة رضى الله عنها أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏\"‏الذي يشرب في آنية الفضة إنما يجرجر في بطنه نار جهنم‏\"‏‏.((متفق عليه)) ‏ وفى ‏:‏ ‏\"‏إن الذي يأكل أو يشرب في آنية الفضة والذهب‏\"‏ وفى رواية له‏:‏ ‏\"‏ من شرب في إناءٍ من ذهب أو فضة فإنما يجرجر في بطنه ناراً من جهنم‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"He who drinks from the vessel of silver kindles the Fire (of Hell) in his belly.\" [Al-Bukhari and Muslim]. A narration in Muslim is: The Messenger of Allah (ﷺ) said, \"Surely, he who eats or drinks in gold and silver vessels fills his belly with Hell-fire.\"","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Barangsiapa minum dari bejana perak, menyalakan Api (Neraka) di perutnya.\" [Al-Bukhari dan Muslim] . Sebuah riwayat dalam Muslim adalah: Rasulullah (ﷺ) berkata, \"Sesungguhnya, orang yang makan atau minum di bejana emas dan perak mengisi perutnya dengan api neraka.\"","language":"bahasa"}],"narrated":[{"text":"Umm Salamah (May Allah be pleased with her) reported:","language":"english"},{"text":"Ummu Salamah (Semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]}]