[{"index":"778","hadith_id":"riyadussalihin","text":[{"text":"وعن ابن عباس رضى الله عنهما أن رسول الله صلى الله عليه وسلم قال‏:‏ إلبسوا من ثيابكم البياض؛ فإنها من خير ثيابكم، وكفنوا فيها موتاكم‏\"‏.‏((رواه أبو داود والترمذي))","language":"arabic"},{"text":"I heard the Messenger of Allah (ﷺ) saying, \"Put on white clothes because they are the best; and use them for shrouding your dead.\" [Abu Dawud and At- Tirmidhi].","language":"english"},{"text":"Saya mendengar Rasulullah (ﷺ) berkata, \"Pakailah pakaian putih karena itu yang terbaik; dan gunakan untuk menyelubungi orang mati Anda.\" [Abu Dawud dan At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Ibn \u0027Abbas (May Allah be pleased with them) reported:","language":"english"},{"text":"Ibn \u0027Abbas (semoga Allah meridhoi mereka) melaporkan:","language":"bahasa"}]},{"index":"779","hadith_id":"riyadussalihin","text":[{"text":"وعن سمرة رضى الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏‏ \"‏إلبسوا البياض؛ فإنها أطهر وأطيب، وكفنوا فيها موتاكم‏\"‏.‏ ((رواه النسائي والحاكم))","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \u0027Wear white clothes because they are the purest and they are closest to modesty; and shroud the dead in it.\" [An- Nasa\u0027i and Al-Hakim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \u0027Pakailah pakaian putih karena itu yang paling suci dan paling dekat dengan kesopanan; dan kafan orang mati di dalamnya.\" [An-Nasa\u0027i dan Al-Hakim] .","language":"bahasa"}],"narrated":[{"text":"Samurah (May Allah be pleased with him) reported:","language":"english"},{"text":"Samurah (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"780","hadith_id":"riyadussalihin","text":[{"text":"وعن البراء رضى الله عنه قال‏:‏ كان رسول الله صلى الله عليه وسلم مربوعاً، ولقد رأيته في حلةٍ حمراء ما رأيت شيئاً قط أحسن منه.((متفق عليه)) ‏‏","language":"arabic"},{"text":"Messenger of Allah (ﷺ) was of medium stature. I saw him wearing a red mantle. I have never seen anything more graceful than that. [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) bertubuh sedang. Aku melihatnya memakai jubah merah. Saya belum pernah melihat sesuatu yang lebih anggun dari itu. [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Bara\u0027 (May Allah be pleased with him) reported:","language":"english"},{"text":"Bara\u0027 (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"781","hadith_id":"riyadussalihin","text":[{"text":"وعن أبى جحيفة وهب بن عبد الله رضى الله عنه قال‏:‏ رأيت النبي صلى الله عليه وسلم بمكة وهو بالأبطح في قبة له حمراء من آدم، فخرج بلال بوضوئه، فمن ناضح ونائل، فخرج النبي صلى الله عليه وسلم وعليه حلة حمراء، كأني أنظر إلى بياض ساقيه، فتوضأ وأذن بلال، فجعلت أتتبع فاه ههنا وههنا، يقول يمينا وشمالاً‏:‏ حي على الصلاة، حي على الفلاح، ثم ركزت له عنزة، فتقدم فصلى يمر بين يديه الكلب والحمار لا يمنع‏.((متفق عليه))","language":"arabic"},{"text":"I saw the Prophet (ﷺ) by Al-Abtah valley in Makkah, in a red tent made from tanned skin. Bilal brought him ablution water. Then the Messenger of Allah (ﷺ) came out wearing a red mantle; and I can still remember looking at whiteness of his shanks. So he made his ablution, and Bilal (ﷺ) pronounced the call for prayer (Adhan). I kept following the movement of his (Bilal\u0027s) face to the right and to the left when he recited: \u0027Come to the prayer; come to the success.\u0027 Then a spear was fixed (as a Sutrah) in front of Messenger of Allah (ﷺ) who then stepped forward and led the prayer. Dogs and donkeys passed in front of him (beyond the spear) and no one prevented them from doing so. [Al-Bukhari and Muslim].","language":"english"},{"text":"Saya melihat Nabi (ﷺ) di dekat lembah Al-Abtah di Mekah, dalam tenda merah yang terbuat dari kulit yang kecokelatan. Bilal membawakannya air wudhu. Kemudian Rasulullah (ﷺ) keluar dengan mengenakan jubah merah; dan saya masih ingat melihat putihnya betisnya. Maka dia berwudhu, dan Bilal (ﷺ) mengumandangkan adzan. Saya terus mengikuti gerakan wajahnya (Bilal) ke kanan dan ke kiri ketika dia membaca: \u0027Ayo sholat; datang ke kesuksesan.\u0027 Kemudian sebuah tombak ditancapkan (sebagai Sutrah) di depan Rasulullah (ﷺ) yang kemudian melangkah maju dan memimpin shalat. Anjing dan keledai lewat di depannya (di luar tombak) dan tidak ada yang mencegah mereka melakukannya. [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Juhaifah Wahb bin \u0027Abdullah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Juhaifah Wahb bin \u0027Abdullah (ra dengan dia) melaporkan:","language":"bahasa"}]},{"index":"782","hadith_id":"riyadussalihin","text":[{"text":"وعن أبى رمثة رفاعة التيمى رضى الله عنه قال‏:‏ رأيت رسول الله صلى الله عليه وسلم وعليه ثوبان أخضران‏.‏((رواه أبو داود والترمذي))","language":"arabic"},{"text":"I saw the Messenger of Allah (ﷺ) wearing two green garments. [Abu Dawud and At- Tirmidhi].","language":"english"},{"text":"Saya melihat Rasulullah (ﷺ) mengenakan dua pakaian hijau. [Abu Dawud dan At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Abu Rimthah Rifa\u0027ah At-Taimi (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Rimthah Rifa\u0027ah At-Taimi (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"783","hadith_id":"riyadussalihin","text":[{"text":"وعن جابر رضى الله عنه ، أن رسول الله صلى الله عليه وسلم دخل يوم فتح مكة وعليه عمامة سوداء‏.‏‏‏((رواه مسلم))‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) entered Makkah on the day of its conquest and he was wearing a black turban. [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) memasuki Mekkah pada hari penaklukannya dan dia mengenakan sorban hitam. [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Jabir (May Allah be pleased with him) reported:","language":"english"},{"text":"Jabir (ra dengan dia) melaporkan:","language":"bahasa"}]},{"index":"784","hadith_id":"riyadussalihin","text":[{"text":"وعن أبى سعيد عمرو بن حريث رضى الله عنه قال‏:‏ كأني انظر إلى رسول الله صلى الله عليه وسلم وعليه عمامة سوداء، قد أرخى طرفيها بين كتفيه‏.‏‏‏((رواه مسلم))‏ ‏ وفى رواية له ‏:‏ أن رسول الله صلى الله عليه وسلم خطب الناس، وعليه عمامة سوداء‏.","language":"arabic"},{"text":"It was as if I am seeing the Messenger of Allah (ﷺ) wearing a black turban and both ends of it are falling over his shoulders. [Muslim]. Another narration is: The Messenger of Allah (ﷺ) was delivering a Khutbah wearing a black turban.","language":"english"},{"text":"Seolah-olah saya melihat Rasulullah (ﷺ) mengenakan sorban hitam dan kedua ujungnya jatuh di atas bahunya. [Muslim] . Riwayat lainnya adalah: Rasulullah (ﷺ) sedang menyampaikan khutbah dengan mengenakan sorban hitam.","language":"bahasa"}],"narrated":[{"text":"Abu Sa\u0027id \u0027Amr bin Huraith (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Sa\u0027id \u0027Amr bin Huraith r.a. melaporkan:","language":"bahasa"}]},{"index":"785","hadith_id":"riyadussalihin","text":[{"text":"وعن عائشة رضى الله عنها قالت‏:‏ كفن رسول الله صلى الله عليه وسلم في ثلاثة أثواب بيض سحولية من كرسف، ليس فيها قميص ولا عمامة‏.((متفق عليه)) ‏ ‏","language":"arabic"},{"text":"The body of Messenger of Allah (ﷺ) was shrouded in three white Yemeni cotton garments, among which was neither a gown nor a turban. [Al- Bukhari and Muslim].","language":"english"},{"text":"Tubuh Rasulullah (ﷺ) diselimuti tiga pakaian katun Yaman putih, di antaranya bukan gaun atau sorban. [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"\u0027Aishah (May Allah be pleased with her) reported:","language":"english"},{"text":"\u0027Aisyah r.a. melaporkan:","language":"bahasa"}]},{"index":"786","hadith_id":"riyadussalihin","text":[{"text":"وعنها قالت‏:‏ خرج رسول الله صلى الله عليه وسلم ذات غداة، وعليه مرط مرحل من شعر أسود‏.‏‏‏((رواه مسلم))‏","language":"arabic"},{"text":"One morning the Messenger of Allah (ﷺ) went out wearing a black blanket made of a camel or sheep\u0027s black hair with patterns of camel\u0027s bags upon it. [Muslim].","language":"english"},{"text":"Suatu pagi Rasulullah (ﷺ) keluar dengan mengenakan selimut hitam yang terbuat dari bulu hitam unta atau domba dengan pola tas unta di atasnya. [Muslim] .","language":"bahasa"}],"narrated":[{"text":"\u0027Aishah (May Allah be pleased with her) reported:","language":"english"},{"text":"\u0027Aisyah r.a. melaporkan:","language":"bahasa"}]},{"index":"787","hadith_id":"riyadussalihin","text":[{"text":"وعن المغيرة بن شعبة رضى الله عنه قال‏:‏ كنت مع رسول الله صلى الله عليه وسلم ذات ليلة في مسير، فقال لي‏:‏ ‏\"‏أمعك ماء‏\"‏ ‏؟‏ قلت‏:‏ نعم، فنزل عن راحلته فمشى حتى توارى في سواد الليل ثم جاء فأفرغت علي من الإداواة، فغسل وجهه وعليه جبة من صوف،فلم يستطع أن يخرج ذراعيه منها حتى أخرجهما من أسفل الجبة، فغسل ذراعيه ومسح برأسه، ثم أهويت لأنزع خفيه فقال‏:‏‏\"‏دعهما فإني أدخلتهما طاهرتين‏\"‏ ومسح عليهما‏.‏((متفق عليه)) وفى رواية‏:‏وعليه جبة شامية ضيقة الكمين‏.‏ وفى رواية‏:‏ أن هذه القضية كانت في غزوة تبوك‏.‏","language":"arabic"},{"text":"I was with the Messenger of Allah (ﷺ) in a journey one night, and he asked me, \"Do you have any water with you?\" I said, \"Yes.\" So he dismounted from his riding camel and walked away (to answer the call of nature) until he disappeared in the darkness. When he returned, I poured out some water from a vessel and he washed his face. He was wearing a long woolen cloak and could not take out his forearms from his sleeves, so he brought them out from below the cloak and then washed them, and then passed his (wet) hands over his head. I stretched out my hand to take off his Khuff (leather socks), but he said, \"Leave them. I put them on after performing Wudu\u0027,\" and he passed his (wet) hands over them. [Al-Bukhari and Muslim]. Another narration is: The Messenger of Allah (ﷺ) was wearing a Syrian cloak with tight sleeves. Another narration is: This incident took place during the battle of Tabuk.","language":"english"},{"text":"Saya bersama Rasulullah (ﷺ) dalam perjalanan suatu malam, dan dia bertanya kepada saya, \"Apakah Anda punya air?\" Saya bilang iya.\" Maka dia turun dari unta tunggangannya dan berjalan pergi (untuk menjawab panggilan alam) sampai dia menghilang dalam kegelapan. Ketika dia kembali, saya menuangkan air dari bejana dan dia membasuh wajahnya. Dia mengenakan jubah wol panjang dan tidak bisa melepaskan lengannya dari lengan bajunya, jadi dia mengeluarkannya dari bawah jubah dan kemudian mencucinya, dan kemudian melewati tangannya (basah) di atas kepalanya. Saya mengulurkan tangan saya untuk melepas Khuff (kaus kaki kulit), tapi dia berkata, \"Biarkan mereka. Saya memakainya setelah melakukan Wudu\u0027,\" dan dia melewati tangannya (basah) di atasnya. [Al-Bukhari dan Muslim] . Narasi lain adalah: Rasulullah (ﷺ) mengenakan jubah Suriah dengan lengan ketat. Narasi lain adalah: Kejadian ini terjadi selama pertempuran Tabuk.","language":"bahasa"}],"narrated":[{"text":"Al-Mughirah bin Shu\u0027bah (May Allah be pleased with him) reported:","language":"english"},{"text":"Al-Mughirah bin Shu\u0027bah (ra dengan dia) melaporkan:","language":"bahasa"}]},{"index":"788","hadith_id":"riyadussalihin","text":[{"text":"عن أم سلمة رضى الله عنها قالت‏:‏ كان أحب الثياب إلى رسول الله صلى الله عليه وسلم القميص‏.‏((رواه أبو داود والترمذي))","language":"arabic"},{"text":"Out of all garments, the Messenger of Allah (ﷺ) liked the Qamees the best. [Abu Dawud and At-Tirmidhi ]. Editor\u0027s note: The Qamees is a modest, traditional outfit thought to resemble what is now referred to as a thawb.","language":"english"},{"text":"Dari semua pakaian, Rasulullah (ﷺ) paling menyukai pakaian Qamees. [Abu Dawud dan At-Tirmidzi] . Catatan editor: Qamees adalah pakaian tradisional sederhana yang dianggap menyerupai apa yang sekarang disebut sebagai thawb.","language":"bahasa"}],"narrated":[{"text":"Umm Salamah (May Allah be pleased with her) reported:","language":"english"},{"text":"Ummu Salamah (Semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"789","hadith_id":"riyadussalihin","text":[{"text":"عن أسماء بنت يزيد الأنصارية رضى الله عنها قالت‏:‏ كان كم قميص رسول الله صلى الله عليه وسلم إلى الرسغ.‏((رواه أبو داود والترمذي))","language":"arabic"},{"text":"The sleeves of the Messenger of Allah (ﷺ)\u0027s Qamees reached down to his wrists. [Abu Dawud and At-Tirmidhi].","language":"english"},{"text":"Lengan baju Rasulullah (ﷺ) sampai ke pergelangan tangannya. [Abu Dawud dan At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Asma\u0027 bint Yazid (May Allah be pleased with her) reported:","language":"english"},{"text":"Asma\u0027 binti Yazid radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"790","hadith_id":"riyadussalihin","text":[{"text":"وعن ابن عمر رضى الله عنهما أن النبي صلى الله عليه وسلم قال‏:‏ ‏\"‏من جر ثوبه خيلاء لم ينظر الله إليه يوم القيامة‏\"‏ فقال أبو بكر‏:‏ يا رسول الله إن إزاري يسترخي إلى أن أتعاهده، فقال له رسول الله صلى الله عليه وسلم‏:‏ ‏\"‏إنك لست ممن يفعله خيلاء‏\"‏‏.‏‏‏((‏رواه البخارى‏)‏‏)‏‏","language":"arabic"},{"text":"The Prophet (ﷺ) said, \"Whoever allows his lower garment to drag out of vanity will find that Allah will not look at him on the Day of Resurrection.\" On this Abu Bakr (May Allah be pleased with him) replied: \"O Messenger of Allah! My lower garment keeps sliding down though I take care to pull it and wrap it.\" The Messenger of Allah (ﷺ) said, \"You are not of those who do it out of vanity.\" [Al- Bukhari].","language":"english"},{"text":"Nabi (ﷺ) berkata, \"Siapa pun yang membiarkan pakaian bawahnya ditarik keluar dari kesombongan akan menemukan bahwa Allah tidak akan melihatnya pada Hari Kebangkitan.\" Tentang ini Abu Bakar (ra dengan dia) menjawab: \"Ya Rasulullah! Pakaian bawahku terus meluncur ke bawah meskipun aku berhati-hati untuk menariknya dan membungkusnya.\" Rasulullah (ﷺ) bersabda, “Kamu tidak termasuk orang-orang yang melakukannya karena kesia-siaan.” [Al-Bukhari] .","language":"bahasa"}],"narrated":[{"text":"Ibn \u0027Umar (May Allah be pleased with him) reported:","language":"english"},{"text":"Ibnu Umar radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"791","hadith_id":"riyadussalihin","text":[{"text":"وعن أبى هريرة رضى الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏ \"‏لا ينظر الله يوم القيامة إلى من جر إزاره بطراً‏\"‏.‏((متفق عليه))","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"On the Day of Resurrection, Allah will not look at him who trails his lower garment out of pride.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, “Pada hari kiamat, Allah tidak akan melihat orang yang menjulurkan pakaiannya karena sombong.” [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"792","hadith_id":"riyadussalihin","text":[{"text":"وعنه عن النبي صلى الله عليه وسلم قال‏:‏ ‏ \"‏ما أسفل من الكعبين من الإزار ففي النار‏\"‏.‏‏‏((‏رواه البخارى‏)‏‏)‏‏","language":"arabic"},{"text":"The Prophet (ﷺ) said, \"What is below the ankles of a lower garment is condemned to the Fire (Hell).\" [Al-Bukhari].","language":"english"},{"text":"Nabi (ﷺ) berkata, \"Apa yang ada di bawah mata kaki dari pakaian yang lebih rendah dikutuk ke Api (Neraka).\" [Al-Bukhari] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"793","hadith_id":"riyadussalihin","text":[{"text":"وعن أبى ذر رضى الله عنه عن النبي صلى الله عليه وسلم قال‏:‏ ‏\"‏ثلاثة لا يكلمهم الله يوم القيامة، ولا ينظر إليهم ، ولا يزكيهم، ولهم عذاب أليم‏\"‏ قال‏:‏ فقرأها رسول الله صلى الله عليه وسلم ثلاث مرار‏.‏ قال أبو ذر ‏:‏ خابوا وخسروا ‍ من هم يا رسول الله ‏؟‏ قال‏:‏ ‏\"‏المسبل، والمنان، والمنفق سلعته بالحلف الكاذب‏\"‏‏‏‏.‏ وفى رواية له‏:‏ ‏\"‏المسبل إزاره‏\"‏‏‏.((رواه مسلم))‏","language":"arabic"},{"text":"I heard the Prophet (ﷺ) saying, \"There are three to whom Allah will neither speak on the Day of Resurrection nor will look at them nor purify them (i.e., of their sins), and they will be severely tormented.\" When he repeated this (statement) thrice, Abu Dharr (May Allah be pleased with him) said: \"They are doomed and destroyed! (But) who are they, O Messenger of Allah (ﷺ)?\" He said, \"One whose lower garment trails, one who boasts of kindness shown to another; and one who promotes sale of his business by taking false oaths.\" [Muslim].","language":"english"},{"text":"Saya mendengar Nabi (ﷺ) berkata, \"Ada tiga orang yang tidak akan diajak bicara oleh Allah pada hari kiamat, tidak akan melihat mereka dan tidak menyucikan mereka (yaitu, dari dosa-dosa mereka), dan mereka akan disiksa dengan sangat keras.\" Ketika dia mengulangi (pernyataan) ini tiga kali, Abu Dzar (semoga Allah meridhoinya) berkata: \"Mereka dikutuk dan dihancurkan! (Tetapi) siapakah mereka, ya Rasulullah (ﷺ)?\" Dia berkata, \"Orang yang pakaian bawahnya tertinggal, orang yang menyombongkan kebaikan ditunjukkan kepada orang lain; dan orang yang mempromosikan penjualan bisnisnya dengan sumpah palsu.\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Dharr (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Dzar radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"794","hadith_id":"riyadussalihin","text":[{"text":"وعن ابن عمر رضى الله عنهما ، عن النبي صلى الله عليه وسلم قال‏:‏ ‏ \"‏الإسبال من الإزار، والقميص، والعمامة؛ من جر شيئاً خيلاء لم ينظر الله إليه يوم القيامة‏\"‏‏‏‏.‏((رواه أبو داود والنسائي))","language":"arabic"},{"text":"The Prophet (ﷺ) said, \"On the Day of Resurrection, Allah will not look at one who trails his lower garment, Qamees or turban arrogantly.\" [Abu Dawud and An- Nasa\u0027i].","language":"english"},{"text":"Nabi (ﷺ) berkata, \"Pada hari kiamat, Allah tidak akan melihat orang yang membuntuti pakaian bawahnya, qamees atau sorban dengan sombong.\" [Abu Dawud dan An-Nasa\u0027i] .","language":"bahasa"}],"narrated":[{"text":"Ibn \u0027Umar (May Allah be pleased with them) reported:","language":"english"},{"text":"Ibnu \u0027Umar radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"795","hadith_id":"riyadussalihin","text":[{"text":"وعن أبى جرى جابر بن سليم رضى الله عنه قال‏:‏ رأيت رجلا يصدر الناس عن رأيه ؛ لا يقول شيئاً إلا صدروا عنه؛ قلت‏:‏ من هذا قالوا‏:‏ رسول الله صلى الله عليه وسلم‏.‏قلت‏:‏ عليك السلام يا رسول الله - مرتين- قال‏:‏ ‏\"‏لا تقل عليك السلام، عليك السلام تحية الموتى -قلت ‏:‏ السلام عليك‏\"‏ قال‏:‏ قلت‏:‏ أنت رسول الله ‏؟‏ قال‏:‏ ‏\"‏أنا رسول الله إذا أصابك ضر فدعوته كشفه عنك،وإذا أصابك عام سنة فدعوته أنبتها لك، وإذا كنت بأرض قفر أو فلاة، فضلت راحلتك، فدعوته ردها عليك‏\"‏ قال‏:‏ قلت‏:‏ اعهد إلى‏.‏ قال‏:‏ ‏\"‏لا تسبن أحداً‏\"‏ قال‏:‏ فما سببت بعده حراً، ولا عبداً، ولا بعيراً، ولا شاة ‏\"‏ولا تحقرن من المعروف شيئاً، وأن تكلم أخاك وأنت منبسط إليه وجهك؛ إن ذلك من المعروف‏.‏ وارفع إزارك إلى نصف الساق، فإن أبيت فإلى الكعبين، وإياك وإسبال الإزار فإنها من المخيلة وإن الله لا يحب المخيلة، وإن امرؤا شتمك وعيرك، بما يعلم فيك فلا تعيره بما تعلم فيه، فإنما وبال ذلك عليه‏\"‏.‏((رواه أبو داود والترمذي))","language":"arabic"},{"text":"I noticed a man whose opinion was followed by everyone, and no one acted contrary to what he said. I asked who he was, and I was informed that he was the Messenger of Allah (ﷺ). I said to him twice: \"Alaikas- salam ya Rasul-Allah (May Allah render you safe).\" He said, \"Do not say: \u0027Alaikas-salamu.\u0027 This is the salutation to the dead (during the time of Jahiliyyah). Say, instead: \u0027As-salamu \u0027alaika (May Allah render you safe).\"\u0027 I asked: \"Are you the Messenger of Allah?\" He replied, \"(Yes) I am the Messenger of Allah, The One Who (Allah) will remove your affliction when you are in trouble and call upon Him, Who will cause food to grow for you when you are famine-stricken and call upon Him, and Who will restore to you your lost riding animal in the desert when you call upon Him.\" I said to him: \"Give me instructions (to act upon).\" He (ﷺ) said, \"Do not abuse anyone.\" (Since then I have never abused anyone, neither a freeman, nor a slave, nor a camel, nor a sheep). He (ﷺ) continued, \"Do not hold in contempt even an insignificant act of goodness because even talking to your brother with a cheerful countenance is an act of goodness. Hold up your lower garment half way to the leg, and at least above the ankles; for trailing it is arrogance, and Allah dislikes pride. And if a man attributes to you bad things he knows you possess, do not attribute to him bad things that you know he has for he will assume the evil consequences of his abuse.\" [Abu Dawud and At-Tirmidhi].","language":"english"},{"text":"Saya melihat seorang pria yang pendapatnya diikuti oleh semua orang, dan tidak ada yang bertindak bertentangan dengan apa yang dia katakan. Saya bertanya siapa dia, dan saya diberitahu bahwa dia adalah Rasulullah (ﷺ). Aku berkata kepadanya dua kali: \"Alaikas-salam ya Rasul-Allah (Semoga Allah memberimu keselamatan).\" Dia berkata, \"Jangan katakan: \u0027Alaikas-salamu.\u0027 Ini adalah salam untuk orang mati (pada masa Jahiliyyah) Katakanlah, sebagai gantinya: \u0027As-salamu \u0027alaika (Semoga Allah memberi Anda keselamatan).\"\u0027 Saya bertanya: \"Apakah Anda utusan Allah?\" Dia menjawab, \"(Ya) Aku adalah Utusan Allah, Yang (Allah) akan menghilangkan kesengsaraanmu ketika kamu dalam kesulitan dan memanggil-Nya, Yang akan menumbuhkan makanan untukmu ketika kamu dilanda kelaparan dan memanggil kepada-Nya, dan Siapa yang akan mengembalikan bagimu hewan tungganganmu yang hilang di padang gurun ketika kamu berseru kepada-Nya.” Saya berkata kepadanya: \"Beri saya instruksi (untuk bertindak).\" Dia (ﷺ) berkata, \"Jangan menyalahgunakan siapa pun.\" (Sejak itu saya tidak pernah melecehkan siapa pun, baik orang merdeka, budak, unta, maupun domba). Beliau (ﷺ) melanjutkan, \"Jangan meremehkan kebaikan yang tidak penting, karena berbicara dengan saudaramu dengan wajah ceria adalah suatu kebaikan. Angkatlah pakaian bawahmu setengah ke kaki, dan setidaknya di atas kakimu. mata kaki, karena membuntuti itu adalah kesombongan, dan Allah tidak menyukai kesombongan. Dan jika seorang pria mengaitkan kepada Anda hal-hal buruk yang dia tahu Anda miliki, jangan menganggapnya hal-hal buruk yang Anda tahu dia miliki karena dia akan menanggung akibat buruk dari pelecehannya. \" bukan orang merdeka, atau budak, atau unta, atau domba). Beliau (ﷺ) melanjutkan, \"Jangan meremehkan kebaikan yang tidak penting, karena berbicara dengan saudaramu dengan wajah ceria adalah suatu kebaikan. Angkatlah pakaian bawahmu setengah ke kaki, dan setidaknya di atas kakimu. mata kaki, karena membuntuti itu adalah kesombongan, dan Allah tidak menyukai kesombongan. Dan jika seorang pria mengaitkan kepada Anda hal-hal buruk yang dia tahu Anda miliki, jangan menganggapnya hal-hal buruk yang Anda tahu dia miliki karena dia akan menanggung akibat buruk dari pelecehannya. \" bukan orang merdeka, atau budak, atau unta, atau domba). Beliau (ﷺ) melanjutkan, \"Jangan meremehkan kebaikan yang tidak penting, karena berbicara dengan saudaramu dengan wajah ceria adalah suatu kebaikan. Angkatlah pakaian bawahmu setengah ke kaki, dan setidaknya di atas kakimu. mata kaki, karena membuntuti itu adalah kesombongan, dan Allah tidak menyukai kesombongan. Dan jika seorang pria mengaitkan kepada Anda hal-hal buruk yang dia tahu Anda miliki, jangan menganggapnya hal-hal buruk yang Anda tahu dia miliki karena dia akan menanggung akibat buruk dari pelecehannya. \" dan setidaknya di atas mata kaki; karena mengikutinya adalah kesombongan, dan Allah tidak menyukai kesombongan. Dan jika seorang pria menghubungkan Anda dengan hal-hal buruk yang dia tahu Anda miliki, jangan menghubungkannya dengan hal-hal buruk yang Anda tahu dia miliki karena dia akan menanggung konsekuensi jahat dari pelecehannya.\" dan setidaknya di atas mata kaki; karena mengikutinya adalah kesombongan, dan Allah tidak menyukai kesombongan. Dan jika seorang pria menghubungkan Anda dengan hal-hal buruk yang dia tahu Anda miliki, jangan menghubungkannya dengan hal-hal buruk yang Anda tahu dia miliki karena dia akan menanggung konsekuensi jahat dari pelecehannya.\" [Abu Dawud dan At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Abu Juraiy Jabir bin Sulaim (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Juraiy Jabir bin Sulaim r.a. melaporkan:","language":"bahasa"}]},{"index":"796","hadith_id":"riyadussalihin","text":[{"text":"وعن أبى هريرة رضى الله عنه قال‏:‏ بينما رجل يصلى مسبل إزاره، قال له رسول الله صلى الله عليه وسلم‏:‏ ‏\"‏اذهب فتوضأ‏\"‏ فذهب فتوضأ، ثم جاء فقال ‏:‏‏\"‏ اذهب فتوضأ‏\"‏ فقال رجل يا رسول الله ما لك أمرته أن يتوضأ ثم سكت عنه‏؟‏ قال‏:‏ ‏\"‏إنه كان يصلى وهو مسبل إزاره، وإن الله لا يقبل صلاة رجل مسبل‏\"‏‏.‏((رواه أبو داود))","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said to a man who was performing Salah while his lower garment was trailing, \"Go and perform your Wudu\u0027 again.\" The man went and came back having performed it. The Messenger of Allah (ﷺ) said (again), \"Go and perform your Wudu\u0027.\" Someone present said to the Messenger of Allah (ﷺ): \"O Messenger of Allah! You ask him to perform his Wudu\u0027 and then you kept silent (without saying the reason for it).\" He (ﷺ) said, \"He performed Salah while his lower garment was below his ankles. Allah does not accept the Salah of a man who trails his lower garment.\" [Abu Dawud].","language":"english"},{"text":"Rasulullah (ﷺ) berkata kepada seorang pria yang sedang melakukan Shalat sementara pakaian bawahnya tertinggal, \"Pergilah dan lakukan Wudumu lagi.\" Pria itu pergi dan kembali setelah melakukannya. Rasulullah (ﷺ) berkata (sekali lagi), \"Pergi dan lakukan wudhumu.\" Seseorang yang hadir berkata kepada Rasulullah (ﷺ): \"Ya Rasulullah! Anda memintanya untuk berwudhu\u0027 dan kemudian Anda diam (tanpa menyebutkan alasannya).\" Dia (ﷺ) berkata, \"Dia melakukan Sholat saat pakaian bawahnya berada di bawah mata kaki. Allah tidak menerima Sholat seorang pria yang membuntuti pakaian bawahnya.\" [Abu Daud] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"797","hadith_id":"riyadussalihin","text":[{"text":"وعن قيس بن بشر التغلبى قال‏:‏ أخبرني أبى - وكان جليساً لأبى الدرداء-قال‏:‏ كان بدمشق رجل من أصحاب النبي صلى الله عليه وسلم يقال له سهل بن الحنظلية، وكان رجلاً متوحداً قلما يجالس الناس، إنما هو في صلاة ، فإذا فرغ فإنما هو تسبيح وتكبير حتى يأتى أهله، فمر بنا ونحن عند أبى الدرداء فقال أبو الدرداء‏:‏ كلمةً تنفعنا ولا تضرك‏.‏ قال‏:‏ بعث رسول الله صلى الله عليه وسلم سرية فقدمت ، فجاء رجل منهم فجلس في المجلس الذي يجلس فيه رسول الله صلى الله عليه وسلم ، فقال لرجل إلى جنبه‏:‏ لو رأيتنا حين التقينا نحن والعدو،فحمل فلان وطعن، فقال‏:‏ خذها منى،وأنا الغلام الغفارى، كيف ترى في قوله‏؟‏ قال‏:‏ ما أراه إلا قد بطل أجره‏.‏ فسمع بذلك آخر فقال‏:‏ ما أرى بذلك بأساً ، فتنازعا حتى سمع رسول الله صلى الله عليه وسلم فقال‏:‏ ‏\"‏سبحان الله‏؟‏لا بأس أن يؤجر ويحمد‏\"‏ فرأيت أبا الدرداء سر بذلك، وجعل يرفع رأسه إليه ويقول‏:‏ أنت سمعت ذلك من رسول الله صلى الله عليه وسلم ‍‍‍‍‍‍‏؟‏ فيقول‏:‏ نعم‏.‏ فما زال يعيد عليه حتى إني لأقول ليبركن على ركبتيه‏.‏ قال‏:‏ فمر بنا يوماً آخر، فقال له الدرداء‏:‏ كلمة تنفعنا ولا تضرك، قال‏:‏ قال لنا رسول الله صلى الله عليه وسلم‏:‏ ‏\"‏المنفق على الخير كالباسط يده بالصدقة ولا يقبضها‏\"‏‏.‏ثم مر بنا يوماً آخر، فقال له أبو الدرداء‏:‏ كلمة تنفعنا ولا تضرك، قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏:‏‏\"‏نعم الرجل خريم الأسدى ‍‏!‏ لولا طول جمته وإسبال إزاره ‏!‏‏:‏ فبلغ خريما، فجعل، فأخذ شفرة فقطع بها جمته إلى أذنيه ، ورفع إزاره إلى أنصاف ساقية‏.‏ ثم مر بنا يوماً آخر فقال له أبو الدرداء‏:‏ كلمةً تنفعنا ولا تضرك، قال‏:‏ سمعت رسول الله صلى الله عليه وسلم يقول‏:‏ ‏\"‏إنكم قادمون على إخوانكم، فأصلحوا رحالكم، وأصلحوا لباسكم حتى تكونوا كأنكم شامة في الناس، فإن الله لا يحب الفحش ولا التفحش‏\"‏‏.‏((رواه أبو داود))","language":"arabic"},{"text":"There was a man in Damascus who was a Companion of the Messenger of Allah (ﷺ). He was called Ibn Al-Hanzaliyyah. He was a lonesome person and would rarely spend some time in the company of people. He would spend most of his time performing Salah and when he finished, he would engage himself in Tasbih (Subhan-Allah) and Takbir (Allahu Akbar), until he would go home. He passed by us one day when we were sitting with Abud-Darda\u0027 (May Allah be pleased with him). The latter said to him: \"Tell us something which will benefit for us and will not harm you.\" He said: \"The Messenger of Allah (ﷺ) sent a detachment. When they returned, one of them came to the assemblage in which the Messenger of Allah (ﷺ) was present and said to his neighbor during the conversation: \u0027I wish you had seen us when we encountered the enemy. So-and-so (a believer) took up his spear, struck and said: Take this from me and I am the Ghifari boy. Now what do you think of this?\u0027 The neighbor said: \u0027I think that he lost his reward because of boasting.\u0027 He said: \u0027I see no harm in it.\u0027 They began to exchange arguments till the Messenger of Allah (ﷺ) heard them and said, \u0027Subhan-Allah (Allah is free from every imperfection). He would be rewarded (in the Hereafter) and praised (in this world)\u0027. I noticed that Abud-Darda\u0027 (May Allah be pleased with him) felt a great pleasure at this remark and, raising his head began to repeat: \"Have you heard the Messenger of Allah (ﷺ) say this!\" Ibn Al-Hanzaliyyah (May Allah be pleased with him) continued responding until I asked Abud-Darda\u0027 (May Allah be pleased with him) not to annoy him. Ibn Al-Hanzaliyyah (May Allah be pleased with him) happened to pass by us another day and Abud-Darda\u0027 said to him: \"Tell us something which will benefit us and will not harm you.\" He said: \"The Messenger of Allah (ﷺ) told us, \u0027He who spends to purchase a horse (for Jihad) is like one who extends his hand for spending out of charity without withholding it.\"\u0027 He passed by us another day and Abud-Darda\u0027 (May Allah be pleased with him) said to him: \"Tell us something which might benefit us, and will not harm you.\" He said: \"The Messenger of Allah (ﷺ) once said, \u0027Khuraim Al-Usaidi is an excellent man were it not for his long hair and his lower garment which is hanging down.\u0027 When Khuraim heard about what the Prophet had said about him, he trimmed his long hair up to his ears with a knife and raised his lower garment half way to his shanks.\" On another occasion he passed by us and Abud-Darda\u0027 (May Allah be pleased with him) said to him: \"Tell us something that will benefit us and will not harm you.\" He said that he heard the Messenger of Allah (ﷺ) say, while coming back from an expedition: \"You are returning to your brothers, so set your saddles and clothes in order so that you look tidy and graceful. Allah hates untidiness.\" [Abu Dawud].","language":"english"},{"text":"Ada seorang pria di Damaskus yang merupakan sahabat Rasulullah (ﷺ). Dia disebut Ibn Al-Hanzaliyyah. Dia adalah orang yang kesepian dan jarang menghabiskan waktu bersama orang-orang. Dia akan menghabiskan sebagian besar waktunya untuk melakukan Shalat dan ketika dia selesai, dia akan terlibat dalam Tasbih (Subhan-Allah) dan Takbir (Allahu Akbar), sampai dia pulang. Dia melewati kami pada suatu hari ketika kami sedang duduk dengan Abud-Darda\u0027 (Semoga Allah meridhoi dia). Yang terakhir berkata kepadanya: \"Beri tahu kami sesuatu yang bermanfaat bagi kami dan tidak akan merugikan Anda.\" Dia berkata: \"Rasulullah (ﷺ) mengirim detasemen. Ketika mereka kembali, salah satu dari mereka datang ke majelis di mana Rasulullah (ﷺ) hadir dan berkata kepada tetangganya selama percakapan: \u0027Saya berharap Anda telah melihat kami ketika kami menghadapi musuh. Fulan (seorang mukmin) mengambil tombaknya, memukul dan berkata: Ambil ini dari saya dan saya adalah anak Ghifari. Sekarang apa pendapat Anda tentang ini?\u0027 Tetangganya berkata: \u0027Saya pikir dia kehilangan upahnya karena menyombongkan diri.\u0027 Dia berkata: \u0027Saya tidak melihat ada salahnya di dalamnya.\u0027 Mereka mulai bertukar argumen sampai Rasulullah (ﷺ) mendengar mereka dan berkata, \u0027Subhanallah (Allah bebas dari segala ketidaksempurnaan). Dia akan diberi pahala (di akhirat) dan dipuji (di dunia ini)\u0027. Saya perhatikan bahwa Abud-Darda\u0027 (semoga Allah meridhoinya) merasa sangat senang dengan ucapan ini dan, sambil mengangkat kepalanya, dia mulai mengulangi: \"Pernahkah Anda mendengar Rasulullah (ﷺ) mengatakan ini!\" Ibn Al-Hanzaliyyah (ra dengan dia) terus menanggapi sampai saya meminta Abud-Darda\u0027 (ra dengan dia) untuk tidak mengganggunya. memukul dan berkata: Ambil ini dari saya dan saya adalah anak Ghifari. Sekarang apa pendapat Anda tentang ini?\u0027 Tetangganya berkata: \u0027Saya pikir dia kehilangan upahnya karena menyombongkan diri.\u0027 Dia berkata: \u0027Saya tidak melihat ada salahnya di dalamnya.\u0027 Mereka mulai bertukar argumen sampai Rasulullah (ﷺ) mendengar mereka dan berkata, \u0027Subhanallah (Allah bebas dari segala ketidaksempurnaan). Dia akan diberi pahala (di akhirat) dan dipuji (di dunia ini)\u0027. Saya perhatikan bahwa Abud-Darda\u0027 (semoga Allah meridhoinya) merasa sangat senang dengan ucapan ini dan, sambil mengangkat kepalanya, dia mulai mengulangi: \"Pernahkah Anda mendengar Rasulullah (ﷺ) mengatakan ini!\" Ibn Al-Hanzaliyyah (ra dengan dia) terus menanggapi sampai saya meminta Abud-Darda\u0027 (ra dengan dia) untuk tidak mengganggunya. memukul dan berkata: Ambil ini dari saya dan saya adalah anak Ghifari. Sekarang apa pendapat Anda tentang ini?\u0027 Tetangganya berkata: \u0027Saya pikir dia kehilangan upahnya karena menyombongkan diri.\u0027 Dia berkata: \u0027Saya tidak melihat ada salahnya di dalamnya.\u0027 Mereka mulai bertukar argumen sampai Rasulullah (ﷺ) mendengar mereka dan berkata, \u0027Subhanallah (Allah bebas dari segala ketidaksempurnaan). Dia akan diberi pahala (di akhirat) dan dipuji (di dunia ini)\u0027. Saya perhatikan bahwa Abud-Darda\u0027 (semoga Allah meridhoinya) merasa sangat senang dengan ucapan ini dan, sambil mengangkat kepalanya, dia mulai mengulangi: \"Pernahkah Anda mendengar Rasulullah (ﷺ) mengatakan ini!\" Ibn Al-Hanzaliyyah (ra dengan dia) terus menanggapi sampai saya meminta Abud-Darda\u0027 (ra dengan dia) untuk tidak mengganggunya. Ambil ini dari saya dan saya adalah anak Ghifari. Sekarang apa pendapat Anda tentang ini?\u0027 Tetangganya berkata: \u0027Saya pikir dia kehilangan upahnya karena menyombongkan diri.\u0027 Dia berkata: \u0027Saya tidak melihat ada salahnya di dalamnya.\u0027 Mereka mulai bertukar argumen sampai Rasulullah (ﷺ) mendengar mereka dan berkata, \u0027Subhanallah (Allah bebas dari segala ketidaksempurnaan). Dia akan diberi pahala (di akhirat) dan dipuji (di dunia ini)\u0027. Saya perhatikan bahwa Abud-Darda\u0027 (semoga Allah meridhoinya) merasa sangat senang dengan ucapan ini dan, sambil mengangkat kepalanya, dia mulai mengulangi: \"Pernahkah Anda mendengar Rasulullah (ﷺ) mengatakan ini!\" Ibn Al-Hanzaliyyah (ra dengan dia) terus menanggapi sampai saya meminta Abud-Darda\u0027 (ra dengan dia) untuk tidak mengganggunya. Ambil ini dari saya dan saya adalah anak Ghifari. Sekarang apa pendapat Anda tentang ini?\u0027 Tetangganya berkata: \u0027Saya pikir dia kehilangan upahnya karena menyombongkan diri.\u0027 Dia berkata: \u0027Saya tidak melihat ada salahnya di dalamnya.\u0027 Mereka mulai bertukar argumen sampai Rasulullah (ﷺ) mendengar mereka dan berkata, \u0027Subhanallah (Allah bebas dari segala ketidaksempurnaan). Dia akan diberi pahala (di akhirat) dan dipuji (di dunia ini)\u0027. Saya perhatikan bahwa Abud-Darda\u0027 (semoga Allah meridhoinya) merasa sangat senang dengan ucapan ini dan, sambil mengangkat kepalanya, dia mulai mengulangi: \"Pernahkah Anda mendengar Rasulullah (ﷺ) mengatakan ini!\" Ibn Al-Hanzaliyyah (ra dengan dia) terus menanggapi sampai saya meminta Abud-Darda\u0027 (ra dengan dia) untuk tidak mengganggunya. Saya pikir dia kehilangan upahnya karena membual.\u0027 Dia berkata: \u0027Saya tidak melihat ada salahnya di dalamnya.\u0027 Mereka mulai bertukar argumen sampai Rasulullah (ﷺ) mendengar mereka dan berkata, \u0027Subhanallah (Allah bebas dari segala ketidaksempurnaan). Dia akan diberi pahala (di akhirat) dan dipuji (di dunia ini)\u0027. Saya perhatikan bahwa Abud-Darda\u0027 (semoga Allah meridhoinya) merasa sangat senang dengan ucapan ini dan, sambil mengangkat kepalanya, dia mulai mengulangi: \"Pernahkah Anda mendengar Rasulullah (ﷺ) mengatakan ini!\" Ibn Al-Hanzaliyyah (ra dengan dia) terus menanggapi sampai saya meminta Abud-Darda\u0027 (ra dengan dia) untuk tidak mengganggunya. Saya pikir dia kehilangan upahnya karena membual.\u0027 Dia berkata: \u0027Saya tidak melihat ada salahnya di dalamnya.\u0027 Mereka mulai bertukar argumen sampai Rasulullah (ﷺ) mendengar mereka dan berkata, \u0027Subhanallah (Allah bebas dari segala ketidaksempurnaan). Dia akan diberi pahala (di akhirat) dan dipuji (di dunia ini)\u0027. Saya perhatikan bahwa Abud-Darda\u0027 (semoga Allah meridhoinya) merasa sangat senang dengan ucapan ini dan, sambil mengangkat kepalanya, dia mulai mengulangi: \"Pernahkah Anda mendengar Rasulullah (ﷺ) mengatakan ini!\" Ibn Al-Hanzaliyyah (ra dengan dia) terus menanggapi sampai saya meminta Abud-Darda\u0027 (ra dengan dia) untuk tidak mengganggunya. \u0027Subhan-Allah (Allah bebas dari segala ketidaksempurnaan). Dia akan diberi pahala (di akhirat) dan dipuji (di dunia ini)\u0027. Saya perhatikan bahwa Abud-Darda\u0027 (semoga Allah meridhoinya) merasa sangat senang dengan ucapan ini dan, sambil mengangkat kepalanya, dia mulai mengulangi: \"Pernahkah Anda mendengar Rasulullah (ﷺ) mengatakan ini!\" Ibn Al-Hanzaliyyah (ra dengan dia) terus menanggapi sampai saya meminta Abud-Darda\u0027 (ra dengan dia) untuk tidak mengganggunya. \u0027Subhan-Allah (Allah bebas dari segala ketidaksempurnaan). Dia akan diberi pahala (di akhirat) dan dipuji (di dunia ini)\u0027. Saya perhatikan bahwa Abud-Darda\u0027 (semoga Allah meridhoinya) merasa sangat senang dengan ucapan ini dan, sambil mengangkat kepalanya, dia mulai mengulangi: \"Pernahkah Anda mendengar Rasulullah (ﷺ) mengatakan ini!\" Ibn Al-Hanzaliyyah (ra dengan dia) terus menanggapi sampai saya meminta Abud-Darda\u0027 (ra dengan dia) untuk tidak mengganggunya. Ibn Al-Hanzaliyyah (Semoga Allah senang dengan dia) kebetulan melewati kami di hari lain dan Abud-Darda\u0027 berkata kepadanya: \"Beri tahu kami sesuatu yang akan bermanfaat bagi kami dan tidak akan merugikan Anda.\" Dia berkata: \"Rasulullah (ﷺ) mengatakan kepada kita, \u0027Orang yang menghabiskan untuk membeli kuda (untuk Jihad) adalah seperti orang yang mengulurkan tangannya untuk menafkahkan sedekah tanpa menahannya.\"\u0027 Dia melewati kami hari lain dan Abud-Darda\u0027 (Semoga Allah senang dengan dia) berkata kepadanya: \"Beri tahu kami sesuatu yang mungkin bermanfaat bagi kami, dan tidak akan membahayakan Anda.\" Dia berkata: \"Rasulullah (ﷺ) pernah berkata, \u0027Khuraim Al-Usaidi adalah pria yang baik jika bukan karena rambutnya yang panjang dan pakaian bawahnya yang menjuntai ke bawah.\u0027 Ketika Khuraim mendengar tentang apa yang dikatakan Nabi tentang dia, dia memotong rambutnya yang panjang hingga ke telinganya dengan pisau dan mengangkat pakaian bawahnya setengah ke betisnya.\" Pada kesempatan lain dia melewati kami dan Abud-Darda\u0027 (semoga Allah meridhoinya) berkata kepadanya: \"Beri tahu kami sesuatu yang bermanfaat bagi kami dan tidak akan merugikan Anda.\" Dia berkata bahwa dia mendengar Rasulullah (ﷺ) berkata, saat kembali dari ekspedisi: \"Kamu kembali ke saudara-saudaramu, jadi atur pelana dan pakaianmu agar terlihat rapi dan anggun. Allah membenci ketidakrapian.\" [Abu Daud] .","language":"bahasa"}],"narrated":[{"text":"Qais bin Bishr At-Taghlibi reported that his father, who attended the company of \u0027Abud-Darda\u0027 (May Allah be pleased with him) told him:","language":"english"},{"text":"Qais bin Bishr At-Taghlibi melaporkan bahwa ayahnya, yang menghadiri perusahaan \u0027Abud-Darda\u0027 (Semoga Allah senang dengan dia) mengatakan kepadanya:","language":"bahasa"}]},{"index":"798","hadith_id":"riyadussalihin","text":[{"text":"وعن أبى سعيد الخدرى رضى الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏ \"‏إزارة المسلم إلى نصف الساق، ولا حرج -أو لا جناح- فيما بينه وبين الكعبين، فما كان أسفل من الكعبين فهو في النار، ومن جر إزاره بطرا لم ينظر الله إليه‏\"‏‏.((رواه أبو داود))","language":"arabic"},{"text":"Messenger of Allah (ﷺ) said, \"The lower garment of a believer should be half way below the knees. He is guilty of no sin if they are up to the ankles. That which is below the ankles is in the Fire (of Hell). Allah will not look at one who allows his lower garment to trail out of vanity. [Abu Dawud].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Baju seorang mukmin harus setengah di bawah lutut. Dia tidak bersalah jika mereka sampai mata kaki. Apa yang di bawah mata kaki adalah di Neraka (Neraka). ). Allah tidak akan melihat orang yang membiarkan pakaian bawahnya terlepas dari kesombongan. [Abu Dawud] .","language":"bahasa"}],"narrated":[{"text":"Abu Sa\u0027id Al-Khudri (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Sa\u0027id Al-Khudri r.a. melaporkan:","language":"bahasa"}]},{"index":"799","hadith_id":"riyadussalihin","text":[{"text":"وعن ابن عمر رضى الله عنهما قال‏:‏ مررت على رسول الله صلى الله عليه وسلم وفى إزاري استرخاء، فقال‏:‏ ‏\"‏يا عبد الله، ارفع إزارك‏\"‏ فرفعت ثم قال‏:‏ ‏\"‏زد‏\"‏، فزدت، فما زلت أتحراها بعد‏.‏ فقال بعض القوم‏:‏ إلى أين ‏؟‏ فقال‏:‏ إلى أنصاف الساقين‏\"‏‏.‏‏((رواه مسلم))‏","language":"arabic"},{"text":"My lower garment was trailing as I passed by the Messenger of Allah (ﷺ) so he said, \"Raise your lower garment, Abdullah.\" I lifted it up and he told me to raise it higher. I complied with his orders and as I was still trying to find the best place (for it), one of the people asked where it should reach and he (ﷺ) replied, \"Half way down the knees.\" [Muslim].","language":"english"},{"text":"Pakaian bawahku tertinggal saat aku melewati Rasulullah (ﷺ) lalu dia berkata, \"Angkat pakaianmu, Abdullah.\" Saya mengangkatnya dan dia menyuruh saya untuk mengangkatnya lebih tinggi. Saya memenuhi perintahnya dan karena saya masih berusaha untuk menemukan tempat terbaik (untuk itu), salah satu orang bertanya di mana harus mencapai dan dia (ﷺ) menjawab, \"Setengah jalan ke bawah.\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Ibn \u0027Umar (May Allah be pleased with them) reported:","language":"english"},{"text":"Ibnu \u0027Umar radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"800","hadith_id":"riyadussalihin","text":[{"text":"وعنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ من جر ثوبه خيلاء لم ينظر الله إليه يوم القيامة‏\"‏ فقالت أم سلمة‏:‏ فكيف تصنع النساء بذيولهن، قال‏:‏ ‏\"‏يرخين شبراً‏\"‏ قالت‏:‏ ِإذاً تنكشف أقدامهن‏.‏ قال‏:‏ ‏\"‏فيرخينه ذراعاً لا يزدن‏\"‏‏.((رواه أبو داود والترمذي))","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"On the Day of Resurrection, Allah will not look at the one who trails his lower garment out of arrogance.\" Umm Salamah (May Allah be pleased with her) asked: \"What should women do with the hem of their clothes?\" He (ﷺ) said, \"They might lower them a hand\u0027s span.\" She said: \"But their feet would still remain exposed.\" He said, \"Let them lower them equal to arm\u0027s length but not more than that.\" [Abu Dawud and At-Tirmidhi].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, “Pada hari kiamat, Allah tidak akan melihat orang yang menjulurkan pakaiannya karena kesombongan.” Ummu Salamah (ra dengan dia) bertanya: \"Apa yang harus dilakukan wanita dengan ujung pakaian mereka?\" Dia (ﷺ) berkata, \"Mereka mungkin menurunkan mereka sejengkal tangan.\" Dia berkata: \"Tapi kaki mereka akan tetap terbuka.\" Dia berkata, \"Biarkan mereka menurunkannya sama dengan panjang lengan tetapi tidak lebih dari itu.\" [Abu Dawud dan At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Ibn \u0027Umar (May Allah be pleased with them) reported:","language":"english"},{"text":"Ibnu \u0027Umar radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"801","hadith_id":"riyadussalihin","text":[{"text":"وعن معاذ بن أنس رضى الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏ \"‏ من ترك اللباس تواضعاً لله، وهو يقدر عليه، دعاه الله يوم القيامة على رؤوس الخلائق حتى يخيره من أي حلل الإيمان شاء يلبسها‏\"‏.((رواه الترمذي)) ‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"Whoever gives up wearing elegant and expensive garments out of humbleness, when he can do so, Allah will call him on the Day of Resurrection, before all of creation, He will give him the choice to wear whichever garment of Iman he would like to wear.\" [At-Tirmidhi].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, “Barangsiapa yang meninggalkan pakaian yang indah dan mahal karena kerendahan hati, jika dia mampu, Allah akan memanggilnya pada hari kiamat, sebelum semua ciptaan, Dia akan memberinya pilihan untuk pakailah pakaian Iman yang ingin dia pakai.” [At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Mu`adh bin Anas (May Allah be pleased with him) reported:","language":"english"},{"text":"Mu\u0027adz bin Anas radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"802","hadith_id":"riyadussalihin","text":[{"text":"عن عمرو بن شعيب عن أبيه عن جده رضى الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏ \"‏إن الله يحب أن يرى أثر نعمته على عبده‏\"‏.‏((رواه الترمذي))","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"Allah loves to see the sign of His Bounties on his slave.\" [At-Tirmidhi].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Allah senang melihat tanda karunia-Nya pada hamba-Nya.\" [At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"`Amr bin Shu`aib on the authority of his father and grandfather reported:","language":"english"},{"text":"`Amr bin Shu`aib atas otoritas ayah dan kakeknya melaporkan:","language":"bahasa"}]},{"index":"803","hadith_id":"riyadussalihin","text":[{"text":"عن عمر بن الخطاب رضى الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏ \"‏ لا تلبسوا الحرير؛ فإن من لبسه في الدنيا لم يلبسه في الآخرة‏\"‏ ‏.‏((متفق عليه))","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"Do not wear silk (clothes). For whoever wears (them) in this life will be deprived of them in the Hereafter.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Jangan memakai sutra (pakaian). Karena siapa pun yang memakainya di dunia ini akan kehilangannya di akhirat.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"`Umar bin Al-Khattab (May Allah be pleased with him) reported:","language":"english"},{"text":"Umar bin Al-Khattab r.a. menceritakan:","language":"bahasa"}]},{"index":"804","hadith_id":"riyadussalihin","text":[{"text":"وعنه قال‏:‏ سمعت رسول الله صلى الله عليه وسلم يقول‏:‏ ‏\"‏إنما يلبس الحرير من لا خلاق له‏\"‏.((متفق عليه)) ‏ وفى رواية للبخاري‏:‏ ‏\"‏من لا خلاق له في الآخرة‏\"‏‏","language":"arabic"},{"text":"I heard the Messenger of Allah (ﷺ) saying, \"Silk (clothes) are worn only by he who has no share in the Hereafter.\" [Al-Bukhari and Muslim]. Another narration is: \"Who has no share in the Hereafter.\"","language":"english"},{"text":"Saya mendengar Rasulullah () berkata, \"Sutra (pakaian) hanya dikenakan oleh orang yang tidak mendapat bagian di akhirat.\" [Al-Bukhari dan Muslim] . Narasi lain adalah: \"Siapa yang tidak memiliki bagian di akhirat.\"","language":"bahasa"}],"narrated":[{"text":"\u0027Umar bin Al-Khattab (May Allah be pleased with him) reported:","language":"english"},{"text":"\u0027Umar bin Al-Khattab (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"805","hadith_id":"riyadussalihin","text":[{"text":"وعن أنس رضى الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏ \"‏من لبس الحرير في الدنيا لم يلبسه في الآخرة‏\"‏.((متفق عليه)) ‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"He who wears silk clothes in this life shall not wear them in the Hereafter.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, “Barangsiapa yang memakai pakaian sutra di dunia, tidak akan dipakai di akhirat.” [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Anas (May Allah be pleased with him) reported:","language":"english"},{"text":"Anas (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"806","hadith_id":"riyadussalihin","text":[{"text":"وعن على رضى الله عنه قال‏:‏ رأيت رسول الله صلى الله عليه وسلم أخذ حريراً، فجعله في يمينه، وذهباً فجعله في شماله، ثم قال‏:‏ ‏ \"‏إن هذين حرام على ذكور أمتي‏\"‏‏.‏((رواه أبو داود))","language":"arabic"},{"text":"I saw the Messenger of Allah (ﷺ) holding a piece of gold in his left hand and a silk (cloth) in his right hand. Then he said, \"These two are forbidden for the males of my Ummah.\" [Abu Dawud].","language":"english"},{"text":"Aku melihat Rasulullah (ﷺ) memegang sekeping emas di tangan kirinya dan sehelai sutra (kain) di tangan kanannya. Kemudian dia berkata, “Dua ini diharamkan bagi laki-laki dari umatku.” [Abu Daud] .","language":"bahasa"}],"narrated":[{"text":"\u0027Ali (May Allah be pleased with him) reported:","language":"english"},{"text":"\u0027Ali (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"807","hadith_id":"riyadussalihin","text":[{"text":"وعن أبى موسى الأشعرى رضى الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏ \"‏حرم لباس الحرير والذهب على ذكور أمتي ،وأحل لإناثهم‏\"‏.‏((رواه الترمذي))","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"The wearing of silk and gold has been made unlawful for males of my Ummah and lawful for the females.\" [At-Tirmidhi].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, “Memakai sutra dan emas telah diharamkan bagi umatku laki-laki dan halal bagi perempuan.” [At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Abu Musa Al-Ash\u0027ari (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Musa Al-Asy\u0027ari r.a. melaporkan:","language":"bahasa"}]},{"index":"808","hadith_id":"riyadussalihin","text":[{"text":"وعن حذيفة رضى الله عنه قال‏:‏ نهانا النبي صلى الله عليه وسلم أن نشرب في آنية الذهب والفضة، وأن نأكل فيها، وعن لبس الحرير والديباج،وأن نجلس عليه‏.‏‏‏((‏رواه البخارى‏)‏‏)‏‏","language":"arabic"},{"text":"The Prophet (ﷺ) prohibited us from eating or drinking from gold or silver utensils and from wearing silk and brocade, or sitting on (anything made from) them. [Al-Bukhari].","language":"english"},{"text":"Nabi (ﷺ) melarang kami makan atau minum dari peralatan emas atau perak dan dari memakai sutra dan brokat, atau duduk di atas (apa pun yang terbuat dari) mereka. [Al-Bukhari] .","language":"bahasa"}],"narrated":[{"text":"Hudhaifah (May Allah be pleased with him) reported:","language":"english"},{"text":"Hudzaifah r.a. melaporkan:","language":"bahasa"}]},{"index":"809","hadith_id":"riyadussalihin","text":[{"text":"عن أنس رضى الله عنه قال‏:‏ رخص رسول الله ، صلى الله عليه وسلم، للزبير وعبد الرحمن بن عوف رضى الله عنهما في لبس الحرير لحكة بهما‏.‏((متفق عليه))","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) permitted Zubair and `Abdur-Rahman bin `Auf (May Allah be pleased with them) to wear silk because they were suffering from an itch. [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) mengizinkan Zubair dan `Abdur-Rahman bin `Auf (ra dengan mereka) untuk memakai sutra karena mereka menderita gatal-gatal. [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Anas (May Allah be pleased with him) reported:","language":"english"},{"text":"Anas (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"810","hadith_id":"riyadussalihin","text":[{"text":"عن معاوية رضى الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏ \"‏لا تركبوا الخز ولا النمار‏\"‏‏.‏ ((رواه أبو داود))","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"Do not ride on saddles made from silk or leopard\u0027s skin.\" [Abu Dawud].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Jangan naik pelana yang terbuat dari sutra atau kulit macan tutul.\" [Abu Daud] .","language":"bahasa"}],"narrated":[{"text":"Mu`awiyah (May Allah be pleased with him) reported:","language":"english"},{"text":"Mu`awiyah (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"811","hadith_id":"riyadussalihin","text":[{"text":"وعن أبى المليح عن أبيه ، رضى الله عنه ، أن رسول الله صلى الله عليه وسلم نهى عن جلود السباع‏.((رواه أبو داود والترمذي والنسائي)) و في رواية للترمذي: نهى عن جلود السباع أن تفترش. ‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) prohibited the use of the skins of wild animals. [Abu Dawud, At-Tirmidhi and An- Nasa\u0027i]. Another narration in At-Tirmidhi is: The Messenger of Allah (ﷺ) forbade the use of the skins of wild animals in making firash (i.e., something to sit on or lie down on, such as cushions, pillows, covers, spreads, saddles, etc.).","language":"english"},{"text":"Rasulullah (ﷺ) melarang penggunaan kulit binatang buas. [Abu Dawud, At-Tirmidzi dan An-Nasa\u0027i] . Riwayat lain dalam At-Tirmidzi adalah: Rasulullah (ﷺ) melarang penggunaan kulit binatang buas dalam pembuatan firash (yaitu, sesuatu untuk diduduki atau dibaringkan, seperti bantal, bantal, selimut, sprei, pelana). , dll.).","language":"bahasa"}],"narrated":[{"text":"Abul-Malih on the authority of his father reported:","language":"english"},{"text":"Abul-Malih atas otoritas ayahnya melaporkan:","language":"bahasa"}]},{"index":"812","hadith_id":"riyadussalihin","text":[{"text":"عن أبى سعيد الخدرى رضى الله عنه قال‏:‏ كان رسول الله صلى الله عليه وسلم إذا استجد ثوباً سماه باسمه -عمامة، أو قميصاً، أو رداء -يقول‏:‏ ‏ \"‏ اللهم لك الحمد أنت كسوتنيه، أسألك خيره وخير ما صنع له، وأعوذ بك من شره وشر ما صنع له‏\"‏ ‏(‏‏(‏رواه أبو داود، والترمذى وقال‏:‏حديث حسن‏)‏‏)‏‏.‏","language":"arabic"},{"text":"When the Messenger of Allah (ﷺ) wore a new garment, he would name it. For instance, a turban, shirt, or cloak and would supplicate: \"Allahumma lakal-hamdu, Anta kasautanihi, as`aluka khairahu wa khaira ma suni`a lahu, wa a`udhu bika min sharrihi wa sharri ma suni`a lahu (O Allah, all the praise is for You that You have given it to me to put on. I ask You its goodness and the goodness of the purpose for which it was made, and I seek Your Protection from its evil and the evil of the purpose for which it was made).\u0027\u0027 [Abu Dawud and At-Tirmidhi].","language":"english"},{"text":"Ketika Rasulullah (ﷺ) mengenakan pakaian baru, dia akan menamainya. Misalnya, sorban, kemeja, atau jubah dan akan berdoa: \"Allahumma lakal-hamdu, Anta kasautanihi, as`aluka khairahu wa khaira ma suni`a lahu, wa a`udhu bika min sharrihi wa sharri ma suni`a lahu ( Ya Allah, segala puji bagi-Mu yang telah Engkau berikan kepadaku untuk memakainya. Aku memohon kepada-Mu kebaikannya dan kebaikan tujuan pembuatannya, dan aku memohon perlindungan-Mu dari keburukannya dan keburukan makhluk-makhluknya. tujuan pembuatannya).\u0027\u0027 [Abu Dawud dan At-Tirmidzi].","language":"bahasa"}],"narrated":[{"text":"Abu Sa`id Al-Khudri (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Sa`id Al-Khudri r.a. melaporkan:","language":"bahasa"}]}]