[{"index":"1376","hadith_id":"riyadussalihin","text":[{"text":"وعن معاوية رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏ \"‏من يرد الله به خيرًا يفقه في الدين‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","language":"arabic"},{"text":"The Messenger of Allah said, \"When Allah wishes good for someone, He bestows upon him the understanding of Deen.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah bersabda, “Jika Allah menginginkan kebaikan bagi seseorang, Dia memberikan kepadanya pemahaman tentang Din.” [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Mu\u0027awiyah (May Allah be pleased with him) reported:","language":"english"},{"text":"Mu\u0027awiyah (ra dengan dia) melaporkan:","language":"bahasa"}]},{"index":"1377","hadith_id":"riyadussalihin","text":[{"text":"وعن ابن مسعود رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏ \"‏لا حسد إلا في اثنتين‏:‏ رجل آتاه الله مالا فسلطه على هلكته في الحق، ورجل آتاه الله الحكمة فهو يقضي بها ويعلمها‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","language":"arabic"},{"text":"The Prophet (ﷺ) said, \"Envy is permitted only in two cases: A man whom Allah gives wealth, and he disposes of it rightfully, and a man to whom Allah gives knowledge which he applies and teaches it.\" [Al- Bukhari and Muslim].","language":"english"},{"text":"Nabi (ﷺ) berkata, \"Iri hanya diperbolehkan dalam dua hal: seorang pria yang Allah berikan kekayaan, dan dia mengaturnya dengan benar, dan seorang pria yang kepadanya Allah memberikan pengetahuan yang dia terapkan dan ajarkan.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Ibn Mas\u0027ud (May Allah be pleased with him) reported:","language":"english"},{"text":"Ibnu Mas\u0027ud radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"1378","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي موسى رضي الله عنه قال‏:‏ قال النبي صلى الله عليه وسلم ‏:‏ ‏ \"‏مثل ما بعثني الله به من الهدى والعلم كمثل غيث أصاب أرضًا، فكانت منها طائفة طيبة قبلت الماء فأنبتت الكلأ، والعشب الكثير وكان منها أجادب أمسكت الماء، فنفع الله بها الناس، فشربوا منها وسقوا وزرعوا، وأصاب طائفة منها أخرى إنما هي قيعان لا تمسك ماء ولا تنبت كلأ فذلك مثل من فقه في دين الله ونفعه ما بعثني الله به وعلم، ومثل من لم يرفع بذلك رأسًا ولم يقبل هدى الله الذي أرسلت به‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"The guidance and knowledge with which Allah has sent me are like abundant rain which fell on a land. A fertile part of it absorbed the water and brought forth profuse herbage and pasture; and solid ground patches which retained the water by which Allah has benefited people, who drank from it, irrigated their crops and sowed their seeds; and another sandy plane which could neither retain the water nor produce herbage. Such is the similitude of the person who becomes well-versed in the religion of Allah and receives benefit from the Message entrusted to me by Allah, so he himself has learned and taught it to others; such is also the similitude of the person who has stubbornly and ignorantly rejected Allah\u0027s Guidance with which I have been sent.\" [Al-Bukhari and Muslim]","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, “Petunjuk dan ilmu yang diturunkan Allah kepadaku adalah seperti hujan lebat yang turun di atas tanah. Sebagiannya yang subur menyerap air dan menghasilkan rerumputan dan padang rumput yang melimpah; dan bidang-bidang tanah yang kokoh. yang menahan air yang olehnya Allah memberi manfaat kepada manusia, yang meminumnya, mengairi tanaman mereka dan menabur benih mereka; dan dataran berpasir lain yang tidak dapat menampung air dan tidak menghasilkan rumput. dalam agama Allah dan mendapat manfaat dari amanat yang dititipkan Allah kepadaku, maka dia sendiri yang mempelajari dan mengajarkannya kepada orang lain; demikian pula perumpamaan orang yang dengan keras kepala dan bodohnya menolak petunjuk Allah yang dengannya aku diutus. .\" [Al-Bukhari dan Muslim]","language":"bahasa"}],"narrated":[{"text":"Abu Musa (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Musa (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"1379","hadith_id":"riyadussalihin","text":[{"text":"وعن سهل بن سعد رضي الله عنه أن النبي صلى الله عليه وسلم قال لعلي رضي الله عنه ‏:‏ ‏ \"‏فوالله لأن يهدي الله بك رجلا واحدا خير من حمر النعم‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","language":"arabic"},{"text":"The Prophet (ﷺ) said to \u0027Ali (May Allah be pleased with him), \"By Allah, if a single person is guided by Allah through you, it will be better for you than a whole lot of red camels.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Nabi (ﷺ) berkata kepada \u0027Ali (ra dengan dia), \"Demi Allah, jika satu orang dibimbing oleh Allah melalui Anda, itu lebih baik bagi Anda daripada unta merah yang banyak.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Sahl bin Sa\u0027d (May Allah be pleased with him) reported:","language":"english"},{"text":"Sahl bin Sa\u0027d radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"1380","hadith_id":"riyadussalihin","text":[{"text":"وعن عبد الله بن عمرو بن العاص رضي الله عنهما أن النبي صلى الله عليه وسلم قال‏:‏ ‏ \"‏بلغوا عني ولو آية وحدثوا عن بني إسرائيل ولا حرج، ومن كذب علي متعمدًا فليتبوأ مقعده من النار‏\"‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Prophet (ﷺ) said, \"Convey from me even an Ayah of the Qur\u0027an; relate traditions from Banu Israel, and there is no restriction on that; but he who deliberately forges a lie against me let him have his abode in the Hell.\" [Al- Bukhari].","language":"english"},{"text":"Nabi (ﷺ) berkata, \"Sampaikan dari saya bahkan satu Ayah dari Al-Qur\u0027an; ceritakan hadis dari Bani Israel, dan tidak ada batasan untuk itu; tetapi dia yang dengan sengaja membuat kebohongan terhadapku biarkan dia memiliki tempat tinggalnya di Neraka.\" [Al-Bukhari] .","language":"bahasa"}],"narrated":[{"text":"\u0027Abdullah bin \u0027Amr bin Al-\u0027As (May Allah be pleased with them) reported:","language":"english"},{"text":"\u0027Abdullah bin \u0027Amr bin Al-\u0027As (semoga Allah meridhoi mereka) melaporkan:","language":"bahasa"}]},{"index":"1381","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏ \"‏ومن سلك طريقًا يلتمس فيه علما سهل الله له به طريقًا إلى الجنة‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"Allah makes the way to Jannah easy for him who treads the path in search of knowledge.\" [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, “Allah memudahkan jalan menuju Jannah bagi orang yang menempuh jalan untuk mencari ilmu.” [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"1382","hadith_id":"riyadussalihin","text":[{"text":"وعنه أيضًا رضي الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏\"‏من دعا إلى هدى كان له من الأجر مثل أجور من تبعه لا ينقص ذلك من أجورهم شيئًا ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"He who calls others to follow the Right Guidance will have a reward equal to the reward of those who follow him, without their reward being diminished in any respect on that account.\" [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Barang siapa yang mengajak orang lain untuk mengikuti petunjuk yang benar, maka baginya pahala yang sama dengan pahala orang yang mengikutinya, tanpa mengurangi pahala mereka sedikit pun karena itu.\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"1383","hadith_id":"riyadussalihin","text":[{"text":"وعنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏ \"‏إذا مات ابن آدم انقطع عمله إلا من ثلاث‏:‏ صدقة جارية ،أو علم ينتفع به، أو ولد صالح يدعو له‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"When a man dies, his deeds come to an end except for three things: Sadaqah Jariyah (ceaseless charity); a knowledge which is beneficial, or a virtuous descendant who prays for him (for the deceased).\" [Muslim].","language":"english"},{"text":"Rasulullah SAW bersabda, “Jika seseorang meninggal dunia, terputus amalnya kecuali tiga hal: Shodaqah Jariyah, ilmu yang bermanfaat, atau anak shaleh yang mendoakannya. almarhum).\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"1384","hadith_id":"riyadussalihin","text":[{"text":"وعنه قال‏:‏ سمعت رسول الله صلى الله عليه وسلم يقول‏:‏ ‏\"‏الدنيا ملعونة ملعون ما فيها إلا ذكر الله تعالى، وما والاه، وعالمًا أو متعلمًا‏\"‏ ‏(‏‏(‏رواه الترمذي وقال‏:‏ حديث حسن‏.‏ ‏)‏‏)‏‏.‏ (2)","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"The world, with all that it contains, is accursed except for the remembrance of Allah that which pleases Allah; and the religious scholars and seekers of knowledge.\" [At- Tirmidhi].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, “Dunia dengan segala isinya, terkutuk kecuali mengingat Allah apa yang diridhai Allah, dan para ulama dan pencari ilmu.” [At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"1385","hadith_id":"riyadussalihin","text":[{"text":"وعن أنس رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏ \"‏من خرج في طلب العلم، فهو في سبيل الله حتى يرجع‏\"‏ رواه الترمذي وقال‏:‏ حديث حسن‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"He who goes forth in search of knowledge is considered as struggling in the Cause of Allah until he returns.\" [At- Tirmidhi].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, “Barang siapa yang pergi untuk menuntut ilmu, maka ia dianggap berjihad di jalan Allah sampai ia kembali.” [At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Anas (May Allah be pleased with him) reported:","language":"english"},{"text":"Anas (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"1386","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي سعيد الخدري رضي الله عنه عن رسول الله صلى الله عليه وسلم قال‏:‏ ‏ \"‏لن يشبع مؤمن من خير حتى يكون منتهاه الجنة‏\"‏ ‏(‏‏(‏رواه الترمذي وقال حديث حسن‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"A believer never satisfies doing good until he reaches Jannah.\" [At- Tirmidhi].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Seorang mukmin tidak pernah puas berbuat baik sampai ia mencapai Jannah.\" [At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Abu Sa\u0027id Al-Khudri (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Sa\u0027id Al-Khudri r.a. melaporkan:","language":"bahasa"}]},{"index":"1387","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي أمامة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏\"‏فضل العالم على العابد كفضلي على أدناكم‏\"‏ ثم قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏إن الله وملائكته وأهل السماوات والأرض حتى النملة في جحرها وحتى الحوت ليصلون على معلمي الناس الخير‏\"‏ ‏(‏‏(‏رواه الترمذي وقال‏:‏ حديث حسن‏.‏ ‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"The superiority of the learned over the devout worshipper is like my superiority over the most inferior amongst you (in good deeds).\" He went on to say, \"Allah, His angels, the dwellers of the heaven and the earth, and even the ant in its hole and the fish (in water) supplicate in favour of those who teach people knowledge.\" [At-Tirmidhi].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, “Keutamaan orang yang berilmu atas orang yang beribadah adalah seperti keutamaanku atas orang yang paling rendah di antara kalian (dalam perbuatan baik).” Dia melanjutkan dengan mengatakan, \"Allah, para malaikat-Nya, penghuni langit dan bumi, dan bahkan semut di lubangnya dan ikan (di dalam air) berdoa untuk orang-orang yang mengajarkan ilmu pengetahuan.\" [At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Abu Umamah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Umamah r.a. melaporkan:","language":"bahasa"}]},{"index":"1388","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي الدرداء رضي الله عنه قال سمعت رسول الله صلى الله عليه وسلم يقول‏:‏ ‏ \"‏من سلك طريقًا يبتغي فيه علمًا سهل الله له طريقًا إلى الجنة، وإن الملائكة لتضع أجنحتها لطالب العلم رضا بما صنع، وإن العالم ليستغفر له من في السماوات والأرض حتى الحيتان في الماء، وفضل العالم على العابد كفضل القمر على سائر الكواكب، وإن العلماء ورثة الأنبياء وإن الأنبياء لم يورثوا دينارًا ولا درهما وإنما ورثوا العلم‏.‏ فمن أخذه أخذ بحظ وافر‏\"‏ ‏(‏‏(‏رواه أبو داود والترمذي‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"He who follows a path in quest of knowledge, Allah will make the path of Jannah easy to him. The angels lower their wings over the seeker of knowledge, being pleased with what he does. The inhabitants of the heavens and the earth and even the fish in the depth of the oceans seek forgiveness for him. The superiority of the learned man over the devout worshipper is like that of the full moon to the rest of the stars (i.e., in brightness). The learned are the heirs of the Prophets who bequeath neither dinar nor dirham but only that of knowledge; and he who acquires it, has in fact acquired an abundant portion.\" [Abu Dawud and At- Tirmidhi].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Barangsiapa menempuh suatu jalan untuk menuntut ilmu, Allah akan memudahkan jalan Jannah baginya. Para malaikat menurunkan sayapnya di atas para pencari ilmu, karena ridha dengan apa yang dia kerjakan. Penghuni langit dan bumi bahkan ikan-ikan di kedalaman samudera memohon ampun untuknya.Keutamaan orang yang berilmu atas orang-orang yang beribadah adalah seperti bulan purnama dibandingkan bintang-bintang yang lain (yaitu, dalam kecerahan ). Orang-orang yang berilmu adalah ahli waris para Nabi yang tidak mewariskan dinar maupun dirham, melainkan hanya ilmu, dan barang siapa yang memperolehnya, sesungguhnya ia telah memperoleh bagian yang banyak.” [Abu Dawud dan At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Abud-Darda (May Allah be pleased with him) reported:","language":"english"},{"text":"Abud-Darda r.a. melaporkan:","language":"bahasa"}]},{"index":"1389","hadith_id":"riyadussalihin","text":[{"text":"وعن ابن مسعود رضي الله عنه قال‏:‏ سمعت رسول الله صلى الله عليه وسلم يقول‏:‏ ‏ \"‏نضر الله امرءًا سمع منا شيئًا فبلغه كما سمعه فرب مبلغ أوعي من سامع‏\"‏ ‏(‏‏(‏رواه الترمذي وقال‏:‏ حديث حسن صحيح‏)‏‏)‏‏.‏","language":"arabic"},{"text":"I heard the Messenger of Allah (ﷺ) saying, \"May Allah freshen the affairs of a person who hears something from us and communicates it to others exactly as he has heard it (i.e., both the meaning and the words), for it may be that the recipient of knowledge understands it better than the one who has heard it.\" [At-Tirmidhi].","language":"english"},{"text":"Saya mendengar Rasulullah (ﷺ) berkata, \"Semoga Allah menyegarkan urusan seseorang yang mendengar sesuatu dari kami dan menyampaikannya kepada orang lain persis seperti yang dia dengar (yaitu, baik arti dan kata-katanya), karena mungkin semoga si penerima ilmu lebih memahaminya dari pada yang mendengarnya”. [At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Ibn Mas\u0027ud (May Allah be pleased with him) reported:","language":"english"},{"text":"Ibnu Mas\u0027ud radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"1390","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي هريرة رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏ \"‏من سئل عن علم فكتمه ألجم يوم القيامة بلجام من نار‏\"‏ ‏(‏‏(‏رواه أبو داود والترمذي، وقال‏:‏ حديث حسن‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"He who is asked about knowledge (of religion) and conceals it, will be bridled with a bridle of fire on the Day of Resurrection.\" [Abu Dawud and At- Tirmidhi].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, “Barangsiapa ditanya tentang ilmu (agama) dan menyembunyikannya, akan dikekang dengan kekang api pada hari kiamat.” [Abu Dawud dan At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"1391","hadith_id":"riyadussalihin","text":[{"text":"وعنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏ \"‏من تعلم علمًا مما يبتغى به وجه الله عز وجل لا يتعلمه إلا ليصيب به غرضًا من الدنيا لم يجد عرف الجنة يوم القيامة‏\"‏ ‏(‏‏(‏يعني ريحها‏)‏‏)‏، ‏(‏‏(‏رواه أبو داود بإسناد صحيح‏.‏ ‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah(ﷺ) said, \"He who does not acquire knowledge with the sole intention of seeking the Pleasure of Allah but for worldly gain, will not smell the fragrance of Jannah on the Day of Resurrection.\" [Abu Dawud].","language":"english"},{"text":"Rasulullah SAW bersabda, “Barang siapa yang menuntut ilmu bukan semata-mata mencari keridhaan Allah melainkan untuk keuntungan duniawi, maka ia tidak akan mencium harumnya surga di hari kiamat.” [Abu Daud] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"1392","hadith_id":"riyadussalihin","text":[{"text":"وعن عبد الله بن عمرو بن العاص رضي الله عنهما قال‏:‏ سمعت رسول الله صلى الله عليه وسلم يقول‏:‏ ‏\"‏إن الله لا يقبض العلم انتزاعًا ينتزعه من الناس ولكن يقبض العلم بقبض العلماء حتى إذا لم يبقِ عالمًا، اتخذ الناس رءوسًا جهالا، فسئلوا فأفتوا بغير علم، فضلوا وأضلوا‏:‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"I heard the Messenger of Allah (ﷺ) saying: \"Verily, Allah does not take away knowledge by snatching it from the people, but He takes it away by taking away (the lives of) the religious scholars till none of the scholars stays alive. Then the people will take ignorant ones as their leaders, who, when asked to deliver religious verdicts, will issue them without knowledge, the result being that they will go astray and will lead others astray.\" [Al- Bukhari and Muslim].","language":"english"},{"text":"Saya mendengar Rasulullah (ﷺ) bersabda: “Sesungguhnya Allah tidak mencabut ilmu dengan mengambilnya dari manusia, tetapi Dia mencabutnya dengan mencabut (nyawa) para ulama sampai tidak ada seorang pun dari para ulama yang hidup. . Kemudian orang-orang akan mengambil orang-orang bodoh sebagai pemimpin mereka, yang ketika diminta untuk memberikan putusan agama, akan mengeluarkan mereka tanpa pengetahuan, akibatnya mereka akan sesat dan menyesatkan orang lain. [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"\u0027Abdullah bin \u0027Amr bin Al-\u0027As (May Allah be pleased with them) reported:","language":"english"},{"text":"\u0027Abdullah bin \u0027Amr bin Al-\u0027As (semoga Allah meridhoi mereka) melaporkan:","language":"bahasa"}]}]