[{"index":"1465","hadith_id":"riyadussalihin","text":[{"text":"وعن النعمان بن بشير رضي الله عنهما عن النبي صلى الله عليه وسلم قال‏:‏ ‏ \"‏الدعاء هو العبادة‏\"‏‏.‏","language":"arabic"},{"text":"The Prophet (ﷺ) said, \"Du\u0027a (supplication) is worship.\" [Abu Dawud].","language":"english"},{"text":"Nabi (ﷺ) berkata, \"Do\u0027a (permohonan) adalah ibadah.\" [Abu Daud] .","language":"bahasa"}],"narrated":[{"text":"An-Nu\u0027man bin Bashir (May Allah be pleased with them) reported:","language":"english"},{"text":"An-Nu\u0027man bin Bashir radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"1466","hadith_id":"riyadussalihin","text":[{"text":"وعن عائشة، رضي الله عنها، قالت‏:‏ كان رسول الله صلى الله عليه وسلم، يستحب الجوامع من الدعاء، ويدع ما سوى ذلك‏.‏ ‏(‏‏(‏رواه أبو داود بإسناد جيد‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) liked comprehensive supplications or (Al-Jawami\u0027 - i.e., supplications with very few words but comprehensive in meanings), and discarded others. [Abu Dawud].","language":"english"},{"text":"Rasulullah (ﷺ) menyukai doa yang lengkap atau (Al-Jawami\u0027 - yaitu, doa dengan sedikit kata tetapi komprehensif dalam arti), dan membuang yang lain. [Abu Daud] .","language":"bahasa"}],"narrated":[{"text":"\u0027Aishah (May Allah be pleased with her) reported:","language":"english"},{"text":"\u0027Aisyah r.a. melaporkan:","language":"bahasa"}]},{"index":"1467","hadith_id":"riyadussalihin","text":[{"text":"وعن أنس رضي الله عنه، قال‏:‏ كان أكثر دعاء النبي صلى الله عليه وسلم‏:‏ ‏ \"‏اللهم آتنا في الدنيا حسنة، وفي الآخرة حسنة، وقنا عذاب النار‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏ زاد مسلم في روايته قال‏:‏ وكان أنس إذا أراد أن يدعو بدعوة دعا بها، وإذا أراد أن يدعو بدعاء دعا بها فيه‏.‏","language":"arabic"},{"text":"The supplication most often recited by the Prophet (ﷺ) was: \"Allahumma atina fid-dunya hasanatan, wa fil-akhirati hasanatan, wa qina \u0027adhab-annar (O our Rubb! give us in this world that which is good and in the Hereafter that which is good, and save us from the punishment of the Fire).\"\u0027 [Al-Bukhari and Muslim]. In the narration of Muslim it is added that whenever Anas supplicated, he used to beseech Allah with this Du\u0027a.","language":"english"},{"text":"Doa yang paling sering dibaca oleh Nabi (ﷺ) adalah: \"Allahumma atina fid-dunya hasanatan, wa fil-akhirati hasanatan, wa qina \u0027adhab-annar (Ya Rabb kami! berilah kami di dunia ini apa yang baik dan di akhirat yang baik, dan peliharalah kami dari siksa Neraka).” [Al-Bukhari dan Muslim] . Dalam riwayat Muslim ditambahkan bahwa setiap kali Anas berdoa, dia selalu memohon kepada Allah dengan Do\u0027a ini.","language":"bahasa"}],"narrated":[{"text":"Anas (May Allah be pleased with him) reported:","language":"english"},{"text":"Anas (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"1468","hadith_id":"riyadussalihin","text":[{"text":"وعن ابن مسعود، رضي الله عنه، أن النبي، صلى الله عليه وسلم، كان يقول‏:‏ ‏ \"‏اللهم إني أسألك الهدى، والتقى، والعفاف، والغنى‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Prophet (ﷺ) used to supplicate: \"Allahumma inni as\u0027alukal-huda, wat-tuqa, wal-\u0027afafa, wal-ghina (O Allah! I beseech You for guidance, piety, chastity and contentment).\" [Muslim].","language":"english"},{"text":"Nabi (ﷺ) biasa berdoa: \"Allahumma inni as\u0027alukal-huda, wat-tuqa, wal-\u0027afafa, wal-ghina (Ya Allah! Aku mohon kepada-Mu petunjuk, ketakwaan, kesucian dan kepuasan).\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"\u0027Abdullah bin Mas\u0027ud (May Allah be pleased with him) reported:","language":"english"},{"text":"\u0027Abdullah bin Mas\u0027ud (ra dengan dia) melaporkan:","language":"bahasa"}]},{"index":"1469","hadith_id":"riyadussalihin","text":[{"text":"وعن طارق بن أشيم، رضي الله عنه، قال‏:‏ كان الرجل إذا أسلم علمه النبي صلى الله عليه وسلم، الصلاة، ثم أمره أن يدعو بهؤلاء الكلمات‏:‏ ‏\"‏اللهم اغفر لي، وارحمني، واهدني، وعافني، وارزقني‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏ وفي رواية له عن طارق أنه سمع النبي صلى الله عليه وسلم، وأتاه رجل، فقال‏:‏ يا رسول الله، كيف أقول حين أسأل ربي‏؟‏ قال‏:‏ ‏\"‏قل‏:‏ اللهم اغفر لي، وارحمني، وعافني، وارزقني، فإن هؤلاء تجمع لك دنياك وآخرتك‏\"‏‏.‏","language":"arabic"},{"text":"Whenever a man entered the fold of Islam, the Prophet (ﷺ) would show him how to perform Salat and then direct him to supplicate: \"Allahumm-aghfir li, warhamni, wa-hdini, wa \u0027afini, warzuqni (O Allah! Forgive me, have mercy on me, guide me, guard me against harm and provide me with sustenance and salvation).\"\u0027 [Muslim]. In another narration Tariq said: A man came to the Prophet (ﷺ) and said to him: \"O Messenger of Allah! What shall I say if I want to pray to my Rubb?\" He (ﷺ) said, \"Say: \u0027Allahumma-ghfir li, warhamni, wa \u0027afini, warzuqni (O Allah! Forgive me, have mercy on me, protect me and provide me with sustenance).\u0027 Surely, this supplication is better for you in this life and in the Hereafter.\"","language":"english"},{"text":"Setiap kali seseorang masuk Islam, Nabi (ﷺ) akan menunjukkan kepadanya bagaimana melakukan Salat dan kemudian mengarahkannya untuk berdoa: \"Allahumm-aghfir li, warhamni, wa-hdini, wa \u0027afini, warzuqni (Ya Allah! aku, kasihanilah aku, bimbing aku, pelihara aku dari bahaya dan beri aku rezeki dan keselamatan).”\u0027 [Muslim] . Dalam narasi lain Tariq berkata: Seorang pria datang kepada Nabi (ﷺ) dan berkata kepadanya: \"Ya Rasulullah! Apa yang harus saya katakan jika saya ingin berdoa untuk Rubb saya?\" Dia (ﷺ) berkata, \"Katakanlah: \u0027Allahumma-ghfir li, warhamni, wa \u0027afini, warzuqni (Ya Allah! Ampuni aku, kasihanilah aku, lindungi aku dan beri aku rezeki).\u0027 Sesungguhnya doa ini lebih baik bagimu di dunia dan di akhirat.”","language":"bahasa"}],"narrated":[{"text":"Tariq bin Ashyam (May Allah be pleased with him) reported:","language":"english"},{"text":"Thariq bin Ashyam radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"1470","hadith_id":"riyadussalihin","text":[{"text":"وعن عبد الله بن عمرو بن العاص، رضي الله عنهما، قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏ \"‏اللهم مصرف القلوب صرف قلوبنا على طاعتك‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) supplicated: \"Allahumma musarrifal-qulubi, sarrif qulubana \u0027ala ta\u0027atika (O Allah! Controller of the hearts, direct our hearts to Your obedience).\" [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berdoa: \"Allahumma musarrifal-qulubi, sarrif qulubana \u0027ala ta\u0027atika (Ya Allah! Pengendali hati, arahkan hati kami untuk ketaatan-Mu).\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"\u0027Abdullah bin \u0027Amr bin Al-\u0027As (May Allah be pleased with them) reported:","language":"english"},{"text":"\u0027Abdullah bin \u0027Amr bin Al-\u0027As (semoga Allah meridhoi mereka) melaporkan:","language":"bahasa"}]},{"index":"1471","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم، قال‏:‏ ‏ \"‏تعوذوا بالله من جهد البلاء، ودرك الشقاء، وسوء القضاء، وشماته الأعداء‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏ وفي رواية‏:‏ قال سفيان‏:‏ أشك أني زدت واحدة منها‏.‏","language":"arabic"},{"text":"The Prophet (ﷺ) said, \"Seek refuge in Allah against the turmoils, attacks of misfortunes, and evil of judgement and joys of the enemies.\" [Al-Bukhari and Muslim] . And in a narration Sufyan said \"I suspect I added one.\"","language":"english"},{"text":"Nabi (ﷺ) berkata, \"Berlindunglah kepada Allah dari kekacauan, serangan kemalangan, dan kejahatan penghakiman dan kegembiraan musuh.\" [Al-Bukhari dan Muslim] . Dan dalam sebuah riwayat Sufyan berkata, “Saya menduga saya menambahkan satu.”","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"1472","hadith_id":"riyadussalihin","text":[{"text":"وعنه قال‏:‏ كان رسول الله صلى الله عليه وسلم، يقول‏:‏ ‏ \"‏اللهم أصلح لي ديني الذي هو عصمة أمري، وأصلح لي دنياي التي فيها معاشي، وأصلح لي آخرتي التي فيها معادي، واجعل الحياة زيادة لي في كل خير، واجعل الموت راحة لي من كل شر‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) used to say: \"Allahumm-aslih li diniyalladhi huwa \u0027ismatu amri, wa aslih li dunyaya-llati fiha ma\u0027ashi, wa aslih li akhirati-llati fiha ma\u0027adi, waj\u0027alil-hayata ziyadatan li fi kulli khair, waj\u0027alil-mauta rahatan li min kulli sharrin (O Allah, make my religion easy for me by virtue of which my affairs are protected, set right for me my world where my life exists, make good for me my Hereafter which is my resort to which I have to return, and make my life prone to perform all types of good, and make death a comfort for me from every evil).\" [Muslim].","language":"english"},{"text":"Rasulullah SAW bersabda: \"Allahumm-aslih li diniyalladhi huwa \u0027ismatu amri, wa aslih li dunyaya-llati fiha ma\u0027ashi, wa aslih li akhirati-llati fiha ma\u0027adi, waj\u0027alil-hayata ziyadatan li fi kulli khair, waj\u0027alil-mauta rahatan li min kulli sharrin (Ya Allah, mudahkan agamaku dengannya urusanku dilindungi, perbaiki untukku duniaku di mana hidupku berada, jadikanlah aku baik-baik saja) Akhirat yang merupakan tujuanku yang harus aku kembalikan, dan jadikan hidupku rawan untuk melakukan semua jenis kebaikan, dan jadikan kematian sebagai penghiburan bagiku dari setiap kejahatan).” [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"1473","hadith_id":"riyadussalihin","text":[{"text":"وعن علي رضي الله عنه قال‏:‏ قال لي رسول الله صلى الله عليه وسلم‏:‏ ‏\"‏قل‏:‏ اللهم اهدني، وسددني‏\"‏‏.‏ وفي رواية‏:‏ ‏\"‏اللهم إني أسألك الهدى، والسداد‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said to me, \"Recite: \u0027Allahumma-hdini wa saddidni (O Allah! Direct me to the Right Path and make me adhere to the Straight Path).\" Another narration is: \u0027Allahumma inni as\u0027aluk-alhuda was-sadad (I beg You for guidance and uprightness).\" [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata kepadaku, \"Bacalah: \u0027Allahumma-hdini wa saddidni (Ya Allah! Arahkan aku ke Jalan yang Benar dan buat aku mengikuti Jalan yang Lurus).\" Narasi lain adalah: \u0027Allahumma inni as\u0027aluk-alhuda was-sadad (Aku mohon petunjuk dan kebenaran).\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"\u0027Ali (May Allah be pleased with him) reported:","language":"english"},{"text":"\u0027Ali (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"1474","hadith_id":"riyadussalihin","text":[{"text":"وعن أنس رضي الله عنه قال‏:‏ كان رسول الله صلى الله عليه وسلم‏:‏ يقول‏:‏ ‏\"‏اللهم إني أعوذ بك من العجز والكسل والجبن والهرم، والبخل، وأعوذ بك من عذاب القبر، وأعوذ بك من فتنة المحيا والممات‏\"‏‏.‏ وفي رواية‏:‏ ‏\"‏وضلع الدين وغلبة الرجال‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) used to supplicate: \"Allahumma inni a\u0027udhu bika minal-ajzi wal- kasali, wal-jubni wal-harami, wal-bukhli, wa a\u0027udhu bika min \u0027adhabil- qabri, wa a\u0027udhu bika min fitnatil-mahya wal-mamat [O Allah! I seek refuge in You from helplessness (to do good), indolence, cowardice, senility, and miserliness; and I seek Your Protection against the torment of the grave and the trials of life and death].\" Another narration adds: \"wa dala\u0027id-daini wa ghalabatir-rijal (And from the burden of indebtedness and the tyranny of men).\" [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) biasa berdoa: \"Allahumma inni a\u0027udhu bika minal-ajzi wal- kasali, wal-jubni wal-harami, wal-bukhli, wa a\u0027udhu bika min \u0027adhabil-qabri, wa a\u0027 udhu bika min fitnatil-mahya wal-mamat [Ya Allah! aku berlindung kepada-Mu dari ketidakberdayaan (untuk berbuat baik), kemalasan, pengecut, kepikunan, dan kikir; dan aku memohon perlindungan-Mu dari siksa kubur dan cobaan hidup dan mati] .\" Narasi lain menambahkan: \"wa dala\u0027id-daini wa ghalabatir-rijal (Dan dari beban hutang dan kezaliman manusia).\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Anas (May Allah be pleased with him) reported:","language":"english"},{"text":"Anas (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"1475","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي بكر الصديق رضي الله عنه أنه قال لرسول الله صلى الله عليه وسلم‏:‏ علمني دعاء أدعو به في صلاتي، قال‏:‏ ‏\"‏قل‏:‏ اللهم إني ظلمت نفسي ظلمًا كثيرًا، ولا يغفر الذنوب إلا أنت، فاغفر لي مغفرة من عندك، وارحمني، إنك أنت الغفور الرحيم‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏ وفي رواية‏:‏ ‏\"‏وفي بيتي‏\"‏ وروي‏:‏ ‏\"‏ظلمًا كثيرًا‏\"‏ وروي ‏\"‏كبيرًا‏\"‏ بالثاء المثلثة وبالباء الموحدة، فينبغي أن يجمع بينهما، فقال‏:‏ كثيرًا كبيرًا‏.‏","language":"arabic"},{"text":"I requested the Messenger of Allah (ﷺ) to teach me a supplication which I could recite in my Salat (prayer). Thereupon he said, \"Recite: \u0027Allahumma inni zalamtu nafsi zulman kathiran, wa la yaghfirudh- dhunuba illa Anta, faghfir li maghfiratan min \u0027indika, warhamni, innaka Antal-Ghafur-ur-Rahim (O Allah! I have considerably wronged myself. There is none to forgive the sins but You. So grant me pardon and have mercy on me. You are the Most Forgiving, the Most Compassionate).\"\u0027 [Al-Bukhari and Muslim].","language":"english"},{"text":"Saya meminta Rasulullah () untuk mengajari saya sebuah doa yang bisa saya baca dalam salat saya. Kemudian dia berkata, “Bacalah: \u0027Allahumma inni zalamtu nafsi zulman kathiran, wa la yaghfirudh- dhunuba illa Anta, faghfir li maghfiratan min \u0027indika, warhamni, innaka Antal-Ghafur-ur-Rahim (Ya Allah! Aku telah sangat menganiaya diriku sendiri. Tidak ada yang mengampuni dosa selain Engkau. Maka ampunilah aku dan kasihanilah aku. Engkau Maha Pengampun lagi Maha Penyayang).\"\u0027 [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Bakr As-Siddiq (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Bakar As-Siddiq radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"1476","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي موسى، رضي الله عنه، عن النبي صلى الله عليه وسلم، أنه كان يدعو بهذا الدعاء‏:‏ ‏ \"‏اللهم اغفر لي خطيئتي وجهلي، وإسرافي في أمري، وما أنت أعلم به مني، اللهم اغفر لي جدي وهزلي، وخطئي وعمدي، وكل ذلك عندي، اللهم اغفر لي ما قدمت وما أخرت، وما أسررت وما أعلنت، وما أنت أعلم به مني، أنت المقدم، وأنت المؤخر، وأنت على كل شيء قدير‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Prophet (ﷺ) used to supplicate: \"Allahumm-aghfir li khati\u0027ati, wajahli, wa israfi fi amri, wa ma Anta a\u0027lamu bihi minni. Allahumm-aghfir li jiddi wa hazli, wa khata\u0027i wa \u0027amdi, wa kullu dhalika \u0027indi. Allahumm-aghfir li ma qaddamtu wa ma akhkhartu, wa ma asrartu, wa ma a\u0027lantu, wa ma Anta a\u0027lamu bihi minni. Antal-Muqaddimu, wa Antal-Mu\u0027akhkhiru; wa Anta \u0027ala kulli shai\u0027in Qadir (O Allah! Forgive my errors, ignorance and immoderation in my affairs. You are better aware of my faults than myself. O Allah! Forgive my faults which I committed in seriousness or in fun deliberately or inadvertently. O Allah! Grant me pardon for those sins which I committed in the past and I may commit in future, which I committed in privacy or in public and all those sins of which You are better aware than me. You Alone can send whomever You will to Jannah, and You Alone can send whomever You will to Hell-fire and You are Omnipotent).\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Nabi (ﷺ) biasa berdoa: \"Allahumm-aghfir li khati\u0027ati, wajahli, wa israfi fi amri, wa ma Anta a\u0027lamu bihi minni. Allahumm-aghfir li jiddi wa hazli, wa khata\u0027i wa \u0027amdi, wa kullu dhalika \u0027indi. Allahumm-aghfir li ma qaddamtu wa ma akhkhartu, wa ma asrartu, wa ma a\u0027lantu, wa ma Anta a\u0027lamu bihi minni. Antal-Muqaddimu, wa Antal-Mu\u0027akhkhiru; wa Anta \u0027ala kulli shai\u0027in Qadir (Ya Allah! Ampunilah kesalahanku, ketidaktahuanku, dan ketidaksopananku dalam urusanku. Engkau lebih mengetahui kesalahanku daripada diriku sendiri. Ya Allah! Ampunilah kesalahanku yang aku lakukan dengan serius atau dalam kesenangan dengan sengaja atau tidak sengaja. Ya Allah Ampunilah saya atas dosa-dosa yang saya lakukan di masa lalu dan mungkin saya lakukan di masa depan, yang saya lakukan secara pribadi atau di depan umum dan semua dosa yang Engkau lebih sadari daripada saya.Anda Sendiri yang dapat mengirim siapa pun yang Anda kehendaki ke Jannah, dan Anda Sendiri yang dapat mengirim siapa pun yang Anda kehendaki ke api Neraka dan Anda Mahakuasa).\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Musa (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Musa (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"1477","hadith_id":"riyadussalihin","text":[{"text":"وعن عائشة، رضي الله عنها، أن النبي صلى الله عليه وسلم، كان يقول في دعائه‏:‏ ‏ \"‏اللهم إني أعوذ بك من شر ما عملت ومن شر ما لم أعمل‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Prophet (ﷺ) used to supplicate (in these words): \"Allahumma inni audhu bika min sharri ma \u0027amiltu, wa min sharri ma lam a\u0027mal (O Allah! I seek refuge in You from the evil of that which I have done and the evil of that which I have not done).\" [Muslim].","language":"english"},{"text":"Nabi (ﷺ) biasa berdoa (dalam kata-kata ini): \"Allahumma inni audhu bika min sharri ma \u0027amiltu, wa min sharri ma lam a\u0027mal (Ya Allah! Aku berlindung kepada-Mu dari kejahatan apa yang kumiliki). lakukan dan keburukan dari apa yang tidak aku lakukan). [Muslim] .","language":"bahasa"}],"narrated":[{"text":"\u0027Aishah (May Allah be pleased with her) reported:","language":"english"},{"text":"\u0027Aisyah r.a. melaporkan:","language":"bahasa"}]},{"index":"1478","hadith_id":"riyadussalihin","text":[{"text":"وعن ابن عمر رضي الله عنه الله عنهما قال‏:‏ كان من دعاء رسول الله صلى الله عليه وسلم‏:‏ ‏ \"‏اللهم إني أعوذ بك من زوال نعمتك، وتحول عافيتك، وفجاءة نقمتك، وجميع سخطك‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) used to supplicate thus: \"Allahumma inni a\u0027udhu bika min zawali ni\u0027matika, wa tahawwuli \u0027afiyatika, wa fuja\u0027ati niqmatika, wa jami\u0027i sakhatika (O Allah! I seek refuge in You against the declining of Your Favours, passing of safety, the suddenness of Your punishment and all that which displeases You).\" [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) biasa berdoa demikian: \"Allahumma inni a\u0027udhu bika min zawali ni\u0027matika, wa tahawwuli \u0027afiyatika, wa fuja\u0027ati niqmatika, wa jami\u0027i sakhatika (Ya Allah! Aku berlindung kepada-Mu terhadap menurunnya Nikmat-Mu, berlalunya keselamatan, datangnya azab-Mu yang tiba-tiba dan segala kemurkaan-Mu). [Muslim] .","language":"bahasa"}],"narrated":[{"text":"\u0027Abdullah bin \u0027Umar (May Allah be pleased with them) reported:","language":"english"},{"text":"\u0027Abdullah bin \u0027Umar (semoga Allah meridhoi mereka) melaporkan:","language":"bahasa"}]},{"index":"1479","hadith_id":"riyadussalihin","text":[{"text":"وعن زيد بن أرقم رضي الله عنه قال‏:‏ كان رسول الله صلى الله عليه وسلم، يقول‏:‏ ‏ \"‏اللهم إني أعوذ بك من العجز والكسل، والبخل والهرم، وعذاب القبر، اللهم آت نفسي تقواها، وزكها أنت خير من زكاها، أنت وليها ومولاها، اللهم إني أعوذ بك من علم لا ينفع ومن قلب لا يخشع، ومن نفس لا تشبع، ومن دعوة لا يستجاب لها‏\"‏‏.‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) would supplicate: \"Allahumma inni a\u0027udhu bika minal-\u0027ajzi wal-kasali, wal-bukhli wal-harami, wa \u0027adhabil-qabri. Allahumma ati nafsi taqwaha, wa zakkiha Anta khairu man zakkaha, Anta waliyyuha wa maulaha. Allahumma inni a\u0027udhu bika min \u0027ilmin la yanfau\u0027, wa min qalbin la yakhsha\u0027u, wa min nafsin la tashba\u0027u, wa min da\u0027watin la yustajabu laha\u0027 [O Allah! I seek refuge in You from the inability (to do good), indolence, cowardice, miserliness, decrepitude and torment of the grave. O Allah! Grant me the sense of piety and purify my soul as You are the Best to purify it. You are its Guardian and its Protecting Friend. O Allah! I seek refuge in You from the knowledge which is not beneficial, and from a heart which does not fear (You), and from desire which is not satisfied, and from prayer which is not answered].\" [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berdoa: \"Allahumma inni a\u0027udhu bika minal-\u0027ajzi wal-kasali, wal-bukhli wal-harami, wa \u0027adhabil-qabri. Allahumma ati nafsi taqwaha, wa zakkiha Anta khairu man zakkaha, Anta waliyyuha wa maulaha. Allahumma inni a\u0027udhu bika min \u0027ilmin la yanfau\u0027, wa min qalbin la yakhsha\u0027u, wa min nafsin la tashba\u0027u, wa min da\u0027watin la yustajabu laha\u0027 [Ya Allah! Aku berlindung kepada-Mu dari ketidakmampuan (berbuat baik), kemalasan, pengecut, kikir, kebobrokan dan siksa kubur. Ya Allah! Berilah aku rasa takwa dan sucikan jiwaku karena Engkaulah yang terbaik untuk mensucikannya. Anda adalah Penjaganya dan Teman Pelindungnya. Ya Allah! Aku berlindung kepada-Mu dari ilmu yang tidak bermanfaat, dari hati yang tidak takut (kepada-Mu), dari nafsu yang tidak dipuaskan, dan dari doa yang tidak dikabulkan .\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Zaid bin Arqam (May Allah be pleased with him) reported:","language":"english"},{"text":"Zaid bin Arqam radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"1480","hadith_id":"riyadussalihin","text":[{"text":"وعن ابن عباس رضي الله عنهما أن رسول الله صلى الله عليه وسلم، كان يقول‏:‏ ‏\"‏اللهم لك أسلمت، وبك آمنت، وعليك توكلت، وإليك أنبت وبك خاصمت، وإليك حاكمت، فاغفر لي ما قدمت، وما أخرت وما أسررت وما أعلنت، أنت المقدم، وأنت المؤخر، لا إله إلا أنت‏\"‏ زاد بعض الرواة‏:‏ ‏\"‏ولا حول ولا قوة إلا بالله‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) used to supplicate: \"Allahumma laka aslamtu, wa bika amantu, wa \u0027alaika tawakkaltu, wa ilaika anabtu, wa bika khasamtu, wa ilaika hakamtu. Faghfir li ma qaddamtu, wa ma akh-khartu, wa ma asrartu wa ma a\u0027lantu, Antal-Muqaddimu, wa Antal-Mu\u0027akhkhiru, la ilaha illa Anta (O Allah! to You I submit, in You I affirm my faith, in You I repose my trust, to You I turn in repentance and with Your Help I contend my adversaries and from You I seek judgement. O Allah! Grant me forgiveness for the faults which I made in past and those ones I may commit in the future, those which I committed secretly or openly. You Alone send whomever You will to Jannah, and You Alone send whomever You will to Hell-fire. There is none worthy of worship except You).\" Another narration adds: \"La hawla wa la quwwata illa billah (There is no strength to resist evil and no power to do good except through Allah).\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) biasa berdoa: \"Allahumma laka aslamtu, wa bika amantu, wa \u0027alaika tawakkaltu, wa ilaika anabtu, wa bika khasamtu, wa ilaika hakamtu. Faghfir li ma qaddamtu, wa ma akh-khartu, wa ma asrartu wa ma a\u0027lantu, Antal-Muqaddimu, wa Antal-Mu\u0027akhkhiru, la ilaha illa Anta (Ya Allah! kepada-Mu aku berserah diri, kepada-Mu aku meneguhkan imanku, kepada-Mu aku bertawakal, kepada-Mu aku berserah diri taubat dan dengan pertolongan-Mu aku melawan musuh-musuhku dan dari-Mu aku mencari penghakiman.Ya Allah, berilah aku ampunan atas kesalahan yang aku buat di masa lalu dan kesalahan yang mungkin aku lakukan di masa depan, yang aku lakukan secara sembunyi-sembunyi atau terang-terangan. kirim siapa saja yang Anda kehendaki ke Jannah, dan Anda Sendiri yang mengirim siapa pun yang Anda kehendaki ke api neraka. Tidak ada yang berhak disembah kecuali Anda).\" Narasi lain menambahkan: \" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Ibn \u0027Abbas (May Allah be pleased with them) reported:","language":"english"},{"text":"Ibn \u0027Abbas (semoga Allah meridhoi mereka) melaporkan:","language":"bahasa"}]},{"index":"1481","hadith_id":"riyadussalihin","text":[{"text":"وعن عائشة رضي الله عنها أن النبي صلى الله عليه وسلم، كان يدعو بهؤلاء الكلمات‏:‏ ‏ \"‏اللهم إني أعوذ بك من فتنة النار، وعذاب النار، ومن شر الغنى والفقر‏\"‏‏.‏ رواه أبو داود والترمذي وقال حديث حسن صحيح وهذا لفظ أبي داود‏.‏","language":"arabic"},{"text":"The Prophet (ﷺ) used to supplicate: \"Allahumma inni a\u0027udhu bika min fitnatin-nari, wa \u0027adhabin-nari, wa min sharril-ghina wal-faqri (O Allah! I seek refuge in You from the trials and the torment of the Fire and from the evils of wealth and poverty).\" [Abu Dawud and At- Tirmidhi].","language":"english"},{"text":"Nabi (ﷺ) biasa berdoa: \"Allahumma inni a\u0027udhu bika min fitnatin-nari, wa \u0027adhabin-nari, wa min sharril-ghina wal-faqri (Ya Allah! Aku berlindung kepada-Mu dari cobaan dan siksaan). neraka dan dari kejahatan kekayaan dan kemiskinan). [Abu Dawud dan At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"\u0027Aishah (May Allah be pleased with her) reported:","language":"english"},{"text":"\u0027Aisyah r.a. melaporkan:","language":"bahasa"}]},{"index":"1482","hadith_id":"riyadussalihin","text":[{"text":"وعن زياد بن علاقة عن عمه، وهو قطبة بن مالك، رضي الله عنه، قال‏:‏ كان النبي صلى الله عليه وسلم، يقول‏:‏ ‏ \"‏اللهم إني أعوذ بك من منكرات الأخلاق، والأعمال، والأهواء‏\"‏‏.‏ رواه الترمذي وقال حديث حسن‏.‏","language":"arabic"},{"text":"My uncle Qutbah bin Malik (May Allah be pleased with him) said that the Prophet (ﷺ) used to supplicate: \"Allahumma inni a\u0027udhu bika min munkaratil-akhlaqi, wal-a\u0027mali, wal- ahwa\u0027i (O Allah! I seek refuge in You from undesirable manners, deeds, and aspirations).\" [At-Tirmidhi].","language":"english"},{"text":"Pamanku Qutbah bin Malik r.a. berkata bahwa Nabi (ﷺ) biasa berdoa: \"Allahumma inni a\u0027udhu bika min munkaratil-akhlaqi, wal-a\u0027mali, wal-ahwa\u0027i (Ya Allah ! Aku berlindung kepada-Mu dari perilaku, perbuatan, dan cita-cita yang tidak diinginkan).” [At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Ziyad bin \u0027Ilaqah reported:","language":"english"},{"text":"Ziyad bin \u0027Ilaqah melaporkan:","language":"bahasa"}]},{"index":"1483","hadith_id":"riyadussalihin","text":[{"text":"وعن شكل بن حميد، رضي الله عنه قال‏:‏ قلت يا رسول الله‏:‏ علمني دعاء‏.‏ قال‏:‏ ‏ \"‏قل‏:‏ اللهم إني أعوذ بك من شر سمعي، ومن شر بصري، ومن شر لساني، ومن شر قلبي، ومن شر مني‏\"‏‏.‏ رواه أبو داود والترمذي وقال حديث حسن‏.‏","language":"arabic"},{"text":"I asked: \"O Messenger of Allah, teach me a prayer.\" He (ﷺ) said, \"Say: Allahumma inni a\u0027udhu bika min sharri sam\u0027i, wa min sharri basari, wa min sharri lisani, wa min sharri qalbi, wa min sharri maniyyi (O Allah! I seek refuge in You from the evils of my hearing, the evils of my seeing, the evils of my tongue; the evils of my heart and the evils of passions).\" [Abu Dawud and At- Tirmidhi].","language":"english"},{"text":"Aku bertanya: \"Ya Rasulullah, ajari aku shalat.\" Dia (ﷺ) berkata, \"Katakanlah: Allahumma inni a\u0027udhu bika min sharri sam\u0027i, wa min sharri basari, wa min sharri lisani, wa min sharri qalbi, wa min sharri maniyyi (Ya Allah! Aku berlindung kepada-Mu dari kejahatan pendengaranku, kejahatan penglihatanku, kejahatan lidahku, kejahatan hatiku dan kejahatan hawa nafsu). [Abu Dawud dan At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Shakal bin Humaid (May Allah be pleased with him) reported:","language":"english"},{"text":"Shakal bin Humaid radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"1484","hadith_id":"riyadussalihin","text":[{"text":"وعن أنس رضي الله عنه أن النبي صلى الله عليه وسلم، كان يقول‏:‏ ‏ \"‏اللهم إني أعوذ بك من البرص والجنون، والجذام، وسيئ الأسقام‏\"‏‏.‏ رواه أبو داود بإسناد صحيح‏.‏","language":"arabic"},{"text":"The Prophet (ﷺ) used to supplicate: \"Allahumma inni a\u0027udhu bika minal-barasi, wal- jununi, wal-judhami, wa sayyi\u0027il-asqami\u0027 (O Allah! I seek refuge in You from leucoderma, insanity, leprosy and evil diseases).\" [Abu Dawud].","language":"english"},{"text":"Nabi (ﷺ) biasa berdoa: \"Allahumma inni a\u0027udhu bika minal-barasi, wal-jununi, wal-judhami, wa sayyi\u0027il-asqami\u0027 (Ya Allah! Aku berlindung kepada-Mu dari penyakit leukoderma, gila, kusta) dan penyakit jahat).\" [Abu Daud] .","language":"bahasa"}],"narrated":[{"text":"Anas (May Allah be pleased with him) reported:","language":"english"},{"text":"Anas (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"1485","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي هريرة، رضي الله عنه، قال‏:‏ كان رسول الله صلى الله عليه وسلم ، يقول‏:‏ ‏ \"‏اللهم إني أعوذ بك من الجوع، فإنه بئس الضجيع، وأعوذ بك من الخيانة، فإنها بئست البطانة‏\"‏ ‏(‏‏(‏رواه أبو داود بإسناد صحيح‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) used to supplicate: \"Allahumma inni a\u0027udhu bika minal- ju\u0027i, fa-innahu bi\u0027sad-daji\u0027u; wa a\u0027udhu bika minal-khiyanati, fa- innaha bi\u0027satil-bitanah\u0027 [O Allah! I seek refuge in You from hunger; surely, it is the worst companion. And I seek refuge in You from treachery; surely, it is a bad inner trait].\" [Abu Dawud].","language":"english"},{"text":"Rasulullah SAW pernah berdoa: \"Allahumma inni a\u0027udhu bika minal ju\u0027i, fa-innahu bi\u0027sad-daji\u0027u; wa a\u0027udhu bika minal-khiyanati, fa-innaha bi\u0027satil -bitanah\u0027 [Ya Allah! Aku berlindung kepada-Mu dari rasa lapar; sesungguhnya itu adalah teman yang paling buruk. Dan aku berlindung kepada-Mu dari pengkhianatan; sungguh, itu adalah sifat batin yang buruk] .\" [Abu Daud] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"1486","hadith_id":"riyadussalihin","text":[{"text":"وعن علي، رضي الله عنه، أن مكاتبًا جاءه، فقال‏:‏ إني عجزت عن كتابتي‏.‏ فأعني‏.‏ قال‏:‏ ألا أعلمك كلمات علمنيهن رسول الله صلى الله عليه وسلم، لو كان عليك مثل جبل دينا أداه الله عنك‏؟‏ قل‏:‏ ‏ \"‏اللهم اكفني بحلالك عن حرامك، وأغنني بفضلك عمن سواك‏\"‏ ‏(‏‏(‏رواه الترمذي وقال‏:‏ حديث حسن‏)‏‏)‏‏.‏","language":"arabic"},{"text":"A slave who had made a contract with his master to pay for his freedom, came to me and said: \"I am unable to fulfill my obligation, so help me.\" He said to him: \"Shall I not teach you a supplication which the Messenger of Allah (ﷺ) taught me? It will surely prove so effective that if you have a debt as large as a huge mountain, Allah will surely pay it for you. Say: \u0027Allahumm-akfini bihalalika \u0027an haramika, wa aghnini bifadlika \u0027amman siwaka (O Allah! Grant me enough of what You make lawful so that I may dispense with what You make unlawful, and enable me by Your Grace to dispense with all but You).\" [At- Tirmidhi].","language":"english"},{"text":"Seorang budak yang telah membuat kontrak dengan tuannya untuk membayar kebebasannya, datang kepada saya dan berkata: \"Saya tidak dapat memenuhi kewajiban saya, jadi bantu saya.\" Dia berkata kepadanya: \"Maukah aku mengajarimu sebuah doa yang diajarkan Rasulullah () kepadaku? Itu pasti akan terbukti sangat efektif sehingga jika kamu memiliki hutang sebesar gunung besar, Allah pasti akan membayarnya untukmu. Katakanlah: \u0027Allahumm-akfini bihalalika \u0027an haramika, wa aghnini bifadlika \u0027amman siwaka (Ya Allah! Berilah aku cukup dari apa yang Engkau halalkan agar aku dapat membuang apa yang Engkau haramkan, dan perkenankan aku dengan Rahmat-Mu untuk membuangnya semua kecuali Anda).\" [At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"\u0027Ali (May Allah be pleased with him) reported:","language":"english"},{"text":"\u0027Ali (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"1487","hadith_id":"riyadussalihin","text":[{"text":"وعن عمران بن الحصين، رضي الله عنهما، أن النبي صلى الله عليه وسلم علم أباه حصينًا كلمتين يدعو بهما‏:‏ ‏ \"‏اللهم ألهمني رشدي، وأعذني من شر نفسي‏\"‏ ‏(‏‏(‏رواه الترمذي وقال‏:‏ حديث حسن‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Prophet (ﷺ) taught my father two statements to recite in his Du\u0027a. These are: \"Allahumma al-himni rushdi, wa a\u0027idhni min sharri nafsi (O Allah! Inspire in me guidance and deliver me from the evils within myself).\" [At-Tirmidhi].","language":"english"},{"text":"Nabi (ﷺ) mengajarkan ayah saya dua pernyataan untuk dibaca dalam Do\u0027a-nya. Ini adalah: \"Allahumma al-himni rushdi, wa a\u0027idhni min sharri nafsi (Ya Allah! Berilah aku petunjuk dan jauhkan aku dari kejahatan dalam diriku).\" [At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"\u0027Imran bin Husain (May Allah be pleased with them) reported:","language":"english"},{"text":"\u0027Imran bin Husain r.a. melaporkan:","language":"bahasa"}]},{"index":"1488","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي الفضل العباس بن عبد المطلب رضي الله عنه قال‏:‏ قلت يا رسول الله‏:‏ علمني شيئًا أسأله الله تعالى، قال‏:‏ ‏\"‏سلوا الله العافية‏\"‏ فمكثت أيامًا، ثم جئت فقلت‏:‏ يا رسول الله‏:‏ علمني شيئًا أسأله الله تعالى، قال لي‏:‏ ‏\"‏يا عباس ‏يا عم رسول الله سلوا الله العافية في الدنيا والآخرة‏\"‏‏.‏ ‏(‏‏(‏رواه الترمذي وقال‏:‏ حديث حسن صحيح‏)‏‏)‏‏.‏","language":"arabic"},{"text":"I asked the Messenger of Allah (ﷺ) to teach me a supplication. He (ﷺ) said, \"Beg Allah for safety (from all evils in this world and in the Hereafter).\" I waited for some days and then I went to him again and asked him: \"O Messenger of Allah Teach me to supplicate something from Allah.\" He said to me, \"O Al-`Abbas, the uncle of Messenger of Allah! Beseech Allah to give you safety (Al-`afiyah ) in this life and in the Hereafter.\" [At- Tirmidhi].","language":"english"},{"text":"Saya meminta Rasulullah () untuk mengajari saya sebuah doa. Dia (ﷺ) berkata, \"Memohon kepada Allah untuk keselamatan (dari semua kejahatan di dunia ini dan di akhirat).\" Aku menunggu selama beberapa hari dan kemudian aku pergi kepadanya lagi dan bertanya: \"Ya Rasulullah, Ajari aku untuk berdoa sesuatu dari Allah.\" Dia berkata kepadaku, \"O Al-`Abbas, paman Rasulullah! Mohon kepada Allah untuk memberimu keselamatan (Al-`afiyah) di dunia dan di akhirat.\" [At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Abul-Fadl Al-`Abbas bin `Abdul-Muttalib (ra) reported:","language":"english"},{"text":"Abul-Fadl Al-`Abbas bin `Abdul-Muttalib (ra) melaporkan:","language":"bahasa"}]},{"index":"1489","hadith_id":"riyadussalihin","text":[{"text":"وعن شهر بن حوشب قال‏:‏ قلت لأم سلمة، رضي الله عنها، يا أم المؤمنين ما كان أكثر دعاء رسول الله صلى الله عليه وسلم، إذا كان عندك‏؟‏ قالت‏:‏ كان أكثر دعائه‏:‏ ‏ \"‏يا مقلب القلوب ثبت قلبي على دينك‏\"‏ ‏(‏‏(‏رواه الترمذي، وقال‏:‏ حديث حسن‏)‏‏)‏‏.‏","language":"arabic"},{"text":"I asked Umm Salamah (May Allah be pleased with her), \"O Mother of the Believers! Which supplication did the Messenger of Allah (ﷺ) make frequently when he was in your house?\" She said: \"He (ﷺ) supplicated frequently: \u0027Ya muqallibal-qulubi, thabbit qalbi \u0027ala dinika (O Controller of the hearts make my heart steadfast in Your religion).\" [At- Tirmidhi].","language":"english"},{"text":"Saya bertanya kepada Ummu Salamah (semoga Allah meridhoinya), \"Wahai ibu orang-orang yang beriman! Doa apa yang sering dipanjatkan Rasulullah (ﷺ) ketika dia berada di rumahmu?\" Dia berkata: \"Dia (ﷺ) sering berdoa: \u0027Ya muqallibal-qulubi, thabbit qalbi \u0027ala dinika (Wahai Penguasa hati, buatlah hatiku teguh dalam agama-Mu).\" [At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Shahr bin Haushab reported:","language":"english"},{"text":"Shahr bin Haushab melaporkan:","language":"bahasa"}]},{"index":"1490","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي الدرداء، رضي الله عنه، قال‏:‏ رسول الله صلى الله عليه وسلم‏:‏ ‏\"‏كان من دعاء داود عليه السلام‏:‏ ‏\"‏اللهم إني أسألك حبك، وحب من يحبك، والعمل الذي يبلغني حبك، اللهم اجعل حبك أحب إلى من نفسي، وأهلي، ومن الماء البارد‏\"‏‏.‏ رواه الترمذي وقال حديث حسن‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"One of Prophet Dawud\u0027s supplications was: \u0027Allahumma inni as\u0027aluka hubbaka, wa hubba man yuhibbuka, wal-\u0027amalalladhi yuballighuni hubbaka. Allahumm-aj\u0027al hubbaka ahabba ilayya min nafsi, wa ahli, wa minal-ma\u0027il-baridi (O Allah! I ask You for Your Love, the love of those who love You, and deeds which will cause me to attain Your Love. O Allah! Make Your Love dearer to me than myself, my family and the cold water).\"\u0027 [At- Tirmidhi].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Salah satu doa Nabi Dawud adalah: \u0027Allahumma inni as\u0027aluka hubbaka, wa hubba man yuhibbuka, wal-\u0027amalalladhi yuballighuni hubbaka. Allahumm-aj\u0027al hubbaka ahabba ilayya min nafsi, wa ahli , wa minal-ma\u0027il-baridi (Ya Allah! Aku memohon kepada-Mu Cinta-Mu, cinta orang-orang yang mencintai-Mu, dan amalan-amalan yang membuatku mencapai Cinta-Mu. Ya Allah! Jadikan Cinta-Mu lebih aku cintai daripada diriku sendiri , keluargaku dan air dinginnya).”\u0027 [At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Abud-Darda\u0027 (May Allah be pleased with him) reported:","language":"english"},{"text":"Abud-Darda\u0027 (ra dengan dia) melaporkan:","language":"bahasa"}]},{"index":"1491","hadith_id":"riyadussalihin","text":[{"text":"وعن أنس رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏ \"‏ألظوا بيا ذا الجلال والإكرام‏\"‏‏.‏ رواه الترمذي ورواه النسائي من رواية ربيعة بن عامر الصحابي قال الحاكم حديث صحيح الإسناد‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"Recite frequently: \u0027Ya Dhal-Jalali wal-Ikram! (O You, Possessor of glory and honour).\"\u0027 [At- Tirmidhi].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Bacalah dengan sering: \u0027Ya Dhal-Jalali wal-Ikram! (Wahai Engkau, Pemilik kemuliaan dan kehormatan).\"\u0027 [At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Anas (May Allah be pleased with him) reported:","language":"english"},{"text":"Anas (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"1492","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي أمامة، رضي الله عنه قال‏:‏ دعا رسول الله صلى الله عليه وسلم، بدعاء كثير لم نحفظ منه شيئًا، قلنا: \"يا رسول الله دعوت بدعاء كثير لم نحفظ منه شيئا،\" فقال‏:‏ ‏\"‏ألا أدلكم على ما يجمع ذلك كله‏؟‏ تقول‏:‏ ‏\"‏اللهم إني أسألك من خير ما سألك منه نبيك محمد صلى الله عليه وسلم، وأعوذ بك من شر ما استعاذ منه نبيك محمد صلى الله عليه وسلم، وأنت المستعان، وعليك البلاغ، ولا حول ولا قوة إلا بالله‏\"‏‏.‏ رواه الترمذي وقال حديث حسن‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) made many supplications which we did not memorize. We said to him: \"O Messenger of Allah! You have made many supplications of which we do not remember anything.\" He said, \"Shall I tell you a comprehensive prayer? Say: \u0027Allahumma inni as\u0027aluka min khairi ma sa\u0027alaka minhu nabiyyuka Muhammadun sallallahu \u0027alaihi wa sallam. Wa \u0027a\u0027udhu bika min sharri mas-ta\u0027adha minhu nabiyyuka Muhammadun sallallahu \u0027alaihi wa sallam. Wa Antal-Musta\u0027anu, wa \u0027alaikal-balaghu, wa la hawla wa la quwwata illa billah (O Allah, I beg to You the good which Your Prophet Muhammad (ﷺ) begged of You; and I seek refuge in You from the evil where from Your Prophet Muhammad (ﷺ) sought refuge. You are the One from Whom help is sought and Your is the responsibility to communicate (the truth). There is no power or strength except with Allah the Exalted, the Great.\"\u0027 [At- Tirmidhi]","language":"english"},{"text":"Rasulullah (ﷺ) membuat banyak doa yang tidak kami hafal. Kami berkata kepadanya: \"Ya Rasulullah! Anda telah membuat banyak doa yang kami tidak ingat apa-apa.\" Dia berkata, “Maukah aku memberitahumu doa yang lengkap? Ucapkan: \u0027Allahumma inni as\u0027aluka min khairi ma sa\u0027alaka minhu nabiyyuka Muhammadun sallallahu \u0027alaihi wa sallam. Wa \u0027a\u0027udhu bika min sharri mas-ta\u0027adha minhu nabiyyuka Muhammadun sallallahu \u0027alaihi wa sallam. Wa Antal-Musta\u0027anu, wa \u0027alaikal-balaghu, wa la hawla wa la quwwata illa billah (Ya Allah, aku mohon kepada-Mu kebaikan yang diminta oleh Nabi-Mu Muhammad (ﷺ) dari-Mu; dan Aku berlindung kepada-Mu dari kejahatan dimana Nabi-Mu Muhammad (ﷺ) berlindung. Andalah yang meminta pertolongan dan Anda adalah tanggung jawab untuk menyampaikan (kebenaran). Tiada daya dan upaya kecuali dengan pertolongan Allah Ta\u0027ala lagi Maha Besar.\"\u0027 [At-Tirmidzi]","language":"bahasa"}],"narrated":[{"text":"Abu Umamah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Umamah r.a. melaporkan:","language":"bahasa"}]},{"index":"1493","hadith_id":"riyadussalihin","text":[{"text":"وعن ابن مسعود رضي الله عنه قال‏:‏ كان من دعاء رسول الله صلى الله عليه وسلم‏:‏ ‏ \"‏اللهم إني أسألك موجبات رحمتك، وعزائم مغفرتك، والسلامة من كل إثم، والغنيمة من كل بر، والفوز بالجنة، والنجاة من النار‏\"‏‏.‏ ‏(‏‏(‏رواه الحاكم أبو عبد الله، وقال‏:‏ حديث صحيح على شرط مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"One of the supplications of the Messenger of Allah (ﷺ) was: \"Allahumma inni as\u0027aluka mujibati rahmatika, wa \u0027aza\u0027ima maghfiratika, was-salamata min kulli ithmin, wal-ghanimata min kulli birrin, wal-fawza bil- jannati, wannajata mina-nar (O Allah! I beg You for that which incites Your Mercy and the means of Your forgiveness, safety from every sin, the benefit from every good deed, success in attaining Jannah and deliverance from Fire).\" [Al-Hakim].","language":"english"},{"text":"Salah satu doa Rasulullah (ﷺ) adalah: \"Allahumma inni as\u0027aluka mujibati rahmatika, wa \u0027aza\u0027ima maghfiratika, was-salamata min kulli ithmin, wal-ghanimata min kulli birrin, wal-fawza bil-jannati , wannajata mina-nar (Ya Allah! Saya mohon kepada-Mu untuk apa yang menghasut rahmat-Mu dan sarana pengampunan-Mu, keselamatan dari setiap dosa, manfaat dari setiap perbuatan baik, kesuksesan dalam mencapai Jannah dan pembebasan dari Api).\" [Al-Hakim] .","language":"bahasa"}],"narrated":[{"text":"Ibn Mas\u0027ud (May Allah be pleased with him) reported:","language":"english"},{"text":"Ibnu Mas\u0027ud radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"1494","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي الدرداء رضي الله عنه أنه سمع رسول الله صلى الله عليه وسلم يقول‏:‏ ‏ \"‏ما من عبد مسلم يدعو لأخيه بظهر الغيب إلا قال الملك ولك بمثل‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"I heard the Messenger of Allah (ﷺ) saying, \"Whenever a Muslim supplicates for his (Muslim) brother in his absence, the angels say: \u0027May the same be for you too\u0027.\" [Muslim].","language":"english"},{"text":"Saya mendengar Rasulullah (ﷺ) berkata, \"Setiap kali seorang Muslim berdoa untuk saudaranya (Muslim) dalam ketidakhadirannya, para malaikat berkata: \u0027Semoga hal yang sama terjadi untuk Anda juga\u0027.\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abud-Darda\u0027 (May Allah be pleased with him) reported:","language":"english"},{"text":"Abud-Darda\u0027 (ra dengan dia) melaporkan:","language":"bahasa"}]},{"index":"1495","hadith_id":"riyadussalihin","text":[{"text":"وعنه أن رسول الله صلى الله عليه وسلم كان يقول‏:‏ ‏ \"‏دعوة المرء المسلم لأخيه بظهر الغيب مستجابة، عند رأسه ملك موكل كلما دعا لأخيه بخير قال الملك الموكل به‏:‏ آمين، ولك بمثل‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"The supplication of a Muslim for his (Muslim) brother in his absence will certainly be answered. Everytime he makes a supplication for good for his brother, the angel appointed for this particular task says: \u0027A meen! May it be for you, too\u0027.\" [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Doa seorang Muslim untuk saudaranya (Muslim) dalam ketidakhadirannya pasti akan dikabulkan. Setiap kali dia berdoa untuk kebaikan saudaranya, malaikat yang ditunjuk untuk tugas khusus ini berkata: \u0027 A meen! Semoga itu juga untukmu\u0027.\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abud-Darda\u0027 (May Allah be pleased with him) reported:","language":"english"},{"text":"Abud-Darda\u0027 (ra dengan dia) melaporkan:","language":"bahasa"}]},{"index":"1496","hadith_id":"riyadussalihin","text":[{"text":"وعن أسامة بن زيد رضي الله عنهما قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏ \"‏من صنع إليه معروف، فقال لفاعله‏:‏ جزاك الله خيرًا، فقد أبلغ في الثناء‏\"‏‏.‏ رواه الترمذي وقال حديث حسن صحيح ‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"He who is favoured by another and says to his benefactor: `Jazak-Allah khairan (may Allah reward you well)\u0027 indeed praised (the benefactor) satisfactorily.\u0027\u0027 [At-Tirmidhi].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Barangsiapa yang disukai oleh orang lain dan berkata kepada dermawannya: \u0027Jazak-Allah khairan (semoga Allah membalas Anda dengan baik)\u0027 memang memuji (dermawan) dengan memuaskan.\" [At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Usamah bin Zaid (May Allah be pleased with them) reported:","language":"english"},{"text":"Usamah bin Zaid radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"1497","hadith_id":"riyadussalihin","text":[{"text":"وعن جابر رضي الله عنهما قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏ \"‏لا تدعوا على أنفسكم، ولا تدعوا على أولادكم، ولا تدعو على أموالكم، لا توافقوا من الله ساعة يسأل فيها عطاء، فيستجيب لكم‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"Do not invoke curses on yourself or on your children or on your possessions lest you should happen to do it at a moment when the supplications are accepted, and your prayer might be granted.\" [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Jangan mengucapkan kutukan pada diri sendiri atau pada anak-anak Anda atau pada harta benda Anda karena Anda akan melakukannya pada saat doa diterima, dan doa Anda mungkin dikabulkan.\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Jabir (May Allah be pleased with him) reported:","language":"english"},{"text":"Jabir (ra dengan dia) melaporkan:","language":"bahasa"}]},{"index":"1498","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏ \"‏أقرب ما يكون العبد من ربه وهو ساجد، فأكثروا الدعاء‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"A slave becomes nearest to his Rubb when he is in prostration. So increase supplications in prostrations.\" [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Seorang hamba menjadi paling dekat dengan Rubb-nya ketika dia sedang sujud. Maka perbanyaklah doa dalam sujud.\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"1499","hadith_id":"riyadussalihin","text":[{"text":"وعنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏ \"‏يستجاب لأحدكم ما لم يعجل‏:‏ يقول‏:‏ قد دعوت ربي، فلم يستجب لي‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏ وفي رواية لمسلم لا يزال يستجاب للعبد ما لم يدعُ بإثم أو قطيعة رحم ما لم يستعجل‏.‏ قيل يا رسول الله ما الاستعجال‏؟‏ قال يقول قد دعوت وقد دعوت فلم أرَ من يستجب لي فيستحسر عند ذلك ويدع الدعاء‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ), \"The supplication of every one of you will be granted if he does not get impatient and say (for example): \u0027I supplicated my Rubb but my prayer has not been granted\u0027.\" [Al-Bukhari and Muslim]. The narration of Muslim is: \"The supplication of a slave continues to be granted as long as he does not supplicate for a sinful thing or for something that would cut off the ties of kinship and he does not grow impatient.\" It was said: \"O Messenger of Allah! What does growing impatient mean?\" He (ﷺ) said, \"It is one\u0027s saying: \u0027I supplicated again and again but I do not think that my prayer will be answered.\u0027 Then he becomes frustrated (in such circumstances) and gives up supplication altogether.\"","language":"english"},{"text":"Rasulullah (ﷺ), \"Doa masing-masing dari Anda akan dikabulkan jika dia tidak sabar dan mengatakan (misalnya): \u0027Saya telah berdoa Rubb saya tetapi doa saya belum dikabulkan\u0027.\" [Al-Bukhari dan Muslim] . Diriwayatkan Muslim adalah: \"Doa seorang budak terus dikabulkan selama dia tidak berdoa untuk sesuatu yang berdosa atau sesuatu yang akan memutuskan hubungan kekerabatan dan dia tidak menjadi tidak sabar.\" Dikatakan: \"Ya Rasulullah! Apa artinya menjadi tidak sabar?\" Dia (ﷺ) berkata, \"Ada yang mengatakan: \u0027Saya berdoa berulang-ulang tetapi saya tidak berpikir bahwa doa saya akan dijawab.\u0027 Kemudian dia menjadi frustrasi (dalam keadaan seperti itu) dan meninggalkan doa sama sekali.\"","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"1500","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي أمامة رضي الله عنه قال‏:‏ قيل لرسول الله صلى الله عليه وسلم‏:‏ أي الدعاء أسمع‏؟‏ قال‏:‏ ‏ \"‏جوف الليل الآخر ودبر الصلوات المكتوبات‏\"‏‏.‏ رواه الترمذي وقال حديث حسن‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) was asked: \"At what time does the supplication find the greatest response?\" He (ﷺ) replied, \"A supplication made during the middle of the last part of the night and after the conclusion of the obligatory prayers.\" [At-Tirmidhi].","language":"english"},{"text":"Rasulullah (ﷺ) ditanya: \"Kapan doa mendapatkan jawaban terbesar?\" Beliau (ﷺ) menjawab, \"Doa yang dilakukan di tengah-tengah bagian akhir malam dan setelah selesainya salat wajib.\" [At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Abu Umamah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Umamah r.a. melaporkan:","language":"bahasa"}]},{"index":"1501","hadith_id":"riyadussalihin","text":[{"text":"وعن عبادة بن الصامت رضي الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏\"‏ما على الأرض مسلم يدعو الله تعالى بدعوة إلا آتاه الله إياها، أو صرف عنه من السوء مثلها‏.‏ ما لم يدع بإثم، أو قطيعة رحم‏\"‏ فقال رجل من القوم‏:‏ إذًا نكثر قال‏:‏ ‏\"‏الله أكثر‏\"‏‏.‏ رواه الترمذي وقال حديث حسن صحيح‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"Whenever a Muslim supplicates Allah, He accepts his supplication or averts any similar kind of trouble from him until he prays for something sinful or something that may break the ties of kinship.\" Upon this someone of the Companions said: \"Then we shall supplicate plenty.\" The Messenger of Allah (ﷺ) said, \"Allah is more plentiful (in responding).\" [At- Tirmidhi].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Setiap kali seorang Muslim berdoa kepada Allah, Dia menerima doanya atau menghindari kesulitan yang serupa darinya sampai dia berdoa untuk sesuatu yang berdosa atau sesuatu yang dapat memutuskan tali persaudaraan.\" Setelah ini seseorang dari para sahabat berkata: \"Maka kita akan banyak berdoa.\" Rasulullah (ﷺ) berkata, \"Allah lebih banyak (dalam menanggapi).\" [At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"\u0027Ubadah bin As-Samit (May Allah be pleased with him) said:","language":"english"},{"text":"\u0027Ubadah bin As-Samit (semoga Allah meridhoinya) berkata:","language":"bahasa"}]},{"index":"1502","hadith_id":"riyadussalihin","text":[{"text":"وعن ابن عباس رضي الله عنهما أن رسول الله صلى الله عليه وسلم كان يقول عند الكرب‏:‏ ‏ \"‏لا إله إلا الله العظيم الحليم، لا إله إلا الله رب العرش العظيم، لا إله إلا الله رب السماوات ورب الأرض ورب العرش الكريم‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) used to say when he was in distress: \"La ilaha illallahul-Azimul-Halim. La ilaha illallahu Rabbul-\u0027Arshil-\u0027Azim. La ilaha illallahu Rabbus-samawati, wa Rabbul-ardi, wa Rabbul-\u0027Arshil- Karim. (None has the right to be worshipped but Allah the Incomparably Great, the Compassionate. None has the right to be worshipped but Allah the Rubb of the Mighty Throne. None has the right to be worshipped but Allah the Rubb of the heavens, the Rubb of the earth, and the Rubb of the Honourable Throne).\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) biasa mengatakan ketika dia dalam kesulitan: \"La ilaha illallahul-Azimul-Halim. La ilaha illallahu Rabbul-\u0027Arshil-\u0027Azim. La ilaha illallahu Rabbus-samawati, wa Rabbul-ardi, wa Rabbul -\u0027Arshil- Karim. (Tidak ada yang berhak disembah kecuali Allah Yang Maha Agung lagi Maha Penyayang. Tidak ada yang berhak disembah selain Allah Pengurang Arsy yang Perkasa. Tidak ada yang berhak disembah selain Allah Tuhan Yang Maha Esa. langit, Pusaka bumi, dan Pusaka Arsy Yang Mulia).” [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Ibn \u0027Abbas (May Allah be pleased with them) said:","language":"english"},{"text":"Ibn \u0027Abbas (semoga Allah meridhoi mereka) berkata:","language":"bahasa"}]},{"index":"1503","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي محمد عبد الرحمن بن أبي بكر الصديق رضي الله عنهما أن أصحاب الصُّفة كانوا أناسًا فقراء، وأن النبي صلى الله عليه وسلم قال مرة‏:‏ ‏ \"‏من كان عنده طعام اثنين، فليذهب بثالث، ومن كان عنده طعام أربعة، فليذهب بخامس بسادس‏\"‏ أو كما قال‏:‏ وأن أبا بكر رضي الله عنه جاء بثلاثة، وانطلق النبي صلى الله عليه وسلم بعشرة، وأن أبا بكر تعشى عند النبي صلى الله عليه وسلم ثم لبث حتى صلى العشاء، ثم رجع، فجاء بعد ما مضى من الليل ما شاء الله‏.‏ قالت له امرأته‏:‏ ما حبسك عن أضيافك‏؟‏ قال‏:‏ أو ما عشيتهم‏؟‏ قالت‏:‏ أبوا حتى تجيء وقد عرضوا عليهم قال‏:‏ فذهبت أنا، فاختبأت، فقال‏:‏ يا غُنثر، فجدع وسب، وقال‏:‏ كلوا لا هنيئًا، والله لا أطعمه أبدًا، قال‏:‏ وايم الله ما كنا نأخذ من لقمة إلا ربا من أسفلها أكثر منها حتى شبعوا، وصارت أكثر مما كانت قبل ذلك، فنظر إليها أبو بكر فقال لامرأته‏:‏ يا أخت بني فراس ما هذا‏؟‏ قالت‏:‏ لا وقرة عيني لهي الآن أكثر منها قبل ذلك بثلاث مرات‏!‏ فأكل منها أبو بكر وقال‏:‏ إنما كان ذلك من الشيطان، يعني يمينه‏.‏ ثم أكل منها لقمة، ثم حملها إلى النبي صلى الله عليه وسلم فأصبحت عنده، وكان بيننا وبين قوم عهد، فمضى الأجل، فتفرقنا اثني عشر رجلا، مع كل رجل منهم أناس، الله أعلم كم مع كل رجل، فأكلوا منها أجمعون‏.‏ وفي رواية‏:‏ فحلف أبو بكر لا يطعمه، فحلفت المرأة لا تطعمه، فحلف الضيف -أو الأضياف- أن لا يطعمه، أو يطعموه حتى يطعمه، فقال أبو بكر‏:‏ هذه من الشيطان‏!‏ فدعا بالطعام، فأكل وأكلوا، فجعلوا لا يرفعون لقمة إلا ربت من أسفلها أكثر منها، فقال‏:‏ يا أخت بني فراس، ما هذا‏؟‏ فقالت‏:‏ وقرة عيني إنها الآن لأكثر منها قبل أن نأكل، فأكلوا، وبعث بها إلى النبي صلى الله عليه وسلم فذكر أنه أكل منها‏.‏ وفي رواية‏:‏ إن أبا بكر قال لعبد الرحمن‏:‏ دونك أضيافك، فإني منطلق إلى النبي صلى الله عليه وسلم، فافرغ من قراهم قبل أن أجيء، فانطلق عبد الرحمن، فأتاهم بما عنده، فقال‏:‏ اطعموا، فقالوا‏:‏ أين رب منزلنا‏؟‏ قال اطعموا، قالوا‏:‏ ما نحن بآكلين حتى يجيء رب منزلنا، قال‏:‏ اقبلوا عنا قراكم، فإنه إن جاء ولم تطعموا، لنلقين منه، فأبوا، فعرفت أنه يجد علي، فلما جاء تنحيت عنه، فقال‏:‏ ما صنعتم‏؟‏ فأخبروه، فقال‏:‏ يا عبد الرحمن فسكت، ثم قال‏:‏ يا عبد الرحمن، فسكت، فقال‏:‏ يا غُنثر أقسمت عليك إن كنت تسمع صوتي لما جئت‏!‏ فخرجت، فقلت‏:‏ سل أضيافك، فقالوا‏:‏ صدق، أتانا به‏.‏ فقال‏:‏ إنما انتظرتموني والله لا أطعمه الليلة، فقال الآخرون‏:‏ والله لا نطعمه حتى تطعمه، فقال‏:‏ ويلكم ما لكم لا تقبلون عنا قراكم‏؟‏ هات طعامك، فجاء به، فوضع يده، فقال‏:‏ بسم الله‏.‏ الأولى من الشيطان، فأكل وأكلوا‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Companions of As-Suffah were poor people. The Prophet (ﷺ) said, \"Whoever has food enough for two people, should take a third one (from among them), and whoever has food enough for four persons, should take a fifth or sixth (or said something similar).\" Abu Bakr (May Allah be pleased with him) took three people with him while Messenger of Allah (ﷺ) took ten. Abu Bakr (May Allah be pleased with him) took his supper with the Prophet (ﷺ) and stayed there till he offered the \u0027Isha\u0027 prayers. After a part of the night had passed, he returned to his house. His wife said to him: \"What has detained you from your guests?\" He said: \"Have you not served supper to them?\" She said: \"They refused to take supper until you come.\" [Abdur-Rahman (Abu Bakr\u0027s son) or the servants] presented the meal to them but they refused to eat. I (the narrator) hid myself out of fear. Abu Bakr (May Allah be pleased with him) (my father) rebuked me. Then he said to them: \"Please eat. By Allah! I will never eat the meal.\" \u0027Abdur-Rahman added: Whenever we took a morsel of the meal, the meal grew from underneath more than that morsel we had till everybody ate to his satisfaction; yet the remaining food was more than what was in the beginning. On seeing this, Abu Bakr (May Allah be pleased with him) called his wife and said: \"O sister of Banu Firas! What is this?\" She said: \"O pleasure of my eyes! The food has increased thrice in quantity.\" Then Abu Bakr (May Allah be pleased with him) started eating. He said: \"My oath not to take the meal was because of Satan.\" He took a morsel handful from it and carried the rest to the Prophet (ﷺ). That food remained with him. In those days there was a treaty between us and the pagans and when the period of that treaty elapsed, he (ﷺ) divided us into twelve groups and every group was headed by a man. Allah knows how many men were under the command of each leader. Anyhow, all of them ate of that meal. [Al-Bukhari and Muslim]. There are some more narrations in both Al-Bukhari and Muslim with very minor differences in wordings and in details.","language":"english"},{"text":"Para sahabat As-Suffah adalah orang-orang miskin. Nabi (ﷺ) bersabda, \"Barangsiapa yang memiliki cukup makanan untuk dua orang, maka ambillah sepertiga (dari antara mereka), dan barang siapa yang memiliki cukup makanan untuk empat orang, maka ambillah seperlima atau keenam (atau mengatakan yang serupa).\" Abu Bakar r.a. membawa tiga orang bersamanya sementara Rasulullah (ﷺ) membawa sepuluh orang. Abu Bakar (ra dengan dia) mengambil makan malamnya dengan Nabi (ﷺ) dan tinggal di sana sampai dia melakukan salat \u0027Isya\u0027. Setelah sebagian malam berlalu, dia kembali ke rumahnya. Istrinya berkata kepadanya: \"Apa yang menahanmu dari tamumu?\" Dia berkata: \"Apakah kamu tidak menyajikan makan malam untuk mereka?\" Dia berkata: \"Mereka menolak untuk makan malam sampai Anda datang.\" [Abdur-Rahman (Abu Bakar\u0027 putra) atau para pelayan] menyajikan makanan kepada mereka tetapi mereka menolak untuk makan. Saya (narator) menyembunyikan diri karena takut. Abu Bakar (semoga Allah meridhoinya) (ayahku) menegurku. Kemudian dia berkata kepada mereka: \"Silakan makan. Demi Allah! Saya tidak akan pernah memakannya.\" \u0027Abdur-Rahman menambahkan: Setiap kali kami mengambil sepotong makanan, makanan tumbuh dari bawah lebih banyak dari yang kami miliki sampai semua orang makan untuk kepuasannya; namun sisa makanan lebih banyak dari yang ada pada awalnya. Melihat ini, Abu Bakar (semoga Allah meridhoinya) memanggil istrinya dan berkata: \"Wahai saudara perempuan Bani Firas! Apa ini?\" Dia berkata: \"O kesenangan mataku! Makanan telah meningkat tiga kali lipat.\" Kemudian Abu Bakar (ra dengan dia) mulai makan. Dia berkata: \"Sumpah saya untuk tidak makan adalah karena setan.\" Dia mengambil segenggam penuh darinya dan membawa sisanya kepada Nabi (ﷺ). Makanan itu tetap bersamanya. Pada hari-hari itu ada perjanjian antara kami dan orang-orang kafir dan ketika periode perjanjian itu berlalu, dia (ﷺ) membagi kami menjadi dua belas kelompok dan setiap kelompok dipimpin oleh seorang pria. Allah mengetahui berapa banyak orang yang berada di bawah komando setiap pemimpin. Bagaimanapun, mereka semua memakan makanan itu. [Al-Bukhari dan Muslim] . Ada beberapa riwayat lagi baik di Al-Bukhari dan Muslim dengan perbedaan yang sangat kecil dalam kata-kata dan detail.","language":"bahasa"}],"narrated":[{"text":"\u0027Abdur-Rahman bin Abu Bakr (May Allah be pleased with them) reported:","language":"english"},{"text":"\u0027Abdur-Rahman bin Abu Bakar (semoga Allah meridhoi mereka) melaporkan:","language":"bahasa"}]},{"index":"1504","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي هريرة رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏\"‏لقد كان فيما قبلكم من الأمم ناس محدثون، فإن يك في أمتي أحد، فإنه عمر‏\"‏ ‏(‏‏(‏رواه البخاري، ورواه مسلم من رواية عائشة، وفي روايتهما قال ابن وهب‏:‏ ‏\"‏محدثون‏\"‏ أي‏:‏ ملهمون‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"There were Muhaddithun (the recipients of Divine inspiration) among the nations before you. If there is any of such Muhaddith among my followers, he must be \u0027Umar.\" [Al- Bukhari]. In Muslim, this Hadith is narrated by \u0027Aishah (May Allah be pleased with her), and in both these narrations Ibn Wahb has said that the meaning of Muhaddithun is recipients of Divine inspiration.","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Ada Muhaddithun (penerima inspirasi Ilahi) di antara bangsa-bangsa sebelum Anda. Jika ada Muhaddith seperti itu di antara pengikut saya, dia pasti \u0027Umar.\" [Al-Bukhari] . Dalam Muslim, hadits ini diriwayatkan oleh \u0027Aisyah radhiyallahu \u0027anhu, dan dalam kedua riwayat tersebut Ibnu Wahb mengatakan bahwa yang dimaksud dengan Muhaddithun adalah penerima ilham.","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"1505","hadith_id":"riyadussalihin","text":[{"text":"وعن جابر بن سَمُرة، رضي الله عنهما، قال‏:‏ شكا أهل الكوفة سعدًا، يعني‏:‏ ابن أبي وقاص، رضي الله عنه الله عنه، إلى عمر بن الخطاب، رضي الله عنه، فعزله واستعمل عليهم عمارًا، فشكوا حتى ذكروا أنه لا يحسن يصلي، فأرسل إليه، فقال‏:‏ يا أبا إسحاق، إن هؤلاء يزعمون أنك لا تحسن تصلي، فقال‏:‏ أما أنا والله فإني كنت أصلي بهم رسول الله صلى الله عليه وسلم، لا أخرم عنها أصلي صلاة العشاء فأركد في الأوليين، وأخف في الأخريين، قال‏:‏ ذلك الظن بك يا أبا إسحاق، وأرسل معه رجلا -أو رجالا- إلى الكوفة يسأل عنه أهل الكوفة، فلم يدع مسجدًا إلا سأل عنه، ويثنون معروفًا، حتى دخل مسجدًا لبني عبس، فقام رجل منهم، يقال له أسامة بن قتادة، يكنى أبا سعدة‏.‏ فقال‏:‏ أما إذ نشدتنا فإن سعدًا كان لا يسير بالسرية ولا يقسم بالسوية، ولا يعدل في القضية، قال سعد‏:‏ أم والله لأدعون بثلاث‏:‏ اللهم إن كان عبدك هذا كاذبًا، قام رياء، وسمعة، فأطل عمره، وأطل فقره، وعرضه للفتن‏.‏ وكان بعد ذلك إذا سئل يقول‏:‏ شيخ كبير مفتون، أصابتني دعوة سعد‏.‏ قال عبد الملك بن عمير الرواي عن جابر بن سمرة‏:‏ فأنا رأيته بعد قد سقط حاجباه على عينيه من الكبر، وإنه ليتعرض للجواري في الطرق فيغمزهن‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The inhabitants of Kufah complained to \u0027Umar (May Allah be pleased with him) against Sa\u0027d bin Abu Waqqas (May Allah be pleased with him) and \u0027Umar (May Allah be pleased with him) appointed \u0027Ammar (May Allah be pleased with him) as Governor of Kufah in his place. Their complaint was that he did not even conduct As-Salat (the prayers) properly. \u0027Umar (May Allah be pleased with him) sent for Sa\u0027d and said to him: \"O Abu Ishaq, the people claim that you do not offer the Salat properly.\" Sa\u0027d replied: \"By Allah! I observe Salat according to the Salat of the Messenger of Allah (ﷺ), and I make no decrease in it. I prolong Qiyam (standing) in the first two Rak\u0027ah in Maghrib and \u0027Isha\u0027 prayers and shorten in the last ones.\" \u0027Umar (May Allah be pleased with him) said: \"This is what I thought of you, O Abu Ishaq!\" Then he sent with him a man (or some men) to Kufah to investigate the matter about him (from the people of Kufah). The inquiry was conducted in every mosque and all the people in these mosques praised him; but in the mosque of the Banu \u0027Abs, a man, with the name of Usamah bin Qatadah and surname Abu Sa\u0027dah, stood up and said, \"Sa\u0027d bin Abu Waqqas did not participate in Jihad and he did not distribute the spoils equitably and did not judge justly.\" On this Sa\u0027d said: \"I shall make three supplications in respect of him: O Allah! If this slave of Yours is a liar and seeker of notoriety, please prolong his life and lengthen his period of adversity and afflict him with trials.\" (And so did it happen.) Thereafter, when the man was asked about his condition he would say, \"I am an old man afflicted with trials and overtaken by the curses of Sa\u0027d.\" \u0027Abdul-Malik bin \u0027Umair (a subnarrator) said: I saw this man with eyebrows hung over his eyes as a result of his old age and he walked aimlessly, following young girls and winking at them. [Al-Bukhari and Muslim].","language":"english"},{"text":"Penduduk Kufah mengadukan \u0027Umar (ra dengan dia) terhadap Sa\u0027d bin Abu Waqqas (ra dengan dia) dan \u0027Umar (ra dengan dia) menunjuk \u0027Ammar (ra dengan dia) bersamanya) sebagai Gubernur Kufah menggantikannya. Keluhan mereka adalah bahwa dia bahkan tidak melakukan As-Salat dengan benar. \u0027Umar (semoga Allah meridhoinya) memanggil Sa\u0027d dan berkata kepadanya: \"Wahai Abu Ishaq, orang-orang mengatakan bahwa kamu tidak melakukan salat dengan benar.\" Sa\u0027d menjawab: \"Demi Allah! Aku menjalankan shalat sesuai dengan shalat Rasulullah (ﷺ), dan aku tidak menguranginya. Aku memperpanjang Qiyam (berdiri) di dua rakaat pertama di Maghrib dan \u0027 Sholat Isya\u0027 dan salat di waktu-waktu terakhir.” \u0027Umar (semoga Allah meridhoinya) berkata: \" Inilah yang aku pikirkan tentangmu, wahai Abu Ishaq!” Kemudian dia mengirim bersamanya seorang pria (atau beberapa pria) ke Kufah untuk menyelidiki masalah tentang dia (dari orang-orang Kufah). Penyelidikan dilakukan di setiap masjid dan semua tempat. orang-orang di masjid-masjid ini memujinya; tetapi di masjid Bani \u0027Abs, seorang pria, dengan nama Usamah bin Qatadah dan nama belakang Abu Sa\u0027dah, berdiri dan berkata, \"Sa\u0027d bin Abu Waqqas tidak ikut dalam Jihad dan dia tidak membagikan harta rampasan secara adil dan tidak menghakimi dengan adil.\" Tentang ini Sa\u0027d berkata: \"Aku akan memanjatkan tiga doa untuknya: Ya Allah! Jika hamba-Mu ini pembohong dan pencari ketenaran, panjangkan umurnya dan perpanjang masa kesulitannya dan beri dia cobaan.” (Dan begitulah yang terjadi.) Setelah itu, ketika pria itu ditanya tentang kondisinya, dia akan menjawab. mengatakan, \u0027Abdul-Malik bin \u0027Umair (seorang subnarator) berkata: Saya melihat pria ini dengan alis menggantung di atas matanya karena usia tuanya dan dia berjalan tanpa tujuan, mengikuti gadis-gadis muda dan mengedipkan mata pada mereka. [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Jabir bin Samurah (May Allah be pleased with them) said:","language":"english"},{"text":"Jabir bin Samurah r.a. berkata:","language":"bahasa"}]},{"index":"1506","hadith_id":"riyadussalihin","text":[{"text":"وعن عروة بن الزبير أن سعيد بن زيد بن عمرو بن نفيل، رضي الله عنه الله عنه خاصمته أروى بنت أوس إلى مروْان بن الحكم، وادعت أنه أخذ شيئًا من أرضها، فقال سعيد‏:‏ أنا كنت آخذ من أرضها شيئًا بعد الذي سمعت من رسول الله صلى الله عليه وسلم‏!‏‏؟‏ قال‏:‏ ماذا سمعت من رسول الله صلى الله عليه وسلم‏؟‏ قال‏:‏ سمعت رسول الله صلى الله عليه وسلم يقول‏:‏ ‏\"‏من أخذ شبرًا من الأرض ظلمًا، طوقه إلى سبعين أرضين‏\"‏ فقال له مروْان‏:‏ لا أسألك بينة بعد هذا، فقال سعيد‏:‏ اللهم إن كانت كاذبة، فأعمِ بصرها، واقتلها في أرضها، فقال‏:‏ فما ماتت حتى ذهب بصرها وبينما هي تمشي في أرضها إذ وقعت في حفرة فماتت‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏ وفي رواية لمسلم عن محمد بن زيد بن عبد الله بن عمر بمعناه وأنه رآها عمياء تلتمس الجدر تقول‏:‏ أصابتني دعوة سعيد، وأنها مرت على بئر في الدار التي خاصمته فيها، فوقعت فيها فكانت قبرها‏.‏","language":"arabic"},{"text":"Arwa bint Aus brought a suit against Sa\u0027id bin Zaid bin \u0027Amr bin Nufail (May Allah be pleased with him). She complained to Marwan bin Al-Hakam that he had wrongfully taken possession of a portion of her land. Sa\u0027id said: \"How can I take a portion out of her land while I have heard a denunciation from the Messenger of Allah (ﷺ).\" Marwan asked him: \"What did you hear from the Messenger of Allah?\" He said, \"I heard the Messenger of Allah (ﷺ) saying, \u0027He who takes a span of land unjustly will be made to wear seven earths round his neck on the Day of Ressurection\u0027.\" Marwan said to him: \"I don\u0027t seek proof from you after this.\" Sa\u0027id supplicated: \"O Allah! If she is a liar, deprive her of her eye sight and cause her to die in her land.\" \u0027Urwah said: \"She did not die till she became blind. While she was walking in her land (concerning which the dispute arose) she fell down into a pit and died.\" [Al-Bukhari and Muslim]. In another narration of Muslim, Muhammad bin Zaid bin \u0027Abdullah bin \u0027Umar said that he had seen Arwa blind, feeling for on the walls with her hand and saying: \"I am ruined by the curse of Sa\u0027id.\" Later she fell in a well in the same disputed land and died.","language":"english"},{"text":"Arwa binti Aus mengajukan gugatan terhadap Sa\u0027id bin Zaid bin \u0027Amr bin Nufail ra. Dia mengadu kepada Marwan bin Al-Hakam bahwa Marwan bin Al-Hakam telah salah mengambil sebagian dari tanahnya. Sa\u0027id berkata: \"Bagaimana saya bisa mengambil sebagian dari tanahnya sementara saya telah mendengar celaan dari Rasulullah (ﷺ).\" Marwan bertanya kepadanya: \"Apa yang kamu dengar dari Rasulullah?\" Dia berkata, \"Saya mendengar Rasulullah (ﷺ) berkata, \u0027Dia yang mengambil sebidang tanah secara tidak adil akan dikenakan tujuh bumi di lehernya pada Hari Kebangkitan\u0027.\" Marwan berkata kepadanya: \"Saya tidak mencari bukti dari Anda setelah ini.\" Sa\u0027id berdoa: \"Ya Allah! Jika dia pembohong, hilangkan penglihatannya dan matikan dia di tanahnya.\" \u0027Urwah berkata: \" Dia tidak mati sampai dia menjadi buta. Ketika dia sedang berjalan di tanahnya (mengenai perselisihan yang muncul) dia jatuh ke dalam lubang dan mati.\" [Al-Bukhari dan Muslim] . Dalam riwayat Muslim lainnya, Muhammad bin Zaid bin \u0027Abdullah bin \u0027Umar berkata bahwa ia telah melihat Arwa buta, meraba dinding dengan tangannya dan berkata: \"Aku hancur oleh kutukan Sa\u0027id.\" Kemudian dia jatuh di sumur di tanah sengketa yang sama dan meninggal.","language":"bahasa"}],"narrated":[{"text":"\u0027Urwah bin Az-Zubair (May Allah be pleased with him) reported:","language":"english"},{"text":"\u0027Urwah bin Az-Zubair r.a. melaporkan:","language":"bahasa"}]},{"index":"1507","hadith_id":"riyadussalihin","text":[{"text":"وعن جابر بن عبد الله رضي الله عنه الله عنهما قال‏:‏ لما حضرت أحد دعاني أبي من الليل فقال‏:‏ ما رآني إلا مقتولا في أول من يقتل من أصحاب النبي صلى الله عليه وسلم، وإني لا أترك بعدي أعز علي منك غير نفس رسول الله صلى الله عليه وسلم، وإن علي دينا فاقضِ، واستوصِ بأخواتك خيرًا، فأصبحنا، فكان أول قتيل، ودفنت معه آخر في قبره، ثم لم تطب نفسي أن أتركه مع آخر، فاستخرجته بعد ستة أشهر، فإذا هو كيوم وضعته غير أذنه، فجعلته في قبر على حدة‏\"‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","language":"arabic"},{"text":"My father called me on the evening before (the battle of) Uhud and said: \"I perceive that I shall be among the first from among the Companions of the Prophet (ﷺ) to be martyred, and after him you are the dearest to me. I am under the burden of debt. Pay it and treat your sisters well.\" Next morning he was among the first to be killed, so I buried him along with another in the same grave. Thereafter, I did not like that I should leave him with another in the grave. So I dug up his corpse after six months and he was in the same condition in which he was on the day when I buried him, except that there was a scratch on his ear. Then I buried him in a separate grave. [Al- Bukhari].","language":"english"},{"text":"Ayahku memanggilku pada malam sebelum (perang) Uhud dan berkata: \"Aku merasa bahwa aku akan menjadi salah satu dari para sahabat Nabi (ﷺ) yang pertama yang mati syahid, dan setelahnya kamu adalah orang yang paling aku sayangi. . Saya dibebani hutang. Bayar dan perlakukan saudara perempuan Anda dengan baik.\" Keesokan paginya dia termasuk yang pertama dibunuh, jadi aku menguburnya bersama yang lain di kuburan yang sama. Setelah itu, saya tidak suka bahwa saya harus meninggalkan dia dengan yang lain di kuburan. Maka saya gali mayatnya setelah enam bulan dan dia dalam kondisi yang sama seperti pada hari saya menguburkannya, kecuali ada goresan di telinganya. Lalu aku menguburkannya di kuburan terpisah. [Al-Bukhari] .","language":"bahasa"}],"narrated":[{"text":"Jabir bin \u0027Abdullah (May Allah be pleased with them) said:","language":"english"},{"text":"Jabir bin \u0027Abdullah (semoga Allah meridhoi mereka) berkata:","language":"bahasa"}]},{"index":"1508","hadith_id":"riyadussalihin","text":[{"text":"وعن أنس رضي الله عنه أن رجلين من أصحاب النبي صلى الله عليه وسلم خرجا من عند النبي صلى الله عليه وسلم، في ليلة مظلمة ومعهما مثل المصباحين بين أيديهما، فلما افترقا، صار مع كل واحد منهما واحد حتى أتى أهله‏.‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏ من طرق، وفي بعضها أن الرجلين أسيد بن حضير، وعباد بن بشر رضي الله عنهما‏.‏","language":"arabic"},{"text":"Two Companions of the Prophet (ﷺ) left his home in a very dark night with something like lights in front of them; when they separated, each of them had one light in front of him till they arrived home. [Al- Bukhari]. Other narrations reported in Al-Bukhari say that the two men were Usaid bin Hudhair and \u0027Abbad bin Bishr (May Allah be pleased with them).","language":"english"},{"text":"Dua sahabat Nabi (ﷺ) meninggalkan rumahnya di malam yang sangat gelap dengan sesuatu seperti lampu di depan mereka; ketika mereka berpisah, masing-masing dari mereka memiliki satu lampu di depannya sampai mereka tiba di rumah. [Al-Bukhari] . Riwayat lain yang dilaporkan dalam Al-Bukhari mengatakan bahwa kedua pria itu adalah Usaid bin Hudhair dan \u0027Abbad bin Bishr (Semoga Allah meridhoi mereka).","language":"bahasa"}],"narrated":[{"text":"Anas (May Allah be pleased with him) reported:","language":"english"},{"text":"Anas (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"1509","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي هريرة، رضي الله عنه ، قال‏:‏ بعث رسول الله صلى الله عليه وسلم عشرة رهط عينًا سرية، وأمَّر عليهم عاصم بن ثابت الأنصاري، رضي الله عنه، فانطلقوا حتى إذا كانوا بالهدأة، بين عسفان ومكة، ذكروا لحي من هذيل يقال لهم‏:‏ بنو لحيان، فنفروا لهم بقريب من مائة رجل رام، فاقتصوا آثارهم، فلما أحس بهم عاصم وأصحابه، لجئوا إلى موضع فأحاط بهم القوم، فقالوا‏:‏ انزلوا، فأعطوا بأيديكم ولكم العهد والميثاق أن لا نقتل منكم أحدًا، فقال عاصم بن ثابت‏:‏ أيها القوم أما أنا، فلا أنزل على ذمة كافر‏:‏ اللهم أخبر عنا نبيك صلى الله عليه وسلم، فرموهم بالنبل فقتلوا عاصمًا، ونزل إليهم ثلاثة نفر على العهد والميثاق، منهم خُبيب، وزيد بن الدِّثِنَّة ورجل آخر‏.‏ فلما استمكنوا منهم أطلقوا أوتار قسيهم، فربطوهم بها، قال الرجل الثالث‏:‏ هذا أول الغدر والله لا أصحبكم إن لي بهؤلاء أسوة، يريد القتلى، فجروه وعالجوه، فأبى أن يصحبهم، فقتلوه، وانطلقوا بخُبيب، وزيد بن الدِّثِنَّة، حتى باعوهما بمكة بعد وقعة بدر، فابتاع بنو الحارث بن عامر بن نوفل بن عبد مناف خُبيبًا، وكان خُبيب هو قتل الحارث يوم بدر، فلبث خُبيب عندهم أسيرًا حتى أجمعوا على قتله، فاستعار من بعض بنات الحارث موسى يستحد بها فأعارته، فدرج بُنيٌّ لها وهي غافلة حتى أتاه، فوجدته مجلسه على فخذه الموسى بيده، ففزعت فزعة عرفها خُبيب، فقال أتخشين أن أقتله ماكنت لأفعل ذلك قالت‏:‏ والله ما رأيت أسيرا خيرا من خُبيب فوالله لقد وجدته يومًا يأكل قطفًا من عنب في يده وإنه لموثق بالحديد وما بمكة من ثمرة، وكانت تقول‏:‏ إنه لرزق رزقه الله خُبيبًا، فلما خرجوا به من الحرم ليقتلوه في الحل، قال لهم خبيب‏:‏ دعوني أصلي ركعتين، فتركوه، فركع ركعتين، فقال‏:‏ والله لولا أن تحسبوا أن ما بي جزع لزدت‏.‏ اللهم أحصهم عددًا، واقتلهم بددًا، ولا تُبقِ منهم أحدًا، وقال‏:‏ فلست أبالي حين أُقتل مســــلمًا**على أي جنب كان لله مصرعــي وذلك في ذات الإله وإن يشأ**يبارك على أوصـــال شلو ممزع وكان خُبيب هو سَنَّ لكل مسلم قُتل صبرًا الصلاة، وأخبر -يعني النبي صلى الله عليه وسلم - أصحابه يوم أصيبوا خبرهم، وبعث ناسٌ من قريش إلى عاصم بن ثابت حين حدثوا أنه قُتل أن يؤتوا بشيء منه يُعرف، وكان قتل رجلا من عظمائهم، فبعث الله لعاصم مثل الظلة من الدبر فحمته من رسلهم، فلم يقدروا أن يقطعوا منه شيئًا‏.‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏ قوله‏:‏ الهدأة‏:‏ موضع، والظلة‏:‏ السحاب، الدبر‏:‏ النحل‏.‏ وقوله‏:‏ ‏ \"‏اقتلهم بَِددًا‏\"‏ بكسر الباء وفتحها، فمن كسر، قال‏:‏ هو جمع بدة بكسر الباء، وهو النصيب، ومعناه‏:‏ اقتلهم حصصًا منقسمة لكل واحد منهم نصيب، ومن فتح ، قال معناه‏:‏ متفرقين في القتل واحدًا بعد واحد من التبديد‏.‏ وفي الباب أحاديثُ كثيرة صحيحة سبقت في مواضعها من هذا الكتاب، منها حديث الغلام الذي كان يأتي الراهب والساحر، ومنها حديث جُريج، وحديث أصحاب الغار الذين أطبقت عليهم الصخرة، وحديث الرجل الذي سمع صوتًا في السحاب يقول‏:‏ اسقِ حديقة فلان، وغير ذلك‏.‏ والدلائل في الباب كثيرة مشهورة، وبالله التوفيق‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) sent an espionage mission of ten men under the leadership of \u0027Asim bin Thabit Al-Ansari (May Allah be pleased with him). They proceeded till they reached Al-Had\u0027ah, a place between \u0027Usfan and Makkah and the news of their arrival reached a section of the tribe of Hudhail, called Banu Lihyan. About one hundred men, who were all archers, hurried to follow their tracks. When \u0027A sim and his companions came to know of their pursuers, they took refuge in a safe place. The infidels encircled them and said to them: \"Come down and surrender, and we promise and guarantee you that we will not kill anyone of you.\" \u0027Asim bin Thabit (May Allah be pleased with him) said: \"By Allah! I will not come down to be under the protection of disbelievers. O Allah! convey this news to our Prophet (ﷺ).\" Then the infidels shot arrows at them till they killed \u0027Asim. Three men came down relying on their promise and covenant. They were Khubaib, Zaid bin Ad-Dathinah and another man. When the disbelievers captured them, they tied them up with the strings of their bows. The third of the captives said: \"This is the beginning of first betrayal. By Allah! I will not go with you. I have a good example in these (martyrs).\" So they dragged him and tried to compel him to accompany them, but he refused. At last they killed him. They took Khubaib and Zaid bin Ad- Dathina with them and sold them as slaves in Makkah. This incident took place after the battle of Badr. Khubaib was bought by the sons of Al-Harith bin \u0027Amir bin Naufal bin \u0027Abd Manaf. It was Khubaib who had killed Al-Harith in the battle of Badr. Khubaib remained a prisoner with those people for a few days till the sons of Al-Harith resolved to kill him. When Khubaib (May Allah be pleased with him) got wind of this plot, he borrowed a razor from one of Al- Harith\u0027s daughters in order to remove his pubic hair. Her little son crawled towards Khubaib because of her carelessness. Later on, she saw her son on his thigh and the razor was in his hand. She got scared so much that Khubaib noticed the agitation on her face and said: \"Are you afraid that I will kill him? No, I will never do that.\" She later remarked (after Al-Khubaib got martyred): \"By Allah! I never saw a prisoner better than Khubaib.\" She added: \"By Allah! I saw him once eating of a bunch of grapes in his hand while he was chained and there was no such fruit at that time in Makkah. Probably it was a boon which Allah bestowed upon Khubaib.\" When they took him out of the Haram of Makkah to kill him outside its boundaries, Khubaib requested them to let him offer two Rak\u0027ah of voluntary prayer. They allowed him and he offered two Rak\u0027ah prayer. Then he said: \"Had I not apprehended that you would think that I was afraid of death, I would have prolonged the prayer. O Allah! Count their number; slay them one by one and spare not one of them.\" He then recited these poetic verses: \u0027I do not care how they kill me as long as I get martyred in the Cause of Allah as a Muslim. I received my death for Allah\u0027s sake. If Allah so desires, He will bless, the amputated limbs of the torn body.\u0027 Then the son of Al-Harith killed him. It was Khubaib who set the tradition for any Muslim sentenced to death in captivity to offer two Rak\u0027ah of voluntary prayer. On that day the Messenger of Allah (ﷺ) informed his Companions of the martyrdom of Khubaib. Later on, when some disbelievers from Quraish were informed that \u0027Asim had been martyred, they sent some people to fetch a significant part of his body to ascertain his death. (This was because) \u0027Asim had killed one of their chiefs. So Allah sent a swarm of wasps, resembling a shady cloud, to hover over the body of \u0027Asim and to shield him from their messengers, and thus they could not cut off anything from his body. [Al- Bukhari].","language":"english"},{"text":"Rasulullah (ﷺ) mengirim misi spionase sepuluh orang di bawah kepemimpinan \u0027Asim bin Tsabit Al-Ansari (Semoga Allah senang dengan dia). Mereka melanjutkan perjalanan sampai mereka mencapai Al-Had\u0027ah, sebuah tempat antara \u0027Usfan dan Mekah dan berita kedatangan mereka mencapai bagian dari suku Hudhail, yang disebut Bani Lihyan. Sekitar seratus orang, yang semuanya pemanah, bergegas mengikuti jejak mereka. Ketika \u0027A sim dan teman-temannya mengetahui pengejar mereka, mereka berlindung di tempat yang aman. Orang-orang kafir mengepung mereka dan berkata kepada mereka: \"Turun dan menyerah, dan kami berjanji dan menjamin Anda bahwa kami tidak akan membunuh siapa pun dari Anda.\" \u0027Asim bin Tsabit (ra dengan dia) berkata: \"Demi Allah! Saya tidak akan turun untuk berada di bawah perlindungan orang-orang kafir. Ya Allah! sampaikan berita ini kepada Nabi kami (ﷺ). Kemudian orang-orang kafir itu menembakkan panah ke arah mereka sampai mereka membunuh \u0027Asim. Tiga orang turun dengan mengandalkan janji dan perjanjian mereka. Mereka adalah Khubaib, Zaid bin Ad-Dathinah dan seorang pria lainnya. Ketika orang-orang kafir menangkap mereka, mereka mengikat mereka dengan tali. tali busur mereka. Yang ketiga dari tawanan berkata: \"Ini adalah awal dari pengkhianatan pertama. Demi Allah! Aku tidak akan pergi denganmu. Saya memiliki contoh yang baik dalam (para syuhada) ini.\" Jadi mereka menyeretnya dan mencoba memaksanya untuk menemani mereka, tetapi dia menolak. Akhirnya mereka membunuhnya. Mereka membawa Khubaib dan Zaid bin Ad-Dathina bersama mereka dan menjualnya sebagai budak di Mekah.Kejadian ini terjadi setelah perang Badar. Zaid bin Ad-Dathinah dan seorang pria lainnya. Ketika orang-orang kafir menangkap mereka, mereka mengikat mereka dengan tali busur mereka. Ketiga tawanan berkata: \"Ini adalah awal dari pengkhianatan pertama. Demi Allah! Saya tidak akan pergi dengan Anda. Saya memiliki contoh yang baik di (martir) ini.\" Jadi mereka menyeretnya dan mencoba memaksanya untuk menemani mereka, tetapi dia menolak. Akhirnya mereka membunuhnya. Mereka membawa Khubaib dan Zaid bin Ad-Dathina bersama mereka dan menjual mereka sebagai budak di Mekah. Peristiwa ini terjadi setelah perang Badar. Zaid bin Ad-Dathinah dan seorang pria lainnya. Ketika orang-orang kafir menangkap mereka, mereka mengikat mereka dengan tali busur mereka. Ketiga tawanan berkata: \"Ini adalah awal dari pengkhianatan pertama. Demi Allah! Saya tidak akan pergi dengan Anda. Saya memiliki contoh yang baik di (martir) ini.\" Jadi mereka menyeretnya dan mencoba memaksanya untuk menemani mereka, tetapi dia menolak. Akhirnya mereka membunuhnya. Mereka membawa Khubaib dan Zaid bin Ad-Dathina bersama mereka dan menjual mereka sebagai budak di Mekah. Peristiwa ini terjadi setelah perang Badar. Jadi mereka menyeretnya dan mencoba memaksanya untuk menemani mereka, tetapi dia menolak. Akhirnya mereka membunuhnya. Mereka membawa Khubaib dan Zaid bin Ad-Dathina bersama mereka dan menjual mereka sebagai budak di Mekah. Peristiwa ini terjadi setelah perang Badar. Jadi mereka menyeretnya dan mencoba memaksanya untuk menemani mereka, tetapi dia menolak. Akhirnya mereka membunuhnya. Mereka membawa Khubaib dan Zaid bin Ad-Dathina bersama mereka dan menjual mereka sebagai budak di Mekah. Peristiwa ini terjadi setelah perang Badar. Khubaib dibeli oleh anak-anak Al-Harits bin \u0027Amir bin Naufal bin \u0027Abd Manaf. Khubaib-lah yang telah membunuh Al-Harits dalam perang Badar. Khubaib tetap menjadi tawanan bersama orang-orang itu selama beberapa hari sampai putra-putra Al-Harits memutuskan untuk membunuhnya. Ketika Khubaib (ra dengan dia) mengetahui rencana ini, dia meminjam pisau cukur dari salah satu putri Al-Harits untuk menghilangkan rambut kemaluannya. Putra kecilnya merangkak ke arah Khubaib karena kecerobohannya. Kemudian, dia melihat putranya di pahanya dan pisau cukur ada di tangannya. Dia menjadi sangat takut sehingga Khubaib memperhatikan kegelisahan di wajahnya dan berkata: \"Apakah kamu takut aku akan membunuhnya? Tidak, aku tidak akan pernah melakukan itu.\" Dia kemudian berkomentar (setelah Al-Khubaib syahid): \"Demi Allah! Saya tidak pernah melihat seorang tahanan yang lebih baik dari Khubaib.\" Dia menambahkan: \"Demi Allah! Saya pernah melihatnya makan seikat anggur di tangannya saat dia dirantai dan tidak ada buah seperti itu pada waktu itu di Mekah. Mungkin itu adalah anugerah yang Allah berikan kepada Khubaib.\" Ketika mereka membawanya keluar dari Haram Mekah untuk membunuhnya di luar perbatasannya, Khubaib meminta mereka untuk mengizinkannya melakukan shalat sunnah dua rakaat. Mereka mengizinkannya dan dia salat dua rakaat. Kemudian dia berkata: \"Seandainya aku tidak mengetahui bahwa kamu akan mengira bahwa aku takut mati, aku akan memperpanjang shalat. Ya Allah! Hitung jumlah mereka; bunuh mereka satu per satu dan jangan lepaskan salah satu dari mereka.\" Dia kemudian membacakan ayat-ayat puitis: \u0027Saya tidak peduli bagaimana mereka membunuh saya selama saya menjadi syahid di jalan Allah sebagai seorang Muslim. Aku menerima kematianku demi Allah. Jika Allah menghendaki, Dia akan memberkati, anggota badan yang diamputasi dari tubuh yang robek.\u0027 Kemudian putra Al-Harits membunuhnya. Khubaib-lah yang menetapkan tradisi bagi setiap Muslim yang dijatuhi hukuman mati di penangkaran untuk melakukan shalat sunnah dua rakaat. Pada hari itu Rasulullah (ﷺ) memberi tahu para sahabatnya tentang syahidnya Khubaib. Kemudian, ketika beberapa orang kafir dari Quraisy diberitahu bahwa \u0027Asim telah mati syahid, mereka mengirim beberapa orang untuk mengambil bagian penting dari tubuhnya untuk memastikan kematiannya. (Ini karena) \u0027Asim telah membunuh salah satu pemimpin mereka. Maka Allah mengirimkan segerombolan tawon, menyerupai awan yang teduh, untuk melayang-layang di atas tubuh \u0027Asim dan untuk melindunginya dari utusan mereka, dan dengan demikian mereka tidak dapat memotong apa pun dari tubuhnya. [Al-Bukhari] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"1510","hadith_id":"riyadussalihin","text":[{"text":"وعن ابن عمر رضي الله عنهما قال‏:‏ ما سمعت عمر رضي الله عنه يقول لشيء قط‏:‏ إني لأظنه كذا إلا كان كما يظن‏.‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏","language":"arabic"},{"text":"I never heard \u0027Umar (May Allah be pleased with him) relating anything that he conceived it to be so-and-so, but that it proved to be as he had conceived it.\" [Al-Bukhari].","language":"english"},{"text":"Aku tidak pernah mendengar \u0027Umar (semoga Allah meridhoinya) menceritakan sesuatu yang dia pikirkan sebagai fulan, tetapi ternyata itu seperti yang dia bayangkan.\" [Al-Bukhari] .","language":"bahasa"}],"narrated":[{"text":"Ibn \u0027Umar (May Allah be pleased with them) reported:","language":"english"},{"text":"Ibnu \u0027Umar radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]}]