[{"index":"1285","hadith_id":"riyadussalihin","text":[{"text":"عن أبي هريرة رضي الله عنه قال‏:‏ سئل رسول الله صلى الله عليه وسلم أي العمل أفضل‏؟‏ قال‏:‏ ‏\"‏إيمان بالله ورسوله‏\"‏ قيل‏:‏ ثم ماذا‏؟‏ قال‏:‏ ‏\"‏الجهاد في سبيل الله‏\"‏ قيل‏:‏ ثم ماذا‏؟‏ قال‏:‏ ‏\"‏حج مبرور‏\"‏‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) was asked, \"Which deed is the best?\" He (ﷺ) replied, \"Faith in Allah and His Messenger.\" He (ﷺ) was asked, \"What is next?\" He (ﷺ) replied, \"Jihad (holy fighting) in the Cause of Allah.\" Then he was asked: \"What is after that (in goodness)?\" He (ﷺ) replied, \"Hajj Mabrur (which is accepted by Allah).\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) ditanya, \"Perbuatan apa yang paling baik?\" Dia (ﷺ) menjawab, \"Iman kepada Allah dan Rasul-Nya.\" Dia (ﷺ) ditanya, \"Apa selanjutnya?\" Dia (ﷺ) menjawab, \"Jihad (perang suci) di jalan Allah.\" Kemudian dia ditanya: “Apa setelah itu (dalam kebaikan)?” Dia (ﷺ) menjawab, \"Haji Mabrur (yang diterima oleh Allah).\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"1286","hadith_id":"riyadussalihin","text":[{"text":"وعن ابن مسعود، رضي الله عنه قال‏:‏ قلت يا رسول الله أي العمل أحب إلى الله تعالى‏؟‏ قال‏:‏ ‏\"‏الصلاة على وقتها‏\"‏ قلت‏:‏ ثم أي‏؟‏ قال‏:‏ ‏\"‏بر الوالدين‏\"‏ قلت ثم أي‏:‏ قال‏:‏ ‏\"‏الجهاد في سبيل الله‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","language":"arabic"},{"text":"I asked the Messenger of Allah (ﷺ): \"Which action is dearest to Allah?\" He (ﷺ) replied, \"Performing As-Salat (the prayer) at its earliest fixed time.\" I asked, \"What is next (in goodness)?\" He (ﷺ) said, \"Kindness towards parents.\" I asked, \"What is next (in goodness)?\" He (ﷺ) said, \"To participate in Jihad in the Cause of Allah.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Saya bertanya kepada Rasulullah (): \"Amalan apa yang paling dicintai Allah?\" Dia (ﷺ) menjawab, \"Menerapkan As-Salat (salat) pada waktu yang ditentukan paling awal.\" Saya bertanya, \"Apa selanjutnya (dalam kebaikan)?\" Dia (ﷺ) berkata, \"Kebaikan terhadap orang tua.\" Saya bertanya, \"Apa selanjutnya (dalam kebaikan)?\" Dia (ﷺ) berkata, \"Untuk berpartisipasi dalam Jihad di jalan Allah.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Ibn Mas\u0027ud (May Allah be pleased with him) reported:","language":"english"},{"text":"Ibnu Mas\u0027ud radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"1287","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي ذر رضي الله عنه قال‏:‏ قلت يا رسول الله أي العمل أفضل‏؟‏ قال‏:‏ ‏ \"‏الإيمان بالله والجهاد في سبيله‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) was asked: \"Which deed is the best?\" He (ﷺ) replied, \"Faith in Allah and Jihad (fighting, struggle) in the Cause of Allah.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) ditanya: \"Perbuatan apa yang paling baik?\" Dia (ﷺ) menjawab, \"Iman kepada Allah dan Jihad (berjuang, berjuang) di jalan Allah.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Dharr (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Dzar radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"1288","hadith_id":"riyadussalihin","text":[{"text":"وعن أنس رضي الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏ \"‏لغدوة في سبيل الله أو روحة خير من الدنيا وما فيها‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"Verily! Setting out in the early morning or in the evening in order to fight in Allah\u0027s way is better than the world and what it contains.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Sesungguhnya! Berangkat di pagi atau sore hari untuk berperang di jalan Allah lebih baik daripada dunia dan seisinya.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Anas (May Allah be pleased with him) reported:","language":"english"},{"text":"Anas (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"1289","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي سعيد الخدري رضي الله عنه قال‏:‏ أتى رجل رسول الله صلى الله عليه وسلم فقال‏:‏ أي الناس أفضل‏؟‏ قال‏:‏ ‏\"‏مؤمن يجاهد بنفسه وماله في سبيل الله‏\"‏ قال‏:‏ ثم من‏؟‏ قال‏:‏ ‏\"‏مؤمن في شعب من الشعاب يعبد الله ويدع الناس من شره‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","language":"arabic"},{"text":"A man came to the Messenger of Allah (ﷺ) and said, \"Who is the best among men?\" He (ﷺ) replied, \"A believer who strives in the way of Allah with his wealth and life.\" The man asked again, \"Who is next to him (in excellence)?\" He (ﷺ) said, \"Next to him is a man who is engaged in worshipping his Rubb in a mountain valley, leaving the people secure from his mischief.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Seorang laki-laki datang kepada Rasulullah (ﷺ) dan bertanya, \"Siapakah yang terbaik di antara manusia?\" Beliau (ﷺ) menjawab, \"Seorang mukmin yang berjihad di jalan Allah dengan harta dan jiwanya.\" Pria itu bertanya lagi, \"Siapa yang di sebelahnya (dalam keunggulan)?\" Beliau (ﷺ) berkata, \"Di sebelahnya ada seorang laki-laki yang sibuk beribadah di lembah pegunungan, sehingga orang-orangnya aman dari kerusakannya.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Sa\u0027id Al-Khudri (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Sa\u0027id Al-Khudri r.a. melaporkan:","language":"bahasa"}]},{"index":"1290","hadith_id":"riyadussalihin","text":[{"text":"وعن سهل بن سعد رضي الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏\"‏رباط يوم في سبيل الله خير من الدنيا وما عليها، وموضع سوط أحدكم من الجنة خير من الدنيا وما عليها، والروحة يروحها العبد في سبيل الله تعالى، أو الغدوة خير من الدنيا وما عليها‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"Observing Ribat (e.g., guarding the Islamic frontier for the sake of Allah) for a single day is far better than the world and all that it contains. A place in Jannah as small as the whip of your horse is far better than the world and all that it contains. An endeavour (fighting) in the Cause of Allah in the evening or in the morning is far better than the world and all that it contains.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, “Menjalankan Ribat (misalnya menjaga perbatasan Islam karena Allah) selama satu hari jauh lebih baik daripada dunia dan seisinya. Tempat di Jannah sekecil cambuk kudamu jauh lebih baik dari dunia dan seisinya. Ikhtiar (berjuang) di jalan Allah di waktu petang atau pagi hari jauh lebih baik dari dunia dan seisinya.” [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Sahl bin Sa\u0027d (May Allah be pleased with him) reported:","language":"english"},{"text":"Sahl bin Sa\u0027d radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"1291","hadith_id":"riyadussalihin","text":[{"text":"وعن سلمان رضي الله عنه قال‏:‏ سمعت رسول الله صلى الله عليه وسلم يقول‏:‏ ‏ \"‏رباط يوم وليلة خير من صيام شهر وقيامه، وإن مات فيه أجري عليه عمله الذي كان يعمل، وأجري عليه رزقه، وأمن الفتان‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"I heard the Messenger of Allah (ﷺ) as saying, \"Observing Ribat in the way of Allah for a day and a night is far better than observing Saum (fasting) for a whole month and standing in Salat (prayer) in all its nights. If a person dies (while performing this duty), he will go on receiving his reward for his meritorious deeds perpetually, and he will be saved from Al- Fattan.\" [Muslim].","language":"english"},{"text":"Saya mendengar Rasulullah (ﷺ) bersabda, “Menerapkan Ribat di jalan Allah selama sehari semalam jauh lebih baik dari pada berpuasa selama sebulan penuh dan mendirikan shalat di semua malamnya. . Jika seseorang meninggal (saat melakukan tugas ini), dia akan terus menerima pahala untuk perbuatan baiknya terus-menerus, dan dia akan diselamatkan dari Al-Fattan. [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Salman (May Allah be pleased with him) reported:","language":"english"},{"text":"Salman (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"1292","hadith_id":"riyadussalihin","text":[{"text":"وعن فضالة بن عبيد رضي الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏\"‏كل ميت يختم على عمله إلا المرابط في سبيل الله فإنه ينمى له عمله إلى يوم القيامة، ويؤمن فتنة القبر” ‏(‏‏(‏رواه أبو داود والترمذي وقال‏:‏ حديث حسن صحيح‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"The actions of every dead person come to a halt with his death except the one who is on the frontier in Allah\u0027s way (i.e., observing Ribat). This latter\u0027s deeds will be made to go on increasing for him till the Day of Resurrection, and he will be secure from the trials in the grave.\" [Abu Dawud and At- Tirmidhi].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, “Setiap orang yang mati akan terhenti dengan kematiannya kecuali orang yang berada di garis depan di jalan Allah (yaitu, menjalankan Ribat). Amal yang terakhir ini akan diteruskan. bertambah baginya sampai hari kiamat, dan dia akan aman dari cobaan kubur.” [Abu Dawud dan At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Fadalah bin \u0027Ubaid (May Allah be pleased with him) reported:","language":"english"},{"text":"Fadalah bin \u0027Ubaid (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"1293","hadith_id":"riyadussalihin","text":[{"text":"وعن عثمان رضي الله عنه قال‏:‏ سمعت رسول الله صلى الله عليه وسلم يقول‏:‏ ‏ \"‏رباط يوم في سبيل الله خير من ألف يوم فيما سواه من المنازل‏\"‏ ‏(‏‏(‏رواه الترمذي وقال‏:‏ حديث حسن صحيح‏)‏‏)‏‏.‏","language":"arabic"},{"text":"I heard the Messenger of Allah (ﷺ) saying: \"Spending a day on the frontier in Allah\u0027s way is better than one thousand days in any other place.\" [At-Tirmidhi].","language":"english"},{"text":"Saya mendengar Rasulullah (ﷺ) berkata: \"Menghabiskan satu hari di perbatasan di jalan Allah lebih baik daripada seribu hari di tempat lain.\" [At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"\u0027Uthman (May Allah be pleased with him) reported:","language":"english"},{"text":"\u0027Utsman (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"1294","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي هريرة رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏\"‏تضمن الله لمن خرج في سبيله لا يخرجه إلا جهاد في سبيلي، وإيمان بي وتصديق برسلي فهو علي ضامن أن أدخله الجنة، أو أرجعه إلى منزله الذي خرج منه بما نال من أجر، أو غنيمة، والذي نفس محمد بيده ما من كلم يكلم في سبيل الله إلا جاء يوم القيامة كهيئته يوم كلم، لونه لون دم، وريحه ريح مسك، والذي نفس محمد بيده لولا أن يشق على المسلمين ما قعدت خلاف سرية تغزو في سبيل الله أبدا، ولكن لا أجد سعة فأحملهم ولا يجدون سعة عليهم أن يتخلفوا عني، والذي نفس محمد بيده لوددت أن أغزو في سبيل الله فأقتل، ثم أغزو فأقتل ثم أغزو فأقتل‏\"‏ ‏(‏‏(‏رواه مسلم وروى البخاري بعضه‏)‏‏)‏‏.‏ ‏(‏‏(‏‏\"‏الكلم‏\"‏ الجرح‏.‏‏)‏‏)‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"Allah guarantees that he who goes out to fight in His way believing in Him and affirming the truth of His Messenger, will either be admitted to Jannah or will be brought back to his home (safely) from where he has set out, with whatever reward or share of booty he may have gained. By Him in Whose Hand Muhammad\u0027s soul is, if a person is wounded in the way of Allah, he will come on the Day of Resurrection with his wound in the same condition as it was on the day when he received it; its colour will be the colour of blood but its smell will be the smell of musk. By Him in Whose Hand Muhammad\u0027s soul is, if it were not to be too hard upon the Muslims, I would not lag behind any expedition to fight in the Cause of Allah, but I have neither abundant means to provide them conveyance (horses) nor all other Muslims have it, and it will be hard on them to remain behind when I go forth (for Jihad). By Him in Whose Hand Muhammad\u0027s soul is, I love to fight in the way of Allah and get killed, to fight again and get killed and to fight again and get killed.\" [Muslim].","language":"english"},{"text":"tetapi saya tidak memiliki sarana yang berlimpah untuk memberi mereka alat angkut (kuda) atau semua Muslim lainnya memilikinya, dan akan sulit bagi mereka untuk tetap berada di belakang ketika saya pergi (untuk Jihad). Demi Dzat yang jiwa Muhammad berada di tangan-Nya, aku suka berperang di jalan Allah dan terbunuh, bertarung lagi dan terbunuh, dan bertarung lagi dan terbunuh.” [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"1295","hadith_id":"riyadussalihin","text":[{"text":"وعنه قال‏:‏ قال‏:‏ رسول الله صلى الله عليه وسلم ‏\"‏ما من مكلوم يكلم في سبيل الله إلا جاء يوم القيامة، وكلمه يدمي اللون لون دم، والريح ريح مسك‏:‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"Whoever is wounded while fighting in the way of Allah, will come on the Day of Resurrection with blood oozing from his wound having the colour of blood but with the fragrance of musk.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, \"Barangsiapa yang terluka saat berperang di jalan Allah, akan datang pada Hari Kebangkitan dengan darah yang mengucur dari lukanya yang berwarna darah tetapi berbau minyak kesturi.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"1296","hadith_id":"riyadussalihin","text":[{"text":"وعن معاذ رضي الله عنه عن النبي صلى الله عليه وسلم قال‏:‏ ‏ \"‏من قاتل في سبييل الله من رجل مسلم فواق ناقة وجبت له الجنة، ومن جرح جرحًا في سبيل الله أو نكب نكبة فإنها تجيء يوم القيامة كأغزر ما كانت‏:‏ لونها الزعفران، وريحها كالمسك‏\"‏ ‏(‏‏(‏رواه أبو داود والترمذي وقال‏:‏ حديث حسن‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Prophet (ﷺ) said, \"Jannah becomes incumbent for a Muslim who fights for the Cause of Allah for a period as long as the time between two consecutive turns of milking a she-camel. He who receives a wound or a bruise in the Cause of Allah will appear on the Day of Resurrection as fresh as possible, its colour will be the colour of saffron and its fragrance will be that of musk.\" [At-Tirmidhi and Abu Dawud].","language":"english"},{"text":"Nabi (ﷺ) berkata, \"Jannah menjadi kewajiban bagi seorang Muslim yang berjuang di jalan Allah untuk jangka waktu selama waktu antara dua putaran berturut-turut memerah susu unta betina. Dia yang menerima luka atau memar di Sebab Allah akan muncul pada Hari Kebangkitan sesegar mungkin, warnanya sewarna kunyit dan wanginya semerbak minyak kesturi.” [At-Tirmidzi dan Abu Dawud] .","language":"bahasa"}],"narrated":[{"text":"Muadh (May Allah be pleased with him) reported:","language":"english"},{"text":"Muadh (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"1297","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي هريرة رضي الله عنه قال‏:‏ مر رجل من أصحاب رسول الله صلى الله عليه وسلم بشعب فيه عيينة من ماء عذبة فأعجبته، فقال‏:‏ لو اعتزلت الناس فأقمت في هذا الشعب، ولن أفعل حتى استأذن رسول الله صلى الله عليه وسلم فذكر ذلك لرسول الله صلى الله عليه وسلم فقال‏:‏ ‏\"‏لا تفعل فإن مقام أحدكم في سبيل الله أفضل من صلاته في بيته سبعين عامًا، ألا تحبون أن يغفر الله لكم ويدخلكم الجنة‏؟‏ اغزو في سبيل الله من قاتل في سبيل الله فواق ناقة وجبت له الجنة‏\"‏ ‏(‏‏(‏رواه الترمذي وقال‏:‏ حديث حسن‏)‏‏)‏‏.‏ ‏(‏‏(‏‏\"‏والفواق‏\"‏‏:‏ ما بين الحلبتين‏)‏‏)‏‏.‏","language":"arabic"},{"text":"One of the Prophet\u0027s Companions came upon a valley containing a rivulet of fresh water and was delighted by it. He reflected: \u0027I wish to withdraw from people and settle in this valley; but I won\u0027t do so without the permission of the Messenger of Allah (ﷺ).\u0027 This was mentioned to the Messenger of Allah (ﷺ) and he said (to the man), \"Do not do that, for when any of you remains in Allah\u0027s way, it is better for him than performing Salat (prayer) in his house for seventy years. Do you not wish that Allah should forgive you and admit you to Jannah? Fight in Allah\u0027s way, for he who fights in Allah\u0027s Cause as long as the time between two consecutive turns of milking a she-camel, will be surely admitted to Jannah.\" [At-Tirmidhi].","language":"english"},{"text":"Salah satu sahabat Nabi datang ke sebuah lembah yang berisi anak sungai air tawar dan sangat senang dengan itu. Dia merenungkan: \u0027Saya ingin menarik diri dari orang-orang dan menetap di lembah ini; tapi aku tidak akan melakukannya tanpa izin Rasulullah (ﷺ).\u0027 Hal ini disebutkan kepada Rasulullah (ﷺ) dan dia berkata (kepada pria itu), \"Jangan lakukan itu, karena jika salah satu dari kalian tetap di jalan Allah, itu lebih baik baginya daripada melakukan shalat di rumahnya. selama tujuh puluh tahun. Tidakkah kamu ingin agar Allah mengampunimu dan memasukkanmu ke Jannah? Berperanglah di jalan Allah, karena siapa yang berperang di jalan Allah selama waktu antara dua putaran berturut-turut memerah susu unta betina, pasti akan diterima di Jannah.” [At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"1298","hadith_id":"riyadussalihin","text":[{"text":"وعنه قال قيل يا رسول الله‏:‏ ما يعدل الجهاد في سبيل الله‏؟‏ قال‏:‏ ‏\"‏لاتستطيعونه‏\"‏ فأعادوا عليه مرتين أو ثلاثًا كل ذلك يقول‏:‏ ‏\"‏لاتستطيعونه‏!‏‏\"‏ ثم قال‏:‏ ‏\"‏مثل المجاهد في سبيل الله كمثل الصائم القائم القانت بآيات الله لا يفتر‏:‏ من صلاة ولا صيام، حتى يرجع المجاهد في سبيل الله‏\"‏ ‏(‏‏(‏متفق عليه، وهذا لفظ مسلم‏)‏‏)‏ ‏.‏ وفي رواية البخاري، أن رجلا قال‏:‏ يا رسول الله دلني على عمل يعدل الجهاد‏؟‏ قال‏:‏ ‏\"‏لا أجده‏\"‏ ثم قال‏:‏ ‏\"‏هل تستطيع إذا خرج المجاهد أن تدخل مسجدك فتقوم ولا تفتر وتصوم ولا تفطر‏؟‏ فقال‏:‏ ومن يستطيع ذلك‏؟‏‏!‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) was asked: \"What other good deed could be an equivalent of Jihad in the way of Allah?\" He (ﷺ) replied, \"You do not have the strength to do it.\" (The narrator said:) The question was repeated twice or thrice, but every time he (ﷺ) answered, \"You do not have the strength to do it.\" Then he (ﷺ) said, \"One who goes out for Jihad in the Cause of Allah is like a person who observes Saum (fasting), stands in Salat (prayer) constantly, recites the Ayat of the Qur\u0027an and does not exhibit any lassitude in fasting and prayer until the participant of Jihad in the way of Allah returns.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) ditanya: \"Perbuatan baik apa lagi yang bisa disamakan dengan Jihad di jalan Allah?\" Dia (ﷺ) menjawab, \"Kamu tidak memiliki kekuatan untuk melakukannya.\" (Narator berkata:) Pertanyaan itu diulang dua atau tiga kali, tetapi setiap kali dia (ﷺ) menjawab, \"Kamu tidak memiliki kekuatan untuk melakukannya.\" Kemudian beliau (ﷺ) berkata, “Orang yang berjihad di jalan Allah adalah seperti orang yang menjalankan Saum (puasa), berdiri dalam shalat (shalat) terus-menerus, membaca ayat-ayat Al-Qur\u0027an dan tidak menunjukkan segala keletihan dalam puasa dan shalat sampai orang yang berjihad di jalan Allah kembali.” [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"1299","hadith_id":"riyadussalihin","text":[{"text":"وعنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏ \"‏من خير معاش الناس لهم رجل ممسك بعنان فرسه في سبيل الله، يطير على متنه كلما سمع هيعة، أو فزعة طار على متنه، يبتغي القتل أو الموت مظانه، أو رجل في غنيمة أو شعفة من هذه الشعف أو بطن واد من هذه الأودية يقيم الصلاة ويؤتي الزكاة، ويعبد ربه حتى يأتيه اليقين ليس من الناس إلا في خير‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"The best life is that of the man who holds his horse\u0027s rein in Allah\u0027s way and flies on its back to the places from whence he hears a war cry or the clatter of arms, seeking martyrdom or slaughter on the battlefield; or that of a person who goes to stay on the top of the hill or in a valley, and there he performs Salat (prayer), pays the Zakat and worships his Rubb till death overtakes him. He has no concern with the affairs of anyone except the doing of good.\" [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Hidup yang terbaik adalah orang yang memegang kendali kudanya di jalan Allah dan terbang di punggungnya ke tempat-tempat dari mana dia mendengar seruan perang atau derap senjata, mencari kesyahidan atau menyembelih di medan perang, atau orang yang pergi menetap di puncak bukit atau di lembah, lalu di sana ia melaksanakan shalat, menunaikan zakat, dan memuja Rub-nya hingga maut menjemputnya. dengan urusan siapa pun kecuali mengerjakan kebaikan.” [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"1300","hadith_id":"riyadussalihin","text":[{"text":"وعنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏ \"‏إن في الجنة مائة درجة أعدها للمجاهدين في سبيل الله ما بين الدرجتين كما بين السماء والأرض‏\"‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"In Jannah there are a hundred grades which Allah has prepared for those who fight in His Cause; and the distance between any two of those grades is like the distance between the heaven and the earth.\" [Al-Bukhari].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Di Jannah ada seratus derajat yang disediakan Allah bagi orang-orang yang berperang di jalan-Nya; dan jarak antara dua derajat itu seperti jarak antara langit dan bumi.\" [Al-Bukhari] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"1301","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي سعيد الخدري رضي الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏\"‏من رضي بالله ربًا وبالإسلام دينًا، وبمحمد رسولا وجبت له الجنة‏\"‏ فعجب لها أبو سعيد فقال أعدها علي يا رسول الله فأعادها عليه ثم قال‏:‏ ‏\"‏وأخرى يرفع الله بها العبد مائة درجة في الجنة، ما بين كل درجتين، كما بين السماء والأرض‏\"‏ قال‏:‏ وما هي يا رسول الله‏؟‏ قال‏:‏ ‏\"‏الجهاد في سبيل الله، الجهاد في سبيل الله‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"If anyone is pleased with Allah as his Rubb, with Islam as his religion and with Muhammad (ﷺ) as (Allah\u0027s) Messenger, surely, he will be entitled to enter Jannah.\" Abu Sa\u0027id was delighted with this and requested the Messenger of Allah (ﷺ) to repeat it. He (ﷺ) repeated it again and then said, \"There is also another act by which Allah will elevate the position of a (pious believing) slave in Jannah to a grade one hundred degrees higher. And the distance between any two grades is equal to the distance between heaven and earth.\" He asked the Messenger of Allah (ﷺ) what it was and he ((ﷺ)) replied, \"Jihad in the way of Allah; Jihad in the way of Allah.\" [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, “Barangsiapa ridha kepada Allah sebagai Rubb-nya, Islam sebagai agamanya, dan Muhammad (ﷺ) sebagai Rasul (Allah), pastilah dia berhak masuk Jannah.” Abu Sa\u0027id senang dengan hal ini dan meminta Rasulullah (ﷺ) untuk mengulanginya. Dia (ﷺ) mengulanginya lagi dan kemudian berkata, \"Ada juga tindakan lain yang dengannya Allah akan mengangkat posisi seorang hamba (yang beriman) di Jannah ke derajat seratus derajat lebih tinggi. Dan jarak antara dua derajat adalah sama. dengan jarak antara langit dan bumi.\" Dia bertanya kepada Rasulullah (ﷺ) apa itu dan dia ((ﷺ)) menjawab, \"Jihad di jalan Allah; Jihad di jalan Allah.\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Sa\u0027id Al-Khudri (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Sa\u0027id Al-Khudri r.a. melaporkan:","language":"bahasa"}]},{"index":"1302","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي بكر بن أبي موسى الأشعري، قال‏:‏ سمعت أبي رضي الله عنه وهو بحضرة العدو، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏إن أبواب الجنة تحت ظلال السيوف‏\"‏ فقام رجل رث الهيئة فقال يا أبا موسى أأنت سمعت رسول الله صلى الله عليه وسلم يقول هذا‏؟‏ قال‏:‏ نعم، فرجع إلى أصحابه، فقال‏:‏ ‏\"‏اقرأ عليكم السلام‏\"‏ ثم كسر جفن سيفه فألقاه، ثم مشى بسيفه إلى العدو فضرب به حتى قتل‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"I heard my father saying in the presence of the enemy: The Messenger of Allah (ﷺ) said, \"The gates of Jannah are under the shades of the swords.\" A man with a shaggy appearance got up and said, \"O Abu Musa! Did you hear the Messenger of Allah (ﷺ) say that in person?\" Abu Musa replied in the affirmative; so he returned to his companions and said: \"I tender you farewell greetings.\" Then he broke the scabbard of his sword and threw it away. He rushed towards the enemy with his sword and fought with it till he was martyred. [Muslim].","language":"english"},{"text":"Saya mendengar ayah saya berkata di hadapan musuh: Rasulullah (ﷺ) berkata, \"Pintu-pintu Jannah berada di bawah naungan pedang.\" Seorang pria dengan penampilan berbulu bangkit dan berkata, \"Wahai Abu Musa! Apakah Anda mendengar Rasulullah (ﷺ) mengatakan itu secara langsung?\" Abu Musa menjawab setuju; jadi dia kembali ke teman-temannya dan berkata: \"Saya mengucapkan salam perpisahan kepada Anda.\" Kemudian dia mematahkan sarung pedangnya dan membuangnya. Dia bergegas menuju musuh dengan pedangnya dan bertarung dengan pedang itu sampai dia mati syahid. [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Bakr bin Abu Musa Al-Ash\u0027ari reported:","language":"english"},{"text":"Abu Bakar bin Abu Musa Al-Asy\u0027ari melaporkan:","language":"bahasa"}]},{"index":"1303","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي عبس عبد الرحمن بن جبير، رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏ \"‏ما اغبرت قدما عبد في سبيل الله فتمسه النار‏\"‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"It will not happen that the feet soiled with dust while (doing Jihad) in the way of Allah, will be touched by the fire (of Hell).\" [Al- Bukhari].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Tidak akan terjadi bahwa kaki yang kotor dengan debu saat (berjihad) di jalan Allah, akan disentuh oleh api (neraka).\" [Al-Bukhari] .","language":"bahasa"}],"narrated":[{"text":"Abu \u0027Abs \u0027Abdur-Rahman bin Jabr (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu \u0027Abs \u0027Abdur-Rahman bin Jabr (ra dengan dia) melaporkan:","language":"bahasa"}]},{"index":"1304","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي هريرة رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏ \"‏لا يلج النار رجل بكي من خشية الله حتى يعود اللبن في الضرع، ولا يجتمع على عبد غبار في سبيل الله ودخان جهنم‏\"‏ ‏(‏‏(‏رواه الترمذي وقال‏:‏ حديث حسن صحيح‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"No one who weeps out of Fear of Allah will enter Hell until milk recedes to the udder, and the dust endured while striving in the Cause of Allah and the smoke of Hell will never subsist together.\" [At-Tirmidhi].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Tidak ada orang yang menangis karena takut kepada Allah akan masuk Neraka sampai susu surut ke ambing, dan debu bertahan saat berjuang di jalan Allah dan asap Neraka tidak akan pernah ada bersama-sama. \" [At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) said:","language":"english"},{"text":"Abu Hurairah r.a. berkata:","language":"bahasa"}]},{"index":"1305","hadith_id":"riyadussalihin","text":[{"text":"وعن ابن عباس، رضي الله عنهما قال‏:‏ سمعت رسول الله صلى الله عليه وسلم يقول‏:‏ “عينان لا تمسهما النار عين بكت من خشية الله، وعين باتت تحرس في سبيل الله‏\"‏ ‏(‏‏(‏رواه الترمذي وقال‏:‏ حديث حسن‏.‏ ‏)‏‏)‏‏.‏","language":"arabic"},{"text":"I heard the Messenger of Allah (ﷺ) saying, \"Two eyes will never be touched by the fire of Hell; an eye which weeps out of Fear of Allah and an eye which spends the night in guarding in the Cause of Allah .\" [At-Tirmidhi].","language":"english"},{"text":"Aku mendengar Rasulullah (ﷺ) berkata, \"Dua mata tidak akan pernah disentuh oleh api neraka; mata yang menangis karena takut kepada Allah dan mata yang menghabiskan malam untuk berjaga di jalan Allah.\" [At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Ibn \u0027Abbas (May Allah be pleased with them) reported:","language":"english"},{"text":"Ibn \u0027Abbas (semoga Allah meridhoi mereka) melaporkan:","language":"bahasa"}]},{"index":"1306","hadith_id":"riyadussalihin","text":[{"text":"وعن زيد بن خالد، رضي الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏ \"‏من جهز غازيًا في سبيل الله فقد غزا ومن خلف غازيا في أهله بخير فقد غزا‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"He who equips a Ghazi (fighter) in the way of Allah is as if he has taken part in the fighting himself; and he who looks after the dependants of a Ghazi in his absence, is as if he has taken part in the fighting himself.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, “Barang siapa yang memperlengkapi seorang Ghazi (pejuang) di jalan Allah, maka seolah-olah dia sendiri yang ikut berperang; dan barang siapa yang menjaga tanggungan seorang Ghazi ketika dia tidak ada, maka dia seolah-olah dia telah mengambil bagian dalam pertempuran itu sendiri.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Zaid bin Khalid (May Allah be pleased with him) reported:","language":"english"},{"text":"Zaid bin Khalid radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"1307","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي أمامة رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏ \"‏أفضل الصدقات ظل فسطاط في سبيل الله، ومنيحة خادم في سبيل الله، أو طروقة فحل في سبيل الله‏\"‏ ‏(‏‏(‏رواه الترمذي وقال‏:‏ حديث حسن صحيح‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"The best of charities is to provide canopy in the Cause of Allah, to pay wages to a servant in the way of Allah, and to provide a camel in the way of Allah (to be used by a Mujahid).\" [At-Tirmidhi].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, “Sedekah yang paling baik adalah memberikan kanopi di jalan Allah, membayar upah seorang hamba di jalan Allah, dan memberikan seekor unta di jalan Allah (untuk digunakan). oleh seorang Mujahid). [At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Abu Umamah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Umamah r.a. melaporkan:","language":"bahasa"}]},{"index":"1308","hadith_id":"riyadussalihin","text":[{"text":"وعن أنس رضي الله عنه أن فتى من أسلم قال‏:‏ يا رسول الله إني أريد الغزو وليس معي ما أتجهز به، قال‏:‏ ‏\"‏ائت فلانًا، قد كان تجهز فمرض فأتاه فقال‏:‏ إن رسول الله صلى الله عليه وسلم يقرئك السلام ويقول‏:‏ أعطني الذي تجهزت به قال‏:‏ يا فلانة أعطيه، الذي كنت تجهزت به ولاتحبسي منه شيئًا فوالله لا تحبسي منه شيئًا فيبارك لك فيه ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"A young man from the Aslam tribe said: \"O Messenger of Allah! I would very much like to fight in the way of Allah but I do not have anything with which to equip myself for fighting.\" The Messenger of Allah (ﷺ) said, \"Go to so-and-so, for he had equipped himself (for fighting) but he fell ill.\" So, he (the young man) went to him and said: \"The Messenger of Allah (ﷺ) sends you his greetings and says that you should hand over to me the equipment that you have procured.\" The man said to his wife: \"Give him the equipment which I have collected for myself and do not withhold anything from him. By Allah! Allah won\u0027t bless something you withheld (in this respect).\" [Muslim].","language":"english"},{"text":"Seorang pemuda dari suku Aslam berkata: \"Ya Rasulullah! Saya sangat ingin berperang di jalan Allah tetapi saya tidak memiliki apa pun untuk melengkapi diri saya untuk berperang.\" Rasulullah (ﷺ) berkata, \"Pergilah ke fulan, karena dia telah memperlengkapi dirinya (untuk berperang) tetapi dia jatuh sakit.\" Jadi, dia (pemuda itu) pergi kepadanya dan berkata: \"Rasulullah (ﷺ) mengirim salam kepadamu dan mengatakan bahwa kamu harus menyerahkan kepadaku peralatan yang telah kamu beli.\" Pria itu berkata kepada istrinya: \"Berikan dia peralatan yang telah saya kumpulkan untuk diri saya sendiri dan jangan menahan apa pun darinya. Demi Allah! Allah tidak akan memberkati sesuatu yang Anda tahan (dalam hal ini).\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Anas (May Allah be pleased with him) reported:","language":"english"},{"text":"Anas (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"1309","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي سعيد الخدري رضي الله عنه أن رسول الله صلى الله عليه وسلم بعث إلى بني لحيان، فقال‏:‏ ‏ \"‏لا ينبعث من كل رجلين أحدهما، والأجر بينهما‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) sent an expedition to Banu Lahyan and said, \"One man from every two should join the fighting force, and the reward will be shared amongst them equally.\" [Muslim]. Another narration in Muslim is: The Messenger of Allah (ﷺ) said, \"Let one of every two men go forth\", and added: \"Whoever stays behind (and looks well after the family and the property of those who have joined the expedition) will get half the reward of the warrior.\"","language":"english"},{"text":"Rasulullah (ﷺ) mengirim ekspedisi ke Bani Lahyan dan berkata, \"Satu orang dari setiap dua orang harus bergabung dalam pasukan tempur, dan hadiahnya akan dibagi rata di antara mereka.\" [Muslim] . Riwayat lain dalam Muslim adalah: Rasulullah (ﷺ) berkata, \"Biarkan salah satu dari setiap dua orang pergi\", dan menambahkan: \"Siapa pun yang tinggal di belakang (dan menjaga keluarga dan harta orang-orang yang bergabung dalam ekspedisi). ) akan mendapatkan setengah dari upah prajurit itu.\"","language":"bahasa"}],"narrated":[{"text":"Abu Sa\u0027id Al-Khudri (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Sa\u0027id Al-Khudri r.a. melaporkan:","language":"bahasa"}]},{"index":"1310","hadith_id":"riyadussalihin","text":[{"text":"وعن البراء رضي الله عنه قال أتى النبي صلى الله عليه وسلم رجل مقنع بالحديد، فقال يا رسول الله أقاتل أو أسلم‏؟‏ قال‏:‏ ‏\"‏أسلم، ثم قاتل‏\"‏ فأسلم، ثم قاتل فقتل، فقال رسول الله صلى الله عليه وسلم ‏:‏ عمل قليلا وأُجر كثيرًا‏\"‏ ‏(‏‏(‏متفق عليه وهذا لفظ البخاري‏)‏‏)‏ ‏.‏","language":"arabic"},{"text":"A man equipped with arms came to the Prophet (ﷺ) and asked: \"O Messenger of Allah! Should I go and fight or should I embrace Islam first?\" He (ﷺ) replied, \"Enter in the fold of Islam and then fight.\" He embraced Islam and fought until he was killed. Thereupon the Messenger of Allah (ﷺ) said, \"He accepted Islam for a short time but was rewarded much.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Seorang pria bersenjata datang kepada Nabi (ﷺ) dan bertanya: \"Ya Rasulullah! Haruskah saya pergi berperang atau haruskah saya memeluk Islam terlebih dahulu?\" Dia (ﷺ) menjawab, \"Masuk Islam dan kemudian berperang.\" Dia memeluk Islam dan berperang sampai dia terbunuh. Kemudian Rasulullah (ﷺ) berkata, \"Dia menerima Islam untuk waktu yang singkat tetapi pahala yang banyak.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Al-Bara (May Allah be pleased with him) reported:","language":"english"},{"text":"Al-Bara radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"1311","hadith_id":"riyadussalihin","text":[{"text":"وعن أنس رضي الله عنه أن النبي صلى الله عليه وسلم قال‏:‏ ‏\"‏ما أحد يدخل الجنة يحب أن يرجع إلى الدنيا وله ما على الأرض من شيء إلا الشهيد، يتمنى أن يرجع إلى الدنيا فيقتل عشر مرات لما يرى من الكرامة”","language":"arabic"},{"text":"The Prophet (ﷺ) said, \"No one who has entered Jannah will desire to return to this world even if he should be given all that the world contains, except a martyr. For he will yearn that he should return to the world and be killed ten times on account of the dignity that he will experience by virtue of his martyrdom.\" Another narration is: \"On account of the excellence and distinction, he will experience as a result of martyrdom.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Nabi (ﷺ) berkata, \"Tidak ada seorang pun yang telah memasuki Jannah akan berkeinginan untuk kembali ke dunia ini bahkan jika ia harus diberi semua isi dunia, kecuali seorang syahid. Karena ia akan mendambakan bahwa ia harus kembali ke dunia dan menjadi dibunuh sepuluh kali karena martabat yang akan dia alami karena kemartirannya.\" Narasi lain adalah: \"Karena keunggulan dan perbedaan, dia akan mengalami sebagai akibat dari kesyahidan.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Anas (May Allah be pleased with him) reported:","language":"english"},{"text":"Anas (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"1312","hadith_id":"riyadussalihin","text":[{"text":"وعن عبد الله بن عمرو بن العاص رضي الله عنهما أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏ \"‏يغفر الله للشهيد كل شيء إلا الدين‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"Allah forgives every sin of a martyr, except his debt.\" [Muslim]. Another narration in Muslim is: The Messenger of Allah (ﷺ) said, \"Being martyred in the Cause of Allah expiates for everything, except debt.\"","language":"english"},{"text":"Rasulullah SAW bersabda, “Allah mengampuni setiap dosa orang yang mati syahid, kecuali hutangnya.” [Muslim] . Riwayat lain dalam Muslim adalah: Rasulullah (ﷺ) berkata, \"Mati syahid di jalan Allah menghapus segala sesuatu, kecuali utang.\"","language":"bahasa"}],"narrated":[{"text":"\u0027Abdullah bin \u0027Amr bin Al-\u0027As (May Allah be pleased with them) reported:","language":"english"},{"text":"\u0027Abdullah bin \u0027Amr bin Al-\u0027As (semoga Allah meridhoi mereka) melaporkan:","language":"bahasa"}]},{"index":"1313","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي قتادة رضي الله عنه أن رسول الله صلى الله عليه وسلم قام فيهم فذكر أن الجهاد في سبيل الله والإيمان بالله أفضل الأعمال فقام رجل فقال يا رسول الله أرأيت إن قتلت في سبيل الله أتكفر عني خطاياي‏؟‏ فقال رسول الله صلى الله عليه وسلم‏:‏ ‏\"‏نعم إن قتلت في سبيل الله وأنت صابر محتسب مقبل غير مدبر‏\"‏ ثم قال رسول الله صلى الله عليه وسلم‏:‏ ‏\"‏كيف قلت‏؟‏‏\"‏ قال‏:‏ أرأيت إن قتلت في سبيل الله أتكفر عني خطاياي‏؟‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏نعم وأنت صابر محتسب مقبل غير مدبر إلا الدين فإن جبريل عليه السلام قال لي ذلك‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) stood up among his Companions and said, \"Jihad in the way of Allah and belief in Allah (with all His Attributes) are the most meritorious of actions.\" A man stood up and said: \"O Messenger of Allah! Inform me if I am killed in the way of Allah, will my sins be blotted out?\" The Messenger of Allah (ﷺ) said, \"Yes, in case you are killed in the way of Allah and you remained patient, hopeful of reward, and advancing forward without retracing back (i.e., while fighting).\" Then he said, \"What was your question?\" He inquired again: \"Inform me, if I am killed in the way of Allah, will all my sins be blotted out?\" The Messenger of Allah (ﷺ) replied, \"If you remained patient, hopeful of reward and always fought without turning your back upon enemy, everything, except debt, will be forgiven. Jibril has told me this.\" [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berdiri di antara para sahabatnya dan berkata, \"Jihad di jalan Allah dan iman kepada Allah (dengan segala sifat-Nya) adalah tindakan yang paling berjasa.\" Seorang pria berdiri dan berkata: \"Ya Rasulullah! Beritahu saya jika saya terbunuh di jalan Allah, apakah dosa-dosa saya akan dihapus?\" Rasulullah (ﷺ) berkata, \"Ya, jika Anda terbunuh di jalan Allah dan Anda tetap sabar, berharap pahala, dan maju ke depan tanpa mundur ke belakang (yaitu, saat berperang).\" Lalu dia berkata, \"Apa pertanyaanmu?\" Dia bertanya lagi: \"Beri tahu saya, jika saya terbunuh di jalan Allah, apakah semua dosa saya akan dihapus?\" Rasulullah (ﷺ) menjawab, “Jika kamu tetap sabar, mengharap pahala dan selalu berjuang tanpa membelakangi musuh, semuanya, kecuali hutang, akan diampuni. Jibril telah memberitahuku ini.\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Qatadah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Qatadah r.a. melaporkan:","language":"bahasa"}]},{"index":"1314","hadith_id":"riyadussalihin","text":[{"text":"وعن جابر رضي الله عنه قال‏:‏ قال رجل‏:‏ أين أنا يا رسول الله إن قتلت‏؟‏ قال‏:‏ “في الجنة‏ \"‏ فألقى تمرات كن في يده ثم قاتل حتى قتل‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"A man asked the Messenger of Allah (ﷺ): \"Tell me where I will be if I am killed while fighting in the way of Allah?\" He (ﷺ) replied, \"In Jannah.\" The man threw away the few dates which he had in his hand, jumped into the battlefield and fought on till he was killed. [Muslim]","language":"english"},{"text":"Seorang pria bertanya kepada Rasulullah (ﷺ): \"Katakan padaku di mana aku akan berada jika aku terbunuh saat berperang di jalan Allah?\" Dia (ﷺ) menjawab, \"Di Jannah.\" Pria itu membuang beberapa kurma yang ada di tangannya, melompat ke medan perang dan berjuang sampai dia terbunuh. [Muslim]","language":"bahasa"}],"narrated":[{"text":"Jabir (May Allah be pleased with him) reported:","language":"english"},{"text":"Jabir (ra dengan dia) melaporkan:","language":"bahasa"}]},{"index":"1315","hadith_id":"riyadussalihin","text":[{"text":"وعن أنس رضي الله عنه قال انطلق رسول الله صلى الله عليه وسلم وأصحابه حتى سبقوا المشركين إلى بدر وجاء المشركون، فقال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏لا يقدمن أحد منكم إلى شيء حتى أكون أنا دونه‏\"‏ فدنا المشركون، فقال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏قوموا إلى جنة عرضها السماوات والأرض‏\"‏ قال‏:‏ يقول عمير بن الحمام الأنصاري رضي الله عنه‏:‏ يا رسول الله جنة عرضها السماوات والأرض‏؟‏ قال‏:‏ ‏\"‏نعم‏\"‏ قال‏:‏ بخ بخ‏!‏ فقال رسول الله صلى الله عليه وسلم‏:‏ “ما يحملك على قولك بخ بخ‏\"‏ قال فإنك من أهلها فأخرج تمرات من قرنه فجعل يأكل منهن، ثم قال لئن أنا حييت حتى آكل تمراتي هذه إنها لحياة طويلة‏!‏ فرمى بما كان معه من التمر، ثم قاتلهم حتى قتل‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏ (4)","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) and his Companions reached Badr before the polytheists, and when they arrived, he (ﷺ) directed: \"Let no one of you advance ahead of me.\" When the polytheists came near, the Messenger of Allah (ﷺ) said, \"Now stand up and proceed towards Jannah which is as wide as are the heavens and the earth.\" \u0027Umair bin Al-Humam (May Allah be pleased with him) asked: \"Is Jannah as wide as are the heaven and the earth?\" The Messenger of Allah (ﷺ) replied in the affirmative. \u0027Umair remarked: \"Great!\" The Messenger of Allah (ﷺ) asked him what had urged him to say so. He replied: \"Nothing, O Messenger of Allah! But hope that I might become one of the inhabitants of Jannah.\" The Messenger of Allah (ﷺ) said, \"You will definitely be among them.\" \u0027Umair then took some dates out of his quiver and began to eat them, but after a short time he said: \"If I survive till I eat my dates, it will mean a long life.\" So he threw away the dates which he had with him and then fought with the enemy till he was killed. [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) dan para sahabatnya mencapai Badar sebelum orang-orang musyrik, dan ketika mereka tiba, dia () memerintahkan: \"Janganlah seorang pun dari kalian mendahuluiku.\" Ketika orang-orang musyrik itu mendekat, Rasulullah (ﷺ) berkata, “Sekarang berdirilah dan berjalanlah menuju Jannah yang seluas langit dan bumi.” \u0027Umair bin Al-Humam (ra dengan dia) bertanya: \"Apakah Jannah seluas langit dan bumi?\" Rasulullah menjawab mengiyakan. \u0027Umair berkomentar: \"Hebat!\" Rasulullah (ﷺ) bertanya kepadanya apa yang mendorongnya untuk mengatakan demikian. Dia menjawab: \"Tidak ada, ya Rasulullah! Tapi berharap bahwa saya bisa menjadi salah satu penghuni Jannah.\" Rasulullah (ﷺ) berkata, \"Kamu pasti termasuk di antara mereka.\" \u0027 Umair kemudian mengambil beberapa kurma dari wadahnya dan mulai memakannya, tetapi setelah beberapa saat dia berkata: \"Jika saya bertahan sampai saya memakan kurma saya, itu berarti umur panjang.\" Maka dia membuang kurma yang ada padanya lalu berperang melawan musuh sampai dia terbunuh. [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Anas (May Allah be pleased with him) reported:","language":"english"},{"text":"Anas (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"1316","hadith_id":"riyadussalihin","text":[{"text":"وعنه قال‏:‏ جاء ناس إلى النبي صلى الله عليه وسلم أن ابعث معنا رجالا يعلمونا القرآن والسنة فبعث إليهم سبعين رجلا من الأنصار يقال لهم‏:‏ القراء، فيهم خالي حرام، يقرءون القرآن ويتدارسونه بالليل يتعلمون، وكانوا بالنهار يجيئون بالماء فيضعونه في المسجد، ويحتطبون فيبيعونه، ويشترون به الطعام لأهل الصفة، وللفقراء فبعثهم صلى الله عليه وسلم فعرضوا لهم فقتلوهم قبل أن يبلغوا المكان، فقالوا‏:‏ اللهم بلغ عنا نبينا أن قد لقيناك فرضينا عنك ورضيت عنا، وأتى رجل حراما خال أنس من خلف فطعنه برمح حتى أنفذه، فقال حرام‏:‏ فزت ورب الكعبة، فقال رسول الله صلى الله عليه وسلم ‏ \"‏إن إخوانكم قد قتلوا وإنهم قالوا‏:‏ اللهم بلغ عنا نبينا أنا قد لقيناك فرضينا عنك ورضيت عنا‏\"‏ ‏(‏‏(‏متفق عليه وهذا لفظ مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"Some people came to the Prophet (ﷺ) and said to him: \"Send with us some men who may teach us the Qur\u0027an and the Sunnah.\" He (ﷺ) sent seventy men from the Ansar. They were called Al-Qurra\u0027 (the reciters) and among them was my maternal uncle, Haram. They used to recite the Qur\u0027an, ponder over its meaning and learn (its wisdom) at night. In the day, they used to bring water and pour it in pitchers in the mosque, then they would collect wood and sell it; and with the sale proceeds, they would buy food for the people of As-Suffah and the needy. The Prophet (ﷺ) sent the reciters with these people but these (treacherous people) fell upon them and killed them before they reached their destination. (While dying) they supplicated: \"O Allah convey from us the news to our Prophet that we have met You (in a way), that we are pleased with You and You are pleased with us.\" (The narrator said:) A man attacked Haram from behind and smote him with a spear which pierced him. Whereupon Haram said: \"By the Rubb of Ka\u0027bah, I have met with success. The Messenger of Allah (ﷺ) said to his Companions, \"Your brethren have been slain and they were saying: \"O Allah! Convey from us to our Prophet the news that we have met You (in a way) that we are pleased with You and You are pleased with us.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Beberapa orang datang kepada Nabi (ﷺ) dan berkata kepadanya: \"Kirimkan bersama kami beberapa orang yang dapat mengajari kami Al-Qur\u0027an dan Sunnah.\" Dia (ﷺ) mengirim tujuh puluh orang dari Ansar. Mereka disebut Al-Qurra\u0027 (para qari) dan di antara mereka adalah paman dari pihak ibu saya, Haram. Mereka biasa membaca Al-Qur\u0027an, merenungkan maknanya dan belajar (hikmatnya) di malam hari. Pada siang hari, mereka biasa membawa air dan menuangkannya ke dalam kendi di masjid, kemudian mereka mengumpulkan kayu dan menjualnya; dan dengan hasil penjualan, mereka akan membeli makanan untuk penduduk As-Suffah dan orang-orang yang membutuhkan. Nabi (ﷺ) mengirim para qari dengan orang-orang ini tetapi (orang-orang pengkhianat) ini menyerang mereka dan membunuh mereka sebelum mereka mencapai tujuan mereka. (sambil sekarat) mereka berdoa: \"Ya Allah sampaikan dari kami berita kepada Nabi kami bahwa kami telah bertemu Anda (dalam suatu cara), bahwa kami ridha kepada-Mu dan Engkau ridha kepada kami.\" (Perawi berkata:) Seorang laki-laki menyerang Haram dari belakang dan menikamnya dengan tombak yang menusuknya. Kemudian Haram berkata: \"Demi Ka\u0027bah, aku telah bertemu dengan sukses. Rasulullah (ﷺ) berkata kepada para sahabatnya, “Saudara-saudaramu telah terbunuh dan mereka berkata: “Ya Allah! Sampaikan dari kami kepada Nabi kami kabar bahwa kami telah bertemu dengan-Mu (dengan cara) bahwa kami ridha kepada-Mu dan Engkau ridha kepada kami.” [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Anas (May Allah be pleased with him) reported:","language":"english"},{"text":"Anas (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"1317","hadith_id":"riyadussalihin","text":[{"text":"وعنه قال‏:‏ غاب عمي أنس بن النضر رضي الله عنه عن قتال بدر، فقال‏:‏ يا رسول الله غبت عن أول قتال قاتلت الشركين لئن الله أشهدني قتال المشركين ليرين الله ما أصنع‏.‏ فلما كان يوم أحد انكشف المسلمون، فقال اللهم إني اعتذر إليك مما صنع هؤلاء - يعني الصحابة- وأبرأ إليك مما صنع هؤلاء يعني المشركين- ثم تقدم فاستقبله سعد بن معاذ فقال‏:‏ يا سعد بن معاذ الجنة ورب النضر، إني أجد ريحها من دون أحد‏!‏ قال سعد‏:‏ فما استطعت يا رسول الله ما صنع‏!‏ قال أنس‏:‏ فوجدنا به بضعًا وثمانين ضربة بالسيف، أو طعنة برمح أو رمية بسهم، ووجدناه قد قتل ومثل به المشركون، فما عرفه أحد إلا أخته ببنانه، قال أنس‏:‏ كنا نرى -أو نظن- أن هذه الآية نزلت فيه وفي أشباهه‏:‏ ‏{‏من المؤمنين رجال صدقوا ما عاهدوا الله عليه فمنهم من قضى نحبه‏}‏ إلى آخره ‏(‏‏(‏الأحزاب 23‏)‏‏)‏‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ وقد سبق في باب المجاهدة‏.‏","language":"arabic"},{"text":"My uncle Anas bin An- Nadr (May Allah be pleased with him) was absent from the battle of Badr. He said: \"O Messenger of Allah! I was absent from the first battle you fought against the pagans. (By Allah!) if Allah gives me a chance to fight against the pagans, no doubt, Allah will see how (bravely) I will fight.\" On the Day of Uhud, when the Muslims turned their backs and fled, he said, \"O Allah! I apologize to You for what these (i.e., his companions) have done, and I denounce what these (i.e., the pagans) have done.\" Then he advanced and Sa\u0027d bin Mu\u0027adh met him. He said: \"O Sa\u0027d bin Mu\u0027adh! By the Rubb of An-Nadr, Jannah! I am smelling its aroma coming from before (the mountain of) Uhud,\" Later on, Sa\u0027d said: \"O Messenger of Allah! I cannot achieve or do what he (i.e., Anas bin An-Nadr) did. We found more than eighty wounds by swords, spears and arrows on his body. We found him dead and his body was mutilated so badly that none except his sister could recognise him by his finger.\" We used to think that the following Ayah was revealed concerning him and other men of his sort: \"Among the believers are men who have been true to their covenant with Allah (i.e., they have gone out for Jihad, and showed not their backs to the disbelievers), of them some have fulfilled their obligations (i.e., have been martyred).\" (33:23).","language":"english"},{"text":"Paman saya Anas bin An-Nadr (semoga Allah meridhoinya) tidak hadir dalam perang Badar. Dia berkata: \"Ya Rasulullah! Saya absen dari pertempuran pertama Anda melawan orang-orang kafir. (Demi Allah!) jika Allah memberi saya kesempatan untuk berperang melawan orang-orang kafir, tidak diragukan lagi, Allah akan melihat bagaimana (dengan berani) saya akan bertarung.\" Pada hari Uhud, ketika kaum Muslim berbalik dan melarikan diri, dia berkata, \"Ya Allah! Saya mohon maaf kepada-Mu atas apa yang telah dilakukan oleh mereka (yaitu, para sahabatnya), dan saya mencela apa yang telah dilakukan oleh mereka (yaitu, orang-orang kafir). selesai.\" Kemudian dia maju dan Sa\u0027d bin Mu\u0027adz menemuinya. Dia berkata: \"Wahai Sa\u0027d bin Mu\u0027adz! Demi An-Nadr, Jannah! Aku mencium aromanya yang berasal dari sebelum (gunung) Uhud,\" Kemudian Sa\u0027d berkata: \"Wahai Rasulullah dari Allah! Saya tidak dapat mencapai atau melakukan apa yang dia (yaitu, Anas bin An-Nadr) melakukannya. Kami menemukan lebih dari delapan puluh luka akibat pedang, tombak, dan panah di tubuhnya. Kami menemukan dia mati dan tubuhnya dimutilasi sedemikian rupa sehingga tidak seorang pun kecuali saudara perempuannya yang dapat mengenalinya dengan jarinya.\" Kami dulu mengira bahwa Ayat berikut diturunkan tentang dia dan orang-orang lain dari jenisnya: \"Di antara orang-orang beriman ada orang-orang yang telah setia pada perjanjian mereka dengan Allah (yaitu, mereka telah keluar untuk jihad, dan tidak menunjukkan punggung mereka kepada orang-orang kafir), dari mereka beberapa telah memenuhi kewajiban mereka (yaitu, mati syahid).\" (33:23). Kami dulu mengira bahwa ayat berikut diturunkan tentang dia dan orang-orang lain dari jenisnya: “Di antara orang-orang mukmin ada orang-orang yang setia pada perjanjian mereka dengan Allah (yaitu, mereka keluar untuk jihad, dan tidak membelakangi mereka). orang-orang kafir), di antara mereka ada yang menunaikan kewajibannya (yakni mati syahid). (33:23). Kami dulu mengira bahwa ayat berikut diturunkan tentang dia dan orang-orang lain dari jenisnya: “Di antara orang-orang mukmin ada orang-orang yang setia pada perjanjian mereka dengan Allah (yaitu, mereka keluar untuk jihad, dan tidak membelakangi mereka). orang-orang kafir), di antara mereka ada yang menunaikan kewajibannya (yakni mati syahid). (33:23).","language":"bahasa"}],"narrated":[{"text":"Anas (May Allah be pleased with him) reported:","language":"english"},{"text":"Anas (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"1318","hadith_id":"riyadussalihin","text":[{"text":"وعن سمرة رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ “رأيت الليلة رجلين أتياني فصعدا بي الشجرة وأدخلاني دارًا هي أحسن وأفضل، لم أر قط أحسن منها، قال أما هذه الدار فدار الشهداء‏\"‏ (5)","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"Last night two men (angels) came to me (in a dream) and made me ascend a tree and then admitted me into a nice and excellent house, the like of which I have never seen before. One of them said: \u0027This house is the house of martyrs\u0027.\" [Al- Bukhari].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Tadi malam dua orang (malaikat) datang kepada saya (dalam mimpi) dan membuat saya naik pohon dan kemudian memasukkan saya ke sebuah rumah yang bagus dan bagus, seperti yang belum pernah saya lihat. sebelumnya. Salah satu dari mereka berkata: \u0027Rumah ini adalah rumah para syuhada\u0027.\" [Al-Bukhari] .","language":"bahasa"}],"narrated":[{"text":"Samurah (May Allah be pleased with him) reported:","language":"english"},{"text":"Samurah (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"1319","hadith_id":"riyadussalihin","text":[{"text":"وعن أنس رضي الله عنه أن أم الربيع بنت البراء وهي أم حارثة بن سراقة أتت النبي صلى الله عليه وسلم فقالت‏:‏ يا رسول الله ألا تحدثني عن حارثة‏.‏ وكان قتل يوم بدر، فإن كان في الجنة صبرت، وإن كان غير ذلك اجتهدت عليه في البكاء، فقال‏:‏ ‏ \"‏يا أم حارثة إنها جنان في الجنة، وإن ابنك أصاب الفردوس الأعلى‏\"‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","language":"arabic"},{"text":"Umm Ar-Rubaiy\u0027i bint Al-Bara\u0027, who was the mother of Harithah bin Suraqah, came to the Prophet (ﷺ) and said: \"O Messenger of Allah! Will you not tell me about Harithah? (He was killed in the battle of Badr). If he is in Jannah I shall show endurance, but if he has met another fate, I may exert myself in weeping for him.\" He (ﷺ) replied, \"O mother of Harithah, in in the gardens of Jannah there are many ranks, and your son has attained Al-Firdaus, the highest.\" [Al- Bukhari].","language":"english"},{"text":"Umm Ar-Rubaiy\u0027i binti Al-Bara\u0027, ibu dari Harithah bin Suraqah, datang kepada Nabi (ﷺ) dan berkata: \"Ya Rasulullah! perang Badar). Jika dia berada di Jannah, saya akan menunjukkan kesabaran, tetapi jika dia bertemu dengan nasib lain, saya mungkin akan mengerahkan diri saya untuk menangisinya.” Dia (ﷺ) menjawab, \"Wahai ibu Harithah, di dalam taman Jannah ada banyak tingkatan, dan anakmu telah mencapai Al-Firdaus, yang tertinggi.\" [Al-Bukhari] .","language":"bahasa"}],"narrated":[{"text":"Anas (May Allah be pleased with him) reported:","language":"english"},{"text":"Anas (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"1320","hadith_id":"riyadussalihin","text":[{"text":"وعن جابر بن عبد الله رضي الله عنهما قال‏:‏ جيء بأبي إلى النبي صلى الله عليه وسلم قد مثل به فوضع بين يديه، فذهبت أكشف عن وجهه فنهاني قوم فقال النبي صلى الله عليه وسلم‏:‏ ‏\"‏ما زالت الملائكة تظله بأجنحتها” ‏(‏‏(‏متفق عليه‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The dead body of my father, who was mutilated by the enemy, was brought and placed before the Prophet (ﷺ). I got up to uncover his face but the people stopped me, and the Prophet (ﷺ) said, \"The angels continue to cover him with their wings.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Mayat ayahku, yang dimutilasi oleh musuh, dibawa dan ditempatkan di hadapan Nabi (ﷺ). Saya bangun untuk membuka wajahnya tetapi orang-orang menghentikan saya, dan Nabi (ﷺ) berkata, \"Para malaikat terus menutupinya dengan sayap mereka.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Jabir bin \u0027Abdullah (May Allah be pleased with them) reported:","language":"english"},{"text":"Jabir bin \u0027Abdullah (ra dengan mereka) melaporkan:","language":"bahasa"}]},{"index":"1321","hadith_id":"riyadussalihin","text":[{"text":"وعن سهل بن حنيف رضي الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏ \"‏من سأل الله تعالى الشهادة بصدق بلغه الله منازل الشهداء وإن مات على فراشه‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"He who supplicates Allah sincerely for martyrdom, Allah will elevate him to the station of the martyrs, even if he dies on his bed.\" [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, \"Barang siapa yang berdoa dengan tulus untuk mati syahid, Allah akan mengangkatnya ke derajat para syuhada, bahkan jika dia mati di tempat tidurnya.\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Sahl bin Hunaif (May Allah be pleased with him) reported:","language":"english"},{"text":"Sahl bin Hunaif radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"1322","hadith_id":"riyadussalihin","text":[{"text":"وعن أنس رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏ \"‏من طلب الشهادة صادقًا أعطيها ولو لم تصبه‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"He who supplicates sincerely for martyrdom, it will be granted to him even though he is not killed on the battlefield.\" [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, \"Barang siapa yang berdoa dengan tulus untuk mati syahid, akan dikabulkan baginya meskipun dia tidak terbunuh di medan perang.\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Anas (May Allah be pleased with him) reported:","language":"english"},{"text":"Anas (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"1323","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي هريرة رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏ \"‏ما يجد الشهيد من مس القتل إلا كما يجد أحدكم من مس القرصة‏\"‏ ‏(‏‏(‏رواه الترمذي وقال‏:‏ حديث حسن صحيح‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"The martyr experiences no more pain in being slain than one of you experiences from the stinging of an ant.\" [At-Tirmidhi].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Orang yang mati syahid tidak merasakan sakit yang lebih sakit daripada yang dialami salah satu dari kalian karena disengat semut.\" [At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"1324","hadith_id":"riyadussalihin","text":[{"text":"وعن عبد الله بن أبي أوفى رضي الله عنهما أن رسول الله صلى الله عليه وسلم في بعض أيامه التي لقي فيها العدو انتظر حتى مالت الشمس، ثم قام في الناس فقال‏:‏ ‏\"‏ أيها الناس، لا تتمنوا لقاء العدو، وسلو الله العافية، فإذا لقيتموه فاصبروا، واعلموا أن الجنة تحت ظلال السيوف‏\"‏ ثم قال‏:‏ ‏\"‏اللهم منزل الكتاب ومجري السحاب، وهازم الأحزاب اهزمهم وانصرنا عليهم‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","language":"arabic"},{"text":"On one occasion the Messenger of Allah (ﷺ) was confronting the enemy. He waited until the sun had declined. Then he stood up to address the people and said, \"O people! Do not wish for an encounter with the enemy. Pray to Allah to grant you safety; (but) when you encounter them, show patience, and know that Jannah is under the shades of the swords.\" Then he (ﷺ) said: \"Allahumma munzilal-kitab, wa mujriyas- sahab, wa hazimal-Ahzab, ihzimhum wansurna alaihim (O Allah, Revealer of the Book, Disperser of the clouds, Defeater of the Confederates, put our enemy to rout and support us against them).\" [Al- Bukhari and Muslim].","language":"english"},{"text":"Pada suatu kesempatan Rasulullah (ﷺ) sedang menghadapi musuh. Dia menunggu sampai matahari terbenam. Kemudian dia berdiri untuk berbicara kepada orang-orang dan berkata, \"Hai manusia! Jangan berharap untuk bertemu dengan musuh. Berdoalah kepada Allah untuk memberi Anda keselamatan; (tetapi) ketika Anda bertemu mereka, tunjukkan kesabaran, dan ketahuilah bahwa Jannah ada di bawah bayangan pedang.\" Kemudian beliau () berkata: “Allahumma munzilal-kitab, wa mujriyas-sahab, wa hazimal-Ahzab, ihzimhum wansurna alaihim (Ya Allah, Pewahyu Kitab, Pemecah awan, Penakluk Konfederasi, hancurkan musuh kami. dan dukung kami melawan mereka).\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"\u0027Abdullah bin Abu Aufa (May Allah be pleased with them) reported:","language":"english"},{"text":"\u0027Abdullah bin Abu Aufa (semoga Allah meridhoi mereka) melaporkan:","language":"bahasa"}]},{"index":"1325","hadith_id":"riyadussalihin","text":[{"text":"وعن سهل بن سعد رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏ \"‏ثنتان لا تردان، أو قلما تردان‏:‏ الدعاء عند النداء وعند البأس حين يلحم بعضهم بعضًا‏\"‏ ‏(‏‏(‏رواه أبو داود بإسناد صحيح‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"Supplications at two times are never turned down (or said, \"Are seldom turned down\"), a supplication after the Adhan has been proclaimed, and a supplication during the battle combating the enemy.\" [Abu Dawud].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, \"Doa dua kali tidak pernah ditolak (atau diucapkan, \"Jarang ditolak\"), doa setelah adzan dikumandangkan, dan doa selama pertempuran memerangi musuh.\" [Abu Daud] .","language":"bahasa"}],"narrated":[{"text":"Sahl bin Sa\u0027d (May Allah be pleased with him) reported:","language":"english"},{"text":"Sahl bin Sa\u0027d radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"1326","hadith_id":"riyadussalihin","text":[{"text":"وعن أنس رضي الله عنه قال‏:‏ كان رسول الله صلى الله عليه وسلم إذا غزا قال‏:‏ ‏ \"‏اللهم أنت عضدي ونصيري، بك أحول وبك أجول وبك أصول، وبك أقاتل‏\"‏ ‏(‏‏(‏رواه أبو داود، والترمذي وقال‏:‏ حديث حسن‏)‏‏)‏‏.‏","language":"arabic"},{"text":"Whenever the Messenger of Allah (ﷺ) set out to participate in Jihad, he would supplicate: \"Allahumma Anta \u0027adudi wa nasiri, bika ahulu, wa bika asulu, wa bika uqatilu (O Allah, You are my Supporter and my Helper. With Your help I get strength, and with Your help I bounce upon the enemy and defeat it, and with Your help I fight).\" [Abu Dawud and At- Tirmidhi].","language":"english"},{"text":"Setiap kali Rasulullah (ﷺ) berangkat untuk berpartisipasi dalam Jihad, dia akan berdoa: \"Allahumma Anta \u0027adudi wa nasiri, bika ahulu, wa bika asulu, wa bika uqatilu (Ya Allah, Engkau Penolong dan Penolongku. Dengan Bantuan-Mu aku mendapatkan kekuatan, dan dengan bantuan-Mu aku bangkit melawan musuh dan mengalahkannya, dan dengan bantuan-Mu aku melawan).\" [Abu Dawud dan At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Anas (May Allah be pleased with him) reported:","language":"english"},{"text":"Anas (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"1327","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي موسى، رضي الله عنه أن النبي صلى الله عليه وسلم كان إذا خاف قومًا قال‏:‏ اللهم إنا نجعلك في نحورهم، ونعوذ بك من شرورهم‏\"‏‏.‏ ‏(‏‏(‏رواه أبو داود بإسناد صحيح‏)‏‏)‏‏.‏","language":"arabic"},{"text":"When the Prophet (ﷺ) had any fear of an enemy, he used to supplicate: \"Allahumma inna naj\u0027aluka fi nuhurihim, wa na\u0027udhu bika min shururihim (O Allah! We put You in front of them, and we seek refuge in You from their evils).\" [Ahmad and Abu Dawud].","language":"english"},{"text":"Ketika Nabi (ﷺ) takut pada musuh, dia biasa berdoa: \"Allahumma inna naj\u0027aluka fi nuhurihim, wa na\u0027udhu bika min shururihim (Ya Allah! Kami menempatkan Engkau di depan mereka, dan kami berlindung). kepada-Mu dari kejahatan mereka).” [Ahmad dan Abu Daud] .","language":"bahasa"}],"narrated":[{"text":"Abu Musa Al-Ash\u0027ari (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Musa Al-Asy\u0027ari r.a. melaporkan:","language":"bahasa"}]},{"index":"1328","hadith_id":"riyadussalihin","text":[{"text":"وعن ابن عمر رضي الله عنهما أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏ \"‏الخيل معقود في نواصيها الخير إلى يوم القيامة‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"There is goodness in the forelocks of horses till the Day of Resurrection.\" [Al-Bukhari and Muslim]","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, “Ada kebaikan pada ubun-ubun kuda sampai hari kiamat.” [Al-Bukhari dan Muslim]","language":"bahasa"}],"narrated":[{"text":"Ibn \u0027Umar (May Allah be pleased with them) reported:","language":"english"},{"text":"Ibnu \u0027Umar radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"1329","hadith_id":"riyadussalihin","text":[{"text":"وعن عروة البارقي رضي الله عنه أن النبي صلى الله عليه وسلم قال‏:‏ الخيل معقود في نواصيها الخير إلى يوم القيامة‏:‏ الأجر والمغنم‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","language":"arabic"},{"text":"The Prophet (ﷺ) said, \"Goodness is tied to the foreheads of horses until the Day of Resurrection, i.e., reward (in the Hereafter) and spoils.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Nabi (ﷺ) berkata, \"Kebaikan terikat pada dahi kuda sampai Hari Kebangkitan, yaitu pahala (di akhirat) dan rampasan.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"\u0027Urwah Al-Bariqi (May Allah be pleased with him) reported:","language":"english"},{"text":"\u0027Urwah Al-Bariqi (ra dengan dia) melaporkan:","language":"bahasa"}]},{"index":"1330","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي هريرة رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏\"‏من احتبس فرسًا في سبيل الله إيمانًا بالله وتصديقًا بوعده، فإن شبعه، وروثه، وبوله في ميزانه يوم القيامة” ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"He who keeps a horse for Jihad purposes, having faith in Allah and relying on His Promise, will find that its fodder, drink, droppings and urine will all be credited to him in his Scales on the Day of Resurrection.\" [Al- Bukhari].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Barangsiapa memelihara kuda untuk tujuan Jihad, karena beriman kepada Allah dan mengandalkan Janji-Nya, akan menemukan bahwa pakan, minuman, kotoran dan air kencingnya semua akan dimasukkan ke dalam timbangannya pada timbangannya. hari kiamat.” [Al-Bukhari] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"1331","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي مسعود رضي الله عنه قال‏:‏ جار رجل إلى النبي صلى الله عليه وسلم بناقة مخطومة فقال‏:‏ هذه في سبيل الله، فقال رسول الله صلى الله عليه وسلم‏:‏ ‏ \"‏لك بها يوم القيامة سبعمائة ناقة كلها مخطومة‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"A man came to the Prophet (ﷺ) with a she-camel wearing a nose-string and said: \"This is (a gift) in the Cause of Allah.\" The Messenger of Allah (ﷺ) replied, \"You will have in return for it on the Day of Resurrection seven hundred she-camels and every one of them will be wearing a nose-string.\" [Muslim].","language":"english"},{"text":"Seorang pria datang kepada Nabi (ﷺ) dengan seekor unta betina yang memakai tali hidung dan berkata: \"Ini adalah (hadiah) di jalan Allah.\" Rasulullah (ﷺ) menjawab, \"Engkau akan mendapat imbalannya pada Hari Kebangkitan tujuh ratus unta betina dan masing-masing dari mereka akan memakai tali hidung.\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Mas\u0027ud (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Mas\u0027ud (ra dengan dia) melaporkan:","language":"bahasa"}]},{"index":"1332","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي حماد- ويقال‏:‏ أبو سعاد، ويقال‏:‏ أبو أسد، ويقال‏:‏ أبو عامر، ويقال‏:‏ أبو عمرو، ويقال‏:‏ أبو الأسود، ويقال‏:‏ أبو عبس- عقبة بن عامر الجهني، رضي الله عنه قال‏:‏ سمعت رسول الله صلى الله عليه وسلم وهو على المنبر يقول‏:‏ “وأعدوا لهم ما استطعتم من قوة ألا إن القوة الرمي، ألا إن القوة الرمي، ألا إن القوة الرمي‏\"‏‏.‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏ وعنه قال‏:‏ سمعت رسول الله صلى الله عليه وسلم يقول‏:‏ ‏\"‏ستفتح عليكم أرضون ويكفيكم الله فلا يعجز أحدكم أن يلهو بأسهمه‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"I heard the Messenger of Allah (ﷺ) saying from the pulpit, \"Prepare to meet them (the enemy) with as much strength as you can afford. Verily! Strength is in archery, strength is in archery, strength is in archery.\" [Muslim].","language":"english"},{"text":"Saya mendengar Rasulullah (ﷺ) berkata dari mimbar, \"Bersiaplah untuk menghadapi mereka (musuh) dengan kekuatan sebanyak yang Anda mampu. Sesungguhnya! Kekuatan dalam memanah, kekuatan dalam memanah, kekuatan dalam memanah.\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"\u0027Uqbah bin \u0027Amir Al-Juhani (May Allah be pleased with him) reported:","language":"english"},{"text":"\u0027Uqbah bin \u0027Amir Al-Juhani (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"1333","hadith_id":"riyadussalihin","text":[{"text":"وعنه قال‏:‏ سمعت رسول الله صلى الله عليه وسلم يقول‏:‏ ‏ \"‏ستفتح عليكم أرضون ويكفيكم الله فلا يعجز أحدكم أن يلهو بأسهمه‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"I heard the Messenger of Allah (ﷺ) saying, \"Lands shall be laid open to you, and Allah will suffice you (against your enemies), but none of you should neglect practicing his skill in archery.\" [Muslim].","language":"english"},{"text":"Saya mendengar Rasulullah (ﷺ) berkata, \"Tanah akan dibuka untuk Anda, dan Allah akan mencukupi Anda (melawan musuh Anda), tetapi tidak seorang pun dari Anda harus mengabaikan keterampilannya dalam memanah.\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"\u0027Uqbah bin \u0027Amir Juhani (May Allah be pleased with him) reported:","language":"english"},{"text":"\u0027Uqbah bin \u0027Amir Juhani (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"1334","hadith_id":"riyadussalihin","text":[{"text":"وعنه أنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏ \"‏من عُلم الرمي ثم تركه فليس منا أو فقد عصى‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"He who learnt archery and then neglected it, is not from us.\" (Or said,) \"He has been guilty of disobedience (to Messenger of Allah).\" [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Orang yang belajar memanah lalu mengabaikannya, bukanlah dari kami.\" (Atau berkata,) \"Dia telah bersalah karena ketidaktaatan (kepada Rasulullah).\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"\u0027Uqbah bin \u0027Amir Al-Juhani (May Allah be pleased with him) reported:","language":"english"},{"text":"\u0027Uqbah bin \u0027Amir Al-Juhani (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"1335","hadith_id":"riyadussalihin","text":[{"text":"وعنه، رضي الله عنه قال‏:‏ سمعت رسول الله صلى الله عليه وسلم يقول‏:‏ ‏\"‏إن الله يدخل بالسهم الواحد ثلاثة نفر الجنة‏:‏ صانعه يحتسب في صنعته الخير، والرامي به ومنبله‏.‏ وارموا واركبوا، وأن ترموا أحب إلي من أن تركبوا‏.‏ ومن ترك الرمي بعد ما علمه رغبة عنه فإنها نعمة تركها‏\"‏ أو قال‏:‏ ‏\"‏كفرها‏\"‏ ‏(‏‏(‏رواه أبو داود‏)‏‏)‏‏.‏","language":"arabic"},{"text":"I heard the Messenger of Allah (ﷺ) saying, \"Allah will admit three persons to Jannah for one arrow; the maker who has a good motive in making it, the one who shoots it, and the one who hands it up for shooting. So shoot and ride, but I like your shooting (more) than your riding. He who gives up archery after becoming adept in it for lack of interest, neglects a (great) blessing.\" (Or said,) \"One who does so is ungrateful.\" [Abu Dawud].","language":"english"},{"text":"Aku mendengar Rasulullah (ﷺ) bersabda, “Allah akan memasukkan tiga orang ke Jannah untuk satu anak panah; pembuat yang memiliki motif yang baik dalam membuatnya, orang yang menembaknya, dan orang yang menyerahkannya untuk menembak. Jadi tembak dan kendarai, tapi aku lebih suka menembakmu (lebih) daripada berkudamu. Dia yang berhenti memanah setelah menjadi mahir di dalamnya karena kurangnya minat, mengabaikan berkah (besar).\" (Atau berkata,) \"Orang yang melakukannya tidak tahu berterima kasih.\" [Abu Daud] .","language":"bahasa"}],"narrated":[{"text":"\u0027Uqbah bin \u0027Amir Al-Juhani (May Allah be pleased with him) reported:","language":"english"},{"text":"\u0027Uqbah bin \u0027Amir Al-Juhani (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"1336","hadith_id":"riyadussalihin","text":[{"text":"وعن سلمه بن الأكوع، رضي الله عنه قال‏:‏ مر النبي صلى الله عليه وسلم على نفر ينتضلون، فقال‏:‏ ‏ \"‏ارموا بني إسماعيل فإن أباكم كان راميًا‏\"‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Prophet (ﷺ) happened to pass by a group of people who were having a shooting match. (Upon seeing them, he (ﷺ)) said, \"Shoot, O sons of (Prophet) Isma\u0027il, for your father was an archer.\" [Al- Bukhari].","language":"english"},{"text":"Nabi (ﷺ) kebetulan melewati sekelompok orang yang sedang melakukan pertandingan menembak. (Setelah melihat mereka, dia (ﷺ)) berkata, \"Tembaklah, wahai putra (Nabi) Ismail, karena ayahmu adalah seorang pemanah.\" [Al-Bukhari] .","language":"bahasa"}],"narrated":[{"text":"Salamah bin Al-Akwa (May Allah be pleased with him) reported:","language":"english"},{"text":"Salamah bin Al-Akwa radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"1337","hadith_id":"riyadussalihin","text":[{"text":"وعن عمرو بن عبسة رضي الله عنه قال‏:‏ سمعت رسول الله صلى الله عليه وسلم يقول‏:‏ من رمى بسهم في سبيل الله فهو له عدل محررة‏:‏ ‏(‏‏(‏رواه أبو داود، والترمذي وقال‏:‏ حديث حسن صحيح‏.‏ ‏)‏‏)‏‏.‏","language":"arabic"},{"text":"I heard the Messenger of Allah (ﷺ) saying: \"He who shoots an arrow for the sake of Allah, will have a reward equal to the emancipation of a slave.\" [Abu Dawud and At-Tirmidhi].","language":"english"},{"text":"Aku mendengar Rasulullah (ﷺ) bersabda: \"Barangsiapa yang menembakkan anak panah karena Allah, maka baginya pahala yang setara dengan pembebasan seorang budak.\" [Abu Dawud dan At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"\u0027Amr bin \u0027Abasah (May Allah be pleased with him) reported:","language":"english"},{"text":"\u0027Amr bin \u0027Abasah (ra dengan dia) melaporkan:","language":"bahasa"}]},{"index":"1338","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي يحيي خريم بن فاتك رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏ \"‏من أنفق نفقة في سبيل الله كتب له سبعمائة ضعف‏\"‏ ‏(‏‏(‏رواه الترمذي وقال‏:‏ حديث حسن‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"He who makes a contribution in Allah\u0027s way, will have his reward seven hundred times recorded to his credit.\" [At-Tirmidhi].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, “Barang siapa yang berjasa di jalan Allah, maka baginya pahalanya tujuh ratus kali lipat dari pahalanya.” [At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Abu Yahya Khuraim bin Fatik (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Yahya Khuraim bin Fatik radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"1339","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي سعيد رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏ \"‏ما من عبد يصوم يومًا في سبيل الله إلا باعد الله بذلك اليوم وجهه عن النار سبعين خريفًا‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"Every slave of Allah who observes Saum (fasting) for a day in the Cause of Allah, Allah will keep his face from Hell-fire at a distance of seventy years.\" [Al- Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Setiap hamba Allah yang menjalankan Saum (puasa) sehari di jalan Allah, Allah akan menjaga wajahnya dari api neraka pada jarak tujuh puluh tahun.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Sa\u0027id Al-Khudri (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Sa\u0027id Al-Khudri r.a. melaporkan:","language":"bahasa"}]},{"index":"1340","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي أمامة، رضي الله عنه عن النبي صلى الله عليه وسلم قال‏:‏ ‏ \"‏من صام يومًا في سبيل الله جعل الله بينه وبين النار خندقًا كما بين السماء والأرض‏\"‏ ‏(‏‏(‏رواه الترمذي وقال‏:‏ حديث حسن صحيح‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Prophet (ﷺ) said, \"He who observes Saum (fasting) for a day in the Cause of Allah, Allah will keep his face from Hell-fire at a distance equivalent to that between heaven and the earth.\" [At- Tirmidhi].","language":"english"},{"text":"Nabi (ﷺ) berkata, \"Barang siapa menjalankan Saum (puasa) sehari di jalan Allah, Allah akan menjaga wajahnya dari api Neraka pada jarak yang setara dengan jarak antara langit dan bumi.\" [At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Abu Umamah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Umamah r.a. melaporkan:","language":"bahasa"}]},{"index":"1341","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي هريرة رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏ \"‏من مات ولم يغزُ، ولم يحدث نفسه بالغزو، مات على شعبة من النفاق‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"He who dies without having fought in the Cause of Allah or without having thought of doing so, will die with one characteristic of hypocrisy in him.\" [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, “Barang siapa yang mati tanpa berjuang di jalan Allah atau tanpa berpikir untuk melakukannya, maka dia akan mati dengan salah satu ciri kemunafikan dalam dirinya.” [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"1342","hadith_id":"riyadussalihin","text":[{"text":"وعن جابر رضي الله عنه قال‏:‏ كنا مع النبي صلى الله عليه وسلم في غزاة فقال‏:‏ ‏ \"‏إن بالمدينة لرجالا ما سرتم مسيرًا، ولا قطعتم واديًا إلا كانوا معكم حبسهم المرض‏\"‏","language":"arabic"},{"text":"We accompanied the Prophet (ﷺ) in an expedition when he (ﷺ) said, \"Some people have remained behind us in Al-Madinah, and we never cross a valley but they are with us. They share the reward with us because they have been held back by valid excuse.\" In another narration the wordings are: \"...by any genuine excuse.\" In another narration the wordings are: \"They are your partners in reward.\" [Al- Bukhari].","language":"english"},{"text":"Kami menemani Nabi (ﷺ) dalam sebuah ekspedisi ketika dia (ﷺ) berkata, \"Beberapa orang telah tinggal di belakang kami di Madinah, dan kami tidak pernah melintasi lembah tetapi mereka bersama kami. Mereka berbagi pahala dengan kami karena mereka telah ditahan dengan alasan yang sah.\" Dalam riwayat lain, susunan kata-katanya adalah: \"...dengan alasan apa pun.\" Dalam riwayat lain kata-katanya adalah: \"Mereka adalah mitra Anda dalam pahala.\" [Al-Bukhari] .","language":"bahasa"}],"narrated":[{"text":"Jabir (May Allah be pleased with him) reported:","language":"english"},{"text":"Jabir (ra dengan dia) melaporkan:","language":"bahasa"}]},{"index":"1343","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي موسى، رضي الله عنه أن أعرابيا أتى النبي صلى الله عليه وسلم فقال‏:‏ يا رسول الله الرجل يقاتل للمغنم، والرجل يقاتل ليذكر، والرجل يقاتل ليرى مكانه‏؟‏ وفي رواية‏:‏ يقاتل شجاعة، ويقاتل حَمِيّة‏.‏ وفي رواية‏:‏ ويقاتل غضبًا، فمن في سبيل الله‏؟‏ فقال رسول الله صلى الله عليه وسلم ‏:‏ ‏ \"‏من قاتل لتكون كلمة الله هي العليا، فهو في سبيل الله‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","language":"arabic"},{"text":"A bedouin came to the Prophet (ﷺ) and said: \"O Messenger of Allah! One man fights for booty, another fights to win fame, and the third fights for show off.\" Another narration is: \"One fights for displaying his valour, another fights out of his family pride.\" Another narration is: \"One fights out of rage.\" He asked: \"Which of them is fighting in the Cause of Allah?\" The Messenger of Allah (ﷺ) said, \"The one who fights so that Word of Allah (Islam) be exalted, is the one who fights in the Cause of Allah.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Seorang Badui datang kepada Nabi (ﷺ) dan berkata: \"Ya Rasulullah! Satu orang berjuang untuk barang rampasan, yang lain berjuang untuk mendapatkan ketenaran, dan yang ketiga berjuang untuk pamer.\" Narasi lain adalah: \"Yang satu berjuang untuk menunjukkan keberaniannya, yang lain bertarung karena kebanggaan keluarganya.\" Narasi lain adalah: \"Seseorang berkelahi karena marah.\" Dia bertanya: \"Siapa di antara mereka yang berjuang di jalan Allah?\" Rasulullah (ﷺ) berkata, \"Orang yang berperang agar kalimat Allah (Islam) ditinggikan, adalah orang yang berperang di jalan Allah.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Musa (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Musa (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"1344","hadith_id":"riyadussalihin","text":[{"text":"وعن عبد الله بن عمرو بن العاص، رضي الله عنهما، قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ ‏ \"‏ما من غازية أو سرية تغزو، فتغنم وتسلم، إلا كانوا قد تعجلوا ثلثي أجورهم، وما من غازية أو سرية تخفق وتصاب إلا تم لهم أجورهم‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"A detachment of soldiers, large or small, who fights in the way of Allah, gets its share of booty and returns safe and sound, receives in advance two- thirds of its reward (only one-third remaining to its credit will be received in the Hereafter). And a troop of soldiers, large or small, that returns disappointed and is afflicted by misery, will receive its full reward (in the Hereafter).\" [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Sebuah detasemen tentara, besar atau kecil, yang berperang di jalan Allah, mendapat bagian dari rampasan dan kembali dengan selamat, menerima di muka dua pertiga dari pahalanya (hanya satu -sepertiga sisanya akan diterima di akhirat) Dan pasukan tentara, besar atau kecil, yang kembali kecewa dan menderita kesengsaraan, akan menerima pahala penuh (di akhirat).\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"\u0027Abdullah bin \u0027Amr bin Al-\u0027As (May Allah be pleased with them) reported:","language":"english"},{"text":"\u0027Abdullah bin \u0027Amr bin Al-\u0027As (semoga Allah meridhoi mereka) melaporkan:","language":"bahasa"}]},{"index":"1345","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي أمامة، رضي الله عنه أن رجلا قال‏:‏ يا رسول الله ائذن لي في السياحة‏.‏ فقال النبي صلى الله عليه وسلم ‏:‏ ‏ \"‏إن سياحة أمتي الجهاد في سبيل الله، عز وجل‏\"‏ ‏(‏‏(‏رواه أبو داود بإسناد جيد‏)‏‏)‏‏.‏","language":"arabic"},{"text":"A man sought permission from the Messenger of Allah (ﷺ) to travel in the land. He (ﷺ) said to him, \"Travel for my people is Jihad in the Cause of Allah, glory be to Him.\" [Abu Dawud].","language":"english"},{"text":"Seorang pria meminta izin dari Rasulullah (ﷺ) untuk bepergian di tanah. Dia (ﷺ) berkata kepadanya, \"Perjalanan bagi umatku adalah Jihad di jalan Allah, kemuliaan bagi-Nya.\" [Abu Daud] .","language":"bahasa"}],"narrated":[{"text":"Abu Umamah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Umamah r.a. melaporkan:","language":"bahasa"}]},{"index":"1346","hadith_id":"riyadussalihin","text":[{"text":"وعن عبد الله بن عمرو بن العاص رضي الله عنهما عن النبي صلى الله عليه وسلم قال‏:‏ ‏ \"‏قفلة كغزوة‏\"‏ ‏(‏‏(‏رواه أبو داود بإسناد جيد‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Prophet (ﷺ) said, \"The return from an expedition is an act as meritorious as fighting.\" [Abu Dawud].","language":"english"},{"text":"Nabi (ﷺ) berkata, \"Kembali dari ekspedisi adalah tindakan yang berjasa seperti pertempuran.\" [Abu Daud] .","language":"bahasa"}],"narrated":[{"text":"\u0027Abdullah bin \u0027Amr bin Al-\u0027As (May Allah be pleased with them) reported:","language":"english"},{"text":"\u0027Abdullah bin \u0027Amr bin Al-\u0027As (semoga Allah meridhoi mereka) melaporkan:","language":"bahasa"}]},{"index":"1347","hadith_id":"riyadussalihin","text":[{"text":"وعن السائب بن يزيد، رضي الله عنه قال‏:‏ لما قدم النبي صلى الله عليه وسلم من غزوة تبوك تلقاه الناس، فلقيته مع الصبيان على ثنية الوداع‏.‏ ‏‏(‏رواه أبو داود بإسناد صحيح بهذا اللفظ‏)‏‏‏ ورواه البخاري قال‏:‏ ذهبنا نتلقى رسول الله صلى الله عليه وسلم مع الصبيان إلى ثنية الوداع‏","language":"arabic"},{"text":"When the Prophet (ﷺ) returned from the battle of Tabuk, people went out from Al-Madinah to meet him and I also met him with other children at Thaniyah-tul-Wada\u0027. [Abu Dawud].","language":"english"},{"text":"Ketika Nabi (ﷺ) kembali dari perang Tabuk, orang-orang keluar dari Madinah untuk menemuinya dan saya juga bertemu dengannya dengan anak-anak lain di Thaniyah-tul-Wada\u0027. [Abu Daud] .","language":"bahasa"}],"narrated":[{"text":"As-Sa\u0027ib bin Yazid (May Allah be pleased with him) reported:","language":"english"},{"text":"As-Sa\u0027ib bin Yazid radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"1348","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي أمامة رضي الله عنه عن النبي صلى الله عليه وسلم قال‏:‏ من لم يغزُ أو يجهز غازيًا، أو يخلف غازيًا في أهله بخير أصابه الله بقارعة قبل يوم القيامة‏:‏ ‏(‏‏(‏رواه أبو داود بإسناد صحيح‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Prophet (ﷺ) said, \"He who neither takes part in fighting nor equips a warrior nor looks after his (the warrior\u0027s) family, will be afflicted by severe calamities before the Day of Resurrection.\" [Abu Dawud].","language":"english"},{"text":"Nabi (ﷺ) bersabda, “Barang siapa yang tidak ikut berperang, tidak memperlengkapi seorang prajurit, dan tidak menjaga keluarganya (pejuang), akan ditimpa musibah yang berat sebelum Hari Kebangkitan.” [Abu Daud] .","language":"bahasa"}],"narrated":[{"text":"Abu Umamah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Umamah r.a. melaporkan:","language":"bahasa"}]},{"index":"1349","hadith_id":"riyadussalihin","text":[{"text":"وعن أنس رضي الله عنه أن النبي صلى الله عليه وسلم قال‏:‏ ‏ \"‏جاهدوا المشركين بأموالكم وأنفسكم وألسنتكم‏\"‏ ‏(‏‏(‏رواه أبو داود بإسناد صحيح‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Prophet (ﷺ) said, \"Fight the polytheists with your wealth, lives and tongues.\" [Abu Dawud].","language":"english"},{"text":"Nabi (ﷺ) bersabda, “Perangilah orang-orang musyrik dengan harta, jiwa, dan lidahmu.” [Abu Daud] .","language":"bahasa"}],"narrated":[{"text":"Anas (May Allah be pleased with him) reported:","language":"english"},{"text":"Anas (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"1350","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي عمرو ويقال‏:‏ أبو حكيم النعمان بن مقرن رضي الله عنه قال‏:‏ شهدت رسول الله صلى الله عليه وسلم إذا لم يقاتل من أول النهار أخر القتال حتى تزول الشمس وتهب الريح وينزل النصر‏.‏ ‏(‏‏(‏رواه أبو داود، والترمذي، وقال‏:‏ حديث حسن صحيح‏)‏‏)‏‏.‏","language":"arabic"},{"text":"I was with the Messenger of Allah (ﷺ) when I witnessed that if he did not begin fighting in the early part of the day, he would postpone fighting till the sun had declined, the blowing of the breeze had blown and the victory from Allah had come. [Abu Dawud and At-Tirmidhi].","language":"english"},{"text":"Saya bersama Rasulullah (ﷺ) ketika saya menyaksikan bahwa jika dia tidak memulai pertempuran di awal hari, dia akan menunda pertempuran sampai matahari terbenam, hembusan angin bertiup dan kemenangan dari Allah. telah datang. [Abu Dawud dan At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"An-Nu\u0027man bin Muqarrin (May Allah be pleased with him) reported:","language":"english"},{"text":"An-Nu\u0027man bin Muqarrin (semoga Allah meridhoinya) melaporkan:","language":"bahasa"}]},{"index":"1351","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي هريرة رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏ \"‏لا تتمنوا لقاء العدو، فإذا لقيتموه فاصبروا‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"Do not wish for an encounter with the enemy. Pray to Allah to grant you safety; (but) when you encounter them, show patience.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Jangan berharap untuk bertemu dengan musuh. Berdoalah kepada Allah untuk memberi Anda keselamatan; (tetapi) ketika Anda menghadapi mereka, tunjukkan kesabaran.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"1352","hadith_id":"riyadussalihin","text":[{"text":"وعنه وعن جابر، رضي الله عنهما أن النبي صلى الله عليه وسلم قال‏:‏ ‏ \"‏الحرب خُدعة‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","language":"arabic"},{"text":"The Prophet (ﷺ) said, \"War is deception.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Nabi (ﷺ) berkata, \"Perang adalah penipuan.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah and Jabir (May Allah be pleased with them) reported:","language":"english"},{"text":"Abu Hurairah dan Jabir radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"1353","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي هريرة رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏ \"‏الشهداء خمسة‏:‏ المطعون والمبطون، والغريق، وصاحب الهدم والشهيد في سبيل الله‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"The martyrs are of five kinds: One who dies of plague; one who dies of disease of his belly; the drowned; one who dies under the debris (of construction, etc.), and one who dies while fighting in the way of Allah.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, “Orang yang mati syahid ada lima macam: Orang yang meninggal karena wabah; Orang yang meninggal karena penyakit perut; Orang yang tenggelam; Orang yang mati di bawah reruntuhan (bangunan, dll), dan orang yang mati saat berperang di jalan Allah.” [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"1354","hadith_id":"riyadussalihin","text":[{"text":"وعنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏ما تعدون الشهداء فيكم‏؟‏ قالوا‏:‏ يا رسول الله من قتل في سبيل الله فهو شهيد‏.‏ قال‏:‏ ‏\"‏إن شهداء أمتي إذًا لقليل‏!‏‏\"‏ قالوا‏:‏ فمن يا رسول الله ‏؟‏ قال‏:‏ ‏\"‏من قتل في سبيل الله فهو شهيد، ومن مات في سبيل الله فهو شهيد، ومن مات في الطاعون فهو شهيد، ومن مات في البطن فهو شهيد، والغريق شهيد‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"Whom do you reckon to be martyr amongst you?\" The Companions replied: \"The one who is killed in Allah\u0027s way.\" He said, \"In that case, the martyrs among my people would be few.\" The Companions asked: \"O Messenger of Allah! Then who are the martyrs?\" He replied, \"He who is killed in the way of Allah is a martyr; he who dies naturally in the Cause of Allah is a martyr; he who dies of plague is a martyr; and he who dies of a belly disease is a martyr; and he who is drowned is a martyr.\" [Muslim]. This Hadith shows the care Allah has for this Ummah, which is the best Ummah of mankind. (Editor\u0027s Note)","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Siapa yang kamu anggap syahid di antara kamu?\" Para sahabat menjawab: \"Orang yang terbunuh di jalan Allah.\" Dia berkata, \"Kalau begitu, para syuhada di antara umatku akan sedikit.\" Para sahabat bertanya: \"Ya Rasulullah! Lalu siapakah yang syahid?\" Beliau menjawab, “Barang siapa yang terbunuh di jalan Allah maka ia syahid, siapa yang mati secara wajar di jalan Allah maka ia syahid, siapa yang meninggal karena wabah maka ia syahid, dan siapa yang meninggal karena sakit perut maka ia syahid. ; dan orang yang ditenggelamkan adalah syahid.” [Muslim] . Hadits ini menunjukkan kepedulian Allah terhadap umat ini, yang merupakan umat terbaik umat manusia. (Catatan Editor)","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"1355","hadith_id":"riyadussalihin","text":[{"text":"وعن عبد الله بن عمرو بن العاص، رضي الله عنهما قال‏:‏ قال رسول الله صلى الله عليه وسلم‏:‏ “من قتل دون ماله فهو شهيد‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"He who is killed while defending his property is a martyr.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, “Barangsiapa terbunuh saat mempertahankan hartanya, maka dia syahid.” [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"\u0027Abdullah bin \u0027Amr bin Al-\u0027As (May Allah be pleased with them) reported:","language":"english"},{"text":"\u0027Abdullah bin \u0027Amr bin Al-\u0027As (semoga Allah meridhoi mereka) melaporkan:","language":"bahasa"}]},{"index":"1356","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي الأعور سعيد بن زيد بن عمرو بن نفيل، أحد العشرة المشهود لهم بالجنة، رضي الله عنهم، قال‏:‏ سمعت رسول الله صلى الله عليه وسلم يقول‏:‏ ‏ \"‏من قتل دون ماله فهو شهيد، ومن قتل دون دمه فهو شهيد، ومن قتل دون دينه فهو شهيد، ومن قتل دون عرضه فهو شهيد‏\"‏ ‏(‏‏(‏رواه أبو داود والترمذي وقال‏:‏ حديث حسن صحيح‏)‏‏)‏‏.‏","language":"arabic"},{"text":"I heard the Messenger of Allah (ﷺ) saying: \"He who dies while defending his property is a martyr; he who dies in defence of his own life is a martyr; and he who dies on defense of his faith is a martyr, he who dies in defence of his family is a martyr.\" [Abu Dawud and At- Tirmidhi].","language":"english"},{"text":"Aku mendengar Rasulullah (ﷺ) bersabda: “Barang siapa yang mati karena mempertahankan hartanya, maka ia syahid; siapa yang mati karena mempertahankan nyawanya, maka ia syahid; dan siapa yang mati karena mempertahankan imannya, maka ia syahid. yang mati untuk membela keluarganya adalah syahid.\" [Abu Dawud dan At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Sa\u0027id bin Zaid bin \u0027Amr bin Nufail (May Allah be pleased with him) reported, one of the ten Companions who were given the glad tidings of entering Jannah reported:","language":"english"},{"text":"Sa\u0027id bin Zaid bin \u0027Amr bin Nufail (ra dengan dia) melaporkan, salah satu dari sepuluh sahabat yang diberi kabar gembira memasuki Jannah melaporkan:","language":"bahasa"}]},{"index":"1357","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي هريرة رضي الله عنه قال‏:‏ جاء رجل إلى رسول الله صلى الله عليه وسلم فقال‏:‏ يا رسول الله أرأيت إن جاء رجل يريد أخذ مالي‏؟‏ قال‏:‏ ‏\"‏فلا تعطه مالك‏\"‏ قال‏:‏ أرأيت إن قاتلني‏؟‏ قال‏:‏ ‏\"‏قاتله‏\"‏ قال‏:‏ أرأيت إن قتلني قال‏:‏ ‏\"‏فأنت شهيد‏\"‏ قال‏:‏ أرأيت إن قتلته‏؟‏ قال‏:‏ ‏\"‏هو في النار‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"A man came to the Messenger of Allah (ﷺ) and asked, \"O Messenger of Allah! What shall I do if someone comes to me with the intention of taking away my property?\" He replied, \"Do not hand over it to him.\" The man asked, \"What shall I do if he fights me?\" The Messenger of Allah (ﷺ) said, \"Then fight him.\" \"What will be my position in the Hereafter if he has killed me?\" The Messenger of Allah (ﷺ) replied, \"In that case you are a martyr.\" The man asked: \"What if I killed him?\" The Messenger of Allah (ﷺ) replied, \"He will be in the Hell- fire.\" [Muslim].","language":"english"},{"text":"Seorang pria datang kepada Rasulullah (ﷺ) dan bertanya, \"Ya Rasulullah! Apa yang harus saya lakukan jika seseorang datang kepada saya dengan niat untuk mengambil harta saya?\" Dia menjawab, \"Jangan serahkan padanya.\" Pria itu bertanya, \"Apa yang harus saya lakukan jika dia melawan saya?\" Rasulullah (ﷺ) berkata, \"Kalau begitu lawanlah dia.\" \"Bagaimana posisiku di akhirat jika dia membunuhku?\" Rasulullah (ﷺ) menjawab, \"Jika demikian, kamu adalah seorang syahid.\" Pria itu bertanya: \"Bagaimana jika saya membunuhnya?\" Rasulullah (ﷺ) menjawab, \"Dia akan berada di api neraka.\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"1358","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي هريرة رضي الله عنه قال‏:‏ قال لي رسول الله صلى الله عليه وسلم ‏:‏ ‏ \"‏من أعتق رقبة مسلمة أعتق الله بكل عضو منه عضوًا منه من النار حتى فرجه بفرجه‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"He who sets free a Muslim slave, Allah will deliver from the fire of Hell every limb of his body in return for every limb of the slave\u0027s body, even his private parts.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Barang siapa yang membebaskan seorang budak Muslim, Allah akan melepaskan dari api Neraka setiap anggota tubuhnya sebagai imbalan untuk setiap anggota tubuh budak itu, bahkan auratnya.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"1359","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي ذر رضي الله عنه قال‏:‏ قلت يا رسول الله أي الأعمال أفضل‏؟‏ قال‏:‏ ‏\"‏الإيمان بالله، والجهاد في سبيل الله‏\"‏ قلت‏:‏ أي الرقاب أفضل‏؟‏ قال‏:‏ ‏\"‏أنفسها عند أهلها وأكثرها ثمنًا” ‏(‏‏(‏متفق عليه‏)‏‏)‏","language":"arabic"},{"text":"I asked the Messenger of Allah (ﷺ), \"Which deed is most excellent?\" He replied, \"Faith in Allah and Jihad in His path.\" I then asked, \"Which slaves are most excellent (to set free)?\" He replied, \"Those who are held in high esteem by their people and whose value is higher.\" [Al- Bukhari and Muslim].","language":"english"},{"text":"Saya bertanya kepada Rasulullah (), \"Perbuatan apa yang paling baik?\" Dia menjawab, \"Iman kepada Allah dan Jihad di jalan-Nya.\" Saya kemudian bertanya, \"Budak mana yang paling baik (untuk dibebaskan)?\" Dia menjawab, \"Mereka yang dijunjung tinggi oleh rakyatnya dan yang nilainya lebih tinggi.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Dharr (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Dzar radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"1360","hadith_id":"riyadussalihin","text":[{"text":"وعن المعرور بن سويد قال‏:‏ رأيت أبا ذر رضي الله عنه وعليه حلة وعلى غلامه مثلها، فسألته عن ذلك فذكر أنه ساب رجلا على عهد رسول الله صلى الله عليه وسلم فعيره بأمه فقال النبي صلى الله عليه وسلم ‏:‏ ‏ \"‏إنك امرؤ فيك جاهلية‏\"‏ ‏:‏ هم إخوانكم، وخولكم جعلهم الله تحت أيديكم فمن كان أخوه تحت يده فليطعمه مما يأكل ويلبسه مما يلبس ولا تكلفوهم ما يغلبهم، فإن كلفتموهم فأعينوهم” ‏(‏‏(‏متفق عليه‏)‏‏)‏","language":"arabic"},{"text":"I saw Abu Dharr (May Allah be pleased with him) wearing a nice gown, and his slave was also wearing one similar to it. I asked him about it, and he said that he had exchanged harsh words with a person during the lifetime of the Messenger of Allah (ﷺ) and put him to shame by making a reference to his mother. That person came to the Messenger of Allah (ﷺ) and made mention of that to him. Thereupon the Messenger of Allah said, \"You are a person who has remnants of the \u0027Days of Ignorance\u0027 in you. Your slaves are your brothers. Allah has placed them under your authority. He who has his brother under him, should feed him from whatever he eats, and dress him with whatever he wears, and do not burden them (assign burdensome task to them) beyond their capacity; and if you burden them then help them.\" [Al- Bukhari and Muslim].","language":"english"},{"text":"Aku melihat Abu Dzar (semoga Allah meridhoinya) mengenakan gaun yang bagus, dan budaknya juga memakai gaun yang serupa. Saya bertanya kepadanya tentang hal itu, dan dia berkata bahwa dia telah bertukar kata-kata kasar dengan seseorang selama masa hidup Rasulullah (ﷺ) dan membuatnya malu dengan menyebut ibunya. Orang itu datang kepada Rasulullah (ﷺ) dan menyebutkan hal itu kepadanya. Kemudian Rasulullah bersabda, \"Kamu adalah orang yang memiliki sisa-sisa \u0027Hari Kebodohan\u0027 di dalam dirimu. Hamba-hambamu adalah saudara-saudaramu. Allah telah menempatkan mereka di bawah kekuasaanmu. Siapa yang memiliki saudaranya di bawahnya, harus memberinya makan. dari apa pun yang dia makan, dan beri dia pakaian apa pun yang dia pakai, dan jangan membebani mereka (memberikan tugas yang memberatkan kepada mereka) di luar kemampuan mereka; dan jika kamu membebani mereka, bantulah mereka.” [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Al-Ma\u0027rur bin Suwaid (May Allah be pleased with him) reported:","language":"english"},{"text":"Al-Ma\u0027rur bin Suwaid radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"1361","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم قال‏:‏ ‏\"‏إذا أتى أحدكم خادمه بطعامه، فإن لم يجلسه معه فليناوله لقمة أو لقمتين أو أُكلة أو أُكلتين فإنه ولي علاجه‏\"‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏ (9)","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"When your servant brings food for you and you do not seat him with you, you should at least give him a morsel or two out of it because he has prepared it himself.\" [Al- Bukhari].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Jika hambamu membawakan makanan untukmu dan kamu tidak mendudukkannya bersamamu, setidaknya kamu harus memberinya satu atau dua suap darinya karena dia telah menyiapkannya sendiri.\" [Al-Bukhari] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"1362","hadith_id":"riyadussalihin","text":[{"text":"عن ابن عمر رضي الله عنهما أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏ \"‏إن العبد إذا نصح لسيده، وأحسن عبادة الله، فله أجره مرتين‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","language":"arabic"},{"text":"I heard the Messenger of Allah (ﷺ) saying, \"When a slave is sincere to his master and worships Allah well, He will have a double reward.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Saya mendengar Rasulullah (ﷺ) berkata, \"Jika seorang hamba tulus kepada tuannya dan beribadah kepada Allah dengan baik, dia akan mendapat dua pahala.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Ibn \u0027Umar (May Allah be pleased with them) reported:","language":"english"},{"text":"Ibnu \u0027Umar radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"1363","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي هريرة رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏ \"‏للعبد المملوك المصلح أجران، والذي نفس أبي هريرة بيده لولا الجهاد في سبيل الله والحج، وبر أمي لأحببت أن أموت وأنا مملوك‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"The faithful and diligent slave will have a double reward.\" (Abu Hurairah added:) By Him in Whose Hand the soul of Abu Hurairah is! but for Jihad in the Cause of Allah, and Hajj and kindness to my mother, I would have preferred to die as a slave. [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Budak yang setia dan rajin akan memiliki pahala ganda.\" (Abu Hurairah menambahkan:) Demi Dzat yang jiwa Abu Hurairah berada di tangan-Nya! tetapi untuk Jihad di jalan Allah, dan haji dan kebaikan untuk ibuku, aku lebih suka mati sebagai budak. [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"1364","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي موسى الأشعري قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏ \"‏المملوك الذي يحسن عبادة ربه ويؤدي إلى سيده الذي عليه من الحق، والنصيحة والطاعة له أجران‏\"‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"A slave who worships his Rubb (Allah) well and discharges efficiently and faithfully the duties which are assigned to him by his master, will have a double reward.\" [Al-Bukhari].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Seorang budak yang menyembah Rubb-nya (Allah) dengan baik dan melaksanakan dengan efisien dan setia tugas-tugas yang diberikan kepadanya oleh tuannya, akan mendapat pahala ganda.\" [Al-Bukhari] .","language":"bahasa"}],"narrated":[{"text":"Abu Musa Al-Ash\u0027ari (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Musa Al-Asy\u0027ari r.a. melaporkan:","language":"bahasa"}]},{"index":"1365","hadith_id":"riyadussalihin","text":[{"text":"وعنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏ \"‏ثلاثة لهم أجران‏:‏ رجل من أهل الكتاب آمن بنبيه، وآمن بمحمد، والعبد المملوك إذا أدى حق الله، وحق مواليه، ورجل كانت له أمة فأدبها فأحسن تأديبها وعلمها فأحسن تعليمها، ثم أعتقها فتزوجها فله أجران‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"Three kinds of people will have a double reward: A man from the People of the Book who believes in his Prophet and (also) believes in Muhammad; a slave who discharges properly the duties towards Allah and towards his master; and a man who possesses a slave-girl and teaches her manners, educates her well, and frees her and then marries her.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, “Tiga jenis orang yang mendapat pahala ganda: Seorang dari Ahli Kitab yang beriman kepada Nabinya dan (juga) beriman kepada Muhammad; seorang hamba yang melaksanakan kewajiban-kewajiban kepada Allah dengan baik. dan terhadap tuannya; dan seorang laki-laki yang memiliki budak perempuan dan mengajarinya sopan santun, mendidiknya dengan baik, dan membebaskannya kemudian menikahinya.” [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Musa Al-Ash\u0027ari (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Musa Al-Asy\u0027ari r.a. melaporkan:","language":"bahasa"}]},{"index":"1366","hadith_id":"riyadussalihin","text":[{"text":"عن معقل بن يسار رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏ \"‏العبادة في الهرج كهجرة إلي‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"The reward of worship performed at a time of trials is equal in reward to an emigration to me.\" [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, \"Pahala ibadah yang dilakukan pada saat cobaan adalah sama dengan pahala hijrah kepadaku.\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Ma\u0027qil bin Yasar (May Allah be pleased with him) reported:","language":"english"},{"text":"Ma\u0027qil bin Yasar radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]},{"index":"1367","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي هريرة رضي الله عنه أن رجلا أتى النبي صلى الله عليه وسلم يتقاضاه فأغلظ له فهم به أصحابه، فقال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏دعوه فإن لصاحب الحق مقالا‏\"‏ ثم قال‏:‏ ‏\"‏أعطوه سنا مثل سنه‏\"‏ قالوا‏:‏ يا رسول الله لا نجد إلا أمثل من سنه، قال‏:‏ ‏\"‏أعطوه فإن خيركم أحسنكم قضاء‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏ ‏.‏","language":"arabic"},{"text":"A man demanded of the Prophet (ﷺ) for repayment of a loan and was harsh to him. His Companions were about to attack him, but he (ﷺ) said, \"Leave him, as the creditor is entitled to make a demand. Give him a camel of the same age as the camel that is due to him.\" They said: \"We find a better camel senior to it in age.\" He (ﷺ) said, \"Then buy it and give it to him; verily the best of you is the one who is the best in discharging his obligations (repayment of loans).\" [Al- Bukhari and Muslim].","language":"english"},{"text":"Seorang pria menuntut Nabi (ﷺ) untuk pembayaran kembali pinjaman dan kasar kepadanya. Para sahabat hendak menyerangnya, tetapi dia (ﷺ) berkata, \"Biarkan dia, karena kreditur berhak memintanya. Beri dia unta yang umurnya sama dengan unta yang menjadi haknya.\" Mereka berkata: \"Kami menemukan unta yang lebih tua darinya dalam usia.\" Beliau (ﷺ) berkata, “Maka belilah dan berikan kepadanya; sesungguhnya sebaik-baik kalian adalah yang paling baik dalam menunaikan kewajibannya (membayar kembali pinjaman).” [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"1368","hadith_id":"riyadussalihin","text":[{"text":"وعن جابر رضي الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏ \"‏رحم الله رجلا سمحًا إذا باع وإذا اشترى وإذا اقتضى‏\"‏ ‏(‏‏(‏رواه البخاري‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"May Allah show mercy to a man who adopts a kind attitude when he sells, buys and demands for the repayment of loans.\" [Al-Bukhari].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, “Semoga Allah memberikan rahmat kepada seseorang yang berperilaku baik ketika dia menjual, membeli, dan menuntut pembayaran kembali pinjaman.” [Al-Bukhari] .","language":"bahasa"}],"narrated":[{"text":"Jabir (May Allah be pleased with him) reported:","language":"english"},{"text":"Jabir (ra dengan dia) melaporkan:","language":"bahasa"}]},{"index":"1369","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي قتادة رضي الله عنه قال‏:‏ سمعت رسول الله صلى الله عليه وسلم يقول‏:‏ ‏ \"‏من سره أن ينجيه الله من كرب يوم القيامة، فلينفس عن معسر أو يضع عنه‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"He who likes Allah to deliver him from the calamities of the Day of Resurrection, let him either give respite to a debtor or grant him remission (of loans) in straitened circumstances.\" [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, “Barang siapa yang menghendaki agar Allah membebaskannya dari bencana di hari kiamat, hendaklah dia memberi tangguhan kepada orang yang berutang atau memberinya keringanan (pinjaman) dalam keadaan sulit.” [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Qatadah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Qatadah r.a. melaporkan:","language":"bahasa"}]},{"index":"1370","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏ \"‏كان رجل يداين الناس، وكان يقول لفتاه‏:‏ إذا أتيت معسرا فتجاوز عنه، لعل الله أن يتجاوز عنا فلقي الله فتجاوز عنه‏\"‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"There was a person who used to loan money to the people and he used to say to his servant: \u0027When an insolvent person comes to you, show him leniency so that Allah may forbear our faults.\u0027 So when he met Allah (i.e., when he died), Allah forgave him.\" [Al-Bukhari and Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Ada seseorang yang meminjamkan uang kepada orang-orang dan dia berkata kepada pelayannya: \u0027Jika orang yang tidak mampu datang kepadamu, beri dia keringanan agar Allah mengampuni kesalahan kami. .\u0027 Jadi ketika dia bertemu Allah (yaitu, ketika dia meninggal), Allah memaafkannya.\" [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"1371","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي مسعود البدري رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏حوسب رجل ممن كان قبلكم فلم يوجد له من الخير شيء إلا أنه كان يخالط الناس، وكان موسرًا وكان يأمر غلمانه أن يتجاوزوا عن المعسر قال الله عز وجل‏:‏ ‏\"‏نحن أحق بذلك منه، تجاوزوا عنه‏\"‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"A person from amongst the people who lived before you was called to account by Allah on the Day of Resurrection. No good deeds were found in his credit except that he being a rich man had (financial) dealings with people and had commanded his servants to show leniency to those who were in straitened circumstances. Upon this Allah, the Exalted, and Majestic said: \u0027I am more entitled to this attribute, so waive (his faults).\"\u0027 [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Seseorang dari antara orang-orang yang hidup sebelum kamu dipanggil oleh Allah pada hari kiamat. Tidak ada perbuatan baik yang ditemukan dalam kreditnya kecuali dia menjadi orang kaya (keuangan). ) berurusan dengan orang-orang dan telah memerintahkan hamba-hambanya untuk menunjukkan kelonggaran kepada mereka yang berada dalam keadaan sulit. Atas hal ini Allah, Ta\u0027ala, dan Majestic berkata: \u0027Saya lebih berhak untuk atribut ini, jadi lepaskan (kesalahannya).\"\u0027 [ Muslim] .","language":"bahasa"}],"narrated":[{"text":"Abu Mas\u0027ud Al-Badri (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Mas\u0027ud Al-Badri (ra dengan dia) melaporkan:","language":"bahasa"}]},{"index":"1372","hadith_id":"riyadussalihin","text":[{"text":"وعن حذيفة رضي الله عنه قال‏:‏ أتي الله تعالى بعبد من عباده آتاه الله مالا فقال له ماذا عملت في الدنيا‏؟‏ قال‏:‏ ولا يكتمون الله حديثا- قال‏:‏ يا رب آتيتني مالك فكنت أبايع الناس، وكان من خلقي الجواز فكنت أتيسر على الموسر وأنظر المعسر فقال الله تعالى‏:‏ “‏ \"‏أنا أحق بذا منك، تجاوزوا عن عبدي‏\"‏ فقال عقبة بن عامر، وأبو مسعود الأنصاري رضي الله عنهما هكذا سمعناه من في رسول الله صلى الله عليه وسلم‏.‏ ‏(‏‏(‏رواه مسلم‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"A slave of Allah whom He had endowed with wealth, will be brought before Him. Allah will ask him: \u0027What did you do in the world?\u0027 (They cannot conceal anything from Allah.) He will say: \u0027O my Rubb, You endowed me with Your wealth; I used to enter into transactions with people and it was my nature to be lenient to the insolvent ones. I used to give respite to those who were in straitened circumstances.\u0027 Whereupon Allah will say: \u0027I am more entitled than you to do this. So forgive my slave\u0027.\" \u0027Uqbah bin \u0027Amir and Abu Mas\u0027ud Al- Ansari (May Allah be pleased with them) said, \"Thus we heard it from the Messenger of Allah (ﷺ).\" [Muslim].","language":"english"},{"text":"Rasulullah (ﷺ) berkata, \"Seorang hamba Allah yang telah Dia anugerahkan kekayaan, akan dibawa ke hadapan-Nya. Allah akan bertanya kepadanya: \u0027Apa yang kamu lakukan di dunia?\u0027 (Mereka tidak dapat menyembunyikan apa pun dari Allah.) Dia akan berkata: \u0027Hai Rubb saya, Anda memberi saya kekayaan Anda; saya biasa melakukan transaksi dengan orang-orang dan sudah menjadi sifat saya untuk lunak kepada orang-orang yang tidak mampu. Saya biasa memberi tangguh bagi mereka yang berada dalam keadaan sulit.\u0027 Kemudian Allah akan berfirman: \u0027Aku lebih berhak darimu untuk melakukan ini. Maka ampunilah hamba-Ku\u0027.\" \u0027Uqbah bin \u0027Amir dan Abu Mas\u0027ud Al-Ansari r.a. berkata, \"Demikianlah kami mendengarnya dari Rasulullah (ﷺ).\" [Muslim] .","language":"bahasa"}],"narrated":[{"text":"Hudhaifah (May Allah be pleased with him) reported:","language":"english"},{"text":"Hudzaifah r.a. melaporkan:","language":"bahasa"}]},{"index":"1373","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي هريرة رضي الله عنه قال‏:‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏ \"‏من أنظر معسرًا أو وضع له، أظله الله يوم القيامة تحت ظل عرشه يوم لا ظل إلا ظله‏\"‏‏.‏ ‏(‏‏(‏رواه الترمذي وقال‏:‏ حديث حسن صحيح‏)‏‏)‏‏.‏","language":"arabic"},{"text":"The Messenger of Allah (ﷺ) said, \"He who gives respite to someone who is in straitened circumstances, or grants him remission, Allah will shelter him in the shade of His Throne, on the Day of Resurrection, when there will be no shade except its shade.\" [At- Tirmidhi].","language":"english"},{"text":"Rasulullah (ﷺ) bersabda, “Barang siapa yang memberi tangguh kepada seseorang yang dalam kesulitan, atau memberinya pengampunan, Allah akan melindunginya di bawah naungan Arsy-Nya, pada Hari Kebangkitan, ketika tidak ada naungan. kecuali bayangannya.” [At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Abu Hurairah (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Hurairah r.a. melaporkan:","language":"bahasa"}]},{"index":"1374","hadith_id":"riyadussalihin","text":[{"text":"وعن جابر، رضي الله عنه أن النبي صلى الله عليه وسلم اشترى منه بعيرًا فوزن له فأرجح‏.‏ ‏(‏‏(‏متفق عليه‏)‏‏)‏","language":"arabic"},{"text":"The Prophet (ﷺ) purchased a camel from me and weighed more than its price. [Al-Bukhari and Muslim].","language":"english"},{"text":"Nabi (ﷺ) membeli unta dari saya dan beratnya lebih dari harganya. [Al-Bukhari dan Muslim] .","language":"bahasa"}],"narrated":[{"text":"Jabir (May Allah be pleased with him) reported:","language":"english"},{"text":"Jabir (ra dengan dia) melaporkan:","language":"bahasa"}]},{"index":"1375","hadith_id":"riyadussalihin","text":[{"text":"وعن أبي صفوان سويد بن قيس، رضي الله عنه قال‏:‏ جلبت أنا ومخرمة العبدي بزًا من هجر، فجاءنا النبي صلى الله عليه وسلم فساومنا سراويل، وعندي وزان يزن بالأجر، فقال النبي صلى الله عليه وسلم للوزان ‏ \"‏زن وأرجح‏\"‏ ‏(‏‏(‏رواه أبو داود والترمذي وقال‏:‏ حديث حسن صحيح‏)‏‏)‏‏.‏","language":"arabic"},{"text":"Makhramah Al-\u0027Abdi and I procured some drapery from Hajar and brought them to Makkah. The Prophet (ﷺ) came and bargained with us for some trousers and we sold them to him. We had a person who weighed the cloth in order to fix the price. The Prophet (ﷺ) said to him, \"Weigh and add a little to it.\" [Abu Dawud and At- Tirmidhi].","language":"english"},{"text":"Makhramah Al-\u0027Abdi dan saya membeli beberapa gorden dari Hajar dan membawanya ke Makkah. Nabi (ﷺ) datang dan menawar dengan kami untuk beberapa celana dan kami menjualnya kepadanya. Kami memiliki seseorang yang menimbang kain untuk menetapkan harga. Nabi (ﷺ) berkata kepadanya, \"Timbang dan tambahkan sedikit.\" [Abu Dawud dan At-Tirmidzi] .","language":"bahasa"}],"narrated":[{"text":"Abu Safwan Suwaid bin Qais (May Allah be pleased with him) reported:","language":"english"},{"text":"Abu Safwan Suwaid bin Qais radhiyallahu \u0027anhu meriwayatkan:","language":"bahasa"}]}]