[
    {
        "_id": "605debabb3d5e20e3b54ea7d",
        "id": "605debabb3d5e20e3b54ea7d",
        "title": [
            {
                "text": "Doa di Qur'an",
                "language": "bahasa"
            },
            {
                "text": "Du'a in Qur'an",
                "language": "english"
            }
        ],
        "description": [
            {
                "text": "The quality of a Dua depends on the Du’a and the Sincerity of the person saying it Here are some of the du’a sourced from the Qur’an.",
                "language": "english"
            },
            {
                "text": "Kualitas do’a itu tergantung kepada bacaan do’a itu sendiri, kesungguhan, serta keikhlasan orang yang mengucapkannya.  Berikut adalah do’a-do’a yang bersumber dari Al-Qur’an. Semoga bermanfaat",
                "language": "bahasa"
            }
        ]
    },
    {
        "_id": "605debabb3d5e20e3b54ea7e",
        "id": "605debabb3d5e20e3b54ea7e",
        "title": [
            {
                "text": "Book of Dzikir",
                "language": "english"
            },
            {
                "text": "Buku Dzikir",
                "language": "bahasa"
            }
        ],
        "description": [
            {
                "text": "Manusia memiliki kebutuhan yang sangat besar terhadap dzikir, kapan pun dan di mana pun. Apabila seorang hamba lalai dari berdzikir kepada Allah, maka waktu itu akan menjadi bencana baginya. Dia akan menyesal dengan penyesalan yang besar, baik ketika di dunia maupun di akhirat. ",
                "language": "bahasa"
            },
            {
                "text": "Humans have a great need for dhikr, anytime and anywhere. If a servant is negligent from remembering Allah, He will regret it both in this dunya and the akhirah.",
                "language": "english"
            }
        ]
    },
    {
        "_id": "605debabb3d5e20e3b54ea7f",
        "id": "605debabb3d5e20e3b54ea7f",
        "title": [
            {
                "text": "Book of Du'a",
                "language": "english"
            },
            {
                "text": "Buku Do'a",
                "language": "bahasa"
            }
        ],
        "description": [
            {
                "text": "Everyone needs Dua, be it to protect one from a disaster or praying for something they want. Below are the list of Dua compiled from the Al-Qur’an and Sunnah.",
                "language": "english"
            },
            {
                "text": "Setiap orang pasti membutuhkan do'a, baik untuk menolak sesuatu yang tidak disukai, ataupun mendatangkan sesuatu yang disenangi. Berikut adalah beberapa do'a yang kami ambil dari Al-Qur'an dan Sunnah.",
                "language": "bahasa"
            }
        ]
    }
]
