[
  {
    "desc": "Kualitas do’a itu tergantung kepada bacaan do’a itu sendiri, kesungguhan, serta keikhlasan orang yang mengucapkannya.  Berikut adalah do’a-do’a yang bersumber dari Al-Qur’an. Semoga bermanfaat",
    "id": 2,
    "language": "id",
    "prayer": [
      {
        "bookId": 2,
        "data": [
          {
            "arabic": "رَبِّ إِنِّي أَعُوذُ بِكَ أَنْ أَسْأَلَكَ مَا لَيْسَ لِي بِهِ عِلْمٌ ۖ وَإِلَّا تَغْفِرْ لِي وَتَرْحَمْنِي أَكُنْ مِنَ الْخَاسِرِينَ",
            "audio": "",
            "notes": "",
            "source": "QS. Hud[11]:47",
            "translation": "Dia (Nuh) berkata: “Ya Rabbku, sungguh aku berlindung kepada-Mu untuk memohon kepada-Mu sesuatu yang aku tidak tahu akan hakikatnya. Jikalau Engkau tidak mengampuniku, dan (tidak) menaruh belas kasihan kepadaku, niscaya aku termasuk orang yang rugi."
          },
          {
            "arabic": " رَبَّنَا آمَنَّا فَاغْفِرْ لَنَا وَارْحَمْنَا وَأَنْتَ خَيْرُ الرَّاحِمِينَ",
            "audio": "",
            "notes": "",
            "source": "QS. Al-Mu'minun[23]:109",
            "translation": "Ya Rabb kami, kami telah beriman, maka ampunilah kami dan berilah kami rahmat, Engkau adalah pemberi rahmat yang terbaik."
          },
          {
            "arabic": " رَبِّ اغْفِرْ وَارْحَمْ وَأَنْتَ خَيْرُ الرَّاحِمِينَ",
            "audio": "",
            "notes": "",
            "source": "QS. Al-Mu'minun[23]:118",
            "translation": "Ya Rabbku, berilah ampunan dan (berilah) rahmat, Engkaulah pemberi rahmat yang terbaik."
          },
          {
            "arabic": "رَبَّنَا اغْفِرْ لَنَا ذُنُوبَنَا وَإِسْرَافَنَا فِي أَمْرِنَا وَثَبِّتْ أَقْدَامَنَا وَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ",
            "audio": "",
            "notes": "",
            "source": "QS. Ali-'Imran[3]:147",
            "translation": "Ya Rabb kami, ampunilah dosa-dosa kami dan tindakan-tindakan kami yang belebihan (dalam) urusan kami dan tetapkanlah pendirian kami, dan tolonglah kami terhadap orang-orang kafir"
          },
          {
            "arabic": "رَبَّنَا إِنَّنَا آمَنَّا فَاغْفِرْ لَنَا ذُنُوبَنَا وَقِنَا عَذَابَ النَّارِ",
            "audio": "",
            "notes": "",
            "source": "QS. Ali-'Imran[3]16",
            "translation": "Ya Rabb kami, kami benar-benar beriman, maka ampunilah dosa-dosa kami dahulu, dan lindungilah kami dari azab Neraka"
          },
          {
            "arabic": "رَبَّنَا إِنَّنَا سَمِعْنَا مُنَادِيًا يُنَادِي لِلْإِيمَانِ أَنْ آمِنُوا بِرَبِّكُمْ فَآمَنَّا ۚ رَبَّنَا فَاغْفِرْ لَنَا ذُنُوبَنَا وَكَفِّرْ عَنَّا سَيِّئَاتِنَا وَتَوَفَّنَا مَعَ الْأَبْرَارِ رَبَّنَا وَآتِنَا مَا وَعَدْتَنَا عَلَىٰ رُسُلِكَ وَلَا تُخْزِنَا يَوْمَ الْقِيَامَةِ ۗ إِنَّكَ لَا تُخْلِفُ الْمِيعَادَ",
            "audio": "",
            "notes": "",
            "source": "QS. Ali-'Imran[3]:193-194",
            "translation": "Ya Rabb kami, sungguh kami mendengar orang yang menyeru kepada iman, (yaitu): 'Berimanlah kamu kepada Rabbmu,' maka kami pun beriman. Ya Rabb kami, ampunilah dosa-dosa kami dan hapuskanlah kesalahan-kesalahan kami, dan matikanlah kami beserta orang-orang yang berbakti(shalih). Ya Rabb kami, berilah kami apa yang telah Engkau janjikan kepada kami melalui Rasul-Rasul-Mu. Dan janganlah Engkau hinakan kami pada hari Kiamat. Sungguh, Engkau tidak pernah mengingkari janji."
          },
          {
            "arabic": "رَبِّ إِنِّي ظَلَمْتُ نَفْسِي فَاغْفِرْ لِي ",
            "audio": "",
            "notes": "",
            "source": "QS. Al-Qashash[28]:16",
            "translation": "Ya Rabbku, sungguh aku telah menzalimi diriku sendiri, maka ampunilah aku."
          },
          {
            "arabic": "رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا ۚ رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا ۚ رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ ۖ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا ۚ أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ",
            "audio": "",
            "notes": "",
            "source": "QS. Al-Baqarah[2]:286",
            "translation": "Ya Rabb kami, janganlah Engkau hukum kami jika kami lupa atau kami melakukan kesalahan. Ya Rabb kami, janganlah Engkau bebani kami dengan beban yang berat sebagaimana Engkau bebankan kepada orang-orang sebelum kami. Ya Rabb kami, janganlah Engkau pikulkan kepada kami apa yang tidak sanggup kami memikulnya. Maafkanlah kami, ampunilah kami, dan rahmatilah kami. Engkaulah pelindung kami, maka tolonglah kami menghadapi orang-orang kafir."
          },
          {
            "arabic": " رَبَّنَا ظَلَمْنَا أَنْفُسَنَا وَإِنْ لَمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُونَنَّ مِنَ الْخَاسِرِينَ",
            "audio": "",
            "notes": "",
            "source": "QS. Al-A'raf[7]:23",
            "translation": "Ya Rabb kami, kami telah menzhalimi diri kami sendiri. Jika Engkau tidak mengampuni kami dan memberi rahmat kepada kami, niscaya kami termasuk orang-orang yang rugi."
          }
        ],
        "id": 1,
        "language": "id",
        "title": "Memohon Ampunan Dan Rahmat Allah"
      },
      {
        "bookId": 2,
        "data": [
          {
            "arabic": "رَبِّ هَبْ لِي حُكْمًا وَأَلْحِقْنِي بِالصَّالِحِينَ وَاجْعَلْ لِي لِسَانَ صِدْقٍ فِي الْآخِرِينَ وَاجْعَلْنِي مِنْ وَرَثَةِ جَنَّةِ النَّعِيمِ",
            "audio": "",
            "notes": "",
            "source": "QS. Asy-Syu'ara[26]:83-85",
            "translation": "Ya Rabb-ku, berikanlah kepadaku ilmu dan masukkanlah aku ke dalam golongan orang-orang yang shalih, dan jadikanlah aku buah tutur yang baik bagi orang-orang (yang datang) kemudian, dan jadikanlah aku termasuk orang yang mewarisi surga yang penuh kenikmatan."
          },
          {
            "arabic": "وَلَا تُخْزِنِي يَوْمَ يُبْعَثُونَ",
            "audio": "",
            "notes": "",
            "source": "QS. Asy-Syu'ara[26]:87",
            "translation": "dan janganlah Engkau hinakan aku pada hari mereka dibangkitkan"
          },
          {
            "arabic": " رَبَّنَا آمَنَّا فَاكْتُبْنَا مَعَ الشَّاهِدِينَ",
            "audio": "",
            "notes": "",
            "source": "QS. Al-Ma'idah[5]:83",
            "translation": "Ya Rabb kami, kami telah beriman, maka catatlah kami bersama orang-orang yang menjadi saksi (atas kebenaran al-Qur'an dan kenabian Muhammad)"
          }
        ],
        "id": 2,
        "language": "id",
        "title": "Doa Agar Termasuk Golongan Orang-Orang Beriman"
      },
      {
        "bookId": 2,
        "data": [
          {
            "arabic": " رَبِّ لَا تَذَرْنِي فَرْدًا وَأَنْتَ خَيْرُ الْوَارِثِينَ",
            "audio": "",
            "notes": "",
            "source": "QS. Al-Anbiya[21]:89",
            "translation": "Ya Rabbku, janganlah Engkau biarkan aku hidup seorang diri ( tanpa keturunan) dan Engkaulah ahli waris yang terbaik."
          },
          {
            "arabic": "رَبِّ هَبْ لِي مِنَ الصَّالِحِينَ",
            "audio": "",
            "notes": "",
            "source": "QS. As-Shaffat[37]:100",
            "translation": "Ya Rabbku, anugerahkanlah kepadaku (seorang anak) yang termasuk orang yang shalih"
          },
          {
            "arabic": "رَبِّ هَبْ لِي مِنْ لَدُنْكَ ذُرِّيَّةً طَيِّبَةً ۖ إِنَّكَ سَمِيعُ الدُّعَاءِ",
            "audio": "",
            "notes": "",
            "source": "QS. Ali-'Imran[3]:38",
            "translation": "Ya Rabbku, berilah aku keturunan yang baik dari sisi-Mu. Sesungguhnya Engkau Yang Maha Mendengar doa."
          },
          {
            "arabic": " رَبَّنَا هَبْ لَنَا مِنْ أَزْوَاجِنَا وَذُرِّيَّاتِنَا قُرَّةَ أَعْيُنٍ وَاجْعَلْنَا لِلْمُتَّقِينَ إِمَامًا",
            "audio": "",
            "notes": "",
            "source": "QS. Al-Furqan[25]:74",
            "translation": "Ya Rabb kami, anugerahkanlah kepada kami istri-istri kami dan keturunan kami sebagai penyenang hati (kami), dan jadikanlah kami pemimpin bagi orang-orang yang bertakwa"
          }
        ],
        "id": 3,
        "language": "id",
        "title": "Doa Agar Diberikan Keturunan Yang Shalih"
      },
      {
        "bookId": 2,
        "data": [
          {
            "arabic": "رَبَّنَا اغْفِرْ لِي وَلِوَالِدَيَّ وَلِلْمُؤْمِنِينَ يَوْمَ يَقُومُ الْحِسَابُ",
            "audio": "",
            "notes": "",
            "source": "QS. Ibrahim[14]:41",
            "translation": "Ya Rabb kami, ampunilah aku dan kedua ibu bapakku dan semua orang yang beriman pada hari diadakan perhitungan (Hari Kiamat)"
          },
          {
            "arabic": "رَبَّنَا اغْفِرْ لَنَا وَلِإِخْوَانِنَا الَّذِينَ سَبَقُونَا بِالْإِيمَانِ وَلَا تَجْعَلْ فِي قُلُوبِنَا غِلًّا لِلَّذِينَ آمَنُوا رَبَّنَا إِنَّكَ رَءُوفٌ رَحِيمٌ",
            "audio": "",
            "notes": "",
            "source": "QS. Al-Hasyr[59]:10",
            "translation": "Ya Rabb kami, ampunilah kami dan saudara-saudara kami yang telah beriman lebih dahulu dari kami, dan janganlah Engkau tanamkan kedengkian ke dalam hati kami terhadap orang-orang yang beriman. Ya Rabb Kami, Sungguh, Engkau Maha Penyantun, Maha Penyayang."
          },
          {
            "arabic": "رَبِّ اغْفِرْ لِي وَلِوَالِدَيَّ وَلِمَنْ دَخَلَ بَيْتِيَ مُؤْمِنًا وَلِلْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ ",
            "audio": "",
            "notes": "",
            "source": "QS. Nuh[71]:28",
            "translation": "Ya Rabbku, ampunilah aku, ibu bapakku, dan siapa pun yang memasuki rumahku dengan beriman dan semua orang yang beriman laki-laki dan perempuan"
          }
        ],
        "id": 4,
        "language": "id",
        "title": "Memohonkan Ampunan Bagi Kedua Orang Tua Dan Bagi Kaum Mukminin"
      },
      {
        "bookId": 2,
        "data": [
          {
            "arabic": "رَبِّ اجْعَلْنِي مُقِيمَ الصَّلَاةِ وَمِنْ ذُرِّيَّتِي ۚ رَبَّنَا وَتَقَبَّلْ دُعَاءِ",
            "audio": "",
            "notes": "",
            "source": "QS. Ibrahim[14]:40",
            "translation": "Ya Rabbku, jadikanlah aku dan anak cucuku orang yang tetap melaksanakan shalat, ya Rabb kami, perkenankanlah doaku."
          }
        ],
        "id": 5,
        "language": "id",
        "title": "Doa Memohon Ketetapan Bagi Diri Sendiri Dan Keluarga Agar Selalu Mendirikan Shalat"
      },
      {
        "bookId": 2,
        "data": [
          {
            "arabic": " رَبِّ نَجِّنِي مِنَ الْقَوْمِ الظَّالِمِينَ",
            "audio": "",
            "notes": "",
            "source": "QS. Al-Qashash[28]:21",
            "translation": "Ya Rabbku, selamatkanlah aku dari orang-orang yang zalim itu."
          },
          {
            "arabic": "رَبَّنَا لَا تَجْعَلْنَا مَعَ الْقَوْمِ الظَّالِمِينَ",
            "audio": "",
            "notes": "",
            "source": "QS. Al-A'raf[7]47",
            "translation": "Ya Rabb kami, janganlah Engkau tempatkan kami bersama-sama orang-orang zalim itu"
          },
          {
            "arabic": " رَبِّ انْصُرْنِي عَلَى الْقَوْمِ الْمُفْسِدِينَ",
            "audio": "",
            "notes": "",
            "source": "QS. Al-Ankabut[29]:30",
            "translation": "Ya Rabbku, tolonglah aku (yakni dengan menimpakan azab) atas golongan yang berbuat kerusakan itu."
          }
        ],
        "id": 6,
        "language": "id",
        "title": "Berlindung Dari Orang-Orang Zhalim"
      },
      {
        "bookId": 2,
        "data": [
          {
            "arabic": " رَبَّنَا تَقَبَّلْ مِنَّا ۖ إِنَّكَ أَنْتَ السَّمِيعُ الْعَلِيمُ …  وَتُبْ عَلَيْنَا ۖ إِنَّكَ أَنْتَ التَّوَّابُ الرَّحِيمُ",
            "audio": "",
            "notes": "",
            "source": "QS. Al-Baqarah[2]:127,128",
            "translation": "Ya Rabb kami, terimalah (amal) dari kami. Sungguh, Engkaulah Yang Maha Mendengar, Maha Mengetahui ... dan terimalah taubat kami. Sungguh, Engkaulah Maha Penerima taubat, Maha Penyayang"
          }
        ],
        "id": 7,
        "language": "id",
        "title": "Doa Agar Diterimanya Amal Ibadah Dan Taubat"
      },
      {
        "bookId": 2,
        "data": [
          {
            "arabic": " رَبَّنَا عَلَيْكَ تَوَكَّلْنَا وَإِلَيْكَ أَنَبْنَا وَإِلَيْكَ الْمَصِيرُ",
            "audio": "",
            "notes": "",
            "source": "QS. Al-Mumtahanah[60]:4",
            "translation": "Ya Rabb kami, hanya kepada Engkau kami bertawakkal dan hanya kepada Engkau kami bertaubat dan hanya kepada Engkaulah kami kembali"
          },
          {
            "arabic": " حَسْبِيَ اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ ۖ عَلَيْهِ تَوَكَّلْتُ ۖ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ",
            "audio": "",
            "notes": "",
            "source": "QS. At-Taubah[9]:129",
            "translation": "Cukuplah Allah bagiku; tidak ada ilah selain Dia. Hanya kepada-Nya aku bertawakal, dan Dia adalah Rabb yang memiliki 'Arsy (singgasana) yang agung"
          }
        ],
        "id": 8,
        "language": "id",
        "title": "Bertawakkal Kepada Allah"
      },
      {
        "bookId": 2,
        "data": [
          {
            "arabic": "رَبَّنَا لَا تَجْعَلْنَا فِتْنَةً لِلَّذِينَ كَفَرُوا وَاغْفِرْ لَنَا رَبَّنَا ۖ إِنَّكَ أَنْتَ الْعَزِيزُ الْحَكِيمُ",
            "audio": "",
            "notes": "",
            "source": "QS. Al-Mumtahanah[60]:5",
            "translation": "Ya Rabb kami, jangan Engkau jadikan kami (sasaran) fitnah bagi orang-orang kafir. Dan ampunilah kami, ya Rabb kami. Sesungguhnya Engkau yang Mahaperkasa, Mahabijaksana"
          },
          {
            "arabic": " رَبَّنَا لَا تَجْعَلْنَا فِتْنَةً لِلْقَوْمِ الظَّالِمِينَ  وَنَجِّنَا بِرَحْمَتِكَ مِنَ الْقَوْمِ الْكَافِرِينَ",
            "audio": "",
            "notes": "",
            "source": "QS. At-Yunus[10]:85-86",
            "translation": "Ya Rabb kami, janganlah Engkau jadikan kami (sasaran) fitnah bagi kaum yang zalim, dan selamatkanlah kami dengan rahmat-Mu dari orang-orang yang kafir"
          }
        ],
        "id": 9,
        "language": "id",
        "title": "Berlindung Dari Fitnah"
      },
      {
        "bookId": 2,
        "data": [
          {
            "arabic": " رَبِّ زِدْنِي عِلْمًا",
            "audio": "",
            "notes": "",
            "source": "QS. Thaha[20]:114",
            "translation": "Ya Rabbku, tambahkanlah ilmu kepadaku"
          }
        ],
        "id": 10,
        "language": "id",
        "title": "Doa Agar Ditambahkan Ilmu"
      },
      {
        "bookId": 2,
        "data": [
          {
            "arabic": " رَبَّنَا أَتْمِمْ لَنَا نُورَنَا وَاغْفِرْ لَنَا ۖ إِنَّكَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ",
            "audio": "",
            "notes": "",
            "source": "QS. At-Tahrim[66]:8",
            "translation": "Ya Rabb kami, sempurnakanlah untuk kami cahaya kami dan ampunilah kami; Sungguh, Engkau Mahakuasa atas segala sesuatu"
          }
        ],
        "id": 11,
        "language": "id",
        "title": "Doa Agar Cahaya Sendiri Disempurnakan"
      },
      {
        "bookId": 2,
        "data": [
          {
            "arabic": " رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ",
            "audio": "",
            "notes": "",
            "source": "QS. Al-Baqarah[2]:201",
            "translation": "Ya Rabb kami, berilah kami kebaikan di dunia dan kebaikan di akhirat, dan lindungilah kami dari azab Neraka"
          }
        ],
        "id": 12,
        "language": "id",
        "title": "Doa Memohon Kebaikan Dunia Dan Akhirat"
      },
      {
        "bookId": 2,
        "data": [
          {
            "arabic": " رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَىٰ وَالِدَيَّ وَأَنْ أَعْمَلَ صَالِحًا تَرْضَاهُ وَأَدْخِلْنِي بِرَحْمَتِكَ فِي عِبَادِكَ الصَّالِحِينَ",
            "audio": "",
            "notes": "",
            "source": "QS. An-Naml[27]:19",
            "translation": "Ya Rabbku, anugerahkanlah aku ilham untuk tetap mensyukuri nikmat-Mu yang telah Engkau anugerahkan kepadaku dan kepada kedua orangtuaku dan agar aku mengerjakan kebajikan yang Engkau ridhai; dan masukkanlah aku dengan rahmat-Mu ke dalam golongna hamba-hamba-Mu yang shalih"
          },
          {
            "arabic": " رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَىٰ وَالِدَيَّ وَأَنْ أَعْمَلَ صَالِحًا تَرْضَاهُ وَأَصْلِحْ لِي فِي ذُرِّيَّتِي ۖ إِنِّي تُبْتُ إِلَيْكَ وَإِنِّي مِنَ الْمُسْلِمِينَ",
            "audio": "",
            "notes": "",
            "source": "QS. Al-Ahqaf[46]:15",
            "translation": "Ya Rabbku, berilah aku petunjuk agar aku dapat mensyukuri nikmat-Mu yang telah Engkau limpahkan kepadaku dan kepada kedua orangtuaku dan agar aku dapat berbuat kebajikan yang Engkau ridhai; dan berilah aku kebaikan yang akan mengalir sampai kepada anak cucuku. Sesungguhnya aku bertaubat kepada Engkau dan sungguh, aku termasuk orang muslim"
          }
        ],
        "id": 13,
        "language": "id",
        "title": "Doa Agar Dijadikan Hamba Yang Bersyukur"
      },
      {
        "bookId": 2,
        "data": [
          {
            "arabic": " رَبِّ أَعُوذُ بِكَ مِنْ هَمَزَاتِ الشَّيَاطِينِ وَأَعُوذُ بِكَ رَبِّ أَنْ يَحْضُرُونِ",
            "audio": "",
            "notes": "",
            "source": "QS. Al-Mu'minun[23]:97-98",
            "translation": "Ya Rabbku, aku berlindung kepada Engkau dari bisikan-bisikan syaitan, dan aku berlindung (pula) kepada Engkau ya Rabbku, agar mereka tidak mendekati aku"
          }
        ],
        "id": 14,
        "language": "id",
        "title": "Berlindung Dari Syaitan"
      },
      {
        "bookId": 2,
        "data": [
          {
            "arabic": "رَبَّنَا لَا تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا وَهَبْ لَنَا مِنْ لَدُنْكَ رَحْمَةً ۚ إِنَّكَ أَنْتَ الْوَهَّابُ",
            "audio": "",
            "notes": "",
            "source": "QS. Ali-'Imran[3]:8",
            "translation": "Ya Rabb kami, jangan Engkau condongkan hati kami kepada kesesatan setelah Engkau telah berikan petunjuk kepada kami, dan karuniakanlah kepada kami rahmat dari sisi-Mu, karena sesungguhnya Engkau Maha Pemberi"
          }
        ],
        "id": 15,
        "language": "id",
        "title": "Doa Agar Hati Ditetapkan Dalam Hidayah"
      },
      {
        "bookId": 2,
        "data": [
          {
            "arabic": " لَا إِلَٰهَ إِلَّا أَنْتَ سُبْحَانَكَ إِنِّي كُنْتُ مِنَ الظَّالِمِينَ",
            "audio": "",
            "notes": "",
            "source": "QS. Al-Anbiya[21]:87",
            "translation": "Tidak ada ilah yang berhak diibadahi selain Engkau, Mahasuci Engkau. Sungguh, aku ini termasuk orang-orang yang zhalim"
          },
          {
            "arabic": " رَبِّ اشْرَحْ لِي صَدْرِي وَيَسِّرْ لِي أَمْرِي وَاحْلُلْ عُقْدَةً مِنْ لِسَانِي يَفْقَهُوا قَوْلِي",
            "audio": "",
            "notes": "",
            "source": "QS. Al-Thaha[20]:25-28",
            "translation": "Ya Rabbku, lapangkanlah dadaku, dan mudahkanlah untukku urusanku, dan lepaskanlah kekakuan dari lidahku, agar mereka mengerti perkataanku"
          },
          {
            "arabic": " رَبَّنَا آتِنَا مِنْ لَدُنْكَ رَحْمَةً وَهَيِّئْ لَنَا مِنْ أَمْرِنَا رَشَدًا",
            "audio": "",
            "notes": "",
            "source": "QS. Al-Kahf[18]:10",
            "translation": "Ya Rabb kami, Berikanlah rahmat kepada kami dari sisi-Mu dan sempurnakanlah petunjuk yang lurus bagi kami dalam urusan kami"
          }
        ],
        "id": 16,
        "language": "id",
        "title": "Doa Agar Dilapangkan Hati Dan Dimudahkan Dalam Segala Urusan"
      },
      {
        "bookId": 2,
        "data": [
          {
            "arabic": "رَبِّ اجْعَلْ هَٰذَا الْبَلَدَ آمِنًا وَاجْنُبْنِي وَبَنِيَّ أَنْ نَعْبُدَ الْأَصْنَامَ",
            "audio": "",
            "notes": "",
            "source": "QS. Ibrahim[14]:35",
            "translation": "Ya Rabb, jadikanlah negeri ini, negeri yang aman, dan jauhkanlah aku beserta anak cucuku agar tidak menyembah berhala"
          }
        ],
        "id": 17,
        "language": "id",
        "title": "Doa Untuk Keamanan Negeri Dan Berlindung Dari Syirik"
      },
      {
        "bookId": 2,
        "data": [
          {
            "arabic": "رَبَّنَا اصْرِفْ عَنَّا عَذَابَ جَهَنَّمَ ۖ إِنَّ عَذَابَهَا كَانَ غَرَامًا إِنَّهَا سَاءَتْ مُسْتَقَرًّا وَمُقَامًا",
            "audio": "",
            "notes": "",
            "source": "QS. Al-Furqan[25]:65-66",
            "translation": "Ya Rabb kami, jauhkanlah azab Jahannam dari kami, karena sesungguhnya azab itu membuat kebinasaan yang kekal, sungguh, Jahannam itu seburuk-buruk tempat menetap dan tempat kediaman"
          }
        ],
        "id": 18,
        "language": "id",
        "title": "Berlindung Dari Api Neraka"
      },
      {
        "bookId": 2,
        "data": [
          {
            "arabic": " حَسْبُنَا اللَّهُ وَنِعْمَ الْوَكِيلُ",
            "audio": "",
            "notes": "",
            "source": "QS. Ali 'Imran[3]:173",
            "translation": "Cukuplah Allah (menjadi penolong) bagi kami dan Dia sebaik-baik pelindung"
          }
        ],
        "id": 19,
        "language": "id",
        "title": "Doa Meminta Pertolongan Dan Perlindungan Dari Orang Kafir"
      },
      {
        "bookId": 2,
        "data": [
          {
            "arabic": "رَبَّنَا أَفْرِغْ عَلَيْنَا صَبْرًا وَتَوَفَّنَا مُسْلِمِينَ",
            "audio": "",
            "notes": "",
            "source": "QS. Al-A'raf[7]:126",
            "translation": "Ya Rabb kami, limpahkan kesabaran kepada kami dan matikanlah kami dalam keadaan muslim (berserah diri kepada-Mu)"
          }
        ],
        "id": 20,
        "language": "id",
        "title": "Doa Mohon Kesabaran Dan Diwafatkan Dalam Keadaan Muslim"
      },
      {
        "bookId": 2,
        "data": [
          {
            "arabic": " عَسَىٰ رَبِّي أَنْ يَهْدِيَنِي سَوَاءَ السَّبِيلِ",
            "audio": "",
            "notes": "",
            "source": "QS. Al-Qashash[28]:22",
            "translation": "Mudah-mudahan Rabbku memimpin aku ke jalan yang benar"
          }
        ],
        "id": 21,
        "language": "id",
        "title": "Doa Agar Dibimbing Ke Jalan Yang Lurus"
      }
    ],
    "status": "1",
    "title": "Doa di Qur'an",
    "type": 0,
    "updated": ""
  },
  {
    "desc": "Humans have a great need for dhikr, anytime and anywhere. If a servant is negligent from remembering Allah, He will regret it both in this dunya and the akhirah.",
    "id": 0,
    "language": "en",
    "prayer": [
      {
        "bookId": 0,
        "data": [
          {
            "arabic": "اللَّهُ لاَ إِلَهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلاَّ بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلَا يَئُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ",
            "audio": "ayatulkursi",
            "notes": "Recite Once",
            "source": "It was reported by Al-Hakim 1 / 562, Al-Albani graded it as authentic in Sahihut-Targhib wat-Tarhib 1/273, and traces it to An-Nasa'i and At-Tabarani.",
            "translation": "There is none worthy of worship but He, the Ever Living, the One Who sustains and projects all that exist. Neither slumber nor sleep overtakes Him. To Him belongs whatever is in the heavens and whatever is on the earth. Who is he that can intercede with Him except with His Permission? He knows what happens to them in this world, and what will happen to them in the Hereafter. And they will never encompass anything of His Knowledge except that which He wills. His Throne extends over the heavens and the earth, and He feels no fatigue in guarding and preserving them. And He is the Most High, the Most Great.\n(Al-Baqarah: 255)"
          },
          {
            "arabic": "قُلْ هُوَ اللَّهُ أَحَدٌ⦿اللَّهُ الصَّمَدُ⦿لَمْ يَلِدْ وَلَمْ يُولَدْ⦿وَلَمْ يَكُن لَّهُ كُفُوًا أَحَدٌ⦿",
            "audio": "alikhlas2",
            "notes": "Recite 3x",
            "source": "The Hadith was reported by Abu Dawud 4/322, and At-Tirmithi 5/567. See Al-Albani's Sahih At-Tirmithi 3/182.",
            "translation": "Say: He is Allah (the) One. The Self-Sufficient Master, Whom all creatures need, He begets not nor was He begotten, and there is none equal to Him.\n(Al-Ikhlas: 1-4)"
          },
          {
            "arabic": "قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ⦿مِن شَرِّ مَا خَلَقَ⦿وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ⦿وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ⦿وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ⦿",
            "audio": "alfalaq",
            "notes": "Recite 3x",
            "source": "The Hadith was reported by Abu Dawud 4/322, and At-Tirmithi 5/567. See Al-Albani's Sahih At-Tirmithi 3/182.",
            "translation": "Say: I seek refuge with (Allah) the Lord of the daybreak, from the evil of what He has created, and from the evil of the darkening (night) as it comes with its darkness, and from the evil of those who practice witchcraft when they blow in the knots, and from the evil of the envier when he envies.\n(Al-Falaq: 1-5)"
          },
          {
            "arabic": "قُلْ أَعُوذُ بِرَبِّ النَّاسِ⦿مَلِكِ النَّاسِ⦿إِلَهِ النَّاسِ⦿مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ⦿الَّذِي يُوَسْوِسُ فِي صُدُورِالنَّاسِ⦿مِنَ الْجِنَّةِ وَ النَّاسِ⦿",
            "audio": "annas",
            "notes": "Recite 3x",
            "source": "Abu Dawud (5082), an-Nasa-i VIII/250 and at-Tirmidzi (3575), Ahmad V/312, Shahiih at-Tirmidzi (2829), Tuhfatul Ahwadzi (3646), Shahiih at-Targhiib wat Tarhiib 1/411 (649)",
            "translation": "Say: I seek refuge with (Allah) the Lord of mankind, the King of mankind, the God of mankind, from the evil of the whisperer who withdraws, who whispers in the hearts of mankind, of jinns and men. \n(An-Naas: 1-6)"
          },
          {
            "arabic": "أَمْسَيْنَا وَأَمْسَى الْمُلْكُ للهِ، وَالْحَمْدُ للهِ، لَا إِلَهَ إِلاَّ اللهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، رَبِّ أَسْأَلُكَ خَيْرَ مَا فِي هَذِهِ اللَّيْلَةِ وَخَيْرَ مَا بَعْدَهَا، وَأَعُوذُبِكَ مِنْ شَرِّ مَا فِي هَذِهِ اللَّيْلَةِ وَشَرِّ مَا بَعْدَهَا، رَبِّ أَعُوذُبِكَ مِنَ الْكَسَلِ وَسُوءِ الْكِبَرِ، رَبِّ أَعُوذُبِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ",
            "audio": "",
            "notes": "Recite Once",
            "source": "Muslim IV/2088 (2723), Abu Dawud (5071), at-Tirmidzi (3390)",
            "translation": "We have ended another day and with it all dominion is Allah's. Praise is to Allah. None has the right to be worshipped but Allah alone, Who has no partner. To Allah belongs the dominion, and to Him is the praise and He is Able to do all things. My Lord, I ask You for the goodness of this day and of the days that come after it, and I seek refuge in You from the evil of this day and of the days that come after it. My Lord, I seek refuge in You from laziness and helpless old age. My Lord, I seek refuge in You from the punishment of Hell-fire , and from the punishment of the grave."
          },
          {
            "arabic": "اَللَّهُمَّ بِكَ أَمْسَيْنَا، وَبِكَ أَصْبَحْنَا، وَبِكَ نَحْيَا، وَبِكَ نَمُوْتُ وَإِلَيْكَ الْـمَصِيْرُ",
            "audio": "",
            "notes": "Recite Once",
            "source": "Al-Bukhari in al-Adabul Mufrad, this part was taken from al-Bukhari, at-Tirmidzi (3391), Abu Dawud (5068), Ahmad 11/354, Ibnu Majah (3868), Shahiih al-Adabil Mufrad (911)",
            "translation": "O Allah, You bring us the end of the day as You bring us its beginning, You bring us life and you bring us death, and to You is our fate."
          },
          {
            "arabic": "اَللَّهُمَّ أَنْتَ رَبِّيْ لاَ إِلَـهَ إِلاَّ أَنْتَ، خَلَقْتَنِيْ وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوْذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوْءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوْءُ بِذَنْبِيْ فَاغْفِرْ لِيْ فَإِنَّهُ لاَ يَغْفِرُ الذُّنُوْبَ إِلاَّ أَنْتَ.",
            "audio": "",
            "notes": "Recite Once",
            "source": "Al-Bukhari (6306 and 6323), Ahmad IV/122-125, an-Nasa-i VIII/279-280",
            "translation": "O Allah, You are my Lord, there is none worthy of worship but You. You created me and I am your slave. I keep Your covenant, and my pledge to You so far as I am able. I seek refuge in You from the evil of what I have done. I admit to Your blessings upon me, and I admit to my misdeeds. Forgive me, for there is none who may forgive sins but You."
          },
          {
            "arabic": "اللَّهُمَّ عَافِنِي فِي بَدَنِي، اللَّهُمَّ عَافِنِي فِي سَمْعِي، اللَّهُمَّ عَافِنِي فِي بَصْرِي، لاَ إِلَهَ إِلاَّ أَنْتَ، اللَّهُمَّ إِنِّي أَعُوْذُ بِكَ مِنَ الْكُفْرِ، وَالْفَقْرِ، وأَعُوْذُ بِكَ مِنْ عَذَابِ القَبْرِ، لاَ إِلَهَ إِلاَّ أَنْتَ",
            "audio": "",
            "notes": "Recite 3x",
            "source": "Al-Bukhari in Shahiih al-Adabil Mufrad (539), Abu Dawud (5090), Ahmad V/42",
            "translation": "O Allah, make me healthy in my body. O Allah, preserve for me my hearing. O Allah, preserve for me my sight. There is none worthy of worship but You .\nO Allah , I seek refuge in You from disbelief and poverty and I seek refuge in You from the punishment of the grave . There is none worthy of worship but You."
          },
          {
            "arabic": "اَللَّهُمَّ إِنِّيْ أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي الدُّنْيَا وَاْلآخِرَةِ، اَللَّهُمَّ إِنِّيْ أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِيْنِيْ وَدُنْيَايَ وَأَهْلِيْ وَمَالِيْ اللَّهُمَّ اسْتُرْ عَوْرَاتِى وَآمِنْ رَوْعَاتِى. اَللَّهُمَّ احْفَظْنِيْ مِنْ بَيْنِ يَدَيَّ، وَمِنْ خَلْفِيْ، وَعَنْ يَمِيْنِيْ وَعَنْ شِمَالِيْ، وَمِنْ فَوْقِيْ، وَأَعُوْذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِيْ",
            "audio": "",
            "notes": "Recite Once",
            "source": "Al-Bukhari in al-Adabul Mufrad, Abu Dawud (5074), Ibnu Majah (3871), al-Hakim 1/517-518, Shahiih al-Adabul Mufrad (912)",
            "translation": "O Allah, I seek Your forgiveness and Your protection in this world and the next. O Allah, I seek Your forgiveness and Your protection in my religion, in my worldly affairs, in my family and in my wealth. O Allah, conceal my secrets and preserve me from anguish . O Allah , guard me from what is in front of me and behind me , from my left , and from my right , and from above me . I seek refuge in Your Greatness from being struck down from beneath me."
          },
          {
            "arabic": "اَللَّهُمَّ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ فَاطِرَ السَّمَاوَاتِ وَاْلأَرْضِ، رَبَّ كُلِّ شَيْءٍ وَمَلِيْكَهُ، أَشْهَدُ أَنْ لاَ إِلَـهَ إِلاَّ أَنْتَ، أَعُوْذُ بِكَ مِنْ شَرِّ نَفْسِيْ، وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِيْ سُوْءًا أَوْ أَجُرُّهُ إِلَى مُسْلِمٍ",
            "audio": "",
            "notes": "Recite Once",
            "source": "At-Tirmidzi (3392) and Abu Dawud (5067), see Shahiih at-Tirmidzi (2071), Shahiih al-Adabil Mufrad (914)",
            "translation": "O Allah, Knower of the unseen and the evident , Maker of the heavens and the earth , Lord of everything and its Possessor , I bear witness that there is none worthy of worship but You . I seek refuge in You from the evil of my soul and from the evil of Satan and his helpers . (I seek refuge in You) from bringing evil upon my soul and from harming any Muslim."
          },
          {
            "arabic": "بِسْمِ اللَّهِ الَّذِى لاَ يَضُرُّ مَعَ اسْمِهِ شَىْءٌ فِى الأَرْضِ وَلاَ فِى السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ",
            "audio": "",
            "notes": "Recite 3x",
            "source": "At-Tirmidzi (3388), Abu Dawud (5088), Ahmad (446 and 476), Tahqiq Ahmad Syakir and Ibnu Majah (3869), see Shahiih Ibni Majah (3120), al-Hakim 1/513, Shahiih al-Adabil Mufrad (513)",
            "translation": "In the Name of Allah, Who with His Name nothing can cause harm in the earth nor in the heavens, and He is the All-Hearing, the All-Knowing."
          },
          {
            "arabic": "رَضِيْتُ بِاللهِ رَبًّا، وَبِاْلإِسْلاَمِ دِيْنًا، وَبِمُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَبِيًّا",
            "audio": "",
            "notes": "Recite 3x",
            "source": "Ahmad IV/337, Abu Dawud (5072), at-Tirmidzi (3389), Ibnu Majah (3870), an-Nasa-i in 'Amalul Yaum wal Lailah (4) and Ibnus Sunni (68), Shahiih at-Targhiib wat Tarhiib 1/415 (657), declared shahih by Imam al-Hakim in al-Mustadrak 1/518 and approved by Imam adz-Dzahabi",
            "translation": "I am pleased with Allah as my Lord, with Islam as my religion and with Muhammad (peace and blessings of Allah be upon him) as my Prophet."
          },
          {
            "arabic": "يَا حَيُّ يَا قَيُّوْمُ بِرَحْمَتِكَ أَسْتَغِيْثُ، وَأَصْلِحْ لِيْ شَأْنِيْ كُلَّهُ وَلاَ تَكِلْنِيْ إِلَى نَفْسِيْ طَرْفَةَ عَيْنٍ",
            "audio": "",
            "notes": "Recite Once",
            "source": "An-Nasa-i 575, al-Bazzar 3107 and al-Hakim 1/545 and Ibnus Sunni 48, see Shahiih at-Targhiib wat Tarhiib I/417 (661)",
            "translation": "O Ever Living One, O Eternal One, by Your mercy I call on You to set right all my affairs. Do not place me in charge of my soul even for the blinking of an eye (a moment)"
          },
          {
            "arabic": "أَمْسَيْنَا عَلَى فِطْرَةِ اْلإِسْلاَمِ وَعَلَى كَلِمَةِ اْلإِخْلاَصِ، وَعَلَى دِيْنِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِيْنَا إِبْرَاهِيْمَ، حَنِيْفًا مُسْلِمًا وَمَا كَانَ مِنَ الْمُشْرِكِيْنَ ",
            "audio": "",
            "notes": "Recite Once",
            "source": "Ahmad III/406, 407, V/123, ad-Darimi II/292 and Ibnus Sunni in Amalul Yaum wal Lailah (34), Misykaatul Mashaabiih (2415), Shahiihal-Jaami'ish Shaghiir (4674)",
            "translation": "We end this day upon the natural religion of Islam, the word of sincere devotion, the religion of our Prophet Muhammad (peace and blessings of Allah be upon him), and the faith of our father Ibrahim. He was upright (in worshipping Allah), and a Muslim. He was not of those who worship others besides Allah."
          },
          {
            "arabic": "لاَ إِلَـهَ إِلاَّ اللهُ وَحْدَهُ لاَ شَرِيْكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرُ",
            "audio": "",
            "notes": "Recite once or 10x or 100x",
            "source": "Abu Dawud (5077), Ibnu Majah (3867), Shahiih Jaami'ish Shaghiir (6418), Misykaatul Mashaabiih (2395), Shahiih at-Targhiib 1/414 (656)",
            "translation": "None has the right to be worshipped but Allah alone, Who has no partner. His is the dominion and His is the praise and He is Able to do all things."
          },
          {
            "arabic": "سُبْحَانَ اللهِ وَبِحَمْدِهِ",
            "audio": "",
            "notes": "Recite 100x",
            "source": "Muslim (2691) and (2692), Syarh Muslim XVII/17-18, Shahiih at-Targhiib wat Tarhiib 1/413 (653).",
            "translation": "Glory is to Allah and praise is to Him"
          },
          {
            "arabic": "أَعُوْذُ بِكَلِمَاتِ اللهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ",
            "audio": "",
            "notes": "Recite 3x",
            "source": "Ahmad 11/290, an-Nasa-i in 'Amalul Yaum wal Lailah (590), Shahiih at-Targhiib wat Tarhiib 1/412 (652), Shahiih al-Jaami 'ish Shaghiir (6427)",
            "translation": "I seek refuge in the Perfect Words of Allah from the evil of what He has created."
          }
        ],
        "id": 2,
        "language": "en",
        "title": "Evening Dzikir"
      },
      {
        "bookId": 0,
        "data": [
          {
            "arabic": "اللَّهُ لاَ إِلَهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلاَّ بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلَا يَئُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ",
            "audio": "ayatulkursi",
            "notes": "Recite Once",
            "source": "It was reported by Al-Hakim 1 / 562, Al-Albani graded it as authentic in Sahihut-Targhib wat-Tarhib 1/273, and traces it to An-Nasa'i and At-Tabarani.",
            "translation": "There is none worthy of worship but He, the Ever Living, the One Who sustains and projects all that exist. Neither slumber nor sleep overtakes Him. To Him belongs whatever is in the heavens and whatever is on the earth. Who is he that can intercede with Him except with His Permission? He knows what happens to them in this world, and what will happen to them in the Hereafter. And they will never encompass anything of His Knowledge except that which He wills. His Throne extends over the heavens and the earth, and He feels no fatigue in guarding and preserving them. And He is the Most High, the Most Great.\n(Al-Baqarah: 255)"
          },
          {
            "arabic": "قُلْ هُوَ اللَّهُ أَحَدٌ⦿اللَّهُ الصَّمَدُ⦿لَمْ يَلِدْ وَلَمْ يُولَدْ⦿وَلَمْ يَكُن لَّهُ كُفُوًا أَحَدٌ⦿",
            "audio": "alikhlas2",
            "notes": "Recite 3x",
            "source": "The Hadith was reported by Abu Dawud 4/322, and At-Tirmithi 5/567. See Al-Albani's Sahih At-Tirmithi 3/182.",
            "translation": "Say: He is Allah (the) One. The Self-Sufficient Master, Whom all creatures need, He begets not nor was He begotten, and there is none equal to Him.\n(Al-Ikhlas: 1-4)"
          },
          {
            "arabic": "قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ⦿مِن شَرِّ مَا خَلَقَ⦿وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ⦿وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ⦿وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ⦿",
            "audio": "alfalaq",
            "notes": "Recite 3x",
            "source": "The Hadith was reported by Abu Dawud 4/322, and At-Tirmithi 5/567. See Al-Albani's Sahih At-Tirmithi 3/182.",
            "translation": "Say: I seek refuge with (Allah) the Lord of the daybreak, from the evil of what He has created, and from the evil of the darkening (night) as it comes with its darkness, and from the evil of those who practice witchcraft when they blow in the knots, and from the evil of the envier when he envies.\n(Al-Falaq: 1-5)"
          },
          {
            "arabic": "قُلْ أَعُوذُ بِرَبِّ النَّاسِ⦿مَلِكِ النَّاسِ⦿إِلَهِ النَّاسِ⦿مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ⦿الَّذِي يُوَسْوِسُ فِي صُدُورِالنَّاسِ⦿مِنَ الْجِنَّةِ وَ النَّاسِ⦿",
            "audio": "annas",
            "notes": "Recite 3x",
            "source": "Abu Dawud (5082), an-Nasa-i VIII/250 and at-Tirmidzi (3575), Ahmad V/312, Shahiih at-Tirmidzi (2829), Tuhfatul Ahwadzi (3646), Shahiih at-Targhiib wat Tarhiib 1/411 (649)",
            "translation": "Say: I seek refuge with (Allah) the Lord of mankind, the King of mankind, the God of mankind, from the evil of the whisperer who withdraws, who whispers in the hearts of mankind, of jinns and men.\n(An-Naas: 1-6)"
          },
          {
            "arabic": "أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ، وَالْحَمْدُ لِلَّهِ، لاَ إِلَـهَ إِلاَّ اللهُ وَحْدَهُ لاَ شَرِيْكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرُ. رَبِّ أَسْأَلُكَ خَيْرَ مَا فِيْ هَذَا الْيَوْمِ وَخَيْرَ مَا بَعْدَهُ، وَأَعُوْذُ بِكَ مِنْ شَرِّ مَا فِيْ هَذَا الْيَوْمِ وَشَرِّ مَا بَعْدَهُ، رَبِّ أَعُوْذُ بِكَ مِنَ الْكَسَلِ وَسُوْءِ الْكِبَرِ، رَبِّ أَعُوْذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ",
            "audio": "",
            "notes": "Recite Once",
            "source": "Muslim IV/2088 (2723), Abu Dawud (5071), at-Tirmidzi (3390)",
            "translation": "We have entered a new day and with it all dominion is Allah's. Praise is to Allah. None has the right to be worshipped but Allah alone, Who has no partner. To Allah belongs the dominion, and to Him is the praise and He is Able to do all things. My Lord, I ask You for the goodness of this day and of the days that come after it, and I seek refuge in You from the evil of this day and of the days that come after it. My Lord, I seek refuge in You from laziness and helpless old age. My Lord, I seek refuge in You from the punishment of Hell-fire , and from the punishment of the grave. "
          },
          {
            "arabic": "اَللَّهُمَّ بِكَ أَصْبَحْنَا، وَبِكَ أَمْسَيْنَا، وَبِكَ نَحْيَا، وَبِكَ نَمُوْتُ وَإِلَيْكَ النُّشُوْرُ",
            "audio": "",
            "notes": "Recite Once",
            "source": "Al-Bukhari in al-Adabul Mufrad, this part was taken from al-Bukhari, at-Tirmidzi (3391), Abu Dawud (5068), Ahmad 11/354, Ibnu Majah (3868), Shahiih al-Adabil Mufrad (911)",
            "translation": "O Allah , by You we enter the morning and by You we enter the evening, by You we live and and by You we die, and to You is the Final Return."
          },
          {
            "arabic": "اَللَّهُمَّ أَنْتَ رَبِّيْ لاَ إِلَـهَ إِلاَّ أَنْتَ، خَلَقْتَنِيْ وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوْذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوْءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوْءُ بِذَنْبِيْ فَاغْفِرْ لِيْ فَإِنَّهُ لاَ يَغْفِرُ الذُّنُوْبَ إِلاَّ أَنْتَ.",
            "audio": "",
            "notes": "Recite Once",
            "source": "Al-Bukhari (6306 & 6323), Ahmad IV/122-125, an-Nasa-i VIII/279-280",
            "translation": "O Allah, You are my Lord, there is none worthy of worship but You. You created me and I am your slave. I keep Your covenant, and my pledge to You so far as I am able. I seek refuge in You from the evil of what I have done. I admit to Your blessings upon me, and I admit to my misdeeds. Forgive me, for there is none who may forgive sins but You."
          },
          {
            "arabic": "اللَّهُمَّ عَافِنِي فِي بَدَنِي، اللَّهُمَّ عَافِنِي فِي سَمْعِي، اللَّهُمَّ عَافِنِي فِي بَصْرِي، لاَ إِلَهَ إِلاَّ أَنْتَ، اللَّهُمَّ إِنِّي أَعُوْذُ بِكَ مِنَ الْكُفْرِ، وَالْفَقْرِ، وأَعُوْذُ بِكَ مِنْ عَذَابِ القَبْرِ، لاَ إِلَهَ إِلاَّ أَنْتَ",
            "audio": "",
            "notes": "Recite 3x",
            "source": "Al-Bukhari in Shahiih al-Adabil Mufrad (539), Abu Dawud (5090), Ahmad V/42",
            "translation": "O Allah, make me healthy in my body. O Allah, preserve for me my hearing. O Allah, preserve for me my sight. There is none worthy of worship but You .\nO Allah , I seek refuge in You from disbelief and poverty and I seek refuge in You from the punishment of the grave . There is none worthy of worship but You."
          },
          {
            "arabic": "اَللَّهُمَّ إِنِّيْ أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي الدُّنْيَا وَاْلآخِرَةِ، اَللَّهُمَّ إِنِّيْ أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِيْنِيْ وَدُنْيَايَ وَأَهْلِيْ وَمَالِيْ اللَّهُمَّ اسْتُرْ عَوْرَاتِى وَآمِنْ رَوْعَاتِى. اَللَّهُمَّ احْفَظْنِيْ مِنْ بَيْنِ يَدَيَّ، وَمِنْ خَلْفِيْ، وَعَنْ يَمِيْنِيْ وَعَنْ شِمَالِيْ، وَمِنْ فَوْقِيْ، وَأَعُوْذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِيْ",
            "audio": "",
            "notes": "Recite Once",
            "source": "Al-Bukhari in al-Adabul Mufrad, Abu Dawud (5074), Ibnu Majah (3871), al-Hakim 1/517-518, Shahiih al-Adabul Mufrad (912)",
            "translation": "O Allah, I seek Your forgiveness and Your protection in this world and the next. O Allah, I seek Your forgiveness and Your protection in my religion, in my worldly affairs, in my family and in my wealth. O Allah, conceal my secrets and preserve me from anguish . O Allah , guard me from what is in front of me and behind me , from my left , and from my right , and from above me . I seek refuge in Your Greatness from being struck down from beneath me."
          },
          {
            "arabic": "اَللَّهُمَّ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ فَاطِرَ السَّمَاوَاتِ وَاْلأَرْضِ، رَبَّ كُلِّ شَيْءٍ وَمَلِيْكَهُ، أَشْهَدُ أَنْ لاَ إِلَـهَ إِلاَّ أَنْتَ، أَعُوْذُ بِكَ مِنْ شَرِّ نَفْسِيْ، وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِيْ سُوْءًا أَوْ أَجُرُّهُ إِلَى مُسْلِمٍ",
            "audio": "",
            "notes": "Recite Once",
            "source": "At-Tirmidzi (3392) and Abu Dawud (5067), see Shahiih at-Tirmidzi (2071), Shahiih al-Adabil Mufrad (914)",
            "translation": "O Allah, Knower of the unseen and the evident , Maker of the heavens and the earth , Lord of everything and its Possessor , I bear witness that there is none worthy of worship but You . I seek refuge in You from the evil of my soul and from the evil of Satan and his helpers . (I seek refuge in You) from bringing evil upon my soul and from harming any Muslim."
          },
          {
            "arabic": "بِسْمِ اللَّهِ الَّذِى لاَ يَضُرُّ مَعَ اسْمِهِ شَىْءٌ فِى الأَرْضِ وَلاَ فِى السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ",
            "audio": "",
            "notes": "Recite 3x",
            "source": "At-Tirmidzi (3388), Abu Dawud (5088), Ahmad (446 and 476), Tahqiq Ahmad Syakir and Ibnu Majah (3869), see Shahiih Ibni Majah (3120), al-Hakim 1/513, Shahiih al-Adabil Mufrad (513)",
            "translation": "In the Name of Allah, Who with His Name nothing can cause harm in the earth nor in the heavens, and He is the All-Hearing, the All-Knowing."
          },
          {
            "arabic": "رَضِيْتُ بِاللهِ رَبًّا، وَبِاْلإِسْلاَمِ دِيْنًا، وَبِمُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَبِيًّا",
            "audio": "",
            "notes": "Recite 3x",
            "source": "Ahmad IV/337, Abu Dawud (5072), at-Tirmidzi (3389), Ibnu Majah (3870), an-Nasa-i in 'Amalul Yaum wal Lailah (4) and Ibnus Sunni (68), Shahiih at-Targhiib wat Tarhiib 1/415 (657), declared shahih by Imam al-Hakim in al-Mustadrak 1/518 and approved by Imam adz-Dzahabi",
            "translation": "I am pleased with Allah as my Lord, with Islam as my religion and with Muhammad (peace and blessings of Allah be upon him) as my Prophet."
          },
          {
            "arabic": "يَا حَيُّ يَا قَيُّوْمُ بِرَحْمَتِكَ أَسْتَغِيْثُ، وَأَصْلِحْ لِيْ شَأْنِيْ كُلَّهُ وَلاَ تَكِلْنِيْ إِلَى نَفْسِيْ طَرْفَةَ عَيْنٍ",
            "audio": "",
            "notes": "Recite Once",
            "source": "An-Nasa-i (575), al-Bazzar (3107) and al-Hakim 1/545 and Ibnus Sunni (48), see Shahiih at-Targhiib wat Tarhiib I/417 (661)",
            "translation": "O Ever Living One, O Eternal One, by Your mercy I call on You to set right all my affairs. Do not place me in charge of my soul even for the blinking of an eye (a moment)"
          },
          {
            "arabic": "أَصْبَحْنَا عَلَى فِطْرَةِ اْلإِسْلاَمِ وَعَلَى كَلِمَةِ اْلإِخْلاَصِ، وَعَلَى دِيْنِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِيْنَا إِبْرَاهِيْمَ، حَنِيْفًا مُسْلِمًا وَمَا كَانَ مِنَ الْمُشْرِكِيْنَ",
            "audio": "",
            "notes": "Recite Once",
            "source": "Ahmad III/406, 407, V/123, ad-Darimi II/292 and Ibnus Sunni in Amalul Yaum wal Lailah (34), Misykaatul Mashaabiih (2415), Shahiihal-Jaami'ish Shaghiir (4674)",
            "translation": "We have entered an new day upon the natural religion of Islam, the word of sincere devotion, the religion of our Prophet Muhammad (peace and blessings of Allah be upon him), and the faith of our father Ibrahim. He was upright (in worshipping Allah), and a Muslim. He was not of those who worship others besides Allah."
          },
          {
            "arabic": "سُبْحَانَ اللهِ وَبِحَمْدِهِ: عَدَدَ خَلْقِهِ، وَرِضَا نَفْسِهِ، وَزِنَةَ عَرْشِهِ وَمِدَادَ كَلِمَاتِهِ",
            "audio": "",
            "notes": "Recite 3x",
            "source": "Muslim (2726).",
            "translation": "Glory is to Allah and praise is to Him, by the multitude of His creation, by His Pleasure, by the weight of His Throne, and by the extent of His Words."
          },
          {
            "arabic": "اَللَّهُمَّ إِنِّيْ أَسْأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا طَيِّبًا، وَعَمَلاً مُتَقَبَّلاً",
            "audio": "",
            "notes": "Recite Once",
            "source": "Ibn As-Sunni, (54), Ibn Majah (925). Its chain of transmission is good (Hasan), Ibn Al-Qayyim 2/375.",
            "translation": "O Allah, I ask You for knowledge that is of benefit, a good provision, and deeds that will be accepted."
          },
          {
            "arabic": "لاَ إِلَـهَ إِلاَّ اللهُ وَحْدَهُ لاَ شَرِيْكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرُ",
            "audio": "",
            "notes": "Recite once or 10x or 100x",
            "source": "Abu Dawud (5077), Ibnu Majah (3867), Shahiih Jaami'ish Shaghiir (6418), Misykaatul Mashaabiih (2395), Shahiih at-Targhiib 1/414 (656)",
            "translation": "None has the right to be worshipped but Allah alone, Who has no partner. His is the dominion and His is the praise and He is Able to do all things."
          },
          {
            "arabic": "سُبْحَانَ اللهِ وَبِحَمْدِهِ",
            "audio": "",
            "notes": "Recite 100x",
            "source": "Muslim (2691) and (2692), Syarh Muslim XVII/17-18, Shahiih at-Targhiib wat Tarhiib 1/413 (653).",
            "translation": "Glory is to Allah and praise is to Him"
          },
          {
            "arabic": "أَسْتَغْفِرُ اللهَ وَأَتُوْبُ إِلَيْهِ",
            "audio": "",
            "notes": "Recite 100x",
            "source": "Al-Bukhari/ Fathul Baari XI/101 and Muslim (2702)",
            "translation": "I seek the forgiveness of Allah and repent to Him."
          }
        ],
        "id": 1,
        "language": "en",
        "title": "Morning Dzikir"
      },
      {
        "bookId": 0,
        "data": [
          {
            "arabic": "أَسْتَغْفِرُ اللهَ",
            "audio": "",
            "notes": "Recite 3x",
            "source": "Muslim no. 591.",
            "translation": "I seek the forgiveness of Allah"
          },
          {
            "arabic": "اَللَّهُمَّ أَنْتَ السَّلاَمُ، وَمِنْكَ السَّلاَمُ، تَبَارَكْتَ يَا ذَا الْجَلاَلِ وَاْلإِكْرَامَِ",
            "audio": "",
            "notes": "Recite Once",
            "source": "Muslim no. 591.",
            "translation": "O Allah, You are Peace and from You comes peace . Blessed are You , O Owner of majesty and honor."
          },
          {
            "arabic": "لاَ إِلَـهَ إِلاَّ اللهُ وَحْدَهُ لاَ شَرِيْكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرُ، اَللَّهُمَّ لاَ مَانِعَ لِمَا أَعْطَيْتَ، وَلاَ مُعْطِيَ لِمَا مَنَعْتَ، وَلاَ يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ",
            "audio": "",
            "notes": "Recite Once",
            "source": "HR. Bukhari no. 844 dan Muslim no. 593.",
            "translation": "None has the right to be worshipped but Allah alone, He has no partner, His is the dominion and His is the praise, and He is Able to do all things. O Allah, there is none who can withhold what You give, and none may give what You have withheld; and the might of the mighty person cannot benefit him against You."
          },
          {
            "arabic": "لاَ إِلَـهَ إِلاَّ اللهُ وَحْدَهُ لاَ شَرِيْكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرُ. لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللهِ، لاَ إِلَـهَ إِلاَّ اللهُ، وَلاَ نَعْبُدُ إِلاَّ إِيَّاهُ، لَهُ النِّعْمَةُ وَلَهُ الْفَضْلُ وَلَهُ الثَّنَاءُ الْحَسَنُ، لاَ إِلَـهَ إِلاَّ اللهُ مُخْلِصِيْنَ لَهُ الدِّيْنَ وَلَوْ كَرِهَ الْكَافِرُوْنَ",
            "audio": "",
            "notes": "Recite Once",
            "source": "Muslim no. 594.",
            "translation": "None has the right to be worshipped but Allah alone, He has no partner, His is the dominion and His is the praise and He is Able to do all things. There is no power and no might except by Allah . None has the right to be worshipped but Allah, and we do not worship any other besides Him . His is grace , and His is bounty and to Him belongs the most excellent praise. None has the right to be worshipped but Allah . (We are) sincere in making our religious devotion to Him, even though the disbelievers may dislike it."
          },
          {
            "arabic": "سُبْحَانَ اللهِ",
            "audio": "",
            "notes": "Read 33x",
            "source": "Muslim no. 597.",
            "translation": "Glory is to Allah"
          },
          {
            "arabic": "اَلْحَمْدُ لِلَّهِ",
            "audio": "",
            "notes": "Read 33x",
            "source": "Muslim no. 597.",
            "translation": "All Praise is to Allah"
          },
          {
            "arabic": "اَللهُ أَكْبَرُ",
            "audio": "",
            "notes": "Read 33x",
            "source": "Muslim no. 597.",
            "translation": "Allah is the Most Great"
          },
          {
            "arabic": "لاَ إِلَـهَ إِلاَّ اللهُ وَحْدَهُ لاَ شَرِيْكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرُ",
            "audio": "",
            "notes": "Recite Once",
            "source": "Muslim no. 597.",
            "translation": "None has the right to be worshipped but Allah alone, Who has no partner. His is the dominion and His is the praise . He brings life and He causes death , and He is Able to do all things."
          },
          {
            "arabic": "اللَّهُ لاَ إِلَهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلاَّ بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلَا يَئُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ",
            "audio": "",
            "notes": "Recite Once",
            "source": "An-Nasai in Al Kubro 9: 44. This hadith was graded as authentic by Ibnu Hibban as well as Ibn Hajar in Bulughul Maram.",
            "translation": "There is none worthy of worship but He, the Ever Living, the One Who sustains and projects all that exist. Neither slumber nor sleep overtakes Him. To Him belongs whatever is in the heavens and whatever is on the earth. Who is he that can intercede with Him except with His Permission? He knows what happens to them in this world, and what will happen to them in the Hereafter. And they will never encompass anything of His Knowledge except that which He wills. His Throne extends over the heavens and the earth, and He feels no fatigue in guarding and preserving them. And He is the Most High, the Most Great.\n(Al-Baqarah: 255)"
          },
          {
            "arabic": "قُلْ هُوَ اللَّهُ أَحَدٌ⦿اللَّهُ الصَّمَدُ⦿لَمْ يَلِدْ وَلَمْ يُولَدْ⦿وَلَمْ يَكُن لَّهُ كُفُوًا أَحَدٌ⦿",
            "audio": "",
            "notes": "Recite 3x",
            "source": "Abu Daud no. 1523 and An-Nasai no. 1337.",
            "translation": "Say: He is Allah (the) One. The Self-Sufficient Master, Whom all creatures need, He begets not nor was He begotten, and there is none equal to Him.\n(Al-Ikhlas: 1-4)"
          },
          {
            "arabic": "قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ⦿مِن شَرِّ مَا خَلَقَ⦿وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ⦿وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ⦿وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ⦿",
            "audio": "",
            "notes": "Recite 3x",
            "source": "Abu Daud no. 1523 and An-Nasai no. 1337.",
            "translation": "Say: I seek refuge with (Allah) the Lord of the daybreak, from the evil of what He has created, and from the evil of the darkening (night) as it comes with its darkness, and from the evil of those who practice witchcraft when they blow in the knots, and from the evil of the envier when he envies.\n(Al-Falaq: 1-5)"
          },
          {
            "arabic": "قُلْ أَعُوذُ بِرَبِّ النَّاسِ⦿مَلِكِ النَّاسِ⦿إِلَهِ النَّاسِ⦿مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ⦿الَّذِي يُوَسْوِسُ فِي صُدُورِالنَّاسِ⦿مِنَ الْجِنَّةِ وَ النَّاسِ⦿",
            "audio": "",
            "notes": "Recite 3x",
            "source": "Abu Daud no. 1523 and An-Nasai no. 1337.",
            "translation": "Say: I seek refuge with (Allah) the Lord of mankind, the King of mankind, the God of mankind, from the evil of the whisperer who withdraws, who whispers in the hearts of mankind, of jinns and men.\n(An-Naas: 1-6)"
          },
          {
            "arabic": "اَللَّهُمَّ إِنِّيْ أَسْأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا طَيِّبًا، وَعَمَلاً مُتَقَبَّلاً",
            "audio": "",
            "notes": "Recite once after fajr prayer",
            "source": "Ibnu Majah no. 925 and Ahmad 6: 305, 322.",
            "translation": "O Allah, I ask You for knowledge that is of benefit , a good provision , and deeds that will be accepted."
          }
        ],
        "id": 3,
        "language": "en",
        "title": "Dzikir After Shalah"
      },
      {
        "bookId": 0,
        "data": [
          {
            "arabic": "قُلْ هُوَ اللَّهُ أَحَدٌ⦿اللَّهُ الصَّمَدُ⦿لَمْ يَلِدْ وَلَمْ يُولَدْ⦿وَلَمْ يَكُن لَّهُ كُفُوًا أَحَدٌ⦿",
            "audio": "alikhlas2",
            "notes": "Recite 3x",
            "source": "Bukhari no. 5017 and Muslim no. 2192.",
            "translation": "Say: He is Allah (the) One. The Self-Sufficient Master, Whom all creatures need, He begets not nor was He begotten, and there is none equal to Him.\n(Al-Ikhlas: 1-4)"
          },
          {
            "arabic": "قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ⦿مِن شَرِّ مَا خَلَقَ⦿وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ⦿وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ⦿وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ⦿",
            "audio": "alfalaq",
            "notes": "Recite 3x",
            "source": "Bukhari no. 5017 and Muslim no. 2192.",
            "translation": "Say: I seek refuge with (Allah) the Lord of the daybreak, from the evil of what He has created, and from the evil of the darkening (night) as it comes with its darkness, and from the evil of those who practice witchcraft when they blow in the knots, and from the evil of the envier when he envies.\n(Al-Falaq: 1-5)"
          },
          {
            "arabic": "قُلْ أَعُوذُ بِرَبِّ النَّاسِ⦿مَلِكِ النَّاسِ⦿إِلَهِ النَّاسِ⦿مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ⦿الَّذِي يُوَسْوِسُ فِي صُدُورِالنَّاسِ⦿مِنَ الْجِنَّةِ وَ النَّاسِ⦿",
            "audio": "annas",
            "notes": "Recite 3x",
            "source": "Bukhari no. 5017 and Muslim no. 2192.",
            "translation": "Say: I seek refuge with (Allah) the Lord of mankind, the King of mankind, the God of mankind, from the evil of the whisperer who withdraws, who whispers in the hearts of mankind, of jinns and men.\n(An-Naas: 1-6)"
          },
          {
            "arabic": "اللَّهُ لاَ إِلَهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلاَّ بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلَا يَئُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ",
            "audio": "ayatulkursi",
            "notes": "Recite Once",
            "source": "Bukhari no. 2311",
            "translation": "There is none worthy of worship but He, the Ever Living, the One Who sustains and projects all that exist. Neither slumber nor sleep overtakes Him. To Him belongs whatever is in the heavens and whatever is on the earth. Who is he that can intercede with Him except with His Permission? He knows what happens to them in this world, and what will happen to them in the Hereafter. And they will never encompass anything of His Knowledge except that which He wills. His Throne extends over the heavens and the earth, and He feels no fatigue in guarding and preserving them. And He is the Most High, the Most Great.\n(Al-Baqarah: 255)"
          },
          {
            "arabic": "آَمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ كُلٌّ آَمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ وَقَالُوا سَمِعْنَا وَأَطَعْنَا غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ * لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلاَّ وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ",
            "audio": "",
            "notes": "Recite Once",
            "source": "Bukhari no. 4008 and Muslim no. 807.",
            "translation": "The Messenger believes in what has been send down to him from his Lord, and so do the believers. Each one believes in Allah, His Angels, His Books, and His Messengers. They say: \"We make no distinction between any of His Messengers,\" and they say: \"We hear, and we obey. (We seek) Your Forgiveness, our Lord, and to You is the return.\" Allah burdens not a person beyond what he can bear. He gets reward for that (good) which he has earned, and he is punished for that (evil) which he has earned. Our Lord! Punish us not if we forget or fall into error. Our Lord! Lay not on us a burden like that which You did lay on those before us. Our Lord! Put not on us a burden greater than we have strength to bear. Pardon us and grant us forgiveness. Have mercy on us. You are our Protector, and help us against the disbelieving people."
          },
          {
            "arabic": "بِاسْمِكَ رَبِّيْ وَضَعْتُ جَنْبِيْ، وَبِكَ أَرْفَعُهُ، فَإِنْ أَمْسَكْتَ نَفْسِيْ فَارْحَمْهَا، وَإِنْ أَرْسَلْتَهَا فَاحْفَظْهَا بِمَا تَحْفَظُ بِهِ عِبَادَكَ الصَّالِحِيْنَ",
            "audio": "",
            "notes": "Recite Once",
            "source": "Al-Bukhari no. 6320 and Muslim no. 2714.",
            "translation": "With Your Name my Lord, I lay myself down ; and with Your Name I rise . And if my soul You take , have mercy on it , and if You send it back then protect it as You protect Your righteous slaves."
          },
          {
            "arabic": "اَللَّهُمَّ إِنَّكَ خَلَقْتَ نَفْسِيْ وَأَنْتَ تَوَفَّاهَا، لَكَ مَمَاتُهَا وَمَحْيَاهَا، إِنْ أَحْيَيْتَهَا فَاحْفَظْهَا، وَإِنْ أَمَتَّهَا فَاغْفِرْ لَهَا. اَللَّهُمَّ إِنِّيْ أَسْأَلُكَ الْعَافِيَةَ",
            "audio": "",
            "notes": "Recite Once",
            "source": "Muslim no. 2712.",
            "translation": "O Allah, You have created my soul and You take it back. Unto You is its death and its life . If You give it life then protect it , and if You cause it to die then forgive it. O Allah, I ask You for strength."
          },
          {
            "arabic": "اَللَّهُمَّ قِنِيْ عَذَابَكَ يَوْمَ تَبْعَثُ عِبَادَكَ",
            "audio": "",
            "notes": "Recite Once",
            "source": "Tirmidzi no. 3398 and Abu Daud no. 5045.",
            "translation": "O Allah, save me from Your punishment on the Day that You resurrect Your slaves."
          },
          {
            "arabic": "بِاسْمِكَ اللَّهُمَّ أَمُوْتُ وَأَحْيَا",
            "audio": "",
            "notes": "Recite Once",
            "source": "Bukhari no. 6312 and Muslim no. 2711.",
            "translation": "In Your Name , O Allah , I die and I live."
          },
          {
            "arabic": "سُبْحَانَ اللهِ",
            "audio": "",
            "notes": "Read 33x",
            "source": "Bukhari no. 3705 and Muslim no. 2727.",
            "translation": "Glory Is To Allah"
          },
          {
            "arabic": "الْحَمْدُ لِلَّهِ",
            "audio": "",
            "notes": "Read 33x",
            "source": "Bukhari no. 3705 and Muslim no. 2727.",
            "translation": "All Praise Is To Allah"
          },
          {
            "arabic": "اللهُ أَكْبَرُ",
            "audio": "",
            "notes": "Recite 34x",
            "source": "Bukhari no. 3705 and Muslim no. 2727.",
            "translation": "Allah Is The Most Great"
          },
          {
            "arabic": "اَللَّهُمَّ رَبَّ السَّمَاوَاتِ السَّبْعِ وَرَبَّ الْعَرْشِ الْعَظِيْمِ، رَبَّنَا وَرَبَّ كُلِّ شَيْءٍ، فَالِقَ الْحَبِّ وَالنَّوَى، وَمُنْزِلَ التَّوْرَاةِ وَاْلإِنْجِيْلِ وَالْفُرْقَانِ، أَعُوْذُ بِكَ مِنْ شَرِّ كُلِّ شَيْءٍ أَنْتَ آخِذٌ بِنَاصِيَتِهِ. اَللَّهُمَّ أَنْتَ اْلأَوَّلُ فَلَيْسَ قَبْلَكَ شَيْءٌ، وَأَنْتَ اْلآخِرُ فَلَيْسَ بَعْدَكَ شَيْءٌ، وَأَنْتَ الظَّاهِرُ فَلَيْسَ فَوْقَكَ شَيْءٌ، وَأَنْتَ الْبَاطِنُ فَلَيْسَ دُوْنَكَ شَيْءٌ، اِقْضِ عَنَّا الدَّيْنَ وَأَغْنِنَا مِنَ الْفَقْرِ",
            "audio": "",
            "notes": "Recite Once",
            "source": "Muslim no. 2713.",
            "translation": "O Allah! Lord of the seven heavens and Lord of the Magnificent Throne . Our Lord and the Lord of everything . Splitter of the grain and the date-stone , Revealer of the Torah and the Injeel and the Furqdn (the Qur'an), I seek refuge in You from the evil of everything that You shall seize by the forelock. O Allah You are the First and nothing has come before you, and You are the Last, and nothing may come after You. You are the Most High, nothing is above You and You are the Most Near and nothing is nearer than You. Remove our debts from us and enrich us against poverty. "
          },
          {
            "arabic": "الْحَمْدُ لِلَّهِ الَّذِيْ أَطْعَمَنَا وَسَقَانَا وَكَفَانَا وَآوَانَا، فَكَمْ مِمَّنْ لاَ كَافِيَ لَهُ وَلاَ مُؤْوِيَ",
            "audio": "",
            "notes": "Recite Once",
            "source": "Muslim no. 2715.",
            "translation": "Praise is to Allah Who has provided us with food and with drink , sufficed us and gave us an abode for how many are there with no provision and no home."
          },
          {
            "arabic": "اَللَّهُمَّ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ فَاطِرَ السَّمَاوَاتِ وَاْلأَرْضِ، رَبَّ كُلِّ شَيْءٍ وَمَلِيْكَهُ، أَشْهَدُ أَنْ لاَ إِلَـهَ إِلاَّ أَنْتَ، أَعُوْذُ بِكَ مِنْ شَرِّ نَفْسِيْ، وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِيْ سُوْءًا أَوْ أَجُرُّهُ إِلَى مُسْلِمٍ",
            "audio": "",
            "notes": "Recite Once",
            "source": "Tirmidzi no. 3392 and Abu Daud no. 5067.",
            "translation": "O Allah, Knower of the unseen and the evident , Maker of the heavens and the earth , Lord of everything and its Master, I bear witness that there is none worthy of worship but You . I seek refuge in You from the evil of my soul and from the evil of Satan and his helpers . (I seek refuge in You) from bringing evil upon my soul and from harming any Muslim."
          },
          {
            "arabic": "اَللَّهُمَّ أَسْلَمْتُ نَفْسِيْ إِلَيْكَ، وَفَوَّضْتُ أَمْرِيْ إِلَيْكَ، وَوَجَّهْتُ وَجْهِيَ إِلَيْكَ، وَأَلْجَأْتُ ظَهْرِيْ إِلَيْكَ، رَغْبَةً وَرَهْبَةً إِلَيْكَ، لاَ مَلْجَأَ وَلاَ مَنْجَا مِنْكَ إِلاَّ إِلَيْكَ، آمَنْتُ بِكِتَابِكَ الَّذِيْ أَنْزَلْتَ وَبِنَبِيِّكَ الَّذِيْ أَرْسَلْتَ",
            "audio": "",
            "notes": "Recite Once",
            "source": "Al-Bukhari no. 6313 and Muslim no. 2710.",
            "translation": "O Allah, I submit myself to You, entrust my affairs to You, turn my face to You, and lay myself down depending upon You , hoping in You and fearing You . There is no refuge , and no escape, except to You. I believe in Your Book (the Qur'an) that You revealed, and the Prophet whom You sent."
          },
          {
            "arabic": "Read Surah Al-Mulk",
            "audio": "",
            "notes": "Recite Once",
            "source": "HR. Tirmidzi no. 3404."
          },
          {
            "arabic": "Read Surah As-Sajdah",
            "audio": "",
            "notes": "Recite Once",
            "source": "HR. Tirmidzi no. 3404."
          }
        ],
        "id": 4,
        "language": "en",
        "title": "Dzikir Before Sleep"
      }
    ],
    "status": "1",
    "title": "Book of Dzikir",
    "type": 0,
    "updated": ""
  },
  {
    "desc": " Everyone needs Dua, be it to protect one from a disaster or praying for something they want. Below are the list of Dua compiled from the Al-Qur’an and Sunnah.",
    "id": 1,
    "language": "en",
    "prayer": [
      {
        "bookId": 1,
        "data": [
          {
            "arabic": "الْحَمْدُ لِلهِ الَّذِي أَحْيَاناَ بَعْـدَ مَا أَمَاتَنَا وَإِلَيْهِ النُّشُوْرِ",
            "audio": "",
            "notes": "",
            "source": "Al-Bukhari in Fathul Bari: 11/113 and Muslim: 4/2083.",
            "translation": "All praise is for Allah who gave us life after having taken it from us and unto Him is the resurrection."
          },
          {
            "arabic": "لاَ إِلَهَ إِلاَّ اللهُ وَحْدَهُ لاَ شَـرِيْكَ لَهُ. لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرٌ. سُبْحَانَ اللهِ وَالْحَمْدُ لِلَّهِ وَلاَ إِلَهَ إِلاَّ اللهُ وَاللهُ أَكْبَرُ، وَلاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللهِ الْعَلِيِّ الْعَظِيْمِ رَبِّ اغْفِرْ ليِ",
            "audio": "",
            "notes": "",
            "source": "Imam Bukhari in Fathul Bari: 3/39",
            "translation": "None has the right to be worshipped except Allah, alone without associate, to Him belongs sovereignty and praise and He is over all things wholly capable. How perfect Allah is, and all praise is for Allah, and none has the right to be worshipped except Allah, Allah is the greatest and there is no power nor might except with Allah, The Most High, The Supreme. O my Lord forgive me."
          },
          {
            "arabic": "الْحَمْدُ لِلَّهِ الَّذِي عَافَانِي فِي جَسَدِيْ وَرَدَّ عَلَيَّ رُوْحِيْ وَأَذِنَ لِيْ بِذِكْرِهِ ",
            "audio": "",
            "notes": "",
            "source": "Tirmidzi: 5/473, see Shahih Tirmidzi: 3/144.",
            "translation": "All praise is for Allah who restored to me my health and returned my soul and has allowed me to remember Him."
          }
        ],
        "id": 1,
        "language": "en",
        "title": "When Waking Up"
      },
      {
        "bookId": 1,
        "data": [
          {
            "arabic": " اَلْحَمْدُ لِلَّهِ الَّذِيْ كَسَانِيْ هَذَا (الثَّوْبَ) وَرَزَقَنِيْهِ مِن ْ غَيْرِ حَوْلٍ مِنِّيْ وَلاَ قُوَّةٍ",
            "audio": "",
            "notes": "",
            "source": "Every Sunan books, except Nasa’i, see; Irwaa’ul ghalil: 4/47",
            "translation": "All Praise is for Allah who has clothed me with this garment and provided it for me, with no power nor might from myself."
          }
        ],
        "id": 2,
        "language": "en",
        "title": "When wearing a garment"
      },
      {
        "bookId": 1,
        "data": [
          {
            "arabic": "اَللَّهُمَّ لَكَ الْحَمْدُ أَنْتَ كَسَوْتَنِيْهِ، أَسْأَلُكَ مِنْ خَيْرِهِ وَخَيْرِ مَا صُنِعَ لَهُ، وَأَعُوْذُ بِكَ مِنْ شَرِّهِ وَشَرِّ مَا صُنِعَ لَهُ",
            "audio": "",
            "notes": "",
            "source": "Abu Dawud, At-Tirmidzi, Al-Baghawi and see Mukhtashar Syamaailit Tirmidzi, by Al-Albani, page: 47.",
            "translation": "YO Allah, for You is all praise, You have clothed me with it (i.e. the garment), I ask You for the good of it and the good for which it was made, and I seek refuge with You from the evil of it and the evil for which it was made."
          }
        ],
        "id": 3,
        "language": "en",
        "title": "When wearing a new garment"
      },
      {
        "bookId": 1,
        "data": [
          {
            "arabic": "تُبْلِي وَيُخْلِفُ اللهُ تَعَالَى",
            "audio": "",
            "notes": "",
            "source": "Abu Daud 4/41 and see also Shahih Abi Dawud, 2/760.",
            "translation": "May you wear it out and Allah replace it (with another)."
          },
          {
            "arabic": "اِلْبِسْ جَدِيْدًا، وَعِشْ حَمِيْدًا، وَمُتْ شَهِيْدًا",
            "audio": "",
            "notes": "",
            "source": "Ibnu Majah: 2/1178, Al-Baghawi: 12/41 also see Shahih Ibnu Majah: 2/275.",
            "translation": "Wear anew, live commendably and die a shaheed."
          }
        ],
        "id": 4,
        "language": "en",
        "title": "To someone wearing a new garment"
      },
      {
        "bookId": 1,
        "data": [
          {
            "arabic": "بِسْمِ اللهِ",
            "audio": "",
            "notes": "",
            "source": "At-Tirmidzi: 2/505 and other Imam. See Irwa’ul Ghalil, 49 and Shahihul Jami’: 3/203.",
            "translation": "In the name of Allah."
          }
        ],
        "id": 5,
        "language": "en",
        "title": "Before Undressing"
      },
      {
        "bookId": 1,
        "data": [
          {
            "arabic": " (بِسْمِ اللهِ) اَللَّهُمَّ إِنِّيْ أَعُوْذُ بِكَ مِنَ الْخُبُثِ وَالْخَبَائِثِ",
            "audio": "",
            "notes": "",
            "source": "Al-Bukhari: 1/45 and Muslim: 1/283. the bismillah in the beginning is according to Said bin Mashur's report. See Fathul Baari: 1/244.",
            "translation": "(In the name of Allah). O Allah, I take refuge with you from all evil and evil-doers."
          }
        ],
        "id": 6,
        "language": "en",
        "title": "Before entering the bathroom"
      },
      {
        "bookId": 1,
        "data": [
          {
            "arabic": "غُفْرَانَكَ",
            "audio": "",
            "notes": "",
            "source": "Abu Dawud, Ibnu Majah and Ahmad. See Irwa’ul Ghalil 1/122.",
            "translation": "I ask You (Allah) for forgiveness"
          }
        ],
        "id": 7,
        "language": "en",
        "title": "After leaving the bathroom"
      },
      {
        "bookId": 1,
        "data": [
          {
            "arabic": " بِسْمِ اللهِ",
            "audio": "",
            "notes": "",
            "source": "Abu Dawud, Ibnu Majah and Ahmad. See Irwa’ul Ghalil 1/122.",
            "translation": "In the name of Allah"
          }
        ],
        "id": 8,
        "language": "en",
        "title": "When starting ablution"
      },
      {
        "bookId": 1,
        "data": [
          {
            "arabic": "أَشْهَدُ أَنْ لاَ إِلَـهَ إِلاَّ اللهُ وَحْدَهُ لاَ شَرِيْكَ لَهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُوْلُهُ",
            "audio": "",
            "notes": "",
            "source": "Muslim: 1/209.",
            "translation": "I bear witness that none has the right to be worshipped except Allah, alone without partner, and I bear witness that Muhammad is His slave and Messenger"
          },
          {
            "arabic": " اَللَّهُمَّ اجْعَلْنِيْ مِنَ التَّوَّابِيْنَ وَاجْعَلْنِيْ مِنَ الْمُتَطَهِّرِيْنَ",
            "audio": "",
            "notes": "",
            "source": "At-Tirmidzi: 1/78, also see Shahih At-Tirmidzi: 1/18.",
            "translation": "O Allah, make me of those who return to You often in repentance and make me of those who remain clean and pure"
          },
          {
            "arabic": "سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ، أَشْهَدُ أَنْ لاَ إِلَـهَ إِلاَّ أَنْتَ، أَسْتَغْفِرُكَ وَأَتُوْبُ إِلَيْكَ",
            "audio": "",
            "notes": "",
            "source": "An-Nasa’i in ‘Amalul Yaumi wal Lailah, page; 173 also see Irwa’ul Ghalil: 1/135 and 2/94.",
            "translation": "How perfect You are O Allah, and I praise You, I bear witness that none has the right to be worshipped except You, I seek Your forgiveness and turn in repentance to You"
          }
        ],
        "id": 9,
        "language": "en",
        "title": "Upon completing the ablution"
      },
      {
        "bookId": 1,
        "data": [
          {
            "arabic": " بِسْمِ اللهِ، تَوَكَّلْتُ عَلَى اللهِ، وَلاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللهِ",
            "audio": "",
            "notes": "",
            "source": "Abu Dawud: 4/325, At-Tirmidzi: 5/490, also see Shahih At-Tirmidzi: 3/151.",
            "translation": "In the name of Allah, I place my trust in Allah, and there is no might nor power except with Allah."
          },
          {
            "arabic": "اَللَّهُمَّ إِنِّيْ أَعُوْذُ بِكَ أَنْ أَضِلَّ، أَوْ أُضَلَّ، أَوْ أَزِلَّ، أَوْ أُزَلَّ، أَوْ أَظْلِمَ، أَوْ أُظْلَمَ، أَوْ أَجْهَلَ، أَوْ يُجْهَلَ عَلَيَّ",
            "audio": "",
            "notes": "",
            "source": "Every Sunan books, also see Shahih At-Tirmidzi: 3/152 and Shahih Ibnu Majah: 2/336.",
            "translation": "O Allah, I take refuge with You lest I should stray or be led astray, or slip or be tripped, or oppress or be oppressed, or behave foolishly or be treated foolishly."
          }
        ],
        "id": 10,
        "language": "en",
        "title": "When leaving the home"
      },
      {
        "bookId": 1,
        "data": [
          {
            "arabic": " بِسْمِ اللهِ وَلَجْنَا، وَبِسْمِ اللهِ خَرَجْنَا، وَعَلَى رَبِّنَا تَوَكَّلْنَا، ثُمَّ لِيُسَلِّمْ عَلَى أَهْلِهِ",
            "audio": "",
            "notes": "",
            "source": "Abu Dawud: 4/325, and Al-‘Allamah Ibnu Baaz said this hadith is graded hasan in Tuhfatul Akhyar, no. 28. in Kitab Shahih: “Whoever enters their home, then make Dzikir to Allah upon entering the home and before eating, the Syaithan will say (to his friends), \"There will be no home or food tonight\" Muslim, no. 2018.",
            "translation": "In the name of Allah we enter and in the name of Allah we leave, and upon our Lord we place our trust"
          }
        ],
        "id": 11,
        "language": "en",
        "title": "Upon entering the home"
      },
      {
        "bookId": 1,
        "data": [
          {
            "arabic": "اَللَّهُمَّ اجْعَلْ فِيْ قَلْبِيْ نُوْرًا، وَفِيْ لِسَانِيْ نُوْرًا، وَفِيْ سَمْعِيْ نُوْرًا، وَفِيْ بَصَرِيْ نُوْرًا، وَمِنْ فَوْقِيْ نُوْرًا، وَمِنْ تَحْتِيْ نُوْرًا، وَعَنْ يَمِيْنِيْ نُوْرًا، وَعَنْ شِمَالِيْ نُوْرًا، وَمِنْ أَمَامِيْ نُوْرًا، وَمِنْ خَلْفِيْ نُوْرًا، وَاجْعَلْ فِيْ نَفْسِيْ نُوْرًا، وَأَعْظِمْ لِيْ نُوْرًا، وَعَظِّمْ لِيْ نُوْرًا، وَاجْعَلْ لِيْ نُوْرًا، وَاجْعَلْنِيْ نُوْرًا، اَللَّهُمَّ أَعْطِنِيْ نُوْرًا، وَاجْعَلْ فِيْ عَصَبِيْ نُوْرًا، وَفِيْ لَحْمِيْ نُوْرًا، وَفِيْ دَمِيْ نُوْرًا، وَفِيْ شَعْرِيْ نُوْرًا، وَفِيْ بَشَرِيْ نُوْرًا",
            "audio": "",
            "notes": "",
            "source": "Bukhari: 11/116 no. 6316, and Muslim: 1/526, 529, 530, no. 763.",
            "translation": "O Allah, place light in my heart, and on my tongue light, and in my ears light and in my sight light, and above me light, and below me light, and to my right light, and to my left light, and before me light and behind me light. Place in my soul light. Magnify for me light, and amplify for me light. Make for me light and make me a light. O Allah, grant me light, and place light in my nerves, and in my body light and in my blood light and in my hair light and in my skin light."
          },
          {
            "arabic": "اَللَّهُمَّ اجْعَلْ لِيْ نُوْرًا فِيْ قَبْرِيْ … ونُوْرًا فِيْ عِظَامِيْ",
            "audio": "",
            "notes": "",
            "source": "At-Tirmidzi no.3419, 5/483.",
            "translation": "O Allah, make for me a light in my grave... and a light in my bones."
          },
          {
            "arabic": "وَزِدْنِيْ نُوْرًا، وَزِدْنِيْ نُوْرًا، وَزِدْنِيْ نُوْرًا",
            "audio": "",
            "notes": "",
            "source": "Bukhari in Al-Adab Al-Mufrad, no. 695, pg.258. Al-Albani graded this as Shahih, in Shahih Al-Adab Al-Mufrad, no. 536.",
            "translation": "Increase me in light, increase me in light, increase me in light "
          },
          {
            "arabic": "وَهَبْ لِيْ نُوْرًا عَلَى نُوْرٍ",
            "audio": "",
            "notes": "",
            "source": "See Fathul Bari: 11/118.",
            "translation": "Grant me light upon light."
          }
        ],
        "id": 12,
        "language": "en",
        "title": "When going to the Masjid"
      },
      {
        "bookId": 1,
        "data": [
          {
            "arabic": "أَعُوْذُ بِاللهِ الْعَظِيْمِ، وَبِوَجْهِهِ الْكَرِيْمِ، وَسُلْطَانِهِ الْقَدِيْمِ، مِنَ الشَّيْطَانِ الرَّجِيْمِ",
            "audio": "",
            "notes": "",
            "source": "Abu Dawud, see Shahih Al-Jami’ no.4591",
            "translation": "I take refuge with Allah, The Supreme and with His Noble Face, and His eternal authority from the accursed devil."
          },
          {
            "arabic": "بِسْمِ اللهِ، وَالصَّلاَةُ وَالسَّلاَمُ عَلَى رَسُوْلِ اللهِ اَللَّهُمَّ افْتَحْ لِيْ أَبْوَابَ رَحْمَتِكَ",
            "audio": "",
            "notes": "",
            "source": "Ibnu As-Sunni no.88, Al-Albani graded this as “hasan”, Abu Dawud, see Shahih Al-Jami’ 1/528.",
            "translation": "In the name of Allah, and prayers and peace be upon the Messenger of Allah."
          },
          {
            "arabic": "اَللَّهُمَّ افْتَحْ لِيْ أَبْوَابَ رَحْمَتِكَ",
            "audio": "",
            "notes": "",
            "source": "Muslim: 1/494.",
            "translation": "O Allah, open the gates of Your mercy for me."
          }
        ],
        "id": 13,
        "language": "en",
        "title": "Upon entering the masjid"
      },
      {
        "bookId": 1,
        "data": [
          {
            "arabic": "بِسْمِ اللهِ وَالصَّلاَةُ وَالسَّلاَمُ عَلَى رَسُوْلِ اللهِ، اَللَّهُمَّ إِنِّيْ أَسْأَلُكَ مِنْ فَضْلِكَ، اَللَّهُمَّ اعْصِمْنِيْ مِنَ الشَّيْطَانِ الرَّجِيْمِ",
            "audio": "",
            "notes": "",
            "source": "Muslim: 713",
            "translation": "In the name of Allah, and prayers and peace be upon the Messenger of Allah. O Allah, I ask You from Your favour. O Allah, guard me from the accursed devil."
          }
        ],
        "id": 14,
        "language": "en",
        "title": "Upon leaving the masjid"
      },
      {
        "bookId": 1,
        "data": [
          {
            "arabic": "لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللهِ",
            "audio": "",
            "notes": "[One repeats just as the mu-athin (one who calls to prayer) says, except when he says : ‘come to prayer, come to success’. Instead, one should say : ’Laa haula wala quwwata Illa billah']",
            "source": "Bukhari: 1/152, Muslim: 1/288.",
            "translation": "There is no might nor power except with Allah."
          },
          {
            "arabic": "وَأَنَا أَشْهَدُ أَنْ لاَ إِلَـهَ إِلاَّ اللهُ وَحْدَهُ لاَ شَرِيْكَ لَهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُوْلُهُ، رَضِيْتُ بِاللهِ رَبًّا، وَبِمُحَمَّدٍ رَسُوْلاً، وَبِاْلإِسْلاَمِ دِيْنًا",
            "audio": "",
            "notes": "Recite after the muadzin recites the Syahadah",
            "source": "Bukhari: 1/152 and Muslim: 1/288. Ibnu Khuzaimah: 1/220.",
            "translation": "And I too bear witness that none has the right to be worshipped except Allah, alone, without partner, and that Muhammad is His salve and Messenger. I am pleased with Allah as a Lord, and Muhammad as a Messenger and Islam as a religion."
          }
        ],
        "id": 15,
        "language": "en",
        "title": "During the adzan"
      },
      {
        "bookId": 1,
        "data": [
          {
            "arabic": "اَللَّهُمَّ رَبَّ هَذِهِ الدَّعْوَةِ التَّامَّةِ، وَالصَّلاَةِ الْقَائِمَةِ، آتِ مُحَمَّدًا الْوَسِيْلَةَ وَالْفَضِيْلَةَ، وَابْعَثْهُ مَقَامًا مَحْمُوْدًا الَّذِيْ وَعَدْتَهُ",
            "audio": "",
            "notes": "",
            "source": "Bukhari: 1/152",
            "translation": "O Allah, Owner of this perfect call and Owner of this prayer to be performed, bestow upon Muhammad al-waseelah and al-fadeelah and send him upon a praised platform which You have promised him."
          },
          {
            "arabic": "",
            "audio": "",
            "notes": "[One should also supplicate for himself during the time between the athan and the iqamah as supplication at such time is not rejected]",
            "source": "At-Tirmidzi, Abu Dawud and Ahmad. See Irwa’ul Ghalil: 1/262.",
            "translation": ""
          }
        ],
        "id": 16,
        "language": "en",
        "title": "After the adzan"
      },
      {
        "bookId": 1,
        "data": [
          {
            "arabic": "اَللَّهُمَّ بَاعِدْ بَيْنِيْ وَبَيْنَ خَطَايَايَ كَمَا بَاعَدْتَ بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ، اَللَّهُمَّ نَقِّنِيْ مِنْ خَطَايَايَ، كَمَا يُنَقَّى الثَّوْبُ اْلأَبْيَضُ مِنَ الدَّنَسِ، اَللَّهُمَّ اغْسِلْنِيْ مِنْ خَطَايَايَ بِالثَّلْجِ وَالْمَاءِ وَالْبَرَدِ",
            "audio": "",
            "notes": "(1)\nRead either one",
            "source": "Bukhari:1/181 and Muslim: 1/419.",
            "translation": "O Allah, set me apart from my sins as the East and the West are set apart from each other. O Allah, clean me from sins as the white garment is cleaned of dirt. O Allah, wash off my sins with water, snow, and hail."
          },
          {
            "arabic": "سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ، وَتَبَارَكَ اسْمُكَ، وَتَعَالَى جَدُّكَ، وَلاَ إِلَـهَ غَيْرُكَ",
            "audio": "",
            "notes": "(2)\nRead either one",
            "source": " The four Sunan books, also see Shahih At-Tirmidzi: 1/77 and Shahih Ibnu Majah: 1/135.",
            "translation": "How perfect You are O Allah, and I praise You. Blessed be Your name, and lofty is Your position and none has the right to be worshipped except You."
          },
          {
            "arabic": "وَجَّهْتُ وَجْهِيَ لِلَّذِيْ فَطَرَ السَّمَاوَاتِ وَاْلأَرْضَ حَنِيْفًا وَمَا أَنَا مِنَ الْمُشْرِكِيْنَ، إِنَّ صَلاَتِيْ، وَنُسُكِيْ، وَمَحْيَايَ، وَمَمَاتِيْ لِلَّهِ رَبِّ الْعَالَمِيْنَ، لاَ شَرِيْكَ لَهُ وَبِذَلِكَ أُمِرْتُ وَأَنَا مِنَ الْمُسْلِمِيْنَ. اَللَّهُمَّ أَنْتَ الْمَلِكُ   لاَ إِلَـهَ إِلاَّ أَنْتَ. أَنْتَ رَبِّيْ وَأَنَا عَبْدُكَ، ظَلَمْتُ نَفْسِيْ وَاعْتَرَفْتُ بِذَنْبِيْ فَاغْفِرْلِيْ ذُنُوْبِيْ جَمِيْعًا إِنَّهُ لاَ يَغْفِرُ الذُّنُوْبَ إِلاَّ أَنْتَ. وَاهْدِنِيْ لأَحْسَنِ اْلأَخْلاَقِ لاَ يَهْدِيْ لأَحْسَنِهَا إِلاَّ أَنْتَ، وَاصْرِفْ عَنِّيْ سَيِّئَهَا، لاَ يَصْرِفُ عَنِّيْ سَيِّئَهَا إِلاَّ أَنْتَ، لَبَّيْكَ وَسَعْدَيْكَ، وَالْخَيْرُ كُلُّهُ بِيَدَيْكَ، وَالشَّرُّ لَيْسَ إِلَيْكَ، أَنَا بِكَ وَإِلَيْكَ، تَبَارَكْتَ وَتَعَالَيْتَ، أَسْتَغْفِرُكَ وَأَتُوْبُ إِلَيْكَ",
            "audio": "",
            "notes": "(3)\nRead either one",
            "source": " Muslim: 1/534.",
            "translation": "I have turned my face sincerely towards He who has brought forth the heavens and the Earth and I am not of those who associate (others with Allah). Indeed my prayer, my sacrifice, my life and my death are for Allah, Lord of the worlds, no partner has He, with this I am commanded and I am of the Muslims. O Allah, You are the Sovereign, none has the right to be worshipped except You. You are my Lord and I am Your servant, I have wronged my own soul and have acknowledged my sin, so forgive me all my sins for no one forgives sins except You. Guide me to the best of characters for none can guide to it other than You, and deliver me from the worst of characters for none can deliver me from it other than You. Here I am, in answer to Your call, happy to serve you. All good is within Your hands and evil does not stem from You. I exist by your will and will return to you. Blessed and High are You, I seek Your forgiveness and repent unto You."
          },
          {
            "arabic": "اَللَّهُمَّ رَبَّ جِبْرَائِيْلَ، وَمِيْكَائِيْلَ، وَإِسْرَافِيْلَ فَاطِرَ السَّمَاوَاتِ وَاْلأَرْضِ، عَالِمَ الْغَيْبِ وَالشَّهَادَةِ، أَنْتَ تَحْكُمُ بَيْنَ عِبَادِكَ فِيْمَا كَانُوْا فِيْهِ يَخْتَلِفُوْنَ. اِهْدِنِيْ لِمَا اخْتُلِفَ فِيْهِ مِنَ الْحَقِّ بِإِذْنِكَ تَهْدِيْ مَنْ تَشَاءُ إِلَى صِرَاطٍ مُسْتَقِيْمٍ",
            "audio": "",
            "notes": "(4)\nRead either one",
            "source": " Muslim: 1/534.",
            "translation": "O Allah, Lord of Jibra-eel, Meeka-eel and Israfeel (great angles), Creator of the heavens and the Earth, Knower of the seen and the unseen. You are the arbitrator between Your servants in that which they have disputed. Guide me to the truth by Your leave, in that which they have differed, for verily You guide whom You will to a straight path."
          }
        ],
        "id": 17,
        "language": "en",
        "title": "Iftitah Dua"
      },
      {
        "bookId": 1,
        "data": [
          {
            "arabic": " اَللَّهُمَّ لَكَ الْحَمْدُ أَنْتَ نُوْرُ السَّمَاوَاتِ وَاْلأَرْضِ وَمَنْ فِيْهِنَّ، وَلَكَ الْحَمْدُ أَنْتَ قَيِّمُ السَّمَاوَاتِ وَاْلأَرْضِ وَمَنْ فِيْهِنَّ، وَلَكَ الْحَمْدُ أَنْتَ رَبُّ السَّمَاوَاتِ وَاْلأَرْضِ وَمَنْ فِيْهِنَّ, وَلَكَ الْحَمْدُ لَكَ مُلْكُ السَّمَاوَاتِ وَاْلأَرْضِ وَمَنْ فِيْهِنَّ, وَلَكَ الْحَمْدُ أَنْتَ مَلِكُ السَّمَاوَاتِ وَاْلأَرْضِ, وَلَكَ الْحَمْدُ, أَنْتَ الْحَقُّ، وَوَعْدُكَ الْحَقُّ، وَقَوْلُكَ الْحَقُّ، وَلِقَاؤُكَ الْحَقُّ، وَالْجَنَّهُ حَقٌّ، وَالنَّارُ حَقٌّ، وَالنَّبِيُّوْنَ حَقٌّ، وَمُحَمَّدٌ ﷺ حَقٌّ، وَالسَّاعَةُ حَقٌّ, اَللَّهُمَّ لَكَ أَسْلَمْتُ، وَعَلَيْكَ تَوَكَّلْتُ، وَبِكَ آمَنْتُ، وَإِلَيْكَ أَنَبْتُ، وَبِكَ خَاصَمْتُ، وَإِلَيْكَ حَاكَمْتُ. فَاغْفِرْ لِيْ مَا قَدَّمْتُ وَمَا أَخَّرْتُ، وَمَا أَسْرَرْتُ وَمَا أَعْلَنْتُ, أَنْتَ الْمُقَدِّمُ وَأَنْتَ الْمُؤَخِّرُ، لاَ إِلَـهَ إِلاَّ أَنْتَ, أَنْتَ إِلَـهِيْ لاَ إِلَـهَ إِلاَّ أَنْتَ",
            "audio": "",
            "notes": "",
            "source": " Al-Bukhari in Fathul Bari 3/3, 11/116, 13/371, 423, 465 and Muslim briefly reported in 1/532.",
            "translation": "O Allah, to You belongs all praise, You are the Light of the heavens and the Earth and all that is within them. To You belongs all praise, You are the Sustainer of the heavens and the Earth and all that is within them. To You belongs all praise. You are Lord of the heavens and the Earth and all that is within them. To You belongs all praise and the kingdom of the heavens and the Earth and all that is within them. To You belongs all praise, You are the King of the heavens and the Earth and to You belongs all praise. You are The Truth, Your promise is true, your Word is true, and the Day in which we will encounter You is true, the Garden of Paradise is true and the Fire is true, and the Prophets are true, Muhammad r is true and the Final Hour is true. O Allah, unto You I have submitted, and upon You I have relied, and in You I have believed, and to You I have turned in repentance, and over You I have disputed, and to You I have turned for judgment. So forgive me for what has come to pass of my sins and what will come to pass, and what I have hidden and what I have made public. You are Al-Muqaddim and Al-Mu-akhkhir. None has the right to be worshipped except You, You are my Deity, none has the right to be worshipped except You."
          }
        ],
        "id": 18,
        "language": "en",
        "title": "Iftitah Dua during Night Prayer (Tahajjud)"
      },
      {
        "bookId": 1,
        "data": [
          {
            "arabic": "سُبْحَانَ رَبِّيَ الْعَظِيْمِ",
            "audio": "",
            "notes": "(1)\nRead either one\nRead 3x",
            "source": " The sunan books and Imam Ahmad, see Shahih At-Tirmidzi:1/83.",
            "translation": "How perfect my Lord is, The Supreme."
          },
          {
            "arabic": "سُبْحَانَكَ اللَّهُمَّ رَبَّنَا وَبِحَمْدِكَ اللَّهُمَّ اغْفِرْ لِيْ",
            "audio": "",
            "notes": "(2)\nRead either one",
            "source": " Bukhari: 1/99 and Muslim: 1/350.",
            "translation": "How perfect You are O Allah, our Lord and I praise You. O Allah, forgive me."
          },
          {
            "arabic": " سُبْحَانَ ذِي الْجَبَرُوْتِ وَاْلمَلَكُوْتِ وَالْكِبْرِيَاءِ وَالْعَظَمَةِ",
            "audio": "",
            "notes": "(3)\nRead either one",
            "source": " Abu Dawud: 1/230, An-Nasai and Ahmad. Graded Hasan",
            "translation": "How perfect He is, The Possessor of total power, sovereignty, magnificence and grandeur."
          },
          {
            "arabic": " سُبُّوْحٌ قُدُّوْسٌ، رَبُّ الْمَلاَئِكَةِ وَالرُّوْحِ",
            "audio": "",
            "notes": "(4)\nRead either one",
            "source": " Muslim: 1/353 and Abu Dawud: 1/230.",
            "translation": "Perfect and Holy (He is), Lord of the angles and the Rooh."
          }
        ],
        "id": 19,
        "language": "en",
        "title": "Dua during ruku'"
      },
      {
        "bookId": 1,
        "data": [
          {
            "arabic": "سَمِعَ اللهُ لِمَنْ حَمِدَهُ",
            "audio": "",
            "notes": "",
            "source": "Bukhari in Fathul Bari: 2/282.",
            "translation": "May Allah answer he who praises Him"
          }
        ],
        "id": 20,
        "language": "en",
        "title": "Upon rising from ruku'"
      },
      {
        "bookId": 1,
        "data": [
          {
            "arabic": " رَبَّنَا وَلَكَ الْحَمْدُ، حَمْدًا كَثِيْرًا طَيِّبًا مُبَارَكًا فِيْهِ",
            "audio": "",
            "notes": "",
            "source": " Bukhari in Fathul Bari: 2/284.",
            "translation": "Our Lord, for You is all praise, an abundant beautiful blessed praise."
          },
          {
            "arabic": "مِلْءَ السَّمَاوَاتِ وَمِلْءَ اْلأَرْضِ وَمَا بَيْنَهُمَا، وَمِلْءَ مَا شِئْتَ  مِنْ شَيْءٍ بَعْدُ. أَهْلَ الثَّنَاءِ وَالْمَجْدِ، أَحَقُّ مَا قَالَ الْعَبْدُ، وَكُلُّنَا لَكَ عَبْدٌ. اَللَّهُمَّ لاَ مَانِعَ لِمَا أَعْطَيْتَ، وَلاَ مُعْطِيَ لِمَا مَنَعْتَ، وَلاَ يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ",
            "audio": "",
            "notes": "",
            "source": " Muslim: 1/346.",
            "translation": "The heavens and the Earth and all between them abound with Your praises, and all that You will abounds with Your praises. O Possessor of praise and majesty, the truest thing a slave has said (of You) and we are all Your slaves. O Allah, none can prevent what You have willed to bestow and none can bestow what You have willed to prevent, and no wealth or majesty can benefit anyone, as from You is all wealth and majesty."
          }
        ],
        "id": 21,
        "language": "en",
        "title": "Dua after rising from ruku'"
      },
      {
        "bookId": 1,
        "data": [
          {
            "arabic": " سُبْحَانَ رَبِّيَ اْلأَعْلَى",
            "audio": "",
            "notes": "(1)\nRead either one\nRead 3x",
            "source": "The sunan books and Imam Ahmad. See Shahih At-Tirmidzi: 1/83.",
            "translation": "How perfect my Lord is, The Most High"
          },
          {
            "arabic": " سُبْحَانَكَ اللَّهُمَّ رَبَّنَا وَبِحَمْدِكَ اللَّهُمَّ اغْفِرْ لِيْ",
            "audio": "",
            "notes": "(2)\nRead either one",
            "source": " Bukhari and Muslim, see chapter Dua during Ruku'.",
            "translation": "How perfect You are O Allah, our Lord, and I praise You. O Allah, forgive me."
          },
          {
            "arabic": " سُبُّوْحٌ قُدُّوْسٌ رَبُّ الْمَلاَئِكَةِ وَالرُّوْحِ",
            "audio": "",
            "notes": "(3)\nRead either one",
            "source": " Muslim: 1/533, see no. 35.",
            "translation": "Perfect and Holy (He is), Lord of the angles and the Rooh."
          }
        ],
        "id": 22,
        "language": "en",
        "title": "Dua during sujud"
      },
      {
        "bookId": 1,
        "data": [
          {
            "arabic": " رَبِّ اغْفِرْ لِيْ رَبِّ اغْفِرْ لِيْ",
            "audio": "",
            "notes": "(1)\nRead either one",
            "source": " Abu Dawud: 1/231, see Shahih Ibnu Majah: 1/148.",
            "translation": "My Lord forgive me, My Lord forgive me."
          },
          {
            "arabic": "اَللَّهُمَّ اغْفِرْ لِيْ وَارْحَمْنِيْ وَاهْدِنِيْ وَاجْبُرْنِيْ وَعَافِنِيْ وَارْزُقْنِيْ وَارْفَعْنِي",
            "audio": "",
            "notes": "(2)\nRead either one",
            "source": " Ashhabus Sunan, except An-Nasai. See Shahih At-Tirmidzi: 1/90 and Shahih Ibnu Majah: 1/148.",
            "translation": "O Allah, forgive me, have mercy upon me, guide me, enrich me, give me health, grant me sustenance and raise my rank."
          }
        ],
        "id": 23,
        "language": "en",
        "title": "Between the two sujud"
      }
    ],
    "status": "1",
    "title": "Book of Du'a",
    "type": 0,
    "updated": ""
  },
  {
    "desc": "The quality of a Dua depends on the Du’a and the Sincerity of the person saying it Here are some of the du’a sourced from the Qur’an.",
    "id": 2,
    "language": "en",
    "prayer": [
      {
        "bookId": 2,
        "data": [
          {
            "arabic": "رَبِّ إِنِّي أَعُوذُ بِكَ أَنْ أَسْأَلَكَ مَا لَيْسَ لِي بِهِ عِلْمٌ ۖ وَإِلَّا تَغْفِرْ لِي وَتَرْحَمْنِي أَكُنْ مِنَ الْخَاسِرِينَ",
            "audio": "",
            "notes": "",
            "source": "QS. Hud[11]:47",
            "translation": "Noah said: \"O my Lord! I do seek refuge with Thee, lest I ask Thee for that of which I have no knowledge. And unless thou forgive me and have Mercy on me, I should indeed be lost!\""
          },
          {
            "arabic": " رَبَّنَا آمَنَّا فَاغْفِرْ لَنَا وَارْحَمْنَا وَأَنْتَ خَيْرُ الرَّاحِمِينَ",
            "audio": "",
            "notes": "",
            "source": "QS. Al-Mu'minun[23]:109",
            "translation": "Our Lord! we believe; then do Thou forgive us, and have mercy upon us: For Thou art the Best of those who show mercy!"
          },
          {
            "arabic": " رَبِّ اغْفِرْ وَارْحَمْ وَأَنْتَ خَيْرُ الرَّاحِمِينَ",
            "audio": "",
            "notes": "",
            "source": "QS. Al-Mu'minun[23]:118",
            "translation": "O my Lord! grant Thou forgiveness and mercy for Thou art the Best of those who show mercy!"
          },
          {
            "arabic": "رَبَّنَا اغْفِرْ لَنَا ذُنُوبَنَا وَإِسْرَافَنَا فِي أَمْرِنَا وَثَبِّتْ أَقْدَامَنَا وَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ",
            "audio": "",
            "notes": "",
            "source": "QS. Ali-'Imran[3]:147",
            "translation": "Our Lord! Forgive us our sins and anything We may have done that transgressed our duty: Establish our feet firmly, and help us against those that resist Faith."
          },
          {
            "arabic": "رَبَّنَا إِنَّنَا آمَنَّا فَاغْفِرْ لَنَا ذُنُوبَنَا وَقِنَا عَذَابَ النَّارِ",
            "audio": "",
            "notes": "",
            "source": "QS. Ali-'Imran[3]16",
            "translation": "Our Lord! we have indeed believed: forgive us, then, our sins, and save us from the agony of the Fire;"
          },
          {
            "arabic": "رَبَّنَا إِنَّنَا سَمِعْنَا مُنَادِيًا يُنَادِي لِلْإِيمَانِ أَنْ آمِنُوا بِرَبِّكُمْ فَآمَنَّا ۚ رَبَّنَا فَاغْفِرْ لَنَا ذُنُوبَنَا وَكَفِّرْ عَنَّا سَيِّئَاتِنَا وَتَوَفَّنَا مَعَ الْأَبْرَارِ رَبَّنَا وَآتِنَا مَا وَعَدْتَنَا عَلَىٰ رُسُلِكَ وَلَا تُخْزِنَا يَوْمَ الْقِيَامَةِ ۗ إِنَّكَ لَا تُخْلِفُ الْمِيعَادَ",
            "audio": "",
            "notes": "",
            "source": "QS. Ali-'Imran[3]:193-194",
            "translation": "Our Lord! we have heard the call of one calling (Us) to Faith, ´Believe ye in the Lord,´ and we have believed. Our Lord! Forgive us our sins, blot out from us our iniquities, and take to Thyself our souls in the company of the righteous. Our Lord! Grant us what Thou didst promise unto us through Thine messengers, and save us from shame on the Day of Judgment: For Thou never breakest Thy promise."
          },
          {
            "arabic": "رَبِّ إِنِّي ظَلَمْتُ نَفْسِي فَاغْفِرْ لِي ",
            "audio": "",
            "notes": "",
            "source": "QS. Al-Qashash[28]:16",
            "translation": "O my Lord! I have indeed wronged my soul! Do Thou then forgive me! So (Allah) forgave him: for He is the Oft-Forgiving, Most Merciful."
          },
          {
            "arabic": "رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا ۚ رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا ۚ رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ ۖ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا ۚ أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ",
            "audio": "",
            "notes": "",
            "source": "QS. Al-Baqarah[2]:286",
            "translation": "Our Lord! Condemn us not if we forget or fall into error; our Lord! Lay not on us a burden Like that which Thou didst lay on those before us; Our Lord! Lay not on us a burden greater than we have strength to bear. Blot out our sins, and grant us forgiveness. Have mercy on us. Thou art our Protector; Help us against those who stand against faith."
          },
          {
            "arabic": " رَبَّنَا ظَلَمْنَا أَنْفُسَنَا وَإِنْ لَمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُونَنَّ مِنَ الْخَاسِرِينَ",
            "audio": "",
            "notes": "",
            "source": "QS. Al-A'raf[7]:23",
            "translation": "Our Lord! We have wronged our own souls: If thou forgive us not and bestow not upon us Thy Mercy, we shall certainly be lost."
          }
        ],
        "id": 1,
        "language": "en",
        "title": "Asking For Allah's Forgiveness"
      },
      {
        "bookId": 2,
        "data": [
          {
            "arabic": "رَبِّ هَبْ لِي حُكْمًا وَأَلْحِقْنِي بِالصَّالِحِينَ وَاجْعَلْ لِي لِسَانَ صِدْقٍ فِي الْآخِرِينَ وَاجْعَلْنِي مِنْ وَرَثَةِ جَنَّةِ النَّعِيمِ",
            "audio": "",
            "notes": "",
            "source": "QS. Asy-Syu'ara[26]:83-85",
            "translation": "O my Lord! bestow wisdom on me, and join me with the righteous;Grant me honourable mention on the tongue of truth among the latest (generations);Make me one of the inheritors of the Garden of Bliss;"
          },
          {
            "arabic": "وَلَا تُخْزِنِي يَوْمَ يُبْعَثُونَ",
            "audio": "",
            "notes": "",
            "source": "QS. Asy-Syu'ara[26]:87",
            "translation": "And let me not be in disgrace on the Day when (men) will be raised up;-"
          },
          {
            "arabic": " رَبَّنَا آمَنَّا فَاكْتُبْنَا مَعَ الشَّاهِدِينَ",
            "audio": "",
            "notes": "",
            "source": "QS. Al-Ma'idah[5]:83",
            "translation": "Our Lord! we believe; write us down among the witnesses."
          }
        ],
        "id": 2,
        "language": "en",
        "title": "Dua to be included among the faithful believers"
      },
      {
        "bookId": 2,
        "data": [
          {
            "arabic": " رَبِّ لَا تَذَرْنِي فَرْدًا وَأَنْتَ خَيْرُ الْوَارِثِينَ",
            "audio": "",
            "notes": "",
            "source": "QS. Al-Anbiya[21]:89",
            "translation": "O my Lord! leave me not without offspring, though thou art the best of inheritors."
          },
          {
            "arabic": "رَبِّ هَبْ لِي مِنَ الصَّالِحِينَ",
            "audio": "",
            "notes": "",
            "source": "QS. As-Shaffat[37]:100",
            "translation": "O my Lord! Grant me a righteous (son)!"
          },
          {
            "arabic": "رَبِّ هَبْ لِي مِنْ لَدُنْكَ ذُرِّيَّةً طَيِّبَةً ۖ إِنَّكَ سَمِيعُ الدُّعَاءِ",
            "audio": "",
            "notes": "",
            "source": "QS. Ali-'Imran[3]:38",
            "translation": "O my Lord! Grant unto me from Thee a progeny that is pure: for Thou art He that heareth prayer!"
          },
          {
            "arabic": " رَبَّنَا هَبْ لَنَا مِنْ أَزْوَاجِنَا وَذُرِّيَّاتِنَا قُرَّةَ أَعْيُنٍ وَاجْعَلْنَا لِلْمُتَّقِينَ إِمَامًا",
            "audio": "",
            "notes": "",
            "source": "QS. Al-Furqan[25]:74",
            "translation": "Our Lord! Grant unto us wives and offspring who will be the comfort of our eyes, and give us (the grace) to lead the righteous."
          }
        ],
        "id": 3,
        "language": "en",
        "title": "Dua for a righteous(believing) descendants"
      },
      {
        "bookId": 2,
        "data": [
          {
            "arabic": "رَبَّنَا اغْفِرْ لِي وَلِوَالِدَيَّ وَلِلْمُؤْمِنِينَ يَوْمَ يَقُومُ الْحِسَابُ",
            "audio": "",
            "notes": "",
            "source": "QS. Ibrahim[14]:41",
            "translation": "O our Lord! cover (us) with Thy Forgiveness - me, my parents, and (all) Believers, on the Day that the Reckoning will be established!"
          },
          {
            "arabic": "رَبَّنَا اغْفِرْ لَنَا وَلِإِخْوَانِنَا الَّذِينَ سَبَقُونَا بِالْإِيمَانِ وَلَا تَجْعَلْ فِي قُلُوبِنَا غِلًّا لِلَّذِينَ آمَنُوا رَبَّنَا إِنَّكَ رَءُوفٌ رَحِيمٌ",
            "audio": "",
            "notes": "",
            "source": "QS. Al-Hasyr[59]:10",
            "translation": "Our Lord! Forgive us, and our brethren who came before us into the Faith, and leave not, in our hearts, rancour (or sense of injury) against those who have believed. Our Lord! Thou art indeed Full of Kindness, Most Merciful."
          },
          {
            "arabic": "رَبِّ اغْفِرْ لِي وَلِوَالِدَيَّ وَلِمَنْ دَخَلَ بَيْتِيَ مُؤْمِنًا وَلِلْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ ",
            "audio": "",
            "notes": "",
            "source": "QS. Nuh[71]:28",
            "translation": "O my Lord! Forgive me, my parents, all who enter my house in Faith, and (all) believing men and believing women"
          }
        ],
        "id": 4,
        "language": "en",
        "title": "Asking for Allah's forgiveness for our parents and believers"
      },
      {
        "bookId": 2,
        "data": [
          {
            "arabic": "رَبِّ اجْعَلْنِي مُقِيمَ الصَّلَاةِ وَمِنْ ذُرِّيَّتِي ۚ رَبَّنَا وَتَقَبَّلْ دُعَاءِ",
            "audio": "",
            "notes": "",
            "source": "QS. Ibrahim[14]:40",
            "translation": "O my Lord! make me one who establishes regular Prayer, and also (raise such) among my offspring O our Lord! and accept Thou my Prayer."
          }
        ],
        "id": 5,
        "language": "en",
        "title": "Dua for self and family to always establishes prayer"
      },
      {
        "bookId": 2,
        "data": [
          {
            "arabic": " رَبِّ نَجِّنِي مِنَ الْقَوْمِ الظَّالِمِينَ",
            "audio": "",
            "notes": "",
            "source": "QS. Al-Qashash[28]:21",
            "translation": "O my Lord! save me from people given to wrong-doing."
          },
          {
            "arabic": "رَبَّنَا لَا تَجْعَلْنَا مَعَ الْقَوْمِ الظَّالِمِينَ",
            "audio": "",
            "notes": "",
            "source": "QS. Al-A'raf[7]47",
            "translation": "Our Lord! send us not to the company of the wrong-doers."
          },
          {
            "arabic": " رَبِّ انْصُرْنِي عَلَى الْقَوْمِ الْمُفْسِدِينَ",
            "audio": "",
            "notes": "",
            "source": "QS. Al-Ankabut[29]:30",
            "translation": "O my Lord! help Thou me against people who do mischief!"
          }
        ],
        "id": 6,
        "language": "en",
        "title": "Protection from the Zhalim"
      },
      {
        "bookId": 2,
        "data": [
          {
            "arabic": " رَبَّنَا تَقَبَّلْ مِنَّا ۖ إِنَّكَ أَنْتَ السَّمِيعُ الْعَلِيمُ …  وَتُبْ عَلَيْنَا ۖ إِنَّكَ أَنْتَ التَّوَّابُ الرَّحِيمُ",
            "audio": "",
            "notes": "",
            "source": "QS. Al-Baqarah[2]:127,128",
            "translation": "Our Lord! Accept (this service) from us: For Thou art the All-Hearing, the All-knowing....and turn unto us (in Mercy); for Thou art the Oft-Returning, Most Merciful."
          }
        ],
        "id": 7,
        "language": "en",
        "title": "Acceptance of deeds and taubah"
      },
      {
        "bookId": 2,
        "data": [
          {
            "arabic": " رَبَّنَا عَلَيْكَ تَوَكَّلْنَا وَإِلَيْكَ أَنَبْنَا وَإِلَيْكَ الْمَصِيرُ",
            "audio": "",
            "notes": "",
            "source": "QS. Al-Mumtahanah[60]:4",
            "translation": "Our Lord! in Thee do we trust, and to Thee do we turn in repentance: to Thee is (our) Final Goal."
          },
          {
            "arabic": " حَسْبِيَ اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ ۖ عَلَيْهِ تَوَكَّلْتُ ۖ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ",
            "audio": "",
            "notes": "",
            "source": "QS. At-Taubah[9]:129",
            "translation": "Allah sufficeth me: there is no god but He: On Him is my trust,- He the Lord of the Throne (of Glory) Supreme!"
          }
        ],
        "id": 8,
        "language": "en",
        "title": "Putting trust in Allah"
      },
      {
        "bookId": 2,
        "data": [
          {
            "arabic": "رَبَّنَا لَا تَجْعَلْنَا فِتْنَةً لِلَّذِينَ كَفَرُوا وَاغْفِرْ لَنَا رَبَّنَا ۖ إِنَّكَ أَنْتَ الْعَزِيزُ الْحَكِيمُ",
            "audio": "",
            "notes": "",
            "source": "QS. Al-Mumtahanah[60]:5",
            "translation": "Our Lord! Make us not a (test and) trial for the Unbelievers, but forgive us, our Lord! for Thou art the Exalted in Might, the Wise."
          },
          {
            "arabic": " رَبَّنَا لَا تَجْعَلْنَا فِتْنَةً لِلْقَوْمِ الظَّالِمِينَ  وَنَجِّنَا بِرَحْمَتِكَ مِنَ الْقَوْمِ الْكَافِرِينَ",
            "audio": "",
            "notes": "",
            "source": "QS. At-Yunus[10]:85-86",
            "translation": "In Allah do we put out trust. Our Lord! make us not a trial for those who practise oppression; And deliver us by Thy Mercy from those who reject (Thee)."
          }
        ],
        "id": 9,
        "language": "en",
        "title": "Protection from fitnah"
      },
      {
        "bookId": 2,
        "data": [
          {
            "arabic": " رَبِّ زِدْنِي عِلْمًا",
            "audio": "",
            "notes": "",
            "source": "QS. Thaha[20]:114",
            "translation": "O my Lord! advance me in knowledge."
          }
        ],
        "id": 10,
        "language": "en",
        "title": "Dua for knowledge"
      },
      {
        "bookId": 2,
        "data": [
          {
            "arabic": " رَبَّنَا أَتْمِمْ لَنَا نُورَنَا وَاغْفِرْ لَنَا ۖ إِنَّكَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ",
            "audio": "",
            "notes": "",
            "source": "QS. At-Tahrim[66]:8",
            "translation": "Our Lord! Perfect our Light for us, and grant us Forgiveness: for Thou hast power over all things."
          }
        ],
        "id": 11,
        "language": "en",
        "title": "Perfecting our light"
      },
      {
        "bookId": 2,
        "data": [
          {
            "arabic": " رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ",
            "audio": "",
            "notes": "",
            "source": "QS. Al-Baqarah[2]:201",
            "translation": "Our Lord! Give us good in this world and good in the Hereafter, and defend us from the torment of the Fire!"
          }
        ],
        "id": 12,
        "language": "en",
        "title": "Goodness in Dunya and Hereafter"
      },
      {
        "bookId": 2,
        "data": [
          {
            "arabic": " رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَىٰ وَالِدَيَّ وَأَنْ أَعْمَلَ صَالِحًا تَرْضَاهُ وَأَدْخِلْنِي بِرَحْمَتِكَ فِي عِبَادِكَ الصَّالِحِينَ",
            "audio": "",
            "notes": "",
            "source": "QS. An-Naml[27]:19",
            "translation": "O my Lord! so order me that I may be grateful for Thy favours, which thou hast bestowed on me and on my parents, and that I may work the righteousness that will please Thee: And admit me, by Thy Grace, to the ranks of Thy righteous Servants."
          },
          {
            "arabic": " رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَىٰ وَالِدَيَّ وَأَنْ أَعْمَلَ صَالِحًا تَرْضَاهُ وَأَصْلِحْ لِي فِي ذُرِّيَّتِي ۖ إِنِّي تُبْتُ إِلَيْكَ وَإِنِّي مِنَ الْمُسْلِمِينَ",
            "audio": "",
            "notes": "",
            "source": "QS. Al-Ahqaf[46]:15",
            "translation": "O my Lord! Grant me that I may be grateful for Thy favour which Thou has bestowed upon me, and upon both my parents, and that I may work righteousness such as Thou mayest approve; and be gracious to me in my issue. Truly have I turned to Thee and truly do I bow (to Thee) in Islam."
          }
        ],
        "id": 13,
        "language": "en",
        "title": "Dua to be a grateful servant"
      },
      {
        "bookId": 2,
        "data": [
          {
            "arabic": " رَبِّ أَعُوذُ بِكَ مِنْ هَمَزَاتِ الشَّيَاطِينِ وَأَعُوذُ بِكَ رَبِّ أَنْ يَحْضُرُونِ",
            "audio": "",
            "notes": "",
            "source": "QS. Al-Mu'minun[23]:97-98",
            "translation": "O my Lord! I seek refuge with Thee from the suggestions of the Evil Ones. And I seek refuge with Thee O my Lord! lest they should come near me."
          }
        ],
        "id": 14,
        "language": "en",
        "title": "Protection from Shaithan"
      },
      {
        "bookId": 2,
        "data": [
          {
            "arabic": "رَبَّنَا لَا تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا وَهَبْ لَنَا مِنْ لَدُنْكَ رَحْمَةً ۚ إِنَّكَ أَنْتَ الْوَهَّابُ",
            "audio": "",
            "notes": "",
            "source": "QS. Ali-'Imran[3]:8",
            "translation": "Our Lord! (they say), Let not our hearts deviate now after Thou hast guided us, but grant us mercy from Thine own Presence; for Thou art the Grantor of bounties without measure."
          }
        ],
        "id": 15,
        "language": "en",
        "title": "Doa Agar Hati Ditetapkan Dalam Hidayah"
      },
      {
        "bookId": 2,
        "data": [
          {
            "arabic": " لَا إِلَٰهَ إِلَّا أَنْتَ سُبْحَانَكَ إِنِّي كُنْتُ مِنَ الظَّالِمِينَ",
            "audio": "",
            "notes": "",
            "source": "QS. Al-Anbiya[21]:87",
            "translation": "There is no god but thou: glory to thee: I was indeed wrong!"
          },
          {
            "arabic": " رَبِّ اشْرَحْ لِي صَدْرِي وَيَسِّرْ لِي أَمْرِي وَاحْلُلْ عُقْدَةً مِنْ لِسَانِي يَفْقَهُوا قَوْلِي",
            "audio": "",
            "notes": "",
            "source": "QS. Al-Thaha[20]:25-28",
            "translation": "O my Lord! expand me my breast; Ease my task for me; And remove the impediment from my speech, So they may understand what I say"
          },
          {
            "arabic": " رَبَّنَا آتِنَا مِنْ لَدُنْكَ رَحْمَةً وَهَيِّئْ لَنَا مِنْ أَمْرِنَا رَشَدًا",
            "audio": "",
            "notes": "",
            "source": "QS. Al-Kahf[18]:10",
            "translation": "Our Lord! bestow on us Mercy from Thyself, and dispose of our affair for us in the right way!"
          }
        ],
        "id": 16,
        "language": "en",
        "title": "Ease all task"
      },
      {
        "bookId": 2,
        "data": [
          {
            "arabic": "رَبِّ اجْعَلْ هَٰذَا الْبَلَدَ آمِنًا وَاجْنُبْنِي وَبَنِيَّ أَنْ نَعْبُدَ الْأَصْنَامَ",
            "audio": "",
            "notes": "",
            "source": "QS. Ibrahim[14]:35",
            "translation": "O my Lord! make this city one of peace and security: and preserve me and my sons from worshipping idols."
          }
        ],
        "id": 17,
        "language": "en",
        "title": "Protection for the city and from shikr"
      },
      {
        "bookId": 2,
        "data": [
          {
            "arabic": "رَبَّنَا اصْرِفْ عَنَّا عَذَابَ جَهَنَّمَ ۖ إِنَّ عَذَابَهَا كَانَ غَرَامًا إِنَّهَا سَاءَتْ مُسْتَقَرًّا وَمُقَامًا",
            "audio": "",
            "notes": "",
            "source": "QS. Al-Furqan[25]:65-66",
            "translation": "Our Lord! avert from us the Wrath of Hell, for its Wrath is indeed an affliction grievous, Evil indeed is it as an abode, and as a place to rest in"
          }
        ],
        "id": 18,
        "language": "en",
        "title": "Protection from Hellfire"
      },
      {
        "bookId": 2,
        "data": [
          {
            "arabic": " حَسْبُنَا اللَّهُ وَنِعْمَ الْوَكِيلُ",
            "audio": "",
            "notes": "",
            "source": "QS. Ali 'Imran[3]:173",
            "translation": "For us Allah sufficeth, and He is the best disposer of affairs."
          }
        ],
        "id": 19,
        "language": "en",
        "title": "Protection from the disbelievers"
      },
      {
        "bookId": 2,
        "data": [
          {
            "arabic": "رَبَّنَا أَفْرِغْ عَلَيْنَا صَبْرًا وَتَوَفَّنَا مُسْلِمِينَ",
            "audio": "",
            "notes": "",
            "source": "QS. Al-A'raf[7]:126",
            "translation": "Our Lord! pour out on us patience and constancy, and take our souls unto thee as Muslims (who bow to thy will)!"
          }
        ],
        "id": 20,
        "language": "en",
        "title": "Protection and Righteous Death"
      },
      {
        "bookId": 2,
        "data": [
          {
            "arabic": " عَسَىٰ رَبِّي أَنْ يَهْدِيَنِي سَوَاءَ السَّبِيلِ",
            "audio": "",
            "notes": "",
            "source": "QS. Al-Qashash[28]:22",
            "translation": "I do hope that my Lord will show me the smooth and straight Path."
          }
        ],
        "id": 21,
        "language": "en",
        "title": "Guidance to the right path"
      }
    ],
    "status": "1",
    "title": "Du'a in Qur'an",
    "type": 0,
    "updated": ""
  },
  {
    "desc": "Setiap orang pasti membutuhkan do'a, baik untuk menolak sesuatu yang tidak disukai, ataupun mendatangkan sesuatu yang disenangi. Berikut adalah beberapa do'a yang kami ambil dari Al-Qur'an dan Sunnah.",
    "id": 1,
    "language": "id",
    "prayer": [
      {
        "bookId": 1,
        "data": [
          {
            "arabic": "الْحَمْدُ لِلهِ الَّذِي أَحْيَاناَ بَعْـدَ مَا أَمَاتَنَا وَإِلَيْهِ النُّشُوْرِ",
            "audio": "",
            "notes": "",
            "source": "HR. Bukhari dalam Fathul Bari: 11/113 dan Muslim: 4/2083.",
            "translation": "Segala puji bagi Allah Yang membangunkan kami setelah ditidurkan-Nya dan kepada-Nya kami dibangkitkan"
          },
          {
            "arabic": "لاَ إِلَهَ إِلاَّ اللهُ وَحْدَهُ لاَ شَـرِيْكَ لَهُ. لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرٌ. سُبْحَانَ اللهِ وَالْحَمْدُ لِلَّهِ وَلاَ إِلَهَ إِلاَّ اللهُ وَاللهُ أَكْبَرُ، وَلاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللهِ الْعَلِيِّ الْعَظِيْمِ رَبِّ اغْفِرْ ليِ",
            "audio": "",
            "notes": "",
            "source": "Imam Bukhari dalam Fathul Bari: 3/39",
            "translation": "Tiada Tuhan selain Allah, Yang Maha Esa, tiada sekutu bagi-Nya. Bagi-Nya kerajaan dan pujian. Dia-lah Yang Maha Kuasa atas segala sesuatu. Maha suci Allah, segala puji bagi Allah, tiada Tuhan selain Allah, Allah Maha Besar, tiada daya dan kekuatan kecuali dengan pertolongan Allah yang Maha Tinggi dan Maha Agung. Ya Tuhanku, ampunilah dosaku"
          },
          {
            "arabic": "الْحَمْدُ لِلَّهِ الَّذِي عَافَانِي فِي جَسَدِيْ وَرَدَّ عَلَيَّ رُوْحِيْ وَأَذِنَ لِيْ بِذِكْرِهِ ",
            "audio": "",
            "notes": "",
            "source": "H.R: Tirmidzi: 5/473, lihat Shahih Tirmidzi: 3/144.",
            "translation": "Segala puji bagi Allah Yang telah memberikan kesehatan kepada-ku, mengembalikan ruh dan merestuiku untuk berdzikir kepada-Nya"
          }
        ],
        "id": 1,
        "language": "id",
        "title": "Bacaan Ketika Bangun Dari Tidur"
      },
      {
        "bookId": 1,
        "data": [
          {
            "arabic": " اَلْحَمْدُ لِلَّهِ الَّذِيْ كَسَانِيْ هَذَا (الثَّوْبَ) وَرَزَقَنِيْهِ مِن ْ غَيْرِ حَوْلٍ مِنِّيْ وَلاَ قُوَّةٍ",
            "audio": "",
            "notes": "",
            "source": "HR. seluruh penyusun kitab sunan, kecuali Nasa’i, lihat; Irwaa’ul ghalil: 4/47",
            "translation": "Segala puji bagi Allah Yang telah memberikan pakaian ini kepadaku sebagai rezeki dari-pada-Nya tanpa daya dan kekuatan dari-ku."
          }
        ],
        "id": 2,
        "language": "id",
        "title": "Doa Ketika Mengenakan Pakaian"
      },
      {
        "bookId": 1,
        "data": [
          {
            "arabic": "اَللَّهُمَّ لَكَ الْحَمْدُ أَنْتَ كَسَوْتَنِيْهِ، أَسْأَلُكَ مِنْ خَيْرِهِ وَخَيْرِ مَا صُنِعَ لَهُ، وَأَعُوْذُ بِكَ مِنْ شَرِّهِ وَشَرِّ مَا صُنِعَ لَهُ",
            "audio": "",
            "notes": "",
            "source": "HR. Abu Dawud, At-Tirmidzi, Al-Baghawi dan lihat Mukhtashar Syamaailit Tirmidzi, oleh Al-Albani, hal: 47.",
            "translation": "Ya Allah, hanya milik-Mu segala puji, Engkaulah yang memberi pakaian ini kepadaku. Aku mohon kepada-Mu untuk memperoleh kebaikannya dan kebaikan yang ia diciptakan karenanya. Aku berlindung kepada-Mu dari kejahatannya dan kejahatan yang ia diciptakan karena-nya"
          }
        ],
        "id": 3,
        "language": "id",
        "title": "Doa Ketika Mengenakan Pakaian Baru"
      },
      {
        "bookId": 1,
        "data": [
          {
            "arabic": "تُبْلِي وَيُخْلِفُ اللهُ تَعَالَى",
            "audio": "",
            "notes": "",
            "source": "HR. Abu Daud 4/41 dan lihat pula Shahih Abi Dawud, 2/760.",
            "translation": "Kenakanlah sampai lusuh, semoga Allah ta'ala memberikan gantinya kepadamu."
          },
          {
            "arabic": "اِلْبِسْ جَدِيْدًا، وَعِشْ حَمِيْدًا، وَمُتْ شَهِيْدًا",
            "audio": "",
            "notes": "",
            "source": "HR. Ibnu Majah: 2/1178, Al-Baghawi: 12/41 dan lihat Shahih Ibnu Majah: 2/275.",
            "translation": "Berpakaianlah yang baru, hiduplah dengan terpuji dan matilah dalam keadaan syahid"
          }
        ],
        "id": 4,
        "language": "id",
        "title": "Doa Bagi Orang Yang Mengenakan pakaian Baru"
      },
      {
        "bookId": 1,
        "data": [
          {
            "arabic": "بِسْمِ اللهِ",
            "audio": "",
            "notes": "",
            "source": "HR. At-Tirmidzi: 2/505 dan Imam yang lain. Lihat Irwa’ul Ghalil, 49 dan Shahihul Jami’: 3/203.",
            "translation": "Dengan nama Allah (aku meletakkan baju)"
          }
        ],
        "id": 5,
        "language": "id",
        "title": "Bacaan Ketika Meletakkan Pakaian"
      },
      {
        "bookId": 1,
        "data": [
          {
            "arabic": " (بِسْمِ اللهِ) اَللَّهُمَّ إِنِّيْ أَعُوْذُ بِكَ مِنَ الْخُبُثِ وَالْخَبَائِثِ",
            "audio": "",
            "notes": "",
            "source": "HR. Al-Bukhari: 1/45 dan Muslim: 1/283. Sedang tambahan bismillah pada permulaan hadits, menurut riwayat Said bin Manshur. Lihat Fathul Baari: 1/244.",
            "translation": "Dengan nama Allah. Ya Allah, sesungguhnya aku berlindung kepada-Mu dari godaan setan laki-laki dan perempuan"
          }
        ],
        "id": 6,
        "language": "id",
        "title": "Doa Masuk WC"
      },
      {
        "bookId": 1,
        "data": [
          {
            "arabic": "غُفْرَانَكَ",
            "audio": "",
            "notes": "",
            "source": "HR. Abu Dawud, Ibnu Majah dan Ahmad. Lihat Irwa’ul Ghalil 1/122.",
            "translation": "Aku minta ampun kepada-Mu"
          }
        ],
        "id": 7,
        "language": "id",
        "title": "Doa Keluar Dari WC"
      },
      {
        "bookId": 1,
        "data": [
          {
            "arabic": " بِسْمِ اللهِ",
            "audio": "",
            "notes": "",
            "source": "HR. Abu Dawud, Ibnu Majah dan Ahmad. Lihat Irwa’ul Ghalil 1/122.",
            "translation": "Dengan nama Allah (aku berwudhu)"
          }
        ],
        "id": 8,
        "language": "id",
        "title": "Bacaan Sebelum Wudhu'"
      },
      {
        "bookId": 1,
        "data": [
          {
            "arabic": "أَشْهَدُ أَنْ لاَ إِلَـهَ إِلاَّ اللهُ وَحْدَهُ لاَ شَرِيْكَ لَهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُوْلُهُ",
            "audio": "",
            "notes": "",
            "source": "HR. Muslim: 1/209.",
            "translation": "Aku bersaksi, bahwa tiada Tuhan yang haq kecuali Allah, Yang Maha Esa dan tiada sekutu bagi-Nya. Aku bersaksi, bahwa Muhammad adalah hamba dan utusan-Nya"
          },
          {
            "arabic": " اَللَّهُمَّ اجْعَلْنِيْ مِنَ التَّوَّابِيْنَ وَاجْعَلْنِيْ مِنَ الْمُتَطَهِّرِيْنَ",
            "audio": "",
            "notes": "",
            "source": "HR. At-Tirmidzi: 1/78, dan lihat Shahih At-Tirmidzi: 1/18.",
            "translation": "Ya Allah, jadikanlah aku termasuk orang-orang yang bertaubat dan jadikanlah aku termasuk orang-orang (yang senang) bersuci"
          },
          {
            "arabic": "سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ، أَشْهَدُ أَنْ لاَ إِلَـهَ إِلاَّ أَنْتَ، أَسْتَغْفِرُكَ وَأَتُوْبُ إِلَيْكَ",
            "audio": "",
            "notes": "",
            "source": "HR. An-Nasa’i dalam ‘Amalul Yaumi wal Lailah, halaman; 173 dan lihat Irwa’ul Ghalil: 1/135 dan 2/94.",
            "translation": "Maha Suci Engkau, ya Allah, aku memuji kepada-Mu. Aku bersaksi, bahwa tiada Tuhan yang haq di sembah selain Engkau, aku minta ampun dan bertaubat kepada-Mu"
          }
        ],
        "id": 9,
        "language": "id",
        "title": "Bacaan Setelah Wudhu'"
      },
      {
        "bookId": 1,
        "data": [
          {
            "arabic": " بِسْمِ اللهِ، تَوَكَّلْتُ عَلَى اللهِ، وَلاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللهِ",
            "audio": "",
            "notes": "",
            "source": "HR. Abu Dawud: 4/325, At-Tirmidzi: 5/490, dan lihat Shahih At-Tirmidzi: 3/151.",
            "translation": "Dengan nama Allah (aku keluar). Aku bertawakkal kepada-Nya, dan tiada daya dan kekuatan kecuali karena pertolongan Allah"
          },
          {
            "arabic": "اَللَّهُمَّ إِنِّيْ أَعُوْذُ بِكَ أَنْ أَضِلَّ، أَوْ أُضَلَّ، أَوْ أَزِلَّ، أَوْ أُزَلَّ، أَوْ أَظْلِمَ، أَوْ أُظْلَمَ، أَوْ أَجْهَلَ، أَوْ يُجْهَلَ عَلَيَّ",
            "audio": "",
            "notes": "",
            "source": "HR. Seluruh penyusun kitab Sunan, dan lihat Shahih At-Tirmidzi: 3/152 dan Shahih Ibnu Majah: 2/336.",
            "translation": "Ya Allah, sesungguhnya aku berlindung kepada-Mu, jangan sampai aku sesat atau disesatkan (setan atau orang yang berwatak setan), berbuat kesalahan atau disalahi, menganiaya atau dianiaya (orang), dan berbuat bodoh atau dibodohi"
          }
        ],
        "id": 10,
        "language": "id",
        "title": "Bacaan Ketika Keluar Rumah"
      },
      {
        "bookId": 1,
        "data": [
          {
            "arabic": " بِسْمِ اللهِ وَلَجْنَا، وَبِسْمِ اللهِ خَرَجْنَا، وَعَلَى رَبِّنَا تَوَكَّلْنَا، ثُمَّ لِيُسَلِّمْ عَلَى أَهْلِهِ",
            "audio": "",
            "notes": "",
            "source": "HR. Abu Dawud: 4/325, dan Al-‘Allamah Ibnu Baaz berpendapat, isnad hadits tersebut hasan dalam Tuhfatul Akhyar, no. 28. Dalam Kitab Shahih: “Apabila seseorang masuk rumahnya, lalu berdzikir kepada Allah ketika masuk rumah dan makan, syaitan berkata (kepada teman-temannya), \"Tiada tempat tinggal dan makanan bagi kalian (malam ini)’.” Muslim, no. 2018.",
            "translation": "Dengan nama Allah, kami masuk (ke rumah), dengan nama Allah, kami keluar (darinya) dan kepada Tuhan kami, kami bertawakkal”. Kemudian mengucapkan salam kepada keluarga-nya."
          }
        ],
        "id": 11,
        "language": "id",
        "title": "Bacaan Apabila Masuk Rumah"
      },
      {
        "bookId": 1,
        "data": [
          {
            "arabic": "اَللَّهُمَّ اجْعَلْ فِيْ قَلْبِيْ نُوْرًا، وَفِيْ لِسَانِيْ نُوْرًا، وَفِيْ سَمْعِيْ نُوْرًا، وَفِيْ بَصَرِيْ نُوْرًا، وَمِنْ فَوْقِيْ نُوْرًا، وَمِنْ تَحْتِيْ نُوْرًا، وَعَنْ يَمِيْنِيْ نُوْرًا، وَعَنْ شِمَالِيْ نُوْرًا، وَمِنْ أَمَامِيْ نُوْرًا، وَمِنْ خَلْفِيْ نُوْرًا، وَاجْعَلْ فِيْ نَفْسِيْ نُوْرًا، وَأَعْظِمْ لِيْ نُوْرًا، وَعَظِّمْ لِيْ نُوْرًا، وَاجْعَلْ لِيْ نُوْرًا، وَاجْعَلْنِيْ نُوْرًا، اَللَّهُمَّ أَعْطِنِيْ نُوْرًا، وَاجْعَلْ فِيْ عَصَبِيْ نُوْرًا، وَفِيْ لَحْمِيْ نُوْرًا، وَفِيْ دَمِيْ نُوْرًا، وَفِيْ شَعْرِيْ نُوْرًا، وَفِيْ بَشَرِيْ نُوْرًا",
            "audio": "",
            "notes": "",
            "source": "Bukhari: 11/116 no. 6316, dan Muslim: 1/526, 529, 530, no. 763.",
            "translation": "Ya Allah ciptakanlah cahaya di hatiku, cahaya di lidahku, cahaya di pendengaranku, cahaya di penglihatan-ku, cahaya dari atasku, cahaya dari bawahku, cahaya di sebelah kananku, cahaya di sebelah kiriku, cahaya dari depanku, dan cahaya dari belakangku. Ciptakanlah cahaya dalam diriku, perbesarlah cahaya untukku, agungkanlah cahaya untukku, berilah cahaya untuk-ku, dan jadikanlah aku sebagai cahaya. Ya Allah, berilah cahaya kepadaku, ciptakan cahaya pada urat sarafku, cahaya dalam dagingku, cahaya dalam darahku, cahaya di rambutku, dan cahaya di kulitku"
          },
          {
            "arabic": "اَللَّهُمَّ اجْعَلْ لِيْ نُوْرًا فِيْ قَبْرِيْ … ونُوْرًا فِيْ عِظَامِيْ",
            "audio": "",
            "notes": "",
            "source": "HR. At-Tirmidzi no.3419, 5/483.",
            "translation": "Ya Allah, ciptakan-lah cahaya untukku dalam kuburku … dan cahaya dalam tulangku"
          },
          {
            "arabic": "وَزِدْنِيْ نُوْرًا، وَزِدْنِيْ نُوْرًا، وَزِدْنِيْ نُوْرًا",
            "audio": "",
            "notes": "",
            "source": "HR. Bukhari dalam Al-Adab Al-Mufrad, no. 695, hal.258. Al-Albani menyatakan isnadnya shahih, dalam Shahih Al-Adab Al-Mufrad, no. 536.",
            "translation": "Tambahkanlah cahaya untukku, tambahkanlah cahaya untukku, tambahkanlah cahaya untuk-ku"
          },
          {
            "arabic": "وَهَبْ لِيْ نُوْرًا عَلَى نُوْرٍ",
            "audio": "",
            "notes": "",
            "source": "Lihat Fathul Bari: 11/118.",
            "translation": "dan karuniakanlah bagiku cahaya di atas cahaya"
          }
        ],
        "id": 12,
        "language": "id",
        "title": "Doa Pergi Ke Masjid"
      },
      {
        "bookId": 1,
        "data": [
          {
            "arabic": "أَعُوْذُ بِاللهِ الْعَظِيْمِ، وَبِوَجْهِهِ الْكَرِيْمِ، وَسُلْطَانِهِ الْقَدِيْمِ، مِنَ الشَّيْطَانِ الرَّجِيْمِ",
            "audio": "",
            "notes": "",
            "source": "HR. Abu Dawud, lihat Shahih Al-Jami’ no.4591",
            "translation": "Aku berlindung kepada Allah Yang Maha Agung, dengan wajah-Nya Yang Mulia dan kekuasaan-Nya yang abadi, dari setan yang terkutuk."
          },
          {
            "arabic": "بِسْمِ اللهِ، وَالصَّلاَةُ وَالسَّلاَمُ عَلَى رَسُوْلِ اللهِ اَللَّهُمَّ افْتَحْ لِيْ أَبْوَابَ رَحْمَتِكَ",
            "audio": "",
            "notes": "",
            "source": "HR. Ibnu As-Sunni no.88, dinyatakan Al-Albani “hasan”, HR. Abu Dawud, lihat Shahih Al-Jami’ 1/528.",
            "translation": "Dengan nama Allah dan semoga shalawat dan salam tercurahkan kepada Rasulullah"
          },
          {
            "arabic": "اَللَّهُمَّ افْتَحْ لِيْ أَبْوَابَ رَحْمَتِكَ",
            "audio": "",
            "notes": "",
            "source": "HR. Muslim: 1/494.",
            "translation": "Ya Allah, bukalah pintu-pintu rahmat-Mu untukku."
          }
        ],
        "id": 13,
        "language": "id",
        "title": "Doa Masuk Masjid"
      },
      {
        "bookId": 1,
        "data": [
          {
            "arabic": "بِسْمِ اللهِ وَالصَّلاَةُ وَالسَّلاَمُ عَلَى رَسُوْلِ اللهِ، اَللَّهُمَّ إِنِّيْ أَسْأَلُكَ مِنْ فَضْلِكَ، اَللَّهُمَّ اعْصِمْنِيْ مِنَ الشَّيْطَانِ الرَّجِيْمِ",
            "audio": "",
            "notes": "",
            "source": "HR. Muslim: 713",
            "translation": "Dengan nama Allah, semoga shalawat dan salam terlimpahkan kepada Rasulullah. Ya Allah, sesungguhnya aku minta kepada-Mu dari karunia-Mu. Ya Allah, peliharalah aku dari godaan setan yang terkutuk"
          }
        ],
        "id": 14,
        "language": "id",
        "title": "Doa Keluar Dari Masjid"
      },
      {
        "bookId": 1,
        "data": [
          {
            "arabic": "لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللهِ",
            "audio": "",
            "notes": "Dibaca saat muadzin membaca Hayya'alashalah dan Hayya'alalfalah",
            "source": "HR. Bukhari: 1/152, Muslim: 1/288.",
            "translation": "Tidak ada daya dan kekuatan kecuali dengan pertolongan Allah"
          },
          {
            "arabic": "وَأَنَا أَشْهَدُ أَنْ لاَ إِلَـهَ إِلاَّ اللهُ وَحْدَهُ لاَ شَرِيْكَ لَهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُوْلُهُ، رَضِيْتُ بِاللهِ رَبًّا، وَبِمُحَمَّدٍ رَسُوْلاً، وَبِاْلإِسْلاَمِ دِيْنًا",
            "audio": "",
            "notes": "Dibaca setelah muadzin membaca syahadat",
            "source": "HR. Bukhari: 1/152 dan Muslim: 1/288. HR. Ibnu Khuzaimah: 1/220.",
            "translation": "Aku bersaksi, bahwa tiada Tuhan yang haq selain Allah, Yang Maha Esa, tidak ada sekutu bagi-Nya dan sesungguhnya Muhammad adalah hamba dan utusan-Nya. Aku rela Allah sebagai Tuhanku, Muhammad sebagai Rasul dan Islam sebagai agama (yang benar)."
          }
        ],
        "id": 15,
        "language": "id",
        "title": "Bacaan Ketika Mendengarkan Adzan"
      },
      {
        "bookId": 1,
        "data": [
          {
            "arabic": "اَللَّهُمَّ رَبَّ هَذِهِ الدَّعْوَةِ التَّامَّةِ، وَالصَّلاَةِ الْقَائِمَةِ، آتِ مُحَمَّدًا الْوَسِيْلَةَ وَالْفَضِيْلَةَ، وَابْعَثْهُ مَقَامًا مَحْمُوْدًا الَّذِيْ وَعَدْتَهُ",
            "audio": "",
            "notes": "",
            "source": "HR. Bukhari: 1/152",
            "translation": "Ya Allah, Tuhan Pemilik panggilan yang sempurna (adzan) ini dan shalat (wajib) yang didirikan. Berilah Al-Wasilah (derajat di Surga, yang tidak akan diberikan selain kepada Nabi ﷺ) dan fadhilah kepada Muhammad. Dan bangkitkanlah beliau sehingga bisa menempati maqam terpuji yang telah Engkau janjikan."
          },
          {
            "arabic": "",
            "audio": "",
            "notes": "Berdo’a untuk diri sendiri antara adzan dan iqamah, sebab do’ pada waktu itu dikabulkan.",
            "source": "HR. At-Tirmidzi, Abu Dawud dan Ahmad. Lihat Irwa’ul Ghalil: 1/262.",
            "translation": ""
          }
        ],
        "id": 16,
        "language": "id",
        "title": "Doa Setelah Mendengarkan Adzan"
      },
      {
        "bookId": 1,
        "data": [
          {
            "arabic": "اَللَّهُمَّ بَاعِدْ بَيْنِيْ وَبَيْنَ خَطَايَايَ كَمَا بَاعَدْتَ بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ، اَللَّهُمَّ نَقِّنِيْ مِنْ خَطَايَايَ، كَمَا يُنَقَّى الثَّوْبُ اْلأَبْيَضُ مِنَ الدَّنَسِ، اَللَّهُمَّ اغْسِلْنِيْ مِنْ خَطَايَايَ بِالثَّلْجِ وَالْمَاءِ وَالْبَرَدِ",
            "audio": "",
            "notes": "(1)\nBaca salah satu",
            "source": "HR. Bukhari:1/181 dan Muslim: 1/419.",
            "translation": "Ya Allah, jauhkan antara aku dan kesalahan-kesalahanku, sebagaimana Engkau menjauhkan antara timur dan barat. Ya Allah, bersihkanlah aku dan kesalahan-kesalahanku, sebagaimana baju putih dibersihkan dari kotoran. Ya Allah, cucilah aku dari kesalahan-kesalahanku dengan, es, air dan salju"
          },
          {
            "arabic": "سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ، وَتَبَارَكَ اسْمُكَ، وَتَعَالَى جَدُّكَ، وَلاَ إِلَـهَ غَيْرُكَ",
            "audio": "",
            "notes": "(2)\nBaca salah satu",
            "source": "HR. Empat penyusun kitab Sunan, dan lihat Shahih At-Tirmidzi: 1/77 dan Shahih Ibnu Majah: 1/135.",
            "translation": "Maha Suci Engkau ya Allah, aku memuji-Mu, Maha Berkah akan nama-Mu, Maha Tinggi kekayaan dan kebesaran-Mu, tiada Ilah yang berhak disembah selain Engkau."
          },
          {
            "arabic": "وَجَّهْتُ وَجْهِيَ لِلَّذِيْ فَطَرَ السَّمَاوَاتِ وَاْلأَرْضَ حَنِيْفًا وَمَا أَنَا مِنَ الْمُشْرِكِيْنَ، إِنَّ صَلاَتِيْ، وَنُسُكِيْ، وَمَحْيَايَ، وَمَمَاتِيْ لِلَّهِ رَبِّ الْعَالَمِيْنَ، لاَ شَرِيْكَ لَهُ وَبِذَلِكَ أُمِرْتُ وَأَنَا مِنَ الْمُسْلِمِيْنَ. اَللَّهُمَّ أَنْتَ الْمَلِكُ   لاَ إِلَـهَ إِلاَّ أَنْتَ. أَنْتَ رَبِّيْ وَأَنَا عَبْدُكَ، ظَلَمْتُ نَفْسِيْ وَاعْتَرَفْتُ بِذَنْبِيْ فَاغْفِرْلِيْ ذُنُوْبِيْ جَمِيْعًا إِنَّهُ لاَ يَغْفِرُ الذُّنُوْبَ إِلاَّ أَنْتَ. وَاهْدِنِيْ لأَحْسَنِ اْلأَخْلاَقِ لاَ يَهْدِيْ لأَحْسَنِهَا إِلاَّ أَنْتَ، وَاصْرِفْ عَنِّيْ سَيِّئَهَا، لاَ يَصْرِفُ عَنِّيْ سَيِّئَهَا إِلاَّ أَنْتَ، لَبَّيْكَ وَسَعْدَيْكَ، وَالْخَيْرُ كُلُّهُ بِيَدَيْكَ، وَالشَّرُّ لَيْسَ إِلَيْكَ، أَنَا بِكَ وَإِلَيْكَ، تَبَارَكْتَ وَتَعَالَيْتَ، أَسْتَغْفِرُكَ وَأَتُوْبُ إِلَيْكَ",
            "audio": "",
            "notes": "(3)\nBaca salah satu",
            "source": "HR. Muslim: 1/534.",
            "translation": "Aku menghadap kepada Tuhan Pencipta langit dan bumi, dengan memegang agama yang lurus dan aku tidak tergolong orang-orang yang musyrik. Sesungguhnya shalat, ibadah dan hidup serta matiku adalah untuk Allah. Tuhan seru sekalian alam, tiada sekutu bagi-Nya, dan karena itu, aku diperintah dan aku termasuk orang-orang muslim. Ya Allah, Engkau adalah Raja, tiada Tuhan (yang berhak disembah) kecuali Engkau, engkau Tuhanku dan aku adalah hamba-Mu. Aku menganiaya diriku, aku mengakui dosaku (yang telah kulakukan). Oleh karena itu, ampunilah seluruh dosaku, sesungguhnya tidak akan ada yang mengampuni dosa-dosa, kecuali Engkau. Tunjukkan aku pada akhlak yang terbaik, tidak akan menunjukkan kepadanya kecuali Engkau. Hindarkan aku dari akhlak yang jahat, tidak akan ada yang bisa menjauhkan aku daripadanya, kecuali Engkau. Aku penuhi panggilan-Mu dengan kegembiraan, seluruh kebaikan di kedua tangan-Mu, kejelekan tidak dinisbahkan kepada-Mu. Aku hidup dengan pertolongan dan rahmat-Mu, dan kepada-Mu (aku kembali). Maha Suci Engkau dan Maha Tinggi. Aku minta ampun dan bertaubat kepada-Mu"
          },
          {
            "arabic": "اَللَّهُمَّ رَبَّ جِبْرَائِيْلَ، وَمِيْكَائِيْلَ، وَإِسْرَافِيْلَ فَاطِرَ السَّمَاوَاتِ وَاْلأَرْضِ، عَالِمَ الْغَيْبِ وَالشَّهَادَةِ، أَنْتَ تَحْكُمُ بَيْنَ عِبَادِكَ فِيْمَا كَانُوْا فِيْهِ يَخْتَلِفُوْنَ. اِهْدِنِيْ لِمَا اخْتُلِفَ فِيْهِ مِنَ الْحَقِّ بِإِذْنِكَ تَهْدِيْ مَنْ تَشَاءُ إِلَى صِرَاطٍ مُسْتَقِيْمٍ",
            "audio": "",
            "notes": "(4)\nBaca salah satu",
            "source": "HR. Muslim: 1/534.",
            "translation": "Ya Allah, Tuhan Jibrail, Mikail dan Israfil. Wahai Pencipta langit dan bumi. Wahai Tuhan yang mengetahui yang ghaib dan nyata. Engkau yang menjatuhkan hukum (untuk memutuskan) apa yang mereka (orang-orang Nasrani dan Yahudi) perselisihkan. Tunjukkanlah aku pada kebenaran apa yang dipertentangkan dengan seizin dari-Mu. Sesungguhnya Engkau menunjukkan pada jalan yang lurus bagi orang yang Engkau kehendaki"
          }
        ],
        "id": 17,
        "language": "id",
        "title": "Doa Isftitah"
      },
      {
        "bookId": 1,
        "data": [
          {
            "arabic": " اَللَّهُمَّ لَكَ الْحَمْدُ أَنْتَ نُوْرُ السَّمَاوَاتِ وَاْلأَرْضِ وَمَنْ فِيْهِنَّ، وَلَكَ الْحَمْدُ أَنْتَ قَيِّمُ السَّمَاوَاتِ وَاْلأَرْضِ وَمَنْ فِيْهِنَّ، وَلَكَ الْحَمْدُ أَنْتَ رَبُّ السَّمَاوَاتِ وَاْلأَرْضِ وَمَنْ فِيْهِنَّ, وَلَكَ الْحَمْدُ لَكَ مُلْكُ السَّمَاوَاتِ وَاْلأَرْضِ وَمَنْ فِيْهِنَّ, وَلَكَ الْحَمْدُ أَنْتَ مَلِكُ السَّمَاوَاتِ وَاْلأَرْضِ, وَلَكَ الْحَمْدُ, أَنْتَ الْحَقُّ، وَوَعْدُكَ الْحَقُّ، وَقَوْلُكَ الْحَقُّ، وَلِقَاؤُكَ الْحَقُّ، وَالْجَنَّهُ حَقٌّ، وَالنَّارُ حَقٌّ، وَالنَّبِيُّوْنَ حَقٌّ، وَمُحَمَّدٌ ﷺ حَقٌّ، وَالسَّاعَةُ حَقٌّ, اَللَّهُمَّ لَكَ أَسْلَمْتُ، وَعَلَيْكَ تَوَكَّلْتُ، وَبِكَ آمَنْتُ، وَإِلَيْكَ أَنَبْتُ، وَبِكَ خَاصَمْتُ، وَإِلَيْكَ حَاكَمْتُ. فَاغْفِرْ لِيْ مَا قَدَّمْتُ وَمَا أَخَّرْتُ، وَمَا أَسْرَرْتُ وَمَا أَعْلَنْتُ, أَنْتَ الْمُقَدِّمُ وَأَنْتَ الْمُؤَخِّرُ، لاَ إِلَـهَ إِلاَّ أَنْتَ, أَنْتَ إِلَـهِيْ لاَ إِلَـهَ إِلاَّ أَنْتَ",
            "audio": "",
            "notes": "",
            "source": "HR. Al-Bukhari dalam Fathul Bari 3/3, 11/116, 13/371, 423, 465 dan Muslim meriwayatkannya dengan ringkas 1/532.",
            "translation": "Ya, Allah! Bagi-Mu segala puji, Engkau cahaya langit dan bumi serta seisinya. Bagi-Mu segala puji, Engkau yang mengurusi langit dan bumi serta seisinya. Bagi-Mu segala puji, Engkau Tuhan yang menguasai langit dan bumi serta seisinya. Bagi-Mu segala puji dan bagi-Mu kerajaan langit dan bumi serta seisi-nya. Bagi-Mu segala puji, Engkau benar, janji-Mu benar, firman-Mu benar, bertemu dengan-Mu benar, Surga adalah benar (ada), Neraka adalah benar (ada), (terutusnya) para nabi adalah benar, (terutusnya) Muhammad adalah benar (dari-Mu), peristiwa hari kiamat adalah benar. Ya Allah, kepada-Mu aku pasrah, kepada-Mu aku bertawakal, kepada-Mu aku beriman, kepada-Mu aku kembali (bertaubat), dengan pertolongan-Mu aku berdebat (kepada orang-orang kafir), kepada-Mu (dan dengan ajaran-Mu) aku menjatuhkan hukum. Oleh karena itu, ampunilah dosaku yang telah lalu dan yang akan datang. Engkaulah yang mendahulukan dan mengakhirkan, tiada Tuhan yang hak disembah kecuali Engkau, Engkau adalah Tuhanku, tidak ada Tuhan yang hak disembah kecuali Engkau"
          }
        ],
        "id": 18,
        "language": "id",
        "title": "Doa Isftitah Saat Tahajjud"
      },
      {
        "bookId": 1,
        "data": [
          {
            "arabic": "سُبْحَانَ رَبِّيَ الْعَظِيْمِ",
            "audio": "",
            "notes": "(1)\nBaca salah satu\nBaca 3x",
            "source": "HR. Penyusun kitab Sunan dan Imam Ahmad, lihat Shahih At-Tirmidzi:1/83.",
            "translation": "Maha Suci Tuhanku yang Maha Agung"
          },
          {
            "arabic": "سُبْحَانَكَ اللَّهُمَّ رَبَّنَا وَبِحَمْدِكَ اللَّهُمَّ اغْفِرْ لِيْ",
            "audio": "",
            "notes": "(2)\nBaca salah satu",
            "source": "HR. Bukhari: 1/99 dan Muslim: 1/350.",
            "translation": "Maha Suci Engkau, ya Allah! Tuhan-ku, dan dengan pujianku pada-Mu. Ya Allah! Ampuni-lah dosaku."
          },
          {
            "arabic": " سُبْحَانَ ذِي الْجَبَرُوْتِ وَاْلمَلَكُوْتِ وَالْكِبْرِيَاءِ وَالْعَظَمَةِ",
            "audio": "",
            "notes": "(3)\nBaca salah satu",
            "source": "HR. Abu Dawud: 1/230, An-Nasai dan Ahmad. Dan sanadnya hasan.",
            "translation": "Maha Suci (Allah) Yang memiliki Keperkasaan, Kerajaan, Kebesaran dan Keagungan."
          },
          {
            "arabic": " سُبُّوْحٌ قُدُّوْسٌ، رَبُّ الْمَلاَئِكَةِ وَالرُّوْحِ",
            "audio": "",
            "notes": "(4)\nBaca salah satu",
            "source": "HR. Muslim: 1/353 dan Abu Dawud: 1/230.",
            "translation": "Engkau, Tuhan Yang Maha Suci (dari kekurangan dan hal yang tidak layak bagi kebesaran-Mu), Maha Agung, Tuhan para malaikat dan Jibril."
          }
        ],
        "id": 19,
        "language": "id",
        "title": "Doa Ruku'"
      },
      {
        "bookId": 1,
        "data": [
          {
            "arabic": "سَمِعَ اللهُ لِمَنْ حَمِدَهُ",
            "audio": "",
            "notes": "",
            "source": "HR. Bukhari dalam Fathul Bari: 2/282.",
            "translation": "Semoga Allah mendengar pujian orang yang memuji-Nya."
          }
        ],
        "id": 20,
        "language": "id",
        "title": "Doa Bangun Dari Ruku'"
      },
      {
        "bookId": 1,
        "data": [
          {
            "arabic": " رَبَّنَا وَلَكَ الْحَمْدُ، حَمْدًا كَثِيْرًا طَيِّبًا مُبَارَكًا فِيْهِ",
            "audio": "",
            "notes": "",
            "source": "HR. Bukhari dalam Fathul Bari: 2/284.",
            "translation": "Wahai Tuhan kami, bagi-Mu segala puji, aku memuji-Mu dengan pujian yang banyak, yang baik dan penuh dengan berkah."
          },
          {
            "arabic": "مِلْءَ السَّمَاوَاتِ وَمِلْءَ اْلأَرْضِ وَمَا بَيْنَهُمَا، وَمِلْءَ مَا شِئْتَ  مِنْ شَيْءٍ بَعْدُ. أَهْلَ الثَّنَاءِ وَالْمَجْدِ، أَحَقُّ مَا قَالَ الْعَبْدُ، وَكُلُّنَا لَكَ عَبْدٌ. اَللَّهُمَّ لاَ مَانِعَ لِمَا أَعْطَيْتَ، وَلاَ مُعْطِيَ لِمَا مَنَعْتَ، وَلاَ يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ",
            "audio": "",
            "notes": "",
            "source": "HR. Muslim: 1/346.",
            "translation": "(Aku memuji-Mu dengan) pujian sepenuh langit dan sepenuh bumi, sepenuh apa yang di antara keduanya, sepenuh apa yang Engkau kehendaki setelah itu. Wahai Tuhan yang layak dipuji dan diagungkan, Yang paling berhak dikatakan oleh seorang hamba dan kami seluruhnya adalah hamba-Mu. Ya Allah tidak ada yang dapat menghalangi apa yang Engkau berikan dan tidak ada pula yang dapat memberi apa yang Engkau halangi, tidak bermanfaat kekayaan bagi orang yang memilikinya (kecuali iman dan amal shalihnya), hanya dari-Mu kekayaan itu"
          }
        ],
        "id": 21,
        "language": "id",
        "title": "Doa I'tidal"
      },
      {
        "bookId": 1,
        "data": [
          {
            "arabic": " سُبْحَانَ رَبِّيَ اْلأَعْلَى",
            "audio": "",
            "notes": "(1)\nBaca salah satu\nBaca 3x",
            "source": "HR. Para penyusun kitab Sunan dan Imam Ahmad. Lihat Shahih At-Tirmidzi: 1/83.",
            "translation": "Maha Suci Tuhanku, Yang Maha Tinggi (dari segala kekurangan dan hal yang tidak layak)"
          },
          {
            "arabic": " سُبْحَانَكَ اللَّهُمَّ رَبَّنَا وَبِحَمْدِكَ اللَّهُمَّ اغْفِرْ لِيْ",
            "audio": "",
            "notes": "(2)\nBaca salah satu",
            "source": "HR. Bukhari dan Muslim, lihat Bab Do’a Ruku’.",
            "translation": "Maha Suci Engkau. Ya Allah, Tuhan kami, aku memuji-Mu. Ya Allah, ampunilah dosaku."
          },
          {
            "arabic": " سُبُّوْحٌ قُدُّوْسٌ رَبُّ الْمَلاَئِكَةِ وَالرُّوْحِ",
            "audio": "",
            "notes": "(3)\nBaca salah satu",
            "source": "HR. Muslim: 1/533, lihat no. 35.",
            "translation": "Engkau Tuhan Yang Maha Suci, Maha Agung, Tuhan para malaikat dan Jibril."
          }
        ],
        "id": 22,
        "language": "id",
        "title": "Doa Sujud"
      },
      {
        "bookId": 1,
        "data": [
          {
            "arabic": " رَبِّ اغْفِرْ لِيْ رَبِّ اغْفِرْ لِيْ",
            "audio": "",
            "notes": "(1)\nBaca salah satu",
            "source": "HR. Abu Dawud: 1/231, lihat Shahih Ibnu Majah: 1/148.",
            "translation": "Wahai Tuhanku, ampunilah dosaku, wahai Tuhanku, ampunilah dosaku."
          },
          {
            "arabic": "اَللَّهُمَّ اغْفِرْ لِيْ وَارْحَمْنِيْ وَاهْدِنِيْ وَاجْبُرْنِيْ وَعَافِنِيْ وَارْزُقْنِيْ وَارْفَعْنِي",
            "audio": "",
            "notes": "(2)\nBaca salah satu",
            "source": "HR. Ashhabus Sunan, kecuali An-Nasai. Lihat Shahih At-Tirmidzi: 1/90 dan Shahih Ibnu Majah: 1/148.",
            "translation": "Ya Allah, ampunilah dosaku, berilah rahmat kepadaku, tunjukilah aku (ke jalan yang benar), cukupkanlah aku, selamatkan aku (tubuh sehat dan keluarga terhindar dari musibah), berilah aku rezki (yang halal) dan angkatlah derajatku."
          }
        ],
        "id": 23,
        "language": "id",
        "title": "Doa Duduk Antara Dua Sujud"
      },
      {
        "bookId": 1,
        "data": [
          {
            "arabic": "سَجَدَ وَجْهِيَ لِلَّذِيْ خَلَقَهُ وَصَوَّرَهُ وَشَقَّ سَمْعَهُ وَبَصَرَهُ، فَتَبَارَكَ اللهُ أَحْسَنُ الْخَالِقِيْنَ",
            "audio": "",
            "notes": "",
            "source": "HR. At-Tirmidzi: 2/474. Ahmad: 6/30 dan Al-Hakim. Menurut Al-Hakim, hadits tersebut shahih. Imam Adz-Dzahabi menyetujuinya 1/220. Sedang tambahannya: Fatabaarakallahu menurut riwayat Adz-Dzahabi sendiri.",
            "translation": "Bersujud wajahku kepada Tuhan yang menciptakannya, yang membelah pendengaran dan penglihatannya dengan Daya dan Kekuatan-Nya, Maha Suci Allah sebaik-baik Pencipta"
          },
          {
            "arabic": "اَللَّهُمَّ اكْتُبْ لِيْ بِهَا عِنْدَكَ أَجْرًا، وَضَعْ عَنِّيْ بِهَا وِزْرًا، وَاجْعَلْهَا لِيْ عِنْدَكَ ذُخْرًا، وَتَقَبَّلْهَا مِنِّيْ كَمَا تَقَبَّلْتَهَا مِنْ عَبْدِكَ دَاوُدَ",
            "audio": "",
            "notes": "",
            "source": "HR. At-Tirmidzi: 2/473, dan Al-Hakim. Menurut Al-Hakim, hadits tersebut shahih. Dan Adz-Dzahabi menyetujuinya: 1/219.",
            "translation": "Ya Allah, tulislah untukku dengan sujudku pahala di sisi-Mu dan ampunilah dengannya akan dosaku, serta jadikanlah simpanan untukku di sisi-Mu dan terimalah sujudku sebagaimana Engkau telah menerimanya dari hamba-Mu Dawud"
          }
        ],
        "id": 24,
        "language": "id",
        "title": "Doa Sujud Tilawah"
      },
      {
        "bookId": 1,
        "data": [
          {
            "arabic": " التَّحِيَّاتُ لِلَّهِ، وَالصَّلَوَاتُ وَالطَّيِّبَاتُ، السَّلاَمُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللهِ وَبَرَكَاتُهُ، السَّلاَمُ عَلَيْنَا وَعَلَى عِبَادِ اللهِ الصَّالِحِيْنَ. أَشْهَدُ أَنْ لاَ إِلَـهَ إِلاَّ اللهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُوْلُهُ",
            "audio": "",
            "notes": "",
            "source": "HR. Bukhari dalam Fathul Baari: 1/13 dan Imam Muslim: 1/301.",
            "translation": "Segala penghormatan hanya milik Allah, juga segala pengagungan dan kebaikan. Semoga kesejahteraan terlimpahkan kepadamu, wahai Nabi, begitu juga rahmat dan berkah-Nya. Kesejahteraan semoga terlimpahkan kepada kita dan hamba-hamba Allah yang shalih. Aku bersaksi bahwa tiada Tuhan yang hak disembah selain Allah dan aku bersaksi bahwa Muhammad adalah hamba dan utusan-Nya."
          }
        ],
        "id": 25,
        "language": "id",
        "title": "Doa Tasyahud"
      },
      {
        "bookId": 1,
        "data": [
          {
            "arabic": "اَللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيْمَ وَعَلَى آلِ إِبْرَاهِيْمَ إِنَّكَ حَمِيْدٌ مَجِيْدٌ، اَللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إِبْرَاهِيْمَ وَعَلَى آلِ إِبْرَاهِيْمَ إِنَّكَ حَمِيْدٌ مَجِيْدٌ",
            "audio": "",
            "notes": "(1)\nBaca salah satu",
            "source": "HR. Bukhari dalam Fathul Baari: 6/408.",
            "translation": "Ya Allah, berilah rahmat kepada Muhammad dan keluarganya, sebagaimana Engkau telah memberikan rahmat kepada Ibrahim dan keluarganya. Sesungguhnya Engkau Maha Terpuji dan Maha Agung. Berilah berkah kepada Muhammad dan keluarganya (termasuk anak dan istri atau umatnya), sebagaimana Engkau telah memberi berkah kepada Ibrahim dan keluarganya. Sesungguhnya Engkau Maha Terpuji dan Maha Agung."
          },
          {
            "arabic": " اَللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى أَزْوَاجِهِ وَذُرِّيَّتِهِ، كَمَا صَلَّيْتَ عَلَى آلِ إِبْرَاهِيْمَ. وَبَارِكْ عَلَى مُحَمَّدٍ وَعَلَى أَزْوَاجِهِ وَذُرِّيَّتِهِ، كَمَا بَارَكْتَ عَلَى آلِ إِبْرَاهِيْمَ إِنَّكَ حَمِيْدٌ مَجِيْدٌ",
            "audio": "",
            "notes": "(2)\nBaca salah satu",
            "source": "HR. Bukhari dalam Fathul Baari: 6/407 dan Imam Muslim meriwayatkannya dalam kitabnya: 1/306. Lafazh hadits tersebut menurut riwayat Muslim.",
            "translation": "Ya Allah, berilah rahmat kepada Muhammad, istri-istri dan keturunannya,sebagaimanaEngkau telah memberikan rahmat kepada keluarga Ibrahim. Berilah berkah kepada Muhammad, istri-istri dan keturunannya,sebagaimana engkau telah memberkahi kepada keluarga Ibrahim.Sesungguhnya Engkau Maha Terpuji dan Maha Agung."
          }
        ],
        "id": 26,
        "language": "id",
        "title": "Shalawat Setelah Tasyahud"
      },
      {
        "bookId": 1,
        "data": [
          {
            "arabic": " اَللَّهُمَّ إِنِّيْ أَعُوْذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، وَمِنْ عَذَابِ جَهَنَّمَ، وَمِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ، وَمِنْ شَرِّ فِتْنَةِ الْمَسِيْحِ الدَّجَّالِ",
            "audio": "",
            "notes": "(1)\nBaca salah satu",
            "source": "HR. Bukhari: 2/102 dan Muslim: 1/412. Lafadz hadits ini dalam riwayat Muslim.",
            "translation": "Ya Allah, Sesungguhnya aku berlindung kepada-Mu dari siksa kubur, siksa neraka Jahanam, fitnah kehidupan dan setelah mati, serta dari kejahatan fitnah Almasih Dajjal."
          },
          {
            "arabic": " اَللَّهُمَّ إِنِّيْ أَعُوْذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، وَأَعُوْذُ بِكَ مِنْ فِتْنَةِ الْمَسِيْحِ الدَّجَّالِ، وَأَعُوْذُ بِكَ مِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ. اَللَّهُمَّ إِنِّيْ أَعُوْذُ بِكَ مِنْ الْمَأْثَمِ وَالْمَغْرَمِ",
            "audio": "",
            "notes": "(2)\nBaca salah satu",
            "source": "HR. Bukhari: 1/202,Muslim: 1/412.",
            "translation": "Ya Allah! Sesungguhnya aku berlindung kepada-Mu dari siksa kubur. Aku berlindung kepada-Mu dari fitnah Almasih Dajjal. Aku berlindung kepada-Mu dari fitnah kehidupan dan sesudah mati. Ya Allah, Sesungguhnya aku berlindung kepada-Mu dari perbuatan dosa dan kerugian."
          },
          {
            "arabic": "اَللَّهُمَّ إِنِّيْ ظَلَمْتُ نَفْسِيْ ظُلْمًا كَثِيْرًا، وَلاَ يَغْفِرُ الذُّنُوْبَ إِلاَّ أَنْتَ، فَاغْفِرْ لِيْ مَغْفِرَةً مِنْ عِنْدِكَ وَارْحَمْنِيْ إِنَّكَ أَنْتَ الْغَفُوْرُ الرَّحِيْمُ",
            "audio": "",
            "notes": "(3)\nBaca salah satu",
            "source": "HR. Bukhari: 8/168 dan Muslim: 4/2078.",
            "translation": "Ya Allah! Sesungguhnya aku banyak menganiaya diriku, dan tidak ada yang mengampuni dosa-dosa kecuali Engkau. Oleh karena itu, ampunilah dosa-dosaku dan berilah rahmat kepadaku. Sesungguhnya Engkau Maha Pengampun dan Maha Penyayang."
          },
          {
            "arabic": " اَللَّهُمَّ إِنِّيْ أَسْأَلُكَ يَا اَللهُ بِأَنَّكَ الْوَاحِدُ اْلأَحَدُ الصَّمَدُ الَّذِيْ لَمْ يَلِدْ وَلَمْ يُوْلَدْ وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ، أَنْ تَغْفِرَ لِيْ ذُنُوْبِيْ إِنَّكَ أَنْتَ الْغَفُوْرُ الرَّحِيْمُ",
            "audio": "",
            "notes": "(4)\nBaca salah satu",
            "source": "HR. An-Nasai, lafadz hadits menurut riwayatnya: 3/52 dan Ahmad: 4/338. Dinyatakan Al-Albani shahih dalam Shahih An-Nasai: 1/280.",
            "translation": "Ya Allah! Sesungguhnya aku mohon kepada-Mu, ya Allah! Dengan bersaksi bahwa Engkau adalah Tuhan Yang Maha Esa, Maha Tunggal tidak membutuhkan sesuatu, tapi segala sesuatu butuh kepada-Mu, tidak beranak dan tidak diperanakkan, tidak ada seorang pun yang menyamai-Mu, aku mohon kepada-Mu agar mengampuni dosa-dosaku. Sesungguhnya Engkau Maha Pengampun dan Maha Penyayang."
          },
          {
            "arabic": " اَللَّهُمَّ إِنِّيْ أَسْأَلُكَ بِأَنَّ لَكَ الْحَمْدَ لاَ إِلَـهَ إِلاَّ أَنْتَ وَحْدَكَ لاَ شَرِيْكَ لَكَ، الْمَنَّانُ، يَا بَدِيْعَ السَّمَاوَاتِ وَاْلأَرْضِ يَا ذَا الْجَلاَلِ وَاْلإِكْرَامِ، يَا حَيُّ يَا قَيُّوْمُ إِنِّيْ أَسْأَلُكَ الْجَنَّةَ وَأَعُوْذُ بِكَ مِنَ النَّارِ",
            "audio": "",
            "notes": "(5)\nBaca salah satu",
            "source": "HR. Seluruh penyusun As-Sunan. Lihat Shahih Ibnu Majah: 2/329.",
            "translation": "Ya Allah! Aku mohon kepada-Mu. Sesungguhnya bagi-Mu segala pujian, tiada Tuhan (yang hak disembah) kecuali Engkau Yang Maha Esa, tiada sekutu bagi-Mu, Maha Pemberi nikmat, Pencipta langit dan bumi tanpa contoh sebelumnya. Wahai Tuhan Yang Maha Agung dan Maha Pemurah, wahai Tuhan Yang Hidup, wahai Tuhan yang mengurusi segala sesuatu, sesungguhnya aku mohon kepada-Mu agar dimasukkan ke Surga dan aku berlindung kepada-Mu dari siksa Neraka."
          }
        ],
        "id": 27,
        "language": "id",
        "title": "Doa Setelah Tasyahud Akhir Sebelum Salam"
      },
      {
        "bookId": 1,
        "data": [
          {
            "arabic": " لاَ إِلَهَ إِلاَّ اللهُ الْوَاحِدُ القَهَّارُ، رَبُّ السَّمَوَاتِ وَاْلأَرْضِ وَمَا بَيْنَهُمَا الْعَزِيْزُ الْغَفَّارُ",
            "audio": "",
            "notes": "Dibaca jika membolak-balikkan tubuh pada malam hari.",
            "source": "Riwayat Hakim, dishahihkannya dan disetujui oleh Adz Dzahabi 1/540, An Nasa’i dalam ‘Amalulyaumi wallailati, Ibnu Sunni. Lihat Shahihul Jami’: 4/213.",
            "translation": "Tiada Tuhan yang berhak disembah selain Allah, Yang Maha Esa, Yang Maha Perkasa, Tuhan langit dan bumi dan di antara keduanya, yang Maha Mulia lagi Maha Pengampun"
          }
        ],
        "id": 28,
        "language": "id",
        "title": "Doa Jika Terbangun Pada Malam Hari"
      },
      {
        "bookId": 1,
        "data": [
          {
            "arabic": " أَعُوْذُ بِكَلِمَاتِ اللهِ التَّامّاتِ مِنْ غَضَبِهِ وَعِقَابِهِ، وَشَرِّ عِبَادِهِ، وَمِنْ هَمَزَاتِ الشَّيَاطِيْنِ وَأَنْ يَحْضُرُوْنَ",
            "audio": "",
            "notes": "",
            "source": "HR. Abu Dawud: 4/12. Shahih Tirmidzi: 3/171.",
            "translation": "Aku berlindung dengan kalimat Allah yang sempurna dari kemarahan, siksaan dan kejahatan hamba-hamba-Nya dan dari godaan setan serta jangan sampai setan mendatangiku"
          }
        ],
        "id": 29,
        "language": "id",
        "title": "Doa Apabila Ada Yang Menakutkan Dalam Tidur"
      },
      {
        "bookId": 1,
        "data": [
          {
            "arabic": " اللَّهُمَّ اهْدِنِي فِيْمَنْ هَدَيْتَ، وَعَافِنِي فِيْمَنِ عَافَيْتَ، وَتَوَلَّنِي فِيْمَنْ تَوَلَّيْتَ، وَبَارِكْ لِي فِيْمَا أَعْطَيْتَ، وَقِنِي شَرَّ مَا قَضَيْتَ، فَإِنَّكَ تَقْضِي وَلاَ يُقْضَى عَلَيْكَ، إِنَّهُ لاَ يَذِلُّ مَنْ وَالَيْتَ، (وَلاَ يَعِزُّ مَنْ عَادَيْتَ) تَبَارَكْتَ رَبَّنَا وَتَعَالَيْتَ",
            "audio": "",
            "notes": "",
            "source": "Ashhabussunan, Ahmad Darimi, Hakim dan Baihaqi. Di antara dua kurung menurut riwayat Baihaqi. Lihat Shahih Tirmidzi 1/144, Shahih Ibnu Majah: 1/194 dan Irwa’ulghalil oleh Al Albani: 2/172.",
            "translation": "Ya Allah, berilah aku petunjuk sebagaimana orang-orang yang Engkau beri petunjuk, berilah aku perlindungan (dari penyakit) sebagaimana orang yang telah Engkau lindungi, uruslah aku sebagaimana  orang yang telah Engkau urus. Berilah berkah apa yang Engkau berikan kepadaku, jauhkan aku dari kejelekan apa yang Engkau tetapkan. Sesungguhnya Engkau yang menjatuhkan qadha’ (ketetapan), dan tidak ada orang yang memberikan hukuman kepada-Mu. Sesungguhnya orang yang Engkau cintai tidak akan hina dan orang yang Engkau musuhi tidak akan mulia. Maha Suci Engkau, wahai Tuhan kami dan Engkau Maha Tinggi"
          },
          {
            "arabic": "اللَّهُمَّ إِنيِّ أَعُوْذُ بِرِضَاكَ مِنْ سَخَطِكَ، وَبِمُعَافَاتِكَ مِنْ عُقُوْبَتِكَ، وَأعُوْذُ بِكَ مِنْكَ، لاَ أُحْصِي ثَنَاءً عَلَيْكَ، أَنْتَ كَمَا أَثْنَيْتَ عَلَى نَفْسِكَ",
            "audio": "",
            "notes": "",
            "source": "Ashabus sunan dan Imam Ahmad. Lihat Shahih Tirmidzi: 3/180, Shahih Ibnu Majah: 1/194, serta kitab Irwa’ul Ghalil: 2/175.",
            "translation": "Ya Allah, sesungguhnya aku berlindung dengan keridha’an-Mu dari kemurkaan-Mu, dan dengan keselamatan-Mu dan siksaan-Mu. Aku berlindung kepada-Mu dari ancaman-Mu. Aku tidak membatasi untuk memuji-Mu. Engkau adalah sebagaimana yang Engkau sanjungkan kepada diri-Mu sendiri"
          },
          {
            "arabic": "اللَّهُمَّ إِيَّاكَ نَعْبُدُ، وَلَكَ نُصَلِّي وَنَسْجُدُ، وَإِلَيْكَ نَسْعَى وَنَحْفِدُ، نَرْجُو رَحْمَتَكَ، وَنَخْشَى عَذَابَكَ، إِنَّ عَذَابَكَ بِاْلكَافِرِيْنَ مُلْحَقٌ، اللَّهُمَّ إِنَّا نَسْتَعِيْنُكَ، وَنَسْتَغْفِرُكَ، وَنُثْنِي عَلَيْكَ الْخَيْرَ، وَلاَ نَكْفُرُكَ، وَنُؤْمِنُ بِكَ، وَنَخْضَعُ لَكَ، وَنَخْلَعُ مَنْ يَكْفُرُكَ",
            "audio": "",
            "notes": "",
            "source": "Riwayat Baihaqi dalam Sunan Kubra, sanadnya shahih: 2/211, Syeikh Al Albani menshahihkannya dalam Irwa’ul Ghalil: 2/170, hadits ini mauquf pada Umar رضي الله عنه .",
            "translation": "Ya Allah, sesungguhnya kami menyembah-Mu, kepada-Mu kami shalat dan sujud, kepada-Mu kami berusaha dan melayani. Kami mengharapkan rahmat-Mu, kami takut akan siksa-Mu, sesungguhnya siksaan-Mu akan menimpa orang-orang yang kafir. Ya Allah, kami mohon pertolongan dan ampunan kepada-Mu. Kami memuji kebaikan-Mu, kami beriman kepada-Mu, kami tunduk (pada ajaran-Mu) dan kami berlepas diri dari orang-orang yang kufur kepada-Mu"
          }
        ],
        "id": 30,
        "language": "id",
        "title": "Doa Qunut Witir"
      }
    ],
    "status": "1",
    "title": "Buku Do'a",
    "type": 0,
    "updated": ""
  },
  {
    "desc": "Manusia memiliki kebutuhan yang sangat besar terhadap dzikir, kapan pun dan di mana pun. Apabila seorang hamba lalai dari berdzikir kepada Allah, maka waktu itu akan menjadi bencana baginya. Dia akan menyesal dengan penyesalan yang besar, baik ketika di dunia maupun di akhirat. ",
    "id": 0,
    "language": "id",
    "prayer": [
      {
        "bookId": 0,
        "data": [
          {
            "arabic": "اللَّهُ لاَ إِلَهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلاَّ بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلَا يَئُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ",
            "audio": "ayatulkursi",
            "notes": "Baca Sekali",
            "source": "HR. Al-Hakim 1/562, Shahiih at-Targhiib wat Tarhiib 1/418 no. 662",
            "translation": "Allah, tidak ada ilah (yang berhak disembah) melainkan Dia, yang hidup kekal lagi terus menerus mengurus (makhluk-Nya). Dia tidak mengantuk dan tidak tidur. Kepunyaan-Nya apa yang di langit dan di bumi. Tiada yang dapat memberi syafa’at di sisi-Nya tanpa seizin-Nya. Dia mengetahui apa-apa yang di hadapan mereka dan di belakang mereka. Mereka tidak mengetahui apa-apa dari ilmu Allah melainkan apa yang dikehendaki-Nya. Kursi Allah meliputi langit dan bumi. Dia tidak merasa berat memelihara keduanya. Dan Dia Maha Tinggi lagi Maha besar.\n(Al-Baqarah: 255)"
          },
          {
            "arabic": "قُلْ هُوَ اللَّهُ أَحَدٌ⦿اللَّهُ الصَّمَدُ⦿لَمْ يَلِدْ وَلَمْ يُولَدْ⦿وَلَمْ يَكُن لَّهُ كُفُوًا أَحَدٌ⦿",
            "audio": "alikhlas2",
            "notes": "Baca 3x",
            "source": "HR. Abu Dawud no. 5082, an-Nasa-i VIII/250 dan at-Tirmidzi no. 3575, Ahmad V/312, Shahiih at-Tirmidzi no. 2829, Tuhfatul Ahwadzi no. 3646, Shahiih at-Targhiib wat Tarhiib 1/411 no. 649",
            "translation": "Katakanlah: Dialah Allah, Yang Maha Esa. Allah adalah ilah yang bergantung kepada-Nya segala urusan. Dia tidak beranak dan tiada pula diperanakkan, dan tidak ada seorang pun yang setara dengan Dia.\n(Al-Ikhlas: 1-4)"
          },
          {
            "arabic": "قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ⦿مِن شَرِّ مَا خَلَقَ⦿وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ⦿وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ⦿وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ⦿",
            "audio": "alfalaq",
            "notes": "Baca 3x",
            "source": "HR. Abu Dawud no. 5082, an-Nasa-i VIII/250 dan at-Tirmidzi no. 3575, Ahmad V/312, Shahiih at-Tirmidzi no. 2829, Tuhfatul Ahwadzi no. 3646, Shahiih at-Targhiib wat Tarhiib 1/411 no. 649",
            "translation": "Katakanlah: Aku berlindung kepada Rabb yang menguasai Shubuh, dari kejahatan makhluk-Nya, dan dari kejahatan malam apabila telah gelap gulita, dan dari kejahatan-kejahatan wanita tukang sihir yang menghembus pada buhul-buhul, dan dari kejahatan orang yang dengki apabila ia dengki.\n(Al-Falaq: 1-5)"
          },
          {
            "arabic": "قُلْ أَعُوذُ بِرَبِّ النَّاسِ⦿مَلِكِ النَّاسِ⦿إِلَهِ النَّاسِ⦿مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ⦿الَّذِي يُوَسْوِسُ فِي صُدُورِالنَّاسِ⦿مِنَ الْجِنَّةِ وَ النَّاسِ⦿",
            "audio": "annas",
            "notes": "Baca 3x",
            "source": "HR. Abu Dawud no. 5082, an-Nasa-i VIII/250 dan at-Tirmidzi no. 3575, Ahmad V/312, Shahiih at-Tirmidzi no. 2829, Tuhfatul Ahwadzi no. 3646, Shahiih at-Targhiib wat Tarhiib 1/411 no. 649",
            "translation": "Dengan menyebut nama Allah Yang Maha Pengasih lagi Maha Penyayang. Katakanlah: Aku berlindung kepada Rabb manusia. Raja manusia. Sembahan manusia, dari kejahatan (bisikan) syaitan yang biasa bersembunyi, yang membisikkan (kejahatan) ke dalam dada manusia, dari jin dan manusia.\n(An-Naas: 1-6)"
          },
          {
            "arabic": "أَمْسَيْنَا وَأَمْسَى الْمُلْكُ للهِ، وَالْحَمْدُ للهِ، لَا إِلَهَ إِلاَّ اللهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، رَبِّ أَسْأَلُكَ خَيْرَ مَا فِي هَذِهِ اللَّيْلَةِ وَخَيْرَ مَا بَعْدَهَا، وَأَعُوذُبِكَ مِنْ شَرِّ مَا فِي هَذِهِ اللَّيْلَةِ وَشَرِّ مَا بَعْدَهَا، رَبِّ أَعُوذُبِكَ مِنَ الْكَسَلِ وَسُوءِ الْكِبَرِ، رَبِّ أَعُوذُبِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ",
            "audio": "",
            "notes": "Baca Sekali",
            "source": "HR. Muslim IV/2088 no. 2723, Abu Dawud no. 5071, at-Tirmidzi 3390",
            "translation": "Kami telah memasuki waktu sore dan kerajaan hanya milik Allah, segala puji hanya milik Allah. Tidak ada Ilah (yang berhak diibadahi dengan benar) kecuali Allah Yang Mahaesa, tiada sekutu bagi-Nya. Bagi-Nya kerajaan dan bagi-Nya pujian. Dia-lah Yang Mahakuasa atas segala sesuatu. Wahai Rabb, aku mohon kepada-Mu kebaikan di malam ini dan kebaikan sesudahnya. Aku berlindung ke­pada-Mu dari kejahatan malam ini dan kejahatan sesudahnya. Wahai Rabb, aku berlindung kepada-Mu dari kemalasan dan kejelekan di hari tua. Wahai Rabb, aku berlindung kepada-Mu dari siksaan di Neraka dan siksaan di kubur."
          },
          {
            "arabic": "اَللَّهُمَّ بِكَ أَمْسَيْنَا، وَبِكَ أَصْبَحْنَا، وَبِكَ نَحْيَا، وَبِكَ نَمُوْتُ وَإِلَيْكَ الْـمَصِيْرُ",
            "audio": "",
            "notes": "Baca Sekali",
            "source": "HR. Al-Bukhari dalam al-Adabul Mufrad, lafazh ini ada­lah lafazh al-Bukhari, at-Tirmidzi no. 3391, Abu Dawud no. 5068, Ahmad 11/354, Ibnu Majah no. 3868, Shahiih al-Adabil Mufrad no. 911",
            "translation": "Ya Allah, dengan rahmat dan pertolongan-Mu kami memasuki waktu sore, dan dengan rahmat dan pertolongan-Mu kami memasuki waktu pagi. Dengan rahmat dan kehendak-Mu kami hidup dan dengan rahmat dan kehendak-Mu kami mati. Dan kepada-Mu tempat kembali (bagi semua makhluk)."
          },
          {
            "arabic": "اَللَّهُمَّ أَنْتَ رَبِّيْ لاَ إِلَـهَ إِلاَّ أَنْتَ، خَلَقْتَنِيْ وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوْذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوْءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوْءُ بِذَنْبِيْ فَاغْفِرْ لِيْ فَإِنَّهُ لاَ يَغْفِرُ الذُّنُوْبَ إِلاَّ أَنْتَ.",
            "audio": "",
            "notes": "Baca Sekali",
            "source": "HR. Al-Bukhari no. 6306, 6323, Ahmad IV/122-125, an-Nasa-i VIII/279-280",
            "translation": "Ya Allah, Engkau adalah Rabbku, tidak ada ilah yang berhak disembah kecuali Engkau, Engkaulah yang menciptakanku. Aku adalah hamba-Mu. Aku akan setia pada perjanjianku pada-Mu (yaitu aku akan mentauhidkan-Mu) semampuku dan aku yakin akan janji-Mu (berupa surga untukku). Aku berlindung kepada-Mu dari kejelekan yang kuperbuat. Aku mengakui nikmat-Mu kepadaku dan aku mengakui dosaku. Oleh karena itu, ampunilah aku. Sesungguhnya tiada yang mengampuni dosa kecuali Engkau."
          },
          {
            "arabic": "اللَّهُمَّ عَافِنِي فِي بَدَنِي، اللَّهُمَّ عَافِنِي فِي سَمْعِي، اللَّهُمَّ عَافِنِي فِي بَصْرِي، لاَ إِلَهَ إِلاَّ أَنْتَ، اللَّهُمَّ إِنِّي أَعُوْذُ بِكَ مِنَ الْكُفْرِ، وَالْفَقْرِ، وأَعُوْذُ بِكَ مِنْ عَذَابِ القَبْرِ، لاَ إِلَهَ إِلاَّ أَنْتَ",
            "audio": "",
            "notes": "Baca 3x",
            "source": "HR. Al-Bukhari dalam Shahiih al-Adabil Mufrad no. 539, Abu Dawud no. 5090, Ahmad V/42",
            "translation": "Ya Allah, selamatkanlah tubuhku (dari penyakit dan dari apa yang tidak aku inginkan). Ya Allah, selamatkanlah pendengaranku (dari penyakit dan maksiat atau dari apa yang tidak aku inginkan). Ya Allah, selamatkanlah penglihatanku, tidak ada Ilah (yang berhak diibadahi) kecuali Engkau. Ya Allah, sesungguhnya aku berlindung kepada-Mu dari kekufuran dan kefakiran. Aku berlindung kepada-Mu dari siksa kubur, tidak ada Ilah (yang berhak diibadahi) kecuali Engkau."
          },
          {
            "arabic": "اَللَّهُمَّ إِنِّيْ أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي الدُّنْيَا وَاْلآخِرَةِ، اَللَّهُمَّ إِنِّيْ أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِيْنِيْ وَدُنْيَايَ وَأَهْلِيْ وَمَالِيْ اللَّهُمَّ اسْتُرْ عَوْرَاتِى وَآمِنْ رَوْعَاتِى. اَللَّهُمَّ احْفَظْنِيْ مِنْ بَيْنِ يَدَيَّ، وَمِنْ خَلْفِيْ، وَعَنْ يَمِيْنِيْ وَعَنْ شِمَالِيْ، وَمِنْ فَوْقِيْ، وَأَعُوْذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِيْ",
            "audio": "",
            "notes": "Baca Sekali",
            "source": "HR. Al-Bukhari dalam al-Adabul Mufrad, Abu Dawud no. 5074, Ibnu Majah no. 3871, al-Hakim 1/517-518, Shahiih al-Adabul Mufrad no. 912",
            "translation": "Ya Allah, sesungguhnya aku memohon kebajikan dan keselamatan di dunia dan akhirat. Ya Allah, sesungguhnya aku memohon kebajikan dan keselamatan dalam agama, dunia, keluarga dan hartaku. Ya Allah, tutupilah auratku (aib dan sesuatu yang tidak layak dilihat orang) dan tenteramkanlah aku dari rasa takut. Ya Allah, peliharalah aku dari muka, belakang, kanan, kiri dan atasku. Aku berlindung dengan kebesaran-Mu, agar aku tidak disambar dari bawahku (oleh ular atau tenggelam dalam bumi dan lain-lain yang membuat aku jatuh)."
          },
          {
            "arabic": "اَللَّهُمَّ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ فَاطِرَ السَّمَاوَاتِ وَاْلأَرْضِ، رَبَّ كُلِّ شَيْءٍ وَمَلِيْكَهُ، أَشْهَدُ أَنْ لاَ إِلَـهَ إِلاَّ أَنْتَ، أَعُوْذُ بِكَ مِنْ شَرِّ نَفْسِيْ، وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِيْ سُوْءًا أَوْ أَجُرُّهُ إِلَى مُسْلِمٍ",
            "audio": "",
            "notes": "Baca Sekali",
            "source": "HR. At-Tirmidzi no. 3392 dan Abu Dawud no. 5067, lihat Shahiih at-Tirmidzi no. 2071, Shahiih al-Adabil Mufrad no. 914",
            "translation": "Ya Allah, Yang Maha Mengetahui yang ghaib dan yang nyata, wahai Rabb pencipta langit dan bumi, Rabb segala sesuatu dan yang merajainya. Aku bersaksi bahwa tidak ada ilah yang berhak disembah kecuali Engkau. Aku berlindung kepadaMu dari kejahatan diriku, setan dan balatentaranya (godaan untuk berbuat syirik pada Allah), dan aku (berlindung kepada-Mu) dari berbuat kejelekan terhadap diriku atau menyeretnya kepada seorang muslim."
          },
          {
            "arabic": "بِسْمِ اللَّهِ الَّذِى لاَ يَضُرُّ مَعَ اسْمِهِ شَىْءٌ فِى الأَرْضِ وَلاَ فِى السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ",
            "audio": "",
            "notes": "Baca 3x",
            "source": "HR. At-Tirmidzi no. 3388, Abu Dawud no. 5088, Ahmad no. 446 dan 476, Tahqiq Ahmad Syakir dan Ibnu Majah no. 3869, lihat Shahiih Ibni Majah no. 3120, al-Hakim 1/513, Shahiih al-Adabil Mufrad no. 513",
            "translation": "Dengan nama Allah yang bila disebut, segala sesuatu di bumi dan langit tidak akan berbahaya, Dia-lah Yang Maha Mendengar lagi Maha Mengetahui."
          },
          {
            "arabic": "رَضِيْتُ بِاللهِ رَبًّا، وَبِاْلإِسْلاَمِ دِيْنًا، وَبِمُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَبِيًّا",
            "audio": "",
            "notes": "Baca 3x",
            "source": "HR. Ahmad IV/337, Abu Dawud no. 5072, at-Tirmidzi no. 3389, Ibnu Majah no. 3870, an-Nasa-i dalam 'Amalul Yaum wal Lailah no. 4 dan Ibnus Sunni no. 68, Shahiih at-Targhiib wat Tarhiib 1/415 no. 657, dishahihkan oleh Imam al-Hakim dalam al-Mustadrak 1/518 dan disetujui oleh Imam adz-Dzahabi",
            "translation": "Aku ridha Allah sebagai Rabb, Islam sebagai agama dan Muhammad shallallahu ‘alaihi wa sallam sebagai nabi."
          },
          {
            "arabic": "يَا حَيُّ يَا قَيُّوْمُ بِرَحْمَتِكَ أَسْتَغِيْثُ، وَأَصْلِحْ لِيْ شَأْنِيْ كُلَّهُ وَلاَ تَكِلْنِيْ إِلَى نَفْسِيْ طَرْفَةَ عَيْنٍ",
            "audio": "",
            "notes": "Baca Sekali",
            "source": "HR. An-Nasa-i 575, al-Bazzar 3107 dan al-Hakim 1/545 dab Ibnus Sunni 48, lihat Shahiih at-Targhiib wat Tarhiib I/417 no. 661",
            "translation": "Wahai Rabb Yang Maha Hidup, wahai Rabb Yang Berdiri Sendiri (tidak butuh segala sesuatu), dengan rahmat-Mu aku minta pertolongan, perbaikilah segala urusanku dan jangan diserahkan kepadaku sekali pun sekejap mata (tanpa mendapat pertolongan dariMu)."
          },
          {
            "arabic": "أَمْسَيْنَا عَلَى فِطْرَةِ اْلإِسْلاَمِ وَعَلَى كَلِمَةِ اْلإِخْلاَصِ، وَعَلَى دِيْنِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِيْنَا إِبْرَاهِيْمَ، حَنِيْفًا مُسْلِمًا وَمَا كَانَ مِنَ الْمُشْرِكِيْنَ ",
            "audio": "",
            "notes": "Baca Sekali",
            "source": "HR. Ahmad III/406, 407, V/123, ad-Darimi II/292 dan Ibnus Sunni dalam Amalul Yaum wal Lailah no. 34, Misykaatul Mashaabiih no. 2415, Shahiihal-Jaami'ish Shaghiir no. 4674",
            "translation": "Di waktu sore kami memegang agama Islam, kalimat ikhlas (kalimat syahadat), agama Nabi kami Muhammad shallallahu ‘alaihi wa sallam, dan agama bapak kami Ibrahim, yang berdiri di atas jalan yang lurus, muslim dan tidak tergolong orang-orang musyrik."
          },
          {
            "arabic": "لاَ إِلَـهَ إِلاَّ اللهُ وَحْدَهُ لاَ شَرِيْكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرُ",
            "audio": "",
            "notes": "Baca sekali atau 10x atau 100x",
            "source": "HR. Abu Dawud no. 5077, Ibnu Majah no. 3867, Shahiih Jaami'ish Shaghiir no. 6418, Misykaatul Mashaabiih no. 2395, Shahiih at-Targhiib 1/414 no. 656",
            "translation": "Tidak ada ilah yang berhak disembah selain Allah semata, tidak ada sekutu bagi-Nya. Milik Allah kerajaan dan segala pujian. Dia-lah yang berkuasa atas segala sesuatu."
          },
          {
            "arabic": "سُبْحَانَ اللهِ وَبِحَمْدِهِ",
            "audio": "",
            "notes": "Baca 100x",
            "source": "HR. Muslim no. 2691 dan no. 2692, Syarh Muslim XVII/17-18, Shahiih at-Targhiib wat Tarhiib 1/413 no. 653.",
            "translation": "Maha suci Allah, aku memuji-Nya."
          },
          {
            "arabic": "أَعُوْذُ بِكَلِمَاتِ اللهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ",
            "audio": "",
            "notes": "Baca 3x",
            "source": "HR. Ahmad 11/290, an-Nasa-i dalam 'Amalul Yaum wal Lailah no. 590, Shahiih at-Targhiib wat Tarhiib 1/412 no. 652, Shahiih al-Jaami 'ish Shaghiir no. 6427",
            "translation": "Aku berlindung dengan kalimat-kalimat Allah yang sempurna, dari kejahatan sesuatu yang diciptakan-Nya"
          }
        ],
        "id": 2,
        "language": "id",
        "title": "Dzikir Sore"
      },
      {
        "bookId": 0,
        "data": [
          {
            "arabic": "اللَّهُ لاَ إِلَهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلاَّ بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلَا يَئُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ",
            "audio": "ayatulkursi",
            "notes": "Baca Sekali",
            "source": "HR. Al-Hakim 1/562, Shahiih at-Targhiib wat Tarhiib 1/418 no. 662",
            "translation": "Allah, tidak ada ilah (yang berhak disembah) melainkan Dia, yang hidup kekal lagi terus menerus mengurus (makhluk-Nya). Dia tidak mengantuk dan tidak tidur. Kepunyaan-Nya apa yang di langit dan di bumi. Tiada yang dapat memberi syafa’at di sisi-Nya tanpa seizin-Nya. Dia mengetahui apa-apa yang di hadapan mereka dan di belakang mereka. Mereka tidak mengetahui apa-apa dari ilmu Allah melainkan apa yang dikehendaki-Nya. Kursi Allah meliputi langit dan bumi. Dia tidak merasa berat memelihara keduanya. Dan Dia Maha Tinggi lagi Maha besar.\n(Al-Baqarah: 255)"
          },
          {
            "arabic": "قُلْ هُوَ اللَّهُ أَحَدٌ⦿اللَّهُ الصَّمَدُ⦿لَمْ يَلِدْ وَلَمْ يُولَدْ⦿وَلَمْ يَكُن لَّهُ كُفُوًا أَحَدٌ⦿",
            "audio": "alikhlas2",
            "notes": "Baca 3x",
            "source": "HR. Abu Dawud no. 5082, an-Nasa-i VIII/250 dan at-Tirmidzi no. 3575, Ahmad V/312, Shahiih at-Tirmidzi no. 2829, Tuhfatul Ahwadzi no. 3646, Shahiih at-Targhiib wat Tarhiib 1/411 no. 649",
            "translation": "Katakanlah: Dialah Allah, Yang Maha Esa. Allah adalah ilah yang bergantung kepada-Nya segala urusan. Dia tidak beranak dan tiada pula diperanakkan, dan tidak ada seorang pun yang setara dengan Dia.\n(Al-Ikhlas: 1-4)"
          },
          {
            "arabic": "قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ⦿مِن شَرِّ مَا خَلَقَ⦿وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ⦿وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ⦿وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ⦿",
            "audio": "alfalaq",
            "notes": "Baca 3x",
            "source": "HR. Abu Dawud no. 5082, an-Nasa-i VIII/250 dan at-Tirmidzi no. 3575, Ahmad V/312, Shahiih at-Tirmidzi no. 2829, Tuhfatul Ahwadzi no. 3646, Shahiih at-Targhiib wat Tarhiib 1/411 no. 649",
            "translation": "Katakanlah: Aku berlindung kepada Rabb yang menguasai Shubuh, dari kejahatan makhluk-Nya, dan dari kejahatan malam apabila telah gelap gulita, dan dari kejahatan-kejahatan wanita tukang sihir yang menghembus pada buhul-buhul, dan dari kejahatan orang yang dengki apabila ia dengki.\n(Al-Falaq: 1-5)"
          },
          {
            "arabic": "قُلْ أَعُوذُ بِرَبِّ النَّاسِ⦿مَلِكِ النَّاسِ⦿إِلَهِ النَّاسِ⦿مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ⦿الَّذِي يُوَسْوِسُ فِي صُدُورِالنَّاسِ⦿مِنَ الْجِنَّةِ وَ النَّاسِ⦿",
            "audio": "annas",
            "notes": "Baca 3x",
            "source": "HR. Abu Dawud no. 5082, an-Nasa-i VIII/250 dan at-Tirmidzi no. 3575, Ahmad V/312, Shahiih at-Tirmidzi no. 2829, Tuhfatul Ahwadzi no. 3646, Shahiih at-Targhiib wat Tarhiib 1/411 no. 649",
            "translation": "Dengan menyebut nama Allah Yang Maha Pengasih lagi Maha Penyayang. Katakanlah: Aku berlindung kepada Rabb manusia. Raja manusia. Sembahan manusia, dari kejahatan (bisikan) syaitan yang biasa bersembunyi, yang membisikkan (kejahatan) ke dalam dada manusia, dari jin dan manusia.\n(An-Naas: 1-6)"
          },
          {
            "arabic": "أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ، وَالْحَمْدُ لِلَّهِ، لاَ إِلَـهَ إِلاَّ اللهُ وَحْدَهُ لاَ شَرِيْكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرُ. رَبِّ أَسْأَلُكَ خَيْرَ مَا فِيْ هَذَا الْيَوْمِ وَخَيْرَ مَا بَعْدَهُ، وَأَعُوْذُ بِكَ مِنْ شَرِّ مَا فِيْ هَذَا الْيَوْمِ وَشَرِّ مَا بَعْدَهُ، رَبِّ أَعُوْذُ بِكَ مِنَ الْكَسَلِ وَسُوْءِ الْكِبَرِ، رَبِّ أَعُوْذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ",
            "audio": "",
            "notes": "Baca Sekali",
            "source": "HR. Muslim IV/2088 no. 2723, Abu Dawud no. 5071, at-Tirmidzi 3390",
            "translation": "Kami telah memasuki waktu pagi dan kerajaan hanya milik Allah, segala puji bagi Allah. Tidak ada ilah (yang berhak disembah) kecuali Allah semata, tiada sekutu bagi-Nya. Milik Allah kerajaan dan bagi-Nya pujian. Dia-lah Yang Mahakuasa atas segala sesuatu. Wahai Rabbku, aku mohon kepada-Mu kebaikan di hari ini dan kebaikan sesudahnya. Aku berlindung kepada-Mu dari kejahatan hari ini dan kejahatan sesudahnya. Wahai Rabbku, aku berlindung kepada-Mu dari kemalasan dan kejelekan di hari tua. Wahai Rabbku, aku berlindung kepada-Mu dari siksaan di neraka dan siksaan di alam kubur."
          },
          {
            "arabic": "اَللَّهُمَّ بِكَ أَصْبَحْنَا، وَبِكَ أَمْسَيْنَا، وَبِكَ نَحْيَا، وَبِكَ نَمُوْتُ وَإِلَيْكَ النُّشُوْرُ",
            "audio": "",
            "notes": "Baca Sekali",
            "source": "HR. Al-Bukhari dalam al-Adabul Mufrad, lafazh ini ada­lah lafazh al-Bukhari, at-Tirmidzi no. 3391, Abu Dawud no. 5068, Ahmad 11/354, Ibnu Majah no. 3868, Shahiih al-Adabil Mufrad no. 911",
            "translation": "Ya Allah, dengan rahmat dan pertolongan-Mu kami memasuki waktu pagi, dan dengan rahmat dan pertolongan-Mu kami memasuki waktu petang. Dengan rahmat dan pertolongan-Mu kami hidup dan dengan kehendak-Mu kami mati. Dan kepada-Mu kebangkitan (bagi semua makhluk)."
          },
          {
            "arabic": "اَللَّهُمَّ أَنْتَ رَبِّيْ لاَ إِلَـهَ إِلاَّ أَنْتَ، خَلَقْتَنِيْ وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوْذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوْءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوْءُ بِذَنْبِيْ فَاغْفِرْ لِيْ فَإِنَّهُ لاَ يَغْفِرُ الذُّنُوْبَ إِلاَّ أَنْتَ.",
            "audio": "",
            "notes": "Baca Sekali",
            "source": "HR. Al-Bukhari no. 6306, 6323, Ahmad IV/122-125, an-Nasa-i VIII/279-280",
            "translation": "Ya Allah, Engkau adalah Rabbku, tidak ada ilah yang berhak disembah kecuali Engkau, Engkaulah yang menciptakanku. Aku adalah hamba-Mu. Aku akan setia pada perjanjianku pada-Mu (yaitu aku akan mentauhidkan-Mu) semampuku dan aku yakin akan janji-Mu (berupa surga untukku). Aku berlindung kepada-Mu dari kejelekan yang kuperbuat. Aku mengakui nikmat-Mu kepadaku dan aku mengakui dosaku. Oleh karena itu, ampunilah aku. Sesungguhnya tiada yang mengampuni dosa kecuali Engkau."
          },
          {
            "arabic": "اللَّهُمَّ عَافِنِي فِي بَدَنِي، اللَّهُمَّ عَافِنِي فِي سَمْعِي، اللَّهُمَّ عَافِنِي فِي بَصْرِي، لاَ إِلَهَ إِلاَّ أَنْتَ، اللَّهُمَّ إِنِّي أَعُوْذُ بِكَ مِنَ الْكُفْرِ، وَالْفَقْرِ، وأَعُوْذُ بِكَ مِنْ عَذَابِ القَبْرِ، لاَ إِلَهَ إِلاَّ أَنْتَ",
            "audio": "",
            "notes": "Baca 3x",
            "source": "HR. Al-Bukhari dalam Shahiih al-Adabil Mufrad no. 539, Abu Dawud no. 5090, Ahmad V/42",
            "translation": "Ya Allah, selamatkanlah tubuhku (dari penyakit dan dari apa yang tidak aku inginkan). Ya Allah, selamatkanlah pendengaranku (dari penyakit dan maksiat atau dari apa yang tidak aku inginkan). Ya Allah, selamatkanlah penglihatanku, tidak ada Ilah (yang berhak diibadahi) kecuali Engkau. Ya Allah, sesungguhnya aku berlindung kepada-Mu dari kekufuran dan kefakiran. Aku berlindung kepada-Mu dari siksa kubur, tidak ada Ilah (yang berhak diibadahi) kecuali Engkau."
          },
          {
            "arabic": "اَللَّهُمَّ إِنِّيْ أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي الدُّنْيَا وَاْلآخِرَةِ، اَللَّهُمَّ إِنِّيْ أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي دِيْنِيْ وَدُنْيَايَ وَأَهْلِيْ وَمَالِيْ اللَّهُمَّ اسْتُرْ عَوْرَاتِى وَآمِنْ رَوْعَاتِى. اَللَّهُمَّ احْفَظْنِيْ مِنْ بَيْنِ يَدَيَّ، وَمِنْ خَلْفِيْ، وَعَنْ يَمِيْنِيْ وَعَنْ شِمَالِيْ، وَمِنْ فَوْقِيْ، وَأَعُوْذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِيْ",
            "audio": "",
            "notes": "Baca Sekali",
            "source": "HR. Al-Bukhari dalam al-Adabul Mufrad, Abu Dawud no. 5074, Ibnu Majah no. 3871, al-Hakim 1/517-518, Shahiih al-Adabul Mufrad no. 912",
            "translation": "Ya Allah, sesungguhnya aku memohon kebajikan dan keselamatan di dunia dan akhirat. Ya Allah, sesungguhnya aku memohon kebajikan dan keselamatan dalam agama, dunia, keluarga dan hartaku. Ya Allah, tutupilah auratku (aib dan sesuatu yang tidak layak dilihat orang) dan tenteramkanlah aku dari rasa takut. Ya Allah, peliharalah aku dari muka, belakang, kanan, kiri dan atasku. Aku berlindung dengan kebesaran-Mu, agar aku tidak disambar dari bawahku (oleh ular atau tenggelam dalam bumi dan lain-lain yang membuat aku jatuh)."
          },
          {
            "arabic": "اَللَّهُمَّ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ فَاطِرَ السَّمَاوَاتِ وَاْلأَرْضِ، رَبَّ كُلِّ شَيْءٍ وَمَلِيْكَهُ، أَشْهَدُ أَنْ لاَ إِلَـهَ إِلاَّ أَنْتَ، أَعُوْذُ بِكَ مِنْ شَرِّ نَفْسِيْ، وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِيْ سُوْءًا أَوْ أَجُرُّهُ إِلَى مُسْلِمٍ",
            "audio": "",
            "notes": "Baca Sekali",
            "source": "HR. At-Tirmidzi no. 3392 dan Abu Dawud no. 5067, lihat Shahiih at-Tirmidzi no. 2071, Shahiih al-Adabil Mufrad no. 914",
            "translation": "Ya Allah, Yang Maha Mengetahui yang ghaib dan yang nyata, wahai Rabb pencipta langit dan bumi, Rabb segala sesuatu dan yang merajainya. Aku bersaksi bahwa tidak ada ilah yang berhak disembah kecuali Engkau. Aku berlindung kepadaMu dari kejahatan diriku, setan dan balatentaranya (godaan untuk berbuat syirik pada Allah), dan aku (berlindung kepada-Mu) dari berbuat kejelekan terhadap diriku atau menyeretnya kepada seorang muslim."
          },
          {
            "arabic": "بِسْمِ اللَّهِ الَّذِى لاَ يَضُرُّ مَعَ اسْمِهِ شَىْءٌ فِى الأَرْضِ وَلاَ فِى السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ",
            "audio": "",
            "notes": "Baca 3x",
            "source": "HR. At-Tirmidzi no. 3388, Abu Dawud no. 5088, Ahmad no. 446 dan 476, Tahqiq Ahmad Syakir dan Ibnu Majah no. 3869, lihat Shahiih Ibni Majah no. 3120, al-Hakim 1/513, Shahiih al-Adabil Mufrad no. 513",
            "translation": "Dengan nama Allah yang bila disebut, segala sesuatu di bumi dan langit tidak akan berbahaya, Dia-lah Yang Maha Mendengar lagi Maha Mengetahui."
          },
          {
            "arabic": "رَضِيْتُ بِاللهِ رَبًّا، وَبِاْلإِسْلاَمِ دِيْنًا، وَبِمُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ نَبِيًّا",
            "audio": "",
            "notes": "Baca 3x",
            "source": "HR. Ahmad IV/337, Abu Dawud no. 5072, at-Tirmidzi no. 3389, Ibnu Majah no. 3870, an-Nasa-i dalam 'Amalul Yaum wal Lailah no. 4 dan Ibnus Sunni no. 68, Shahiih at-Targhiib wat Tarhiib 1/415 no. 657, dishahihkan oleh Imam al-Hakim dalam al-Mustadrak 1/518 dan disetujui oleh Imam adz-Dzahabi",
            "translation": "Aku ridha Allah sebagai Rabb, Islam sebagai agama dan Muhammad shallallahu ‘alaihi wa sallam sebagai nabi."
          },
          {
            "arabic": "يَا حَيُّ يَا قَيُّوْمُ بِرَحْمَتِكَ أَسْتَغِيْثُ، وَأَصْلِحْ لِيْ شَأْنِيْ كُلَّهُ وَلاَ تَكِلْنِيْ إِلَى نَفْسِيْ طَرْفَةَ عَيْنٍ",
            "audio": "",
            "notes": "Baca Sekali",
            "source": "HR. An-Nasa-i 575, al-Bazzar 3107 dan al-Hakim 1/545 dab Ibnus Sunni 48, lihat Shahiih at-Targhiib wat Tarhiib I/417 no. 661",
            "translation": "Wahai Rabb Yang Maha Hidup, wahai Rabb Yang Berdiri Sendiri (tidak butuh segala sesuatu), dengan rahmat-Mu aku minta pertolongan, perbaikilah segala urusanku dan jangan diserahkan kepadaku sekali pun sekejap mata (tanpa mendapat pertolongan dariMu)."
          },
          {
            "arabic": "أَصْبَحْنَا عَلَى فِطْرَةِ اْلإِسْلاَمِ وَعَلَى كَلِمَةِ اْلإِخْلاَصِ، وَعَلَى دِيْنِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِيْنَا إِبْرَاهِيْمَ، حَنِيْفًا مُسْلِمًا وَمَا كَانَ مِنَ الْمُشْرِكِيْنَ",
            "audio": "",
            "notes": "Baca Sekali",
            "source": "HR. Ahmad III/406, 407, V/123, ad-Darimi II/292 dan Ibnus Sunni dalam Amalul Yaum wal Lailah no. 34, Misykaatul Mashaabiih no. 2415, Shahiihal-Jaami'ish Shaghiir no. 4674",
            "translation": "Di waktu pagi kami memegang agama Islam, kalimat ikhlas (kalimat syahadat), agama Nabi kami Muhammad shallallahu ‘alaihi wa sallam, dan agama bapak kami Ibrahim, yang berdiri di atas jalan yang lurus, muslim dan tidak tergolong orang-orang musyrik."
          },
          {
            "arabic": "سُبْحَانَ اللهِ وَبِحَمْدِهِ: عَدَدَ خَلْقِهِ، وَرِضَا نَفْسِهِ، وَزِنَةَ عَرْشِهِ وَمِدَادَ كَلِمَاتِهِ",
            "audio": "",
            "notes": "Baca 3x",
            "source": "HR. Muslim no. 2726. Syarah Muslim XVII/44",
            "translation": "Maha Suci Allah, aku memujiNya sebanyak makhluk-Nya, sejauh kerelaan-Nya, seberat timbangan ‘Arsy-Nya dan sebanyak tinta tulisan kalimat-Nya."
          },
          {
            "arabic": "اَللَّهُمَّ إِنِّيْ أَسْأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا طَيِّبًا، وَعَمَلاً مُتَقَبَّلاً",
            "audio": "",
            "notes": "Baca Sekali",
            "source": "HR. Ibnu Majah no. 925, Shahiih Ibni Majah 1/152 no. 753 dan Ibnus Sunni dalam 'Amalul Yaum wal Lailah",
            "translation": "Ya Allah, sungguh aku memohon kepada-Mu ilmu yang bermanfaat (bagi diriku dan orang lain), rizki yang halal dan amal yang diterima (di sisi-Mu dan mendapatkan ganjaran yang baik)."
          },
          {
            "arabic": "لاَ إِلَـهَ إِلاَّ اللهُ وَحْدَهُ لاَ شَرِيْكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرُ",
            "audio": "",
            "notes": "Baca sekali atau 10x atau 100x",
            "source": "HR. Abu Dawud no. 5077, Ibnu Majah no. 3867, Shahiih Jaami'ish Shaghiir no. 6418, Misykaatul Mashaabiih no. 2395, Shahiih at-Targhiib 1/414 no. 656",
            "translation": "Tidak ada ilah yang berhak disembah selain Allah semata, tidak ada sekutu bagi-Nya. Milik Allah kerajaan dan segala pujian. Dia-lah yang berkuasa atas segala sesuatu."
          },
          {
            "arabic": "سُبْحَانَ اللهِ وَبِحَمْدِهِ",
            "audio": "",
            "notes": "Baca 100x",
            "source": "HR. Muslim no. 2691 dan no. 2692, Syarh Muslim XVII/17-18, Shahiih at-Targhiib wat Tarhiib 1/413 no. 653.",
            "translation": "Maha suci Allah, aku memuji-Nya."
          },
          {
            "arabic": "أَسْتَغْفِرُ اللهَ وَأَتُوْبُ إِلَيْهِ",
            "audio": "",
            "notes": "Baca 100x",
            "source": "HR. Al-Bukhari/ Fathul Baari XI/101 dan Muslim no.2702",
            "translation": "Aku memohon ampun kepada Allah dan bertobat kepada-Nya."
          }
        ],
        "id": 1,
        "language": "id",
        "title": "Dzikir Pagi"
      },
      {
        "bookId": 0,
        "data": [
          {
            "arabic": "أَسْتَغْفِرُ اللهَ",
            "audio": "",
            "notes": "Baca 3x",
            "source": "HR. Muslim no. 591.",
            "translation": "Aku memohon ampun kepada Allah"
          },
          {
            "arabic": "اَللَّهُمَّ أَنْتَ السَّلاَمُ، وَمِنْكَ السَّلاَمُ، تَبَارَكْتَ يَا ذَا الْجَلاَلِ وَاْلإِكْرَامَِ",
            "audio": "",
            "notes": "Baca Sekali",
            "source": "HR. Muslim no. 591.",
            "translation": "Ya Allah, Engkau pemberi keselamatan, dan dariMu keselamatan, Maha Suci Engkau, wahai Tuhan Yang Pemilik Keagungan dan Kemuliaan."
          },
          {
            "arabic": "لاَ إِلَـهَ إِلاَّ اللهُ وَحْدَهُ لاَ شَرِيْكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرُ، اَللَّهُمَّ لاَ مَانِعَ لِمَا أَعْطَيْتَ، وَلاَ مُعْطِيَ لِمَا مَنَعْتَ، وَلاَ يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ",
            "audio": "",
            "notes": "Baca Sekali",
            "source": "HR. Bukhari no. 844 dan Muslim no. 593.",
            "translation": "Tiada Rabb yang berhak disembah selain Allah Yang Maha Esa, tidak ada sekutu bagi-Nya. Bagi-Nya puji dan bagi-Nya kerajaan. Dia Maha Kuasa atas segala sesuatu. Ya Allah, tidak ada yang mencegah apa yang Engkau berikan dan tidak ada yang memberi apa yang Engkau cegah. Tidak berguna kekayaan dan kemuliaan itu bagi pemiliknya (selain iman dan amal shalihnya yang menyelamatkan dari siksaan). Hanya dari-Mu kekayaan dan kemuliaan."
          },
          {
            "arabic": "لاَ إِلَـهَ إِلاَّ اللهُ وَحْدَهُ لاَ شَرِيْكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرُ. لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللهِ، لاَ إِلَـهَ إِلاَّ اللهُ، وَلاَ نَعْبُدُ إِلاَّ إِيَّاهُ، لَهُ النِّعْمَةُ وَلَهُ الْفَضْلُ وَلَهُ الثَّنَاءُ الْحَسَنُ، لاَ إِلَـهَ إِلاَّ اللهُ مُخْلِصِيْنَ لَهُ الدِّيْنَ وَلَوْ كَرِهَ الْكَافِرُوْنَ",
            "audio": "",
            "notes": "Baca Sekali",
            "source": "HR. Muslim no. 594.",
            "translation": "Tiada Rabb (yang berhak disembah) kecuali Allah, Yang Maha Esa, tidak ada sekutu bagi-Nya. Bagi-Nya kerajaan dan pujaan. Dia Mahakuasa atas segala sesuatu. Tidak ada daya dan kekuatan kecuali (dengan pertolongan) Allah. Tiada Rabb (yang hak disembah) kecuali Allah. Kami tidak menyembah kecuali kepada-Nya. Bagi-Nya nikmat, anugerah dan pujaan yang baik. Tiada Rabb (yang hak disembah) kecuali Allah, dengan memurnikan ibadah kepadaNya, sekalipun orang-orang kafir sama benci."
          },
          {
            "arabic": "سُبْحَانَ اللهِ",
            "audio": "",
            "notes": "Baca 33x",
            "source": "HR. Muslim no. 597.",
            "translation": "Maha Suci Allah"
          },
          {
            "arabic": "اَلْحَمْدُ لِلَّهِ",
            "audio": "",
            "notes": "Baca 33x",
            "source": "HR. Muslim no. 597.",
            "translation": "Segala Puji Bagi Allah"
          },
          {
            "arabic": "اَللهُ أَكْبَرُ",
            "audio": "",
            "notes": "Baca 33x",
            "source": "HR. Muslim no. 597.",
            "translation": "Allah Maha Besar"
          },
          {
            "arabic": "لاَ إِلَـهَ إِلاَّ اللهُ وَحْدَهُ لاَ شَرِيْكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرُ",
            "audio": "",
            "notes": "Baca Sekali",
            "source": "HR. Muslim no. 597.",
            "translation": "Tidak ada Rabb (yang berhak disembah) kecuali Allah Yang Maha Esa, tidak ada sekutu bagi-Nya. Bagi-Nya kerajaan. Bagi-Nya pujaan. Dia-lah Yang Mahakuasa atas segala sesuatu."
          },
          {
            "arabic": "اللَّهُ لاَ إِلَهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلاَّ بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلَا يَئُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ",
            "audio": "",
            "notes": "Baca Sekali",
            "source": "HR. An-Nasai dalam Al Kubro 9: 44. Hadits ini dinyatakan shahih oleh Ibnu Hibban, sebagaimana disebut oleh Ibnu Hajar dalam Bulughul Maram.",
            "translation": "Allah, tidak ada ilah (yang berhak disembah) melainkan Dia, yang hidup kekal lagi terus menerus mengurus (makhluk-Nya). Dia tidak mengantuk dan tidak tidur. Kepunyaan-Nya apa yang di langit dan di bumi. Tiada yang dapat memberi syafa’at di sisi-Nya tanpa seizin-Nya. Dia mengetahui apa-apa yang di hadapan mereka dan di belakang mereka. Mereka tidak mengetahui apa-apa dari ilmu Allah melainkan apa yang dikehendaki-Nya. Kursi Allah meliputi langit dan bumi. Dia tidak merasa berat memelihara keduanya. Dan Dia Maha Tinggi lagi Maha besar.\n(Al-Baqarah: 255)"
          },
          {
            "arabic": "قُلْ هُوَ اللَّهُ أَحَدٌ⦿اللَّهُ الصَّمَدُ⦿لَمْ يَلِدْ وَلَمْ يُولَدْ⦿وَلَمْ يَكُن لَّهُ كُفُوًا أَحَدٌ⦿",
            "audio": "",
            "notes": "Baca 3x",
            "source": "HR. Abu Daud no. 1523 dan An-Nasai no. 1337.",
            "translation": "Katakanlah: Dialah Allah, Yang Maha Esa. Allah adalah ilah yang bergantung kepada-Nya segala urusan. Dia tidak beranak dan tiada pula diperanakkan, dan tidak ada seorang pun yang setara dengan Dia.\n(Al-Ikhlas: 1-4)"
          },
          {
            "arabic": "قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ⦿مِن شَرِّ مَا خَلَقَ⦿وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ⦿وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ⦿وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ⦿",
            "audio": "",
            "notes": "Baca 3x",
            "source": "HR. Abu Daud no. 1523 dan An-Nasai no. 1337.",
            "translation": "Katakanlah: Aku berlindung kepada Rabb yang menguasai Shubuh, dari kejahatan makhluk-Nya, dan dari kejahatan malam apabila telah gelap gulita, dan dari kejahatan-kejahatan wanita tukang sihir yang menghembus pada buhul-buhul, dan dari kejahatan orang yang dengki apabila ia dengki.\n(Al-Falaq: 1-5)"
          },
          {
            "arabic": "قُلْ أَعُوذُ بِرَبِّ النَّاسِ⦿مَلِكِ النَّاسِ⦿إِلَهِ النَّاسِ⦿مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ⦿الَّذِي يُوَسْوِسُ فِي صُدُورِالنَّاسِ⦿مِنَ الْجِنَّةِ وَ النَّاسِ⦿",
            "audio": "",
            "notes": "Baca 3x",
            "source": "HR. Abu Daud no. 1523 dan An-Nasai no. 1337.",
            "translation": "Dengan menyebut nama Allah Yang Maha Pengasih lagi Maha Penyayang. Katakanlah: Aku berlindung kepada Rabb manusia. Raja manusia. Sembahan manusia, dari kejahatan (bisikan) syaitan yang biasa bersembunyi, yang membisikkan (kejahatan) ke dalam dada manusia, dari jin dan manusia.\n(An-Naas: 1-6)"
          },
          {
            "arabic": "اَللَّهُمَّ إِنِّيْ أَسْأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا طَيِّبًا، وَعَمَلاً مُتَقَبَّلاً",
            "audio": "",
            "notes": "Baca sekali setelah shalat shubuh",
            "source": "HR. Ibnu Majah no. 925 dan Ahmad 6: 305, 322.",
            "translation": "Ya Allah, sungguh aku memohon kepada-Mu ilmu yang bermanfaat (bagi diriku dan orang lain), rizki yang halal dan amal yang diterima (di sisi-Mu dan mendapatkan ganjaran yang baik)."
          }
        ],
        "id": 3,
        "language": "id",
        "title": "Dzikir Setelah Shalat"
      },
      {
        "bookId": 0,
        "data": [
          {
            "arabic": "قُلْ هُوَ اللَّهُ أَحَدٌ⦿اللَّهُ الصَّمَدُ⦿لَمْ يَلِدْ وَلَمْ يُولَدْ⦿وَلَمْ يَكُن لَّهُ كُفُوًا أَحَدٌ⦿",
            "audio": "alikhlas2",
            "notes": "Baca 3x",
            "source": "HR. Bukhari no. 5017 dan Muslim no. 2192.",
            "translation": "Katakanlah: Dialah Allah, Yang Maha Esa. Allah adalah ilah yang bergantung kepada-Nya segala urusan. Dia tidak beranak dan tiada pula diperanakkan, dan tidak ada seorang pun yang setara dengan Dia.\n(Al-Ikhlas: 1-4)"
          },
          {
            "arabic": "قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ⦿مِن شَرِّ مَا خَلَقَ⦿وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ⦿وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ⦿وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ⦿",
            "audio": "alfalaq",
            "notes": "Baca 3x",
            "source": "HR. Bukhari no. 5017 dan Muslim no. 2192.",
            "translation": "Katakanlah: Aku berlindung kepada Rabb yang menguasai Shubuh, dari kejahatan makhluk-Nya, dan dari kejahatan malam apabila telah gelap gulita, dan dari kejahatan-kejahatan wanita tukang sihir yang menghembus pada buhul-buhul, dan dari kejahatan orang yang dengki apabila ia dengki.\n(Al-Falaq: 1-5)"
          },
          {
            "arabic": "قُلْ أَعُوذُ بِرَبِّ النَّاسِ⦿مَلِكِ النَّاسِ⦿إِلَهِ النَّاسِ⦿مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ⦿الَّذِي يُوَسْوِسُ فِي صُدُورِالنَّاسِ⦿مِنَ الْجِنَّةِ وَ النَّاسِ⦿",
            "audio": "annas",
            "notes": "Baca 3x",
            "source": "HR. Bukhari no. 5017 dan Muslim no. 2192.",
            "translation": "Dengan menyebut nama Allah Yang Maha Pengasih lagi Maha Penyayang. Katakanlah: Aku berlindung kepada Rabb manusia. Raja manusia. Sembahan manusia, dari kejahatan (bisikan) syaitan yang biasa bersembunyi, yang membisikkan (kejahatan) ke dalam dada manusia, dari jin dan manusia.\n(An-Naas: 1-6)"
          },
          {
            "arabic": "اللَّهُ لاَ إِلَهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلاَّ بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلَا يَئُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ",
            "audio": "ayatulkursi",
            "notes": "Baca Sekali",
            "source": "HR. Bukhari no. 2311",
            "translation": "Allah, tidak ada ilah (yang berhak disembah) melainkan Dia, yang hidup kekal lagi terus menerus mengurus (makhluk-Nya). Dia tidak mengantuk dan tidak tidur. Kepunyaan-Nya apa yang di langit dan di bumi. Tiada yang dapat memberi syafa’at di sisi-Nya tanpa seizin-Nya. Dia mengetahui apa-apa yang di hadapan mereka dan di belakang mereka. Mereka tidak mengetahui apa-apa dari ilmu Allah melainkan apa yang dikehendaki-Nya. Kursi Allah meliputi langit dan bumi. Dia tidak merasa berat memelihara keduanya. Dan Dia Maha Tinggi lagi Maha besar.\n(Al-Baqarah: 255)"
          },
          {
            "arabic": "آَمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ كُلٌّ آَمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ وَقَالُوا سَمِعْنَا وَأَطَعْنَا غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ * لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلاَّ وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ",
            "audio": "",
            "notes": "Baca Sekali",
            "source": "HR. Bukhari no. 4008 dan Muslim no. 807.",
            "translation": "Rasul telah beriman kepada Al-Qur’an yang diturunkan kepadanya dari Rabbnya, demikian pula orang-orang yang beriman. Semuanya beriman kepada Allah, malaikat-malaikat-Nya, kitab-kitab-Nya dan rasul-rasul-Nya. (Mereka mengatakan): “Kami tidak membeda-bedakan antara seorang pun (dengan yang lain) dari rasul-rasul-Nya”, dan mereka mengatakan: “Kami dengar dan kami ta’at”. (Mereka berdoa): “Ampunilah kami ya Rabb kami dan kepada Engkaulah tempat kembali”. Allah tidak membebani seseorang melainkan sesuai dengan kesanggupannya. Ia mendapat pahala (dari kebajikan) yang diusahakannya dan mendapat siksa (dari kejahatan) yang dikerjakannya. (Mereka berdoa): “Ya Rabb kami, janganlah Engkau hukum kami jika kami lupa atau kami bersalah. Ya Rabb kami, janganlah Engkau bebankan kepada kami beban yang berat sebagaimana Engkau bebankan kepada orang-orang yang sebelum kami. Ya Rabb kami, janganlah Engkau pikulkan kepada kami apa yang tak sanggup kami memikulnya. Beri maaflah kami; ampunilah kami; dan rahmatilah kami. Engkaulah Penolong kami, maka tolonglah kami terhadap kaum yang kafir. (QS. Al Baqarah: 285-286)"
          },
          {
            "arabic": "بِاسْمِكَ رَبِّيْ وَضَعْتُ جَنْبِيْ، وَبِكَ أَرْفَعُهُ، فَإِنْ أَمْسَكْتَ نَفْسِيْ فَارْحَمْهَا، وَإِنْ أَرْسَلْتَهَا فَاحْفَظْهَا بِمَا تَحْفَظُ بِهِ عِبَادَكَ الصَّالِحِيْنَ",
            "audio": "",
            "notes": "Baca Sekali",
            "source": "HR. Al-Bukhari no. 6320 dan Muslim no. 2714.",
            "translation": "Dengan nama Engkau, wahai Rabbku, aku meletakkan lambungku. Dan dengan namaMu pula aku bangun daripadanya. Apabila Engkau menahan rohku (mati), maka berilah rahmat padanya. Tapi, apabila Engkau melepaskannya, maka peliharalah (dari kejahatan setan dan kejelekan dunia), sebagaimana Engkau memelihara hamba-hambaMu yang shalih."
          },
          {
            "arabic": "اَللَّهُمَّ إِنَّكَ خَلَقْتَ نَفْسِيْ وَأَنْتَ تَوَفَّاهَا، لَكَ مَمَاتُهَا وَمَحْيَاهَا، إِنْ أَحْيَيْتَهَا فَاحْفَظْهَا، وَإِنْ أَمَتَّهَا فَاغْفِرْ لَهَا. اَللَّهُمَّ إِنِّيْ أَسْأَلُكَ الْعَافِيَةَ",
            "audio": "",
            "notes": "Baca Sekali",
            "source": "HR. Muslim no. 2712.",
            "translation": "Ya Allah, sesungguhnya Engkau menciptakan diriku, dan Engkaulah yang akan mematikannya. Mati dan hidupnya hanya milik-Mu. Apabila Engkau menghidupkannya, maka peliharalah (dari berbagai kejelekan). Apabila Engkau mematikannya, maka ampunilah. Ya Allah, sesungguhnya aku memohon kepada-Mu keselamatan."
          },
          {
            "arabic": "اَللَّهُمَّ قِنِيْ عَذَابَكَ يَوْمَ تَبْعَثُ عِبَادَكَ",
            "audio": "",
            "notes": "Baca Sekali",
            "source": "HR. Tirmidzi no. 3398 dan Abu Daud no. 5045.",
            "translation": "Ya Allah, jauhkanlah aku dari siksaanMu pada hari Engkau membangkitkan hamba-hambaMu (yaitu pada hari kiamat)."
          },
          {
            "arabic": "بِاسْمِكَ اللَّهُمَّ أَمُوْتُ وَأَحْيَا",
            "audio": "",
            "notes": "Baca Sekali",
            "source": "HR. Bukhari no. 6312 dan Muslim no. 2711.",
            "translation": "Dengan namaMu, ya Allah! Aku mati dan hidup."
          },
          {
            "arabic": "سُبْحَانَ اللهِ",
            "audio": "",
            "notes": "Baca 33x",
            "source": "HR. Bukhari no. 3705 dan Muslim no. 2727.",
            "translation": "Maha Suci Allah"
          },
          {
            "arabic": "الْحَمْدُ لِلَّهِ",
            "audio": "",
            "notes": "Baca 33x",
            "source": "HR. Bukhari no. 3705 dan Muslim no. 2727.",
            "translation": "Segala Puji Bagi Allah"
          },
          {
            "arabic": "اللهُ أَكْبَرُ",
            "audio": "",
            "notes": "Baca 34x",
            "source": "HR. Bukhari no. 3705 dan Muslim no. 2727.",
            "translation": "Allah Maha Besar"
          },
          {
            "arabic": "اَللَّهُمَّ رَبَّ السَّمَاوَاتِ السَّبْعِ وَرَبَّ الْعَرْشِ الْعَظِيْمِ، رَبَّنَا وَرَبَّ كُلِّ شَيْءٍ، فَالِقَ الْحَبِّ وَالنَّوَى، وَمُنْزِلَ التَّوْرَاةِ وَاْلإِنْجِيْلِ وَالْفُرْقَانِ، أَعُوْذُ بِكَ مِنْ شَرِّ كُلِّ شَيْءٍ أَنْتَ آخِذٌ بِنَاصِيَتِهِ. اَللَّهُمَّ أَنْتَ اْلأَوَّلُ فَلَيْسَ قَبْلَكَ شَيْءٌ، وَأَنْتَ اْلآخِرُ فَلَيْسَ بَعْدَكَ شَيْءٌ، وَأَنْتَ الظَّاهِرُ فَلَيْسَ فَوْقَكَ شَيْءٌ، وَأَنْتَ الْبَاطِنُ فَلَيْسَ دُوْنَكَ شَيْءٌ، اِقْضِ عَنَّا الدَّيْنَ وَأَغْنِنَا مِنَ الْفَقْرِ",
            "audio": "",
            "notes": "Baca Sekali",
            "source": "HR. Muslim no. 2713.",
            "translation": "Ya Allah, Rabb yang menguasai langit yang tujuh, Rabb yang menguasai ‘Arsy yang agung, Rabb kami dan Rabb segala sesuatu. Rabb yang membelah butir tumbuh-tumbuhan dan biji buah, Rabb yang menurunkan kitab Taurat, Injil dan Furqan (Al-Qur’an). Aku berlindung kepadaMu dari kejahatan segala sesuatu yang Engkau memegang ubun-ubunnya (semua makhluk atas kuasa Allah). Ya Allah, Engkau-lah yang awal, sebelum-Mu tidak ada sesuatu. Engkaulah yang terakhir, setelahMu tidak ada sesuatu. Engkau-lah yang lahir, tidak ada sesuatu di atasMu. Engkau-lah yang Batin, tidak ada sesuatu yang luput dari-Mu[9]. Lunasilah utang kami dan berilah kami kekayaan (kecukupan) hingga terlepas dari kefakiran."
          },
          {
            "arabic": "الْحَمْدُ لِلَّهِ الَّذِيْ أَطْعَمَنَا وَسَقَانَا وَكَفَانَا وَآوَانَا، فَكَمْ مِمَّنْ لاَ كَافِيَ لَهُ وَلاَ مُؤْوِيَ",
            "audio": "",
            "notes": "Baca Sekali",
            "source": "HR. Muslim no. 2715.",
            "translation": "Segala puji bagi Allah yang memberi makan kami, memberi minum kami, mencukupi kami, dan memberi tempat berteduh. Berapa banyak orang yang tidak mendapatkan siapa yang memberi kecukupan dan tempat berteduh."
          },
          {
            "arabic": "اَللَّهُمَّ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ فَاطِرَ السَّمَاوَاتِ وَاْلأَرْضِ، رَبَّ كُلِّ شَيْءٍ وَمَلِيْكَهُ، أَشْهَدُ أَنْ لاَ إِلَـهَ إِلاَّ أَنْتَ، أَعُوْذُ بِكَ مِنْ شَرِّ نَفْسِيْ، وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِيْ سُوْءًا أَوْ أَجُرُّهُ إِلَى مُسْلِمٍ",
            "audio": "",
            "notes": "Baca Sekali",
            "source": "HR. Tirmidzi no. 3392 dan Abu Daud no. 5067.",
            "translation": "Ya Allah, Rabb yang mengetahui yang ghaib dan yang nyata, Rabb pencipta langit dan bumi, Rabb yang menguasai segala sesuatu dan yang merajainya. Aku bersaksi bahwa tiada Rabb yang berhak disembah kecuali Engkau. Aku berlindung kepadaMu dari kejahatan diriku, kejahatan setan dan balatentaranya, atau aku berbuat kejelekan pada diriku atau aku mendorongnya kepada seorang Muslim."
          },
          {
            "arabic": "اَللَّهُمَّ أَسْلَمْتُ نَفْسِيْ إِلَيْكَ، وَفَوَّضْتُ أَمْرِيْ إِلَيْكَ، وَوَجَّهْتُ وَجْهِيَ إِلَيْكَ، وَأَلْجَأْتُ ظَهْرِيْ إِلَيْكَ، رَغْبَةً وَرَهْبَةً إِلَيْكَ، لاَ مَلْجَأَ وَلاَ مَنْجَا مِنْكَ إِلاَّ إِلَيْكَ، آمَنْتُ بِكِتَابِكَ الَّذِيْ أَنْزَلْتَ وَبِنَبِيِّكَ الَّذِيْ أَرْسَلْتَ",
            "audio": "",
            "notes": "Baca Sekali",
            "source": "HR. Al-Bukhari no. 6313 dan Muslim no. 2710.",
            "translation": "Ya Allah, aku menyerahkan diriku kepadaMu, aku menyerahkan urusanku kepadaMu, aku menghadapkan wajahku kepadaMu, aku menyandarkan punggungku kepadaMu, karena senang (mendapatkan rahmatMu) dan takut pada (siksaanMu, bila melakukan kesalahan). Tidak ada tempat perlindungan dan penyelamatan dari (ancaman)Mu, kecuali kepadaMu. Aku beriman pada kitab yang telah Engkau turunkan, dan (kebenaran) NabiMu yang telah Engkau utus."
          },
          {
            "arabic": "Membaca Surat Al-Mulk",
            "audio": "",
            "notes": "Baca Sekali",
            "source": "HR. Tirmidzi no. 3404."
          },
          {
            "arabic": "Membaca Surat As-Sajdah",
            "audio": "",
            "notes": "Baca Sekali",
            "source": "HR. Tirmidzi no. 3404."
          }
        ],
        "id": 4,
        "language": "id",
        "title": "Dzikir Sebelum Tidur"
      }
    ],
    "status": "1",
    "title": "Buku Dzikir",
    "type": 0,
    "updated": ""
  }
]